     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(01)
     A*PUI                                  SFLDEFINE(02)
     A          R SCR01S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A  05 07 08  QPUI000001     1A  O  2  2
     A            SCDATA        74A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCEFDT    R        H      REFFLD(DT8)
     A            SCST      R        H      REFFLD(ST)
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  01 02 03
     A  04 21 32
     A  23 24 25                            CA01(01 'Response Indicator *IN01')
     A  26 27 28
     A  29 91 93
     A  94 95 06                            CA02(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR01S    5    RS-
     A                                      FLDSP    0    E1    3     04RSFLDSP-
     A                                      CTL 0    E1    3    N03RSFLCLR    0-
     A                                          E1    3     03RSFLPAG    1    C-
     A                                      1    9 RSFLSIZ    1    C2    10 1  -
     A                                        RSFLNXTCHG 0    E1    3     087  -
     A                                        ROVERLAY   0     RROWS      2    -
     A                                      C1    1C2    20 RSFLMSGID  4    C7 -
     A                                         CPD6A7CC7    QCPFMSGC5    *LIBLC-
     A                                      0    E1    3     93RERRMSGID  5    -
     A                                      C6    SCUSERC7    CPF5203C7    QCPF-
     A                                      MSGC5    *LIBLC0    E1    3     91R-
     A                                      ERRMSGID  5    C6    SCUSERC7    CP-
     A                                      F5204C7    QCPFMSGC5    *LIBLC0    -
     A                                      E1    3     94FSCPST1    INPUTONLY -
     A                                      0     FSCPST2    INPUTONLY 0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","error message id-
     A                                      ":"CPD6A7C","error message file":"Q-
     A                                      CPFMSG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"93","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"1 message",-
     A                                      "overlay range":"1-20"},"items":[{"-
     A                                      id":"SCPST8","field type":"output f-
     A                                      ield","visibility":{"fieldName":"28-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"value":{"fieldName":"-
     A                                      SCPST8","designValue":"[SCPST8]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none","d-
     A                                      ataLength":"1"},"left":"0px","top":-
     A                                      "-30px","css class":"profound-conve-
     A                                      rted"},{"id":"SFLMOD","field type":-
     A                                      "output field","visibility":"hidden-
     A                                      ","value":{"fieldName":"SFLMOD","de-
     A                                      signValue":"[SFLMOD]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "1"},"left":"0px","top":"-30px","cs-
     A                                      s class":"profound-converted"},{"id-
     A                                      ":"SCPST9","field type":"output fie-
     A                                      ld","visibility":{"fieldName":"29",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"value":{"fieldName":"SC-
     A                                      PST9","designValue":"[SCPST9]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"1"},"left":"0px","top":"--
     A                                      30px","css class":"profound-convert-
     A                                      ed"},{"id":"SCRRN1","field type":"o-
     A                                      utput field","visibility":"hidden",-
     A                                      "value":{"fieldName":"SCRRN1","desi-
     A                                      gnValue":"[SCRRN1]","dataType":"zon-
     A                                      ed","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"true","zeroF-
     A                                      ill":"true","curSym":"","units":"",-
     A                                      "negNum":"-999.00","dataLength":"4"-
     A                                      ,"decPos":"0"},"left":"0px","top":"-
     A                                      -30px","width":"28px","text align":-
     A                                      "right","css class":"profound-conve-
     A                                      rted"},{"id":"SCPST3","field type":-
     A                                      "output field","visibility":{"field-
     A                                      Name":"23","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"value":{"fie-
     A                                      ldName":"SCPST3","designValue":"[SC-
     A                                      PST3]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none","dataLength":"1"},"left":"0p-
     A                                      x","top":"-30px","css class":"profo-
     A                                      und-converted"},{"id":"SCPST4","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":{"fieldName":"24","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"val-
     A                                      ue":{"fieldName":"SCPST4","designVa-
     A                                      lue":"[SCPST4]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"none","dataLength":"1"},"-
     A                                      left":"0px","top":"-30px","css clas-
     A                                      s":"profound-converted"},{"id":"SCP-
     A                                      ST5","field type":"output field","v-
     A                                      isibility":{"fieldName":"25","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"value":{"fieldName":"SCPST5",-
     A                                      "designValue":"[SCPST5]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"1"},"left":"0px","top":"-30px",-
     A                                      "css class":"profound-converted"},{-
     A                                      "id":"SCPST6","field type":"output -
     A                                      field","visibility":{"fieldName":"2-
     A                                      6","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"value":{"fieldName":-
     A                                      "SCPST6","designValue":"[SCPST6]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none","-
     A                                      dataLength":"1"},"left":"0px","top"-
     A                                      :"-30px","css class":"profound-conv-
     A                                      erted"},{"id":"SCPST7","field type"-
     A                                      :"output field","visibility":{"fiel-
     A                                      dName":"27","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"value":{"fi-
     A                                      eldName":"SCPST7","designValue":"[S-
     A                                      CPST7]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"none","dataLength":"1"},"left":"0-
     A                                      px","top":"-30px","css class":"prof-
     A                                      ound-converted"},{"id":"SCOPL2","fi-
     A                                      eld type":"output field","visibilit-
     A                                      y":"hidden","value":{"fieldName":"S-
     A                                      COPL2","designValue":"[SCOPL2]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"none","da-
     A                                      taLength":"76"},"left":"0px","top":-
     A                                      "-30px","css class":"profound-conve-
     A                                      rted"},{"id":"W0019F_SCR01C_avKeys"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"AV_KEYS","dataLengt-
     A                                      h":"1134","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designVal')
     A                                  1  4HTML('ue":"[AV_KEYS]"},"left":"0px"-
     A                                      ,"top":"0px","visibility":"hidden"}-
     A                                      ,{"id":"W0019F_SCR01C_action","fiel-
     A                                      d type":"html container","white spa-
     A                                      ce":"normal","left":"0px","top":"10-
     A                                      px","width":"230px","css class":"ac-
     A                                      tion-panel-converted","height":"700-
     A                                      px","html":"<div class=\"top\"></di-
     A                                      v><div class=\"imagetop\"><img src=-
     A                                      \"/profoundui/userdata/images/bar_t-
     A                                      op.png\" /></div><div class=\"menul-
     A                                      inks\"></div><div class=\"imagebott-
     A                                      om\"><img src=\"/profoundui/userdat-
     A                                      a/images/bar_bottom.png\" /></div><-
     A                                      div class=\"bottom\"></div>"},{"fie-
     A                                      ld type":"icon menu button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"32px","z index-
     A                                      ":"20","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1170px","id":"W0019F_SCR-
     A                                      01C_BtnIconMenuSystemTools","tool t-
     A                                      ip":"System Tools","icon alignment"-
     A                                      :"middle left","icon width":"16px",-
     A                                      "icon height":"24px","icon source":-
     A                                      "/profoundui/userdata/images/systoo-
     A                                      l/systools.png","data function":"Sy-
     A                                      stemToolbarSystools","show down arr-
     A                                      ow":"Yes"},{"field type":"panel","p-
     A                                      anel style":"TransformButtonBar","i-
     A                                      d":"W0019F_SCR01C_ButtonBar","top":-
     A                                      "35px","left":"1036px","width":"187-
     A                                      px","height":"28px","css class":"st-
     A                                      ationary","visibility":"hidden","lo-
     A                                      cked in place":"true"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1040px","id":"W0019F_SCR0-
     A                                      1C_BtnSave","tool tip":"Save","oncl-
     A                                      ick":"SystemToolbarSave","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/save.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1066px","id":"W00-
     A                                      19F_SCR01C_BtnRefresh","tool tip":"-
     A                                      Refresh","onclick":"SystemToolbarRe-
     A                                      fresh","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/r-
     A                                      efresh.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1092px","id":"W0019F_SCR01C_BtnS-
     A                                      earch","tool tip":"Search","onclick-
     A                                      ":"SystemToolbarSearch","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/search.png'')"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1118px","id":"W0-
     A                                      019F_SCR01C_BtnDiaryItems","tool ti-
     A                                      p":"Diary/Work Items - IDARTS","onc-
     A                                      lick":"SystemToolbarDiary","backgro-
     A                                      und image":{"fieldName":"DryIcnURL"-
     A                                      ,"dataLength":"128","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none"}},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1144px","id":"W0019F-
     A                                      _SCR01C_BtnSystemMessages","tool ti-
     A                                      p":"System Messages","onclick":"Sys-
     A                                      temToolbarMessages","background ima-
     A                                      ge":{"fieldName":"MsgIcnURL","dataL-
     A                                      ength":"128","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"W0019F_SCR01C-
     A                                      _BtnHelp","tool tip":"Help","onclic-
     A                                      k":"SystemToolbarHelp","background -
     A                                      image":"url(''/profoundui/')
     A                                  1  5HTML('userdata/images/systool/help.-
     A                                      png'')"},{"id":"W0019F_SCR01C_ImgSy-
     A                                      sToolBottom","field type":"image","-
     A                                      image source":"/profoundui/userdata-
     A                                      /images/systool/butbarbot.png","lef-
     A                                      t":"1036px","top":"64px","width":"1-
     A                                      87px","locked in place":"true","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden"},{"id":"W0019F_SCR01C_MainT-
     A                                      abPanel","field type":"tab panel","-
     A                                      tab panel style":"Transform","tab n-
     A                                      ames":{"fieldName":"SCPRDS","design-
     A                                      Value":"[SCPRDS]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"active tab":"0","left":"25-
     A                                      0px","top":"70px","width":"970px","-
     A                                      height":"657px","z index":"8","lock-
     A                                      ed in place":"true","css class":"ta-
     A                                      b-panel","css class 2":"stationary"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W0019F_SCR-
     A                                      01C_BtnHiddenSave","value":"btnSave-
     A                                      ","top":"100px","response":{"fieldN-
     A                                      ame":"btnSave","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"SCUSER","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCUSER","designValue":"[S-
     A                                      CUSER]","refField":"USER","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"28-
     A                                      1px","cursor column":"2","top":"110-
     A                                      px","cursor row":"1","css class 2":-
     A                                      "top-line","error message id":"CPF5-
     A                                      203","error message file":"QCPFMSG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"91","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"2 messages","error-
     A                                       message id 2":"CPF5204","error mes-
     A                                      sage file 2":"QCPFMSG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"94","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"parent ta-
     A                                      b panel":"W0019F_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCCONM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCCONM","designValu-
     A                                      e":"[SCCONM]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"414px","cursor column":"21","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass 2":"top-line","css class 3":"HI-
     A                                      ","parent tab panel":"W0019F_SCR01C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 4":"profound-converted"},{"-
     A                                      id":"constant1","field type":"outpu-
     A                                      t field","left":"778px","cursor col-
     A                                      umn":"73","top":"110px","cursor row-
     A                                      ":"1","css class":"top-line","value-
     A                                      ":"js: currentDate()","css class 2"-
     A                                      :"output-field","parent tab panel":-
     A                                      "W0019F_SCR01C_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"W0019F_SCR01C_fk-
     A                                      eyMenu","field type":"menu","left":-
     A                                      "10px","top":"120px","height":"350p-
     A                                      x","width":"230px","hover backgroun-
     A                                      d color":"#9AAA61","hover text colo-
     A                                      r":"#FFFFFF","border color":"#4C610-
     A                                      6","menu option indent":"10px","bac-
     A                                      kground color":"#758B27","css class-
     A                                      ":"action-menu","css class 2":"stat-
     A                                      ionary","z index":"101"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0019F_SCR01C_BtnHidde-
     A                                      nRefresh","value":"btnRefresh","top-
     A                                      ":"125px","response":{"fieldName":"-
     A                                      btnRefresh","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"Q1PGM","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"Q1PGM","designValue":"[Q1PGM]-
     A                                      ","refField":"DS10","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"281px","-
     A                                      cursor column":"2","top":"130px","c-
     A                                      ursor row":"2","parent tab panel":"-
     A                                      W0019F_SCR01C_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCPRDS","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCPRDS","designValue":"[SCPRD-
     A                                      S]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"414px"-
     A                                      ,"cursor column":"21","top":"130px"-
     A                                      ,"cursor row":"2","css class 2":"HI-
     A                                      ","parent tab panel":"W0019F_SCR01C-
     A                                      _MainTabPanel","parent tab":"0","vi-
     A                                      sibility":"hidden","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      2","field type":"output field","val-
     A                                      ue":"SCR01","css class":"constant",-
     A                                      "left":"799px","cursor column":"76"-
     A                                      ,"top":"130px","cursor row":"2","pa-
     A                                      rent tab panel":"W0019F_SCR01C_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"')
     A                                  1  6HTML('},{"id":"constant3","field ty-
     A                                      pe":"output field","value":"Group:"-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"150p-
     A                                      x","cursor row":"3","parent tab pan-
     A                                      el":"W0019F_SCR01C_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCFND","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCFND","designValue":"[SC-
     A                                      FND]","refField":"FND","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00"},"css cla-
     A                                      ss":"output-field","left":"337px","-
     A                                      cursor column":"10","top":"150px","-
     A                                      cursor row":"3","width":"21px","tex-
     A                                      t align":"right","parent tab panel"-
     A                                      :"W0019F_SCR01C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCFNAM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCFNAM","designValue":"[SCF-
     A                                      NAM]","refField":"NM60","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"365p-
     A                                      x","cursor column":"14","top":"150p-
     A                                      x","cursor row":"3","parent tab pan-
     A                                      el":"W0019F_SCR01C_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W0019F_SCR01C_BtnHiddenSearch",-
     A                                      "value":"btnSearch","top":"150px","-
     A                                      response":{"fieldName":"btnSearch",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0019F_SCR01-
     A                                      C_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t4","field type":"output field","va-
     A                                      lue":"Position to . . .","css class-
     A                                      ":"constant","left":"281px","cursor-
     A                                       column":"2","top":"190px","cursor -
     A                                      row":"5","parent tab panel":"W0019F-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCPSTS","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCPSTS","designValue":"[SCPSTS]","r-
     A                                      efField":"ST","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","visibility":{"fieldNa-
     A                                      me":"21 and 32","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      414px","cursor column":"21","top":"-
     A                                      190px","cursor row":"5","parent tab-
     A                                       panel":"W0019F_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCPST1",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","in-
     A                                      put only":"true","value":{"fieldNam-
     A                                      e":"SCPST1","designValue":"[SCPST1]-
     A                                      ","refField":"ST","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase"},"text -
     A                                      transform":"uppercase","visibility"-
     A                                      :{"fieldName":"21 and N32","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"414px","cursor column":"-
     A                                      21","top":"190px","cursor row":"5",-
     A                                      "width":"15px","set focus":{"fieldN-
     A                                      ame":"N06 and N32","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"parent t-
     A                                      ab panel":"W0019F_SCR01C_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCPST2-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      input only":"true","value":{"fieldN-
     A                                      ame":"SCPST2","designValue":"[SCPST-
     A                                      2]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase","dataLength":"8","blankFil-
     A                                      l":"true"},"text transform":"upperc-
     A                                      ase","visibility":{"fieldName":"21"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"435px","cursor -
     A                                      column":"24","top":"190px","cursor -
     A                                      row":"5","width":"57px","text align-
     A                                      ":"right","set focus":{"fieldName":-
     A                                      "N06 and 32","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"parent tab pan-
     A                                      el":"W0019F_SCR01C_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W0019F_SCR01C_BtnHiddenSystemMe-
     A                                      ssages","value":"btnMessage","top":-
     A                                      "200px","response":{"fieldName":"bt-
     A                                      nMessage","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"b')
     A                                  1  7HTML('utton","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0019F_SCR01C_BtnHidde-
     A                                      nWorkSubmitJob","value":"btnWrksbmj-
     A                                      ob","top":"225px","response":{"fiel-
     A                                      dName":"btnWrkJob","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant5-
     A                                      ","field type":"output field","valu-
     A                                      e":"Type options, press Enter.","cs-
     A                                      s class":"constant","left":"281px",-
     A                                      "cursor column":"2","top":"230px","-
     A                                      cursor row":"7","css class 2":"BLU"-
     A                                      ,"parent tab panel":"W0019F_SCR01C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"SCOPL1","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCOPL1",-
     A                                      "designValue":"[SCOPL1]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"76"},"css class":"output-field-
     A                                      ","left":"295px","cursor column":"4-
     A                                      ","top":"250px","cursor row":"8","c-
     A                                      ss class 2":"BLU","parent tab panel-
     A                                      ":"W0019F_SCR01C_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0019F_SCR01C_BtnHiddenWorkPrinte-
     A                                      rOutput","value":"btnWrkprtout","to-
     A                                      p":"250px","response":{"fieldName":-
     A                                      "btnWrkPrnt","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W0019F_SCR01C_BtnHiddenImageQueue"-
     A                                      ,"value":"btnImgQue","top":"275px",-
     A                                      "response":{"fieldName":"btnImgQue"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"SCTOP","field type":"output-
     A                                       field","value":{"fieldName":"SCTOP-
     A                                      ","designValue":"[SCTOP]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none","dataLen-
     A                                      gth":"78"},"css class":"output-fiel-
     A                                      d","left":"281px","cursor column":"-
     A                                      2","top":"290px","cursor row":"10",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"W0019F_SCR01C_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted","css class 4":"subfil-
     A                                      e-heading"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0019F_SCR01C_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"SCH-
     A                                      DL1","field type":"output field","v-
     A                                      alue":{"fieldName":"SCHDL1","design-
     A                                      Value":"[SCHDL1]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none","dataLength":"78-
     A                                      "},"css class":"output-field","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"310px","cursor row":"11","css cla-
     A                                      ss 2":"HI","parent tab panel":"W001-
     A                                      9F_SCR01C_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted","css class 4":"subfile-headin-
     A                                      g"},{"id":"SCR01S","field type":"gr-
     A                                      id","number of columns":"2","record-
     A                                       format name":"SCR01S","subfile nex-
     A                                      t changed":{"fieldName":"08","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"display subfile":{"fieldName":"04-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"display control record":{-
     A                                      "fieldName":"N03","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"clear sub-
     A                                      file":{"fieldName":"03","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"sub-
     A                                      file size":"10","place cursor":"tru-
     A                                      e","header height":"40","row height-
     A                                      ":"20","css class":"subfilegrid","c-
     A                                      ss class 2":"profound-converted","p-
     A                                      arent tab panel":"W0019F_SCR01C_Mai-
     A                                      nTabPanel","parent tab":"0","subfil-
     A                                      e end":{"fieldName":"95","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"pa-
     A                                      ge down response":{"fieldName":"*IN-
     A                                      01","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"page up response":{"fieldName":-
     A                                      "*IN02","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"show paging controls":"true-
     A                                      ","scrollbar":"none","number of row-
     A                                      s":"10","top":"290px","left":"276px-
     A                                      ","column widths":"28,553","return -
     A                                      mode":{"fieldName":"SFLMOD","dataLe-
     A                                      ngth":"1","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"none"},"subfile record number":-
     A                                      {"fieldName":"SCRRN1","designValue"-
     A                                      :"[SCRRN1]","dataType":"zoned","for-
     A                                      matting":"Number","numSep"')
     A                                  1  8HTML(':"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","dataLeng-
     A                                      th":"4","decPos":"0"}},{"id":"btnSu-
     A                                      bmit","field type":"button","value"-
     A                                      :"Enter","shortcut key":"Enter","le-
     A                                      ft":"14px","top":"150px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF03","fie-
     A                                      ld type":"button","value":"F3","sho-
     A                                      rtcut key":"F3","left":"14px","top"-
     A                                      :"183px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF05","field type":"button-
     A                                      ","value":"F5","shortcut key":"F5",-
     A                                      "left":"14px","top":"216px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF06","-
     A                                      field type":"button","value":"F6","-
     A                                      shortcut key":"F6","left":"14px","t-
     A                                      op":"249px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF12","field type":"but-
     A                                      ton","value":"Cancel","shortcut key-
     A                                      ":"F12","left":"14px","top":"282px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nHELP","field type":"button","short-
     A                                      cut key":"F1","onclick":"pui.showHe-
     A                                      lp()","value":"HELP","left":"14px",-
     A                                      "top":"315px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"SCDBRR","field type":"ou-
     A                                      tput field","visibility":"hidden","-
     A                                      value":{"fieldName":"SCDBRR","desig-
     A                                      nValue":"[SCDBRR]","dataType":"zone-
     A                                      d","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"true","curSym":"","units":"","-
     A                                      negNum":"-999.00","dataLength":"9",-
     A                                      "decPos":"0"},"left":"-58px","top":-
     A                                      "-359px","width":"63px","text align-
     A                                      ":"right","css class":"profound-con-
     A                                      verted","grid":"SCR01S","column":"0-
     A                                      "},{"id":"SCEFDT","field type":"out-
     A                                      put field","visibility":"hidden","v-
     A                                      alue":{"fieldName":"SCEFDT","design-
     A                                      Value":"[SCEFDT]","refField":"DT8",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"true","zeroFill":"true","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0"},"left":"-51px","top":"-359px","-
     A                                      width":"56px","text align":"right",-
     A                                      "css class":"profound-converted","g-
     A                                      rid":"SCR01S","column":"0"},{"id":"-
     A                                      SCST","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"SCST","designValue":"[SCST]-
     A                                      ","refField":"ST","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"none"},"left":"-45-
     A                                      px","top":"-359px","css class":"pro-
     A                                      found-converted","grid":"SCR01S","c-
     A                                      olumn":"0"},{"id":"SCSEL","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCSEL","designValue":"[SC-
     A                                      SEL]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase","dataLength":"2"},"text -
     A                                      transform":"uppercase","left":"5px"-
     A                                      ,"cursor column":"2","top":"1px","c-
     A                                      ursor row":"12","width":"15px","set-
     A                                       focus":{"fieldName":"07","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 3":{"fieldName":"05","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"RI","customFalse":"-
     A                                      "},"description":"Selection Field",-
     A                                      "css class 4":"profound-converted",-
     A                                      "grid":"SCR01S","column":"0"},{"id"-
     A                                      :"SCDATA","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCDATA","d-
     A                                      esignValue":"[SCDATA]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none","dataLength-
     A                                      ":"74"},"css class":"output-field",-
     A                                      "left":"5px","cursor column":"6","t-
     A                                      op":"1px","cursor row":"12","css cl-
     A                                      ass 2":"profound-converted","grid":-
     A                                      "SCR01S","column":"1"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCHDL1        78A  H
     A            SCOPL1        76A  H
     A            SCOPL2        76A  H
     A            SCPST2         8A  H
     A            SCPST3         1A  H
     A            SCPST4         1A  H
     A            SCPST5         1A  H
     A            SCPST6         1A  H
     A            SCPST7         1A  H
     A            SCPST8         1A  H
     A            SCPST9         1A  H
     A            SCRRN1         4S 0H
     A            SCTOP         78A  H
     A            SFLMOD         1A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFNAM    R        H      REFFLD(NM60)
     A            SCFND     R        H      REFFLD(FND)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPST1    R        H      REFFLD(ST)
     A            SCPSTS    R        H      REFFLD(ST)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR01
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    22C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","overlay range":"2-
     A                                      2-23"},"items":[{"id":"W0019F_SCR01-
     A                                      _avKeys","field type":"output field-
     A                                      ","value":{"fieldName":"AV_KEYS","d-
     A                                      ataLength":"1134","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[AV_KEYS]"},"left":"0px","top":-
     A                                      "0px","visibility":"hidden"},{"id":-
     A                                      "W0019F_SCR01_action","field type":-
     A                                      "html container","white space":"nor-
     A                                      mal","left":"0px","top":"10px","wid-
     A                                      th":"230px","css class":"action-pan-
     A                                      el-converted","height":"700px","htm-
     A                                      l":"<div class=\"top\"></div><div c-
     A                                      lass=\"imagetop\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_top.png\"-
     A                                       /></div><div class=\"menulinks\"><-
     A                                      /div><div class=\"imagebottom\"><im-
     A                                      g src=\"/profoundui/userdata/images-
     A                                      /bar_bottom.png\" /></div><div clas-
     A                                      s=\"bottom\"></div>"},{"field type"-
     A                                      :"icon menu button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"32px","z index":"20","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1170px","id":"W0019F_SCR01_BtnIc-
     A                                      onMenuSystemTools","tool tip":"Syst-
     A                                      em Tools","icon alignment":"middle -
     A                                      left","icon width":"16px","icon hei-
     A                                      ght":"24px","icon source":"/profoun-
     A                                      dui/userdata/images/systool/systool-
     A                                      s.png","data function":"SystemToolb-
     A                                      arSystools","show down arrow":"Yes"-
     A                                      },{"field type":"panel","panel styl-
     A                                      e":"TransformButtonBar","id":"W0019-
     A                                      F_SCR01_ButtonBar","top":"35px","le-
     A                                      ft":"1036px","width":"187px","heigh-
     A                                      t":"28px","css class":"stationary",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1040px","id":"W0019F_SCR01_BtnSave"-
     A                                      ,"tool tip":"Save","onclick":"Syste-
     A                                      mToolbarSave","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/save.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1066px","id":"W0019F_SCR01_B-
     A                                      tnRefresh","tool tip":"Refresh","on-
     A                                      click":"SystemToolbarRefresh","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/refresh.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1092px","-
     A                                      id":"W0019F_SCR01_BtnSearch","tool -
     A                                      tip":"Search","onclick":"SystemTool-
     A                                      barSearch","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/search.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1118px","id":"W0019F_SCR01_Bt-
     A                                      nDiaryItems","tool tip":"Diary/Work-
     A                                       Items - IDARTS","onclick":"SystemT-
     A                                      oolbarDiary","background image":{"f-
     A                                      ieldName":"DryIcnURL","dataLength":-
     A                                      "128","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"}},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1144px","id":"W0019F_SCR01_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"W0019F_SCR01_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      W0019F_SCR01_ImgSysToolBottom","fie-
     A                                      ld type":"image","image source":"/p-
     A                                      rofoundui/userdata/images/systool/b-
     A                                      utbarbot.png","left":"1036px","top"-
     A                                      :"64px","width":"187px","locked in -
     A                                      place":"true","css class":"stationa-
     A                                      ry","visibility":"hidden"},{"id":"W-
     A                                      0019F_SCR01_MainTabPanel","field ty-
     A                                      pe":"tab panel","tab panel style":"-
     A                                      Transform","tab names":"Tab 1","act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0019F_SCR01_BtnHidden-
     A                                      Save","value":"btnSave","top":"100p-
     A                                      x","response":{"fieldName":"btnSave-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"W0019F_SCR01_fkeyMenu","fi-
     A                                      eld type":"menu","left":"10px","top-
     A                                      ":"120px","height":"350px","width":-
     A                                      "230px","hover background color":"#-
     A                                      9AAA61","hover text color":"#FFFFFF-
     A                                      ","border color":"#4C6106","menu op-
     A                                      tion indent":"10px","background col-
     A                                      or":"#758B27","css class":"action-m-
     A                                      enu","css class 2":"stationary","z -
     A                                      index":"101"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0019F_SCR01_BtnHiddenRefresh","v-
     A                                      alue":"btnRefresh","top":"125px","r-
     A                                      esponse":{"fieldName":"btnRefresh",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0019F_SCR01-
     A                                      _BtnHiddenSearch","value":"btnSearc-
     A                                      h","top":"150px","response":{"field-
     A                                      Name":"btnSearch","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0019F_SCR01_BtnHiddenDiaryIt-
     A                                      ems","value":"btnDiary","top":"175p-
     A                                      x","response":{"fieldName":"btnDiar-
     A                                      y","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W0019F_SC-
     A                                      R01_BtnHiddenSystemMessages","value-
     A                                      ":"btnMessage","top":"200px","respo-
     A                                      nse":{"fieldName":"btnMessage","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W0019F_SCR01_Btn-
     A                                      HiddenWorkSubmitJob","value":"btnWr-
     A                                      ksbmjob","top":"225px","response":{-
     A                                      "fieldName":"btnWrkJob","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W0019F_SCR01_BtnHiddenW-
     A                                      orkPrinterOutput","value":"btnWrkpr-
     A                                      tout","top":"250px","response":{"fi-
     A                                      eldName":"btnWrkPrnt","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0019F_SCR01_BtnHiddenIma-
     A                                      geQueue","value":"btnImgQue","top":-
     A                                      "275px","response":{"fieldName":"bt-
     A                                      nImgQue","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W00-
     A                                      19F_SCR01_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCFKL1"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCFKL1","d')
     A                                  1  5HTML('esignValue":"[SCFKL1]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none","dataL-
     A                                      ength":"78"},"left":"281px","cursor-
     A                                       column":"2","top":"530px","cursor -
     A                                      row":"22","css class":"BLU","parent-
     A                                       tab panel":"W0019F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","visibility":-
     A                                      "hidden","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCFKL2","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCFKL2","designValue":"[SCFKL2-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e","dataLength":"78"},"left":"281px-
     A                                      ","cursor column":"2","top":"550px"-
     A                                      ,"cursor row":"23","css class":"BLU-
     A                                      ","parent tab panel":"W0019F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","vis-
     A                                      ibility":"hidden","css class 2":"pr-
     A                                      ofound-converted"},{"id":"btnSubmit-
     A                                      ","field type":"button","value":"En-
     A                                      ter","shortcut key":"Enter","left":-
     A                                      "14px","top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF12","field t-
     A                                      ype":"button","value":"Cancel","sho-
     A                                      rtcut key":"F12","left":"14px","top-
     A                                      ":"183px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnHELP","field type":"butto-
     A                                      n","shortcut key":"F1","onclick":"p-
     A                                      ui.showHelp()","value":"HELP","left-
     A                                      ":"14px","top":"216px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnPAGEDOWN","f-
     A                                      ield type":"button","value":"Page D-
     A                                      own","shortcut key":"PageDown","res-
     A                                      ponse":{"fieldName":"*IN01","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"left":"-
     A                                      14px","top":"249px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnPAGEUP","field -
     A                                      type":"button","value":"Page Up","s-
     A                                      hortcut key":"PageUp","response":{"-
     A                                      fieldName":"*IN02","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"left":"14px","to-
     A                                      p":"282px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFKL1        78A  H
     A            SCFKL2        78A  H
     A          R SCR02S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            SCDATA        74A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCSF1R         4S 0H
     A          R QSFLCTL002                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  01 02 13
     A  14 15                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR02S    5    RS-
     A                                      FLDSP    0    E1    3     14RSFLDSP-
     A                                      CTL 0    E1    3    N13RSFLCLR    0-
     A                                          E1    3     13RSFLPAG    1    C-
     A                                      1    9 RSFLSIZ    1    C2    10 1  -
     A                                        RSFLNXTCHG 0     2    ROVERLAY   -
     A                                      0     RROWS      2    C1    1C2    -
     A                                      17 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","overlay range":"-
     A                                      1-17"},"items":[{"id":"SCRRN2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      RRN2","designValue":"[SCRRN2]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"4","decPos":"0"},"left":"0-
     A                                      px","top":"-30px","width":"28px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted"},{"id":"W0019F_SCR-
     A                                      02C_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"W0019F_SCR02C_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"W0019F_SCR02C_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon alignment":"mi-
     A                                      ddle left","icon width":"16px","ico-
     A                                      n height":"24px","icon source":"/pr-
     A                                      ofoundui/userdata/images/systool/sy-
     A                                      stools.png","data function":"System-
     A                                      ToolbarSystools","show down arrow":-
     A                                      "Yes"},{"field type":"panel","panel-
     A                                       style":"TransformButtonBar","id":"-
     A                                      W0019F_SCR02C_ButtonBar","top":"35p-
     A                                      x","left":"1036px","width":"187px",-
     A                                      "height":"28px","css class":"statio-
     A                                      nary","visibility":"hidden","locked-
     A                                       in place":"true"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1040px","id":"W0019F_SCR02C_B-
     A                                      tnSave","tool tip":"Save","onclick"-
     A                                      :"SystemToolbarSave","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/save.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1066px","id":"W0019F_-
     A                                      SCR02C_BtnRefresh","tool tip":"Refr-
     A                                      esh","onclick":"SystemToolbarRefres-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/refre-
     A                                      sh.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      092px","id":"W0019F_SCR02C_BtnSearc-
     A                                      h","tool tip":"Search","onclick":"S-
     A                                      ystemToolbarSearch","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/search.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1118px","id":"W0019F-
     A                                      _SCR02C_BtnDiaryItems","tool tip":"-
     A                                      Diary/Work Items - IDARTS","onclick-
     A                                      ":"SystemToolbarDiary","background -
     A                                      image":{"fieldName":"DryIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","bord')
     A                                  1  4HTML('er bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1144px","-
     A                                      id":"W0019F_SCR02C_BtnSystemMessage-
     A                                      s","tool tip":"System Messages","on-
     A                                      click":"SystemToolbarMessages","bac-
     A                                      kground image":{"fieldName":"MsgIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1196px","id":"W0-
     A                                      019F_SCR02C_BtnHelp","tool tip":"He-
     A                                      lp","onclick":"SystemToolbarHelp","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/help.png'-
     A                                      ')"},{"id":"W0019F_SCR02C_ImgSysToo-
     A                                      lBottom","field type":"image","imag-
     A                                      e source":"/profoundui/userdata/ima-
     A                                      ges/systool/butbarbot.png","left":"-
     A                                      1036px","top":"64px","width":"187px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en"},{"id":"W0019F_SCR02C_MainTabPa-
     A                                      nel","field type":"tab panel","tab -
     A                                      panel style":"Transform","tab names-
     A                                      ":{"fieldName":"SCPRD2","designValu-
     A                                      e":"[SCPRD2]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"active tab":"0","left":"250px"-
     A                                      ,"top":"70px","width":"970px","heig-
     A                                      ht":"657px","z index":"8","locked i-
     A                                      n place":"true","css class":"tab-pa-
     A                                      nel","css class 2":"stationary"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0019F_SCR02C_-
     A                                      BtnHiddenSave","value":"btnSave","t-
     A                                      op":"100px","response":{"fieldName"-
     A                                      :"btnSave","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"SCR02C_SCUSER","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCUSER","designValue":-
     A                                      "[SCUSER]","refField":"USER","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      110px","cursor row":"1","css class -
     A                                      2":"top-line","parent tab panel":"W-
     A                                      0019F_SCR02C_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCR02C_SCCONM","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCCONM","designValue":"-
     A                                      [SCCONM]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      414px","cursor column":"21","top":"-
     A                                      110px","cursor row":"1","css class -
     A                                      2":"top-line","css class 3":"HI","p-
     A                                      arent tab panel":"W0019F_SCR02C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 4":"profound-converted"},{"id":-
     A                                      "constant6","field type":"output fi-
     A                                      eld","left":"778px","cursor column"-
     A                                      :"73","top":"110px","cursor row":"1-
     A                                      ","css class":"top-line","value":"j-
     A                                      s: currentDate()","css class 2":"ou-
     A                                      tput-field","parent tab panel":"W00-
     A                                      19F_SCR02C_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"W0019F_SCR02C_fkeyMe-
     A                                      nu","field type":"menu","left":"10p-
     A                                      x","top":"120px","height":"350px","-
     A                                      width":"230px","hover background co-
     A                                      lor":"#9AAA61","hover text color":"-
     A                                      #FFFFFF","border color":"#4C6106","-
     A                                      menu option indent":"10px","backgro-
     A                                      und color":"#758B27","css class":"a-
     A                                      ction-menu","css class 2":"stationa-
     A                                      ry","z index":"101"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0019F_SCR02C_BtnHiddenRef-
     A                                      resh","value":"btnRefresh","top":"1-
     A                                      25px","response":{"fieldName":"btnR-
     A                                      efresh","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"SCR02C_Q1PGM","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"Q1PGM","designValue":"[Q1P-
     A                                      GM]","refField":"DS10","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"281px-
     A                                      ","cursor column":"2","top":"130px"-
     A                                      ,"cursor row":"2","parent tab panel-
     A                                      ":"W0019F_SCR02C_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCPRD2","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCPRD2","designValue":"[SC-
     A                                      PRD2]","refField":"NAME","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"n')
     A                                  1  5HTML('one"},"css class":"output-fie-
     A                                      ld","left":"414px","cursor column":-
     A                                      "21","top":"130px","cursor row":"2"-
     A                                      ,"css class 2":"HI","parent tab pan-
     A                                      el":"W0019F_SCR02C_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"constant7","-
     A                                      field type":"output field","value":-
     A                                      "SCR02","css class":"constant","lef-
     A                                      t":"799px","cursor column":"76","to-
     A                                      p":"130px","cursor row":"2","parent-
     A                                       tab panel":"W0019F_SCR02C_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W0019F_SCR02C_BtnHidden-
     A                                      Search","value":"btnSearch","top":"-
     A                                      150px","response":{"fieldName":"btn-
     A                                      Search","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant8","field ty-
     A                                      pe":"output field","value":"Press E-
     A                                      nter to confirm your choices for 4=-
     A                                      Delete.","css class":"constant","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"170px","cursor row":"4","css cl-
     A                                      ass 2":"BLU","parent tab panel":"W0-
     A                                      019F_SCR02C_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W00-
     A                                      19F_SCR02C_BtnHiddenDiaryItems","va-
     A                                      lue":"btnDiary","top":"175px","resp-
     A                                      onse":{"fieldName":"btnDiary","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant9","field type":"output f-
     A                                      ield","value":"Press F12 to return -
     A                                      to change your choices.","css class-
     A                                      ":"constant","left":"281px","cursor-
     A                                       column":"2","top":"190px","cursor -
     A                                      row":"5","css class 2":"BLU","paren-
     A                                      t tab panel":"W0019F_SCR02C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0019F_SCR02C_BtnHidde-
     A                                      nSystemMessages","value":"btnMessag-
     A                                      e","top":"200px","response":{"field-
     A                                      Name":"btnMessage","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0019F_SCR02C_BtnHiddenWorkS-
     A                                      ubmitJob","value":"btnWrksbmjob","t-
     A                                      op":"225px","response":{"fieldName"-
     A                                      :"btnWrkJob","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"SCR02C_SCTOP","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCTOP","designValue":-
     A                                      "[SCTOP]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none","dataLength":"78"},"css -
     A                                      class":"output-field","left":"281px-
     A                                      ","cursor column":"2","top":"230px"-
     A                                      ,"cursor row":"7","css class 2":"HI-
     A                                      ","parent tab panel":"W0019F_SCR02C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted","cs-
     A                                      s class 4":"subfile-heading"},{"id"-
     A                                      :"SCR02C_SCHDL1","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCH-
     A                                      DL1","designValue":"[SCHDL1]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none","dat-
     A                                      aLength":"78"},"css class":"output--
     A                                      field","left":"281px","cursor colum-
     A                                      n":"2","top":"250px","cursor row":"-
     A                                      8","css class 2":"HI","parent tab p-
     A                                      anel":"W0019F_SCR02C_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted","css class 4":"sub-
     A                                      file-heading"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0019F_SCR02C_BtnHiddenWorkPrint-
     A                                      erOutput","value":"btnWrkprtout","t-
     A                                      op":"250px","response":{"fieldName"-
     A                                      :"btnWrkPrnt","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"SCR02S","field-
     A                                       type":"grid","number of columns":"-
     A                                      2","record format name":"SCR02S","s-
     A                                      ubfile next changed":"true","displa-
     A                                      y subfile":{"fieldName":"14","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"display control record":{"fieldNa-
     A                                      me":"N13","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"clear subfile":{"-
     A                                      fieldName":"13","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"subfile siz-
     A                                      e":"10","header height":"40","row h-
     A                                      eight":"20","css class":"subfilegri-
     A                                      d","css class 2":"profound-converte-
     A                                      d","parent tab panel":"W0019F_SCR02-
     A                                      C_MainTabPanel","parent tab":"0","s-
     A                                      ubfile end":{"fieldName":"N15","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"tru')
     A                                  1  6HTML('e / false"},"page down respon-
     A                                      se":{"fieldName":"*IN01","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"page up re-
     A                                      sponse":{"fieldName":"*IN02","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"show p-
     A                                      aging controls":"true","scrollbar":-
     A                                      "none","number of rows":"10","top":-
     A                                      "230px","left":"276px","column widt-
     A                                      hs":"28,553","subfile record number-
     A                                      ":{"fieldName":"SCRRN2","designValu-
     A                                      e":"[SCRRN2]","dataType":"zoned","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      true","curSym":"","units":"","negNu-
     A                                      m":"-999.00","dataLength":"4","decP-
     A                                      os":"0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W0-
     A                                      019F_SCR02C_BtnHiddenImageQueue","v-
     A                                      alue":"btnImgQue","top":"302px","re-
     A                                      sponse":{"fieldName":"btnImgQue","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0019F_SCR02C_-
     A                                      BtnHiddenHelp","value":"btnHelp","t-
     A                                      op":"327px","response":{"fieldName"-
     A                                      :"btnHelp","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"150px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF12","field type":"bu-
     A                                      tton","value":"Cancel","shortcut ke-
     A                                      y":"F12","left":"14px","top":"183px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnHELP","field type":"button","shor-
     A                                      tcut key":"F1","onclick":"pui.showH-
     A                                      elp()","value":"HELP","left":"14px"-
     A                                      ,"top":"216px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"SCR02S_SCDBRR","field t-
     A                                      ype":"output field","visibility":"h-
     A                                      idden","value":{"fieldName":"SCDBRR-
     A                                      ","designValue":"[SCDBRR]","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","dataLeng-
     A                                      th":"9","decPos":"0"},"left":"-58px-
     A                                      ","top":"-299px","width":"63px","te-
     A                                      xt align":"right","css class":"prof-
     A                                      ound-converted","grid":"SCR02S","co-
     A                                      lumn":"0"},{"id":"SCSF1R","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"SCSF1R"-
     A                                      ,"designValue":"[SCSF1R]","dataType-
     A                                      ":"zoned","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"true",-
     A                                      "zeroFill":"true","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","dataLengt-
     A                                      h":"4","decPos":"0"},"left":"-23px"-
     A                                      ,"top":"-299px","width":"28px","tex-
     A                                      t align":"right","css class":"profo-
     A                                      und-converted","grid":"SCR02S","col-
     A                                      umn":"0"},{"id":"SCR02S_SCSEL","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCSEL","designValue":"[S-
     A                                      CSEL]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none","dataLength":"2"},"css clas-
     A                                      s":"output-field","left":"5px","cur-
     A                                      sor column":"2","top":"1px","cursor-
     A                                       row":"9","description":"Selection -
     A                                      Field","css class 2":"profound-conv-
     A                                      erted","grid":"SCR02S","column":"0"-
     A                                      },{"id":"SCR02S_SCDATA","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCDATA","designValue":"[SCDATA]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"74"},"css class":"-
     A                                      output-field","left":"5px","cursor -
     A                                      column":"6","top":"1px","cursor row-
     A                                      ":"9","css class 2":"profound-conve-
     A                                      rted","grid":"SCR02S","column":"1"}-
     A                                      ]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCHDL1        78A  H
     A            SCRRN2         4S 0H
     A            SCTOP         78A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRD2    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR02
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"23-23"},"items":[{-
     A                                      "id":"W0019F_SCR02_avKeys","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"AV_KEYS","dataLength":"1134"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[AV_KEYS]"},"-
     A                                      left":"0px","top":"0px","visibility-
     A                                      ":"hidden"},{"id":"W0019F_SCR02_act-
     A                                      ion","field type":"html container",-
     A                                      "white space":"normal","left":"0px"-
     A                                      ,"top":"10px","width":"230px","css -
     A                                      class":"action-panel-converted","he-
     A                                      ight":"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_bottom.png\"-
     A                                       /></div><div class=\"bottom\"></di-
     A                                      v>"},{"field type":"icon menu butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"32px-
     A                                      ","z index":"20","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1170px","id":"-
     A                                      W0019F_SCR02_BtnIconMenuSystemTools-
     A                                      ","tool tip":"System Tools","icon a-
     A                                      lignment":"middle left","icon width-
     A                                      ":"16px","icon height":"24px","icon-
     A                                       source":"/profoundui/userdata/imag-
     A                                      es/systool/systools.png","data func-
     A                                      tion":"SystemToolbarSystools","show-
     A                                       down arrow":"Yes"},{"field type":"-
     A                                      panel","panel style":"TransformButt-
     A                                      onBar","id":"W0019F_SCR02_ButtonBar-
     A                                      ","top":"35px","left":"1036px","wid-
     A                                      th":"187px","height":"28px","css cl-
     A                                      ass":"stationary","visibility":"hid-
     A                                      den","locked in place":"true"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1040px","id":"W00-
     A                                      19F_SCR02_BtnSave","tool tip":"Save-
     A                                      ","onclick":"SystemToolbarSave","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/save.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1066px","i-
     A                                      d":"W0019F_SCR02_BtnRefresh","tool -
     A                                      tip":"Refresh","onclick":"SystemToo-
     A                                      lbarRefresh","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/refresh.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1092px","id":"W0019F_SCR02-
     A                                      _BtnSearch","tool tip":"Search","on-
     A                                      click":"SystemToolbarSearch","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/search.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1118px","id-
     A                                      ":"W0019F_SCR02_BtnDiaryItems","too-
     A                                      l tip":"Diary/Work Items - IDARTS",-
     A                                      "onclick":"SystemToolbarDiary","bac-
     A                                      kground image":{"fieldName":"DryIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1144px","id":"W0-
     A                                      019F_SCR02_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting"')
     A                                  1  4HTML(':"Text","textTransform":"none-
     A                                      "}},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1196px","-
     A                                      id":"W0019F_SCR02_BtnHelp","tool ti-
     A                                      p":"Help","onclick":"SystemToolbarH-
     A                                      elp","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/hel-
     A                                      p.png'')"},{"id":"W0019F_SCR02_ImgS-
     A                                      ysToolBottom","field type":"image",-
     A                                      "image source":"/profoundui/userdat-
     A                                      a/images/systool/butbarbot.png","le-
     A                                      ft":"1036px","top":"64px","width":"-
     A                                      187px","locked in place":"true","cs-
     A                                      s class":"stationary","visibility":-
     A                                      "hidden"},{"id":"W0019F_SCR02_MainT-
     A                                      abPanel","field type":"tab panel","-
     A                                      tab panel style":"Transform","tab n-
     A                                      ames":"Tab 1","active tab":"0","lef-
     A                                      t":"250px","top":"70px","width":"97-
     A                                      0px","height":"657px","z index":"8"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"tab-panel","css class 2":"stati-
     A                                      onary"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W001-
     A                                      9F_SCR02_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"W0019F_S-
     A                                      CR02_fkeyMenu","field type":"menu",-
     A                                      "left":"10px","top":"120px","height-
     A                                      ":"350px","width":"230px","hover ba-
     A                                      ckground color":"#9AAA61","hover te-
     A                                      xt color":"#FFFFFF","border color":-
     A                                      "#4C6106","menu option indent":"10p-
     A                                      x","background color":"#758B27","cs-
     A                                      s class":"action-menu","css class 2-
     A                                      ":"stationary","z index":"101"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0019F_SCR02_Bt-
     A                                      nHiddenRefresh","value":"btnRefresh-
     A                                      ","top":"125px","response":{"fieldN-
     A                                      ame":"btnRefresh","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0019F_SCR02_BtnHiddenSearch"-
     A                                      ,"value":"btnSearch","top":"150px",-
     A                                      "response":{"fieldName":"btnSearch"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0019F_SCR0-
     A                                      2_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0019F_SCR02_BtnHiddenSyst-
     A                                      emMessages","value":"btnMessage","t-
     A                                      op":"200px","response":{"fieldName"-
     A                                      :"btnMessage","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0019F_SCR02_BtnHiddenWorkSubmitJ-
     A                                      ob","value":"btnWrksbmjob","top":"2-
     A                                      25px","response":{"fieldName":"btnW-
     A                                      rkJob","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0019-
     A                                      F_SCR02_BtnHiddenWorkPrinterOutput"-
     A                                      ,"value":"btnWrkprtout","top":"250p-
     A                                      x","response":{"fieldName":"btnWrkP-
     A                                      rnt","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W0019F_-
     A                                      SCR02_BtnHiddenImageQueue","value":-
     A                                      "btnImgQue","top":"275px","response-
     A                                      ":{"fieldName":"btnImgQue","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0019F_SCR02_BtnHidd-
     A                                      enHelp","value":"btnHelp","top":"30-
     A                                      0px","response":{"fieldName":"btnHe-
     A                                      lp","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px"')
     A                                  1  5HTML(',"top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF12","field t-
     A                                      ype":"button","value":"Cancel","sho-
     A                                      rtcut key":"F12","left":"14px","top-
     A                                      ":"183px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnHELP","field type":"butto-
     A                                      n","shortcut key":"F1","onclick":"p-
     A                                      ui.showHelp()","value":"HELP","left-
     A                                      ":"14px","top":"216px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnPAGEDOWN","f-
     A                                      ield type":"button","value":"Page D-
     A                                      own","shortcut key":"PageDown","res-
     A                                      ponse":{"fieldName":"*IN01","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"left":"-
     A                                      14px","top":"249px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnPAGEUP","field -
     A                                      type":"button","value":"Page Up","s-
     A                                      hortcut key":"PageUp","response":{"-
     A                                      fieldName":"*IN02","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"left":"14px","to-
     A                                      p":"282px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR03
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    RWINDOW    0     -
     A                                      RROWS      2    C1    1C1    9 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"4","overlay ra-
     A                                      nge":"1-9"},"items":[{"id":"SCR03",-
     A                                      "field type":"panel","panel style":-
     A                                      "Transform Dialog","text align":"ce-
     A                                      nter","left":"5px","top":"5px","hei-
     A                                      ght":"330px","width":"534px","z ind-
     A                                      ex":"8","locked in place":"true"},{-
     A                                      "id":"SCR03_SCUSER","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCUSER","designValue":"[SCUSER]","r-
     A                                      efField":"USER","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"29px","curso-
     A                                      r column":"2","top":"65px","cursor -
     A                                      row":"1","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCPRD3","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCPRD3","designValue":"[SCPRD3-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"127px",-
     A                                      "cursor column":"16","top":"65px","-
     A                                      cursor row":"1","css class 2":"HI",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant10","field type":"o-
     A                                      utput field","value":"SCR03","css c-
     A                                      lass":"constant","left":"477px","cu-
     A                                      rsor column":"66","top":"65px","cur-
     A                                      sor row":"1","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant11","f-
     A                                      ield type":"output field","value":"-
     A                                      Type choices, press Enter.","css cl-
     A                                      ass":"constant","left":"29px","curs-
     A                                      or column":"2","top":"105px","curso-
     A                                      r row":"3","css class 2":"BLU","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant12","field type":"outpu-
     A                                      t field","value":"Description (cont-
     A                                      ains) . .","css class":"constant","-
     A                                      left":"36px","cursor column":"3","t-
     A                                      op":"145px","cursor row":"5","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SSPDSC","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SSPDSC-
     A                                      ","designValue":"[SSPDSC]","refFiel-
     A                                      d":"DS40","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true"},"left":-
     A                                      "232px","cursor column":"31","top":-
     A                                      "145px","cursor row":"5","width":"2-
     A                                      81px","css class 3":"profound-conve-
     A                                      rted"},{"id":"btnSubmit","field typ-
     A                                      e":"button","value":"Enter","shortc-
     A                                      ut key":"Enter","left":"14px","top"-
     A                                      :"290px","width":"80px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnCF12","field type":"button"-
     A                                      ,"value":"Cancel","shortcut key":"F-
     A                                      12","left":"104px","top":"290px","w-
     A                                      idth":"80px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnHEL-
     A                                      P","field type":"button","shortcut -
     A                                      key":"F1","onclick":"pui.showHelp()-
     A                                      ","value":"HELP","left":"194px","to-
     A                                      p":"290px","width":"80px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnPAGEDOWN","field type":"b-
     A                                      utton","value":"Page Down","shortcu-
     A                                      t key":"PageDown","response":{"fiel-
     A                                      dName":"*IN01","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"left":"284px","top":-
     A                                      "290px","width":"80px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","visibility":"hidden","-
     A                                      cursor":"default"},{"id":"btnPAGEUP-
     A                                      ","field type":"button","value":"Pa-
     A                                      ge Up","shortcut key":"PageUp","res-
     A                                      ponse":{"fieldName":"*IN02","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"left":"-
     A                                      374px","top":"290px","width":"80px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","visibilit-
     A                                      y":"hidden","cursor":"default"}]}')
     A            SCPRD3    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A            SSPDSC    R        H      REFFLD(DS40)
     A          R MSGSFL                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            MSGKEY         4A  H
     A            Q1PGM         10A  H
     A          R QSFLCTL003                SFLCTL(MSGSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLMSGSFLC')
     A          R MSGSFLC
     A  01 02 10                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    MSGSFL    6    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LINZ    0     RSFLPAG    1    C1   -
     A                                       1 RSFLSIZ    1    C1    5 FQ1PGM  -
     A                                         SFLPGMQ   0     2    FMSGKEY    -
     A                                      SFLMSGKEY 0     FQ1PGM     SFLPGMQ -
     A                                        0     1    RROWS      2    C2    -
     A                                      24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"MSGSFLC","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","overlay range":"24-24"},"items":-
     A                                      [{"id":"W0019F_MSGSFLC_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"W0019F_MSGSF-
     A                                      LC_action","field type":"html conta-
     A                                      iner","white space":"normal","left"-
     A                                      :"0px","top":"10px","width":"230px"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","height":"700px","html":"<div cl-
     A                                      ass=\"top\"></div><div class=\"imag-
     A                                      etop\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_top.png\" /></div><d-
     A                                      iv class=\"menulinks\"></div><div c-
     A                                      lass=\"imagebottom\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_bottom-
     A                                      .png\" /></div><div class=\"bottom\-
     A                                      "></div>"},{"field type":"icon menu-
     A                                       button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"32px","z index":"20","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1170px",-
     A                                      "id":"W0019F_MSGSFLC_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon alignment":"middle left","ic-
     A                                      on width":"16px","icon height":"24p-
     A                                      x","icon source":"/profoundui/userd-
     A                                      ata/images/systool/systools.png","d-
     A                                      ata function":"SystemToolbarSystool-
     A                                      s","show down arrow":"Yes"},{"field-
     A                                       type":"panel","panel style":"Trans-
     A                                      formButtonBar","id":"W0019F_MSGSFLC-
     A                                      _ButtonBar","top":"35px","left":"10-
     A                                      36px","width":"187px","height":"28p-
     A                                      x","css class":"stationary","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1040px"-
     A                                      ,"id":"W0019F_MSGSFLC_BtnSave","too-
     A                                      l tip":"Save","onclick":"SystemTool-
     A                                      barSave","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /save.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1066px","id":"W0019F_MSGSFLC_BtnR-
     A                                      efresh","tool tip":"Refresh","oncli-
     A                                      ck":"SystemToolbarRefresh","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/refresh.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1092px","id"-
     A                                      :"W0019F_MSGSFLC_BtnSearch","tool t-
     A                                      ip":"Search","onclick":"SystemToolb-
     A                                      arSearch","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/search.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1118px","id":"W0019F_MSGSFLC_B-
     A                                      tnDiaryItems","tool tip":"Diary/Wor-
     A                                      k Items - IDARTS","onclick":"System-
     A                                      ToolbarDiary","background image":{"-
     A                                      fieldName":"DryIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1144px","id":"W0019F_MSGSFLC_BtnS-
     A                                      ystemMessages","tool tip":"System M-
     A                                      essages","onclick":"SystemToolbarMe-
     A                                      ssages","background image":{"fieldN-
     A                                      ame":"MsgIcnURL","dataLength":"128"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType"')
     A                                  1  4HTML(':"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"W0019F_MSG-
     A                                      SFLC_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"W0019F_MSGSFLC_ImgSysToolBotto-
     A                                      m","field type":"image","image sour-
     A                                      ce":"/profoundui/userdata/images/sy-
     A                                      stool/butbarbot.png","left":"1036px-
     A                                      ","top":"64px","width":"187px","loc-
     A                                      ked in place":"true","css class":"s-
     A                                      tationary","visibility":"hidden"},{-
     A                                      "id":"W0019F_MSGSFLC_MainTabPanel",-
     A                                      "field type":"tab panel","tab panel-
     A                                       style":"Transform","tab names":"Ta-
     A                                      b 1","active tab":"0","left":"250px-
     A                                      ","top":"70px","width":"970px","hei-
     A                                      ght":"657px","z index":"8","locked -
     A                                      in place":"true","css class":"tab-p-
     A                                      anel","css class 2":"stationary"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W0019F_MSGSFL-
     A                                      C_BtnHiddenSave","value":"btnSave",-
     A                                      "top":"100px","response":{"fieldNam-
     A                                      e":"btnSave","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"W0019F_MSGSFLC_-
     A                                      fkeyMenu","field type":"menu","left-
     A                                      ":"10px","top":"120px","height":"35-
     A                                      0px","width":"230px","hover backgro-
     A                                      und color":"#9AAA61","hover text co-
     A                                      lor":"#FFFFFF","border color":"#4C6-
     A                                      106","menu option indent":"10px","b-
     A                                      ackground color":"#758B27","css cla-
     A                                      ss":"action-menu","css class 2":"st-
     A                                      ationary","z index":"101"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0019F_MSGSFLC_BtnHi-
     A                                      ddenRefresh","value":"btnRefresh","-
     A                                      top":"125px","response":{"fieldName-
     A                                      ":"btnRefresh","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0019F_MSGSFLC_BtnHiddenSearch",-
     A                                      "value":"btnSearch","top":"150px","-
     A                                      response":{"fieldName":"btnSearch",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0019F_MSGSF-
     A                                      LC_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0019F_MSGSFLC_BtnHiddenS-
     A                                      ystemMessages","value":"btnMessage"-
     A                                      ,"top":"200px","response":{"fieldNa-
     A                                      me":"btnMessage","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0019F_MSGSFLC_BtnHiddenWorkSu-
     A                                      bmitJob","value":"btnWrksbmjob","to-
     A                                      p":"225px","response":{"fieldName":-
     A                                      "btnWrkJob","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0019F_MSGSFLC_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0019F_MSGSFLC_BtnHiddenImageQueue"-
     A                                      ,"value":"btnImgQue","top":"275px",-
     A                                      "response":{"fieldName":"btnImgQue"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0019F_MSGS-
     A                                      FLC_BtnHiddenHelp","value":"btnHelp-
     A                                      ","top":"300px","response":{"fieldN-
     A                                      ame":"btnHelp","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"MSGSFL","fiel-
     A                                      d type":"grid","number of ')
     A                                  1  5HTML('columns":"1","record format n-
     A                                      ame":"MSGSFL","display subfile":"tr-
     A                                      ue","display control record":"true"-
     A                                      ,"subfile size":"5","initialize sub-
     A                                      file":"true","row height":"20","css-
     A                                       class":"subfilegrid","css class 2"-
     A                                      :"profound-converted","parent tab p-
     A                                      anel":"W0019F_MSGSFLC_MainTabPanel"-
     A                                      ,"parent tab":"0","subfile end":{"f-
     A                                      ieldName":"N10","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"number of r-
     A                                      ows":"1","has header":"false","subf-
     A                                      ile program message queue":{"fieldN-
     A                                      ame":"Q1PGM","dataLength":"10","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"},"su-
     A                                      bfile control program message queue-
     A                                      ":{"fieldName":"Q1PGM","dataLength"-
     A                                      :"10","trimLeading":"false","trimTr-
     A                                      ailing":"true","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"},"subfile message key":{"fiel-
     A                                      dName":"MSGKEY","dataLength":"4","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"},"-
     A                                      top":"570px","left":"269px","column-
     A                                       widths":"595"},{"id":"btnSubmit","-
     A                                      field type":"button","value":"Enter-
     A                                      ","shortcut key":"Enter","left":"14-
     A                                      px","top":"150px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF12","field type-
     A                                      ":"button","value":"Cancel","shortc-
     A                                      ut key":"F12","left":"14px","top":"-
     A                                      183px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnHELP","field type":"button",-
     A                                      "shortcut key":"F1","onclick":"pui.-
     A                                      showHelp()","value":"HELP","left":"-
     A                                      14px","top":"216px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnPAGEDOWN","fiel-
     A                                      d type":"button","value":"Page Down-
     A                                      ","shortcut key":"PageDown","respon-
     A                                      se":{"fieldName":"*IN01","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"left":"14p-
     A                                      x","top":"249px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnPAGEUP","field typ-
     A                                      e":"button","value":"Page Up","shor-
     A                                      tcut key":"PageUp","response":{"fie-
     A                                      ldName":"*IN02","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"left":"14px","top":-
     A                                      "282px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A          R SCR99
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C1    1 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-1"},"items":[{"i-
     A                                      d":"W0019F_SCR99_avKeys","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"AV_KEYS","dataLength":"1134","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[AV_KEYS]"},"le-
     A                                      ft":"0px","top":"0px","visibility":-
     A                                      "hidden"},{"id":"W0019F_SCR99_actio-
     A                                      n","field type":"html container","w-
     A                                      hite space":"normal","left":"0px","-
     A                                      top":"10px","width":"230px","css cl-
     A                                      ass":"action-panel-converted","heig-
     A                                      ht":"700px","html":"<div class=\"to-
     A                                      p\"></div><div class=\"imagetop\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_top.png\" /></div><div class-
     A                                      =\"menulinks\"></div><div class=\"i-
     A                                      magebottom\"><img src=\"/profoundui-
     A                                      /userdata/images/bar_bottom.png\" /-
     A                                      ></div><div class=\"bottom\"></div>-
     A                                      "},{"field type":"icon menu button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"32px",-
     A                                      "z index":"20","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1170px","id":"W0-
     A                                      019F_SCR99_BtnIconMenuSystemTools",-
     A                                      "tool tip":"System Tools","icon ali-
     A                                      gnment":"middle left","icon width":-
     A                                      "16px","icon height":"24px","icon s-
     A                                      ource":"/profoundui/userdata/images-
     A                                      /systool/systools.png","data functi-
     A                                      on":"SystemToolbarSystools","show d-
     A                                      own arrow":"Yes"},{"field type":"pa-
     A                                      nel","panel style":"TransformButton-
     A                                      Bar","id":"W0019F_SCR99_ButtonBar",-
     A                                      "top":"35px","left":"1036px","width-
     A                                      ":"187px","height":"28px","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n","locked in place":"true"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1040px","id":"W0019-
     A                                      F_SCR99_BtnSave","tool tip":"Save",-
     A                                      "onclick":"SystemToolbarSave","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/save.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1066px","id"-
     A                                      :"W0019F_SCR99_BtnRefresh","tool ti-
     A                                      p":"Refresh","onclick":"SystemToolb-
     A                                      arRefresh","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/refresh.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1092px","id":"W0019F_SCR99_B-
     A                                      tnSearch","tool tip":"Search","oncl-
     A                                      ick":"SystemToolbarSearch","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/search.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1118px","id":-
     A                                      "W0019F_SCR99_BtnDiaryItems","tool -
     A                                      tip":"Diary/Work Items - IDARTS","o-
     A                                      nclick":"SystemToolbarDiary","backg-
     A                                      round image":{"fieldName":"DryIcnUR-
     A                                      L","dataLength":"128","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"}},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1144px","id":"W001-
     A                                      9F_SCR99_BtnSystemMessages","tool t-
     A                                      ip":"System Messages","onclick":"Sy-
     A                                      stemToolbarMessages","background im-
     A                                      age":{"fieldName":"MsgIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"')
     A                                  1  4HTML('Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1196px","id-
     A                                      ":"W0019F_SCR99_BtnHelp","tool tip"-
     A                                      :"Help","onclick":"SystemToolbarHel-
     A                                      p","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/help.-
     A                                      png'')"},{"id":"W0019F_SCR99_ImgSys-
     A                                      ToolBottom","field type":"image","i-
     A                                      mage source":"/profoundui/userdata/-
     A                                      images/systool/butbarbot.png","left-
     A                                      ":"1036px","top":"64px","width":"18-
     A                                      7px","locked in place":"true","css -
     A                                      class":"stationary","visibility":"h-
     A                                      idden"},{"id":"W0019F_SCR99_MainTab-
     A                                      Panel","field type":"tab panel","ta-
     A                                      b panel style":"Transform","tab nam-
     A                                      es":"Tab 1","active tab":"0","left"-
     A                                      :"250px","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W0019F-
     A                                      _SCR99_BtnHiddenSave","value":"btnS-
     A                                      ave","top":"100px","response":{"fie-
     A                                      ldName":"btnSave","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"SCFL01","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCFL01","designValue":-
     A                                      "[SCFL01]","refField":"FLAG","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      110px","cursor row":"1","css class -
     A                                      2":"top-line","visibility":"hidden"-
     A                                      ,"description":"DUMMY FIELD","paren-
     A                                      t tab panel":"W0019F_SCR99_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"W001-
     A                                      9F_SCR99_fkeyMenu","field type":"me-
     A                                      nu","left":"10px","top":"120px","he-
     A                                      ight":"350px","width":"230px","hove-
     A                                      r background color":"#9AAA61","hove-
     A                                      r text color":"#FFFFFF","border col-
     A                                      or":"#4C6106","menu option indent":-
     A                                      "10px","background color":"#758B27"-
     A                                      ,"css class":"action-menu","css cla-
     A                                      ss 2":"stationary","z index":"101"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0019F_SCR9-
     A                                      9_BtnHiddenRefresh","value":"btnRef-
     A                                      resh","top":"125px","response":{"fi-
     A                                      eldName":"btnRefresh","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0019F_SCR99_BtnHiddenSea-
     A                                      rch","value":"btnSearch","top":"150-
     A                                      px","response":{"fieldName":"btnSea-
     A                                      rch","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W0019F_-
     A                                      SCR99_BtnHiddenDiaryItems","value":-
     A                                      "btnDiary","top":"175px","response"-
     A                                      :{"fieldName":"btnDiary","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0019F_SCR99_BtnHidden-
     A                                      SystemMessages","value":"btnMessage-
     A                                      ","top":"200px","response":{"fieldN-
     A                                      ame":"btnMessage","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0019F_SCR99_BtnHiddenWorkSub-
     A                                      mitJob","value":"btnWrksbmjob","top-
     A                                      ":"225px","response":{"fieldName":"-
     A                                      btnWrkJob","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      0019F_SCR99_BtnHiddenWorkPrinterOut-
     A                                      put","value":"btnWrkprtout","top":"-
     A                                      250px","response":{"fieldName":"btn-
     A                                      WrkPrnt","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W00-
     A                                      19F_SCR99_BtnHiddenImageQueue","val-
     A                                      ue":"btnImgQue","top":"275px","resp-
     A                                      onse":{"fieldName":"btnImg')
     A                                  1  5HTML('Que","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      0019F_SCR99_BtnHiddenHelp","value":-
     A                                      "btnHelp","top":"300px","response":-
     A                                      {"fieldName":"btnHelp","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"btnSu-
     A                                      bmit","field type":"button","value"-
     A                                      :"Enter","shortcut key":"Enter","le-
     A                                      ft":"14px","top":"150px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF12","fie-
     A                                      ld type":"button","value":"Cancel",-
     A                                      "shortcut key":"F12","left":"14px",-
     A                                      "top":"183px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnHELP","field type":"b-
     A                                      utton","shortcut key":"F1","onclick-
     A                                      ":"pui.showHelp()","value":"HELP","-
     A                                      left":"14px","top":"216px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnPAGEDOWN-
     A                                      ","field type":"button","value":"Pa-
     A                                      ge Down","shortcut key":"PageDown",-
     A                                      "response":{"fieldName":"*IN01","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"lef-
     A                                      t":"14px","top":"249px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnPAGEUP","fi-
     A                                      eld type":"button","value":"Page Up-
     A                                      ","shortcut key":"PageUp","response-
     A                                      ":{"fieldName":"*IN02","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"left":"14px"-
     A                                      ,"top":"282px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFL01    R        H      REFFLD(FLAG)
