     A                                      REF(*LIBL/WREFP)
     A          R SCR01
     A  52 53 09
     A  40 71 72
     A  73 74 75                            CA01(52 'Response Indicator *IN52')
     A  76 77 78
     A  79 81 82                            CA02(53 'Response Indicator *IN53')
     A                                  1  2HTML('QPUIREC12   RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C6    SCCFSDC7    WCR0-
     A                                      503C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     71RERRMSGID  5    C6    SC-
     A                                      CFSDC7    WCR0500C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     72RERRMSGID -
     A                                       5    C6    SCCFSDC7    WC30000C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        78RERRMSGID  5    C6    SCNOTCC7 -
     A                                         WCR0571C6    WMESGGC5    *LIBLC0-
     A                                          E1    3     73RERRMSGID  5    C-
     A                                      6    SCAURQC7    WCR0571C6    WMESG-
     A                                      GC5    *LIBLC0    E1    3     74RER-
     A                                      RMSGID  5    C6    SCQTRKC7    WCR0-
     A                                      571C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     75RERRMSGID  5    C6    SC-
     A                                      NECXC7    WCR0571C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     76RERRMSGID -
     A                                       5    C6    SCCFDRC7    WCR0878C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        77RERRMSGID  5    C6    SCDARTC7 -
     A                                         WCR0571C6    WMESGGC5    *LIBLC0-
     A                                          E1    3     79RERRMSGID  5    C-
     A                                      6    SCSRFLC7    WCR1241C6    WMESG-
     A                                      GC5    *LIBLC0    E1    3     53')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN52","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN53","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"assume"-
     A                                      :"true","return cursor record":{"fi-
     A                                      eldName":"HREC","dataLength":"10","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none"},-
     A                                      "return cursor field":{"fieldName":-
     A                                      "HFLD","dataLength":"10","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none"},"overlay -
     A                                      range":"1-23"},"items":[{"id":"HREC-
     A                                      ","field type":"output field","visi-
     A                                      bility":"hidden","value":{"fieldNam-
     A                                      e":"HREC","designValue":"[HREC]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none","d-
     A                                      ataLength":"10"},"left":"0px","top"-
     A                                      :"-30px","css class":"profound-conv-
     A                                      erted"},{"id":"HFLD","field type":"-
     A                                      output field","visibility":"hidden"-
     A                                      ,"value":{"fieldName":"HFLD","desig-
     A                                      nValue":"[HFLD]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none","dataLength":"10"}-
     A                                      ,"left":"0px","top":"-30px","css cl-
     A                                      ass":"profound-converted"},{"id":"W-
     A                                      0029F_SCR01_avKeys","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      AV_KEYS","dataLength":"1134","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none",-
     A                                      "designValue":"[AV_KEYS]"},"left":"-
     A                                      0px","top":"0px","visibility":"hidd-
     A                                      en"},{"id":"W0029F_SCR01_action","f-
     A                                      ield type":"html container","white -
     A                                      space":"normal","left":"0px","top":-
     A                                      "10px","width":"230px","css class":-
     A                                      "action-panel-converted","height":"-
     A                                      700px","html":"<div class=\"top\"><-
     A                                      /div><div class=\"imagetop\"><img s-
     A                                      rc=\"/profoundui/userdata/images/ba-
     A                                      r_top.png\" /></div><div class=\"me-
     A                                      nulinks\"></div><div class=\"imageb-
     A                                      ottom\"><img src=\"/profoundui/user-
     A                                      data/images/bar_bottom.png\" /></di-
     A                                      v><div class=\"bottom\"></div>"},{"-
     A                                      field type":"icon menu button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"32px","z in-
     A                                      dex":"20","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1170px","id":"W0029F_-
     A                                      SCR01_BtnIconMenuSystemTools","tool-
     A                                       tip":"System Tools","icon source":-
     A                                      "/profoundui/userdata/images/systoo-
     A                                      l/systools.png","data')
     A                                  1  2HTML(' function":"SystemToolbarSyst-
     A                                      ools","show down arrow":"Yes"},{"fi-
     A                                      eld type":"panel","panel style":"Tr-
     A                                      ansformButtonBar","id":"W0029F_SCR0-
     A                                      1_ButtonBar","top":"35px","left":"1-
     A                                      036px","width":"187px","height":"28-
     A                                      px","css class":"stationary","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1040px-
     A                                      ","id":"W0029F_SCR01_BtnSave","tool-
     A                                       tip":"Save","onclick":"SystemToolb-
     A                                      arSave","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      save.png'')"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1066px","id":"W0029F_SCR01_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"W-
     A                                      0029F_SCR01_BtnSearch","tool tip":"-
     A                                      Search","onclick":"SystemToolbarSea-
     A                                      rch","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sea-
     A                                      rch.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1118px","id":"W0029F_SCR01_BtnDiary-
     A                                      Items","tool tip":"Diary/Work Items-
     A                                       - IDARTS","onclick":"SystemToolbar-
     A                                      Diary","background image":{"fieldNa-
     A                                      me":"DryIcnURL","dataLength":"128",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"}},{"field type":"button","css-
     A                                       class":"stationary",')
     A                                  1  2HTML('"width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1144px","id":"W0029F-
     A                                      _SCR01_BtnSystemMessages","tool tip-
     A                                      ":"System Messages","onclick":"Syst-
     A                                      emToolbarMessages","background imag-
     A                                      e":{"fieldName":"MsgIcnURL","dataLe-
     A                                      ngth":"128","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none"}},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1196px","id":"W0029F_SCR01_B-
     A                                      tnHelp","tool tip":"Help","onclick"-
     A                                      :"SystemToolbarHelp","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/help.png'')"},{"id":"W-
     A                                      0029F_SCR01_ImgSysToolBottom","fiel-
     A                                      d type":"image","image source":"/pr-
     A                                      ofoundui/userdata/images/systool/bu-
     A                                      tbarbot.png","left":"1036px","top":-
     A                                      "64px","width":"187px","locked in p-
     A                                      lace":"true","css class":"stationar-
     A                                      y","visibility":"hidden"},{"id":"W0-
     A                                      029F_SCR01_MainTabPanel","field typ-
     A                                      e":"tab panel","tab panel style":"T-
     A                                      ransform","tab names":{"fieldName":-
     A                                      "SCPRDS","designValue":"[SCPRDS]","-
     A                                      refField":"NAME","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"active tab-
     A                                      ":"0","left":"250px","top":"70px","-
     A                                      width":"970px","height":"657px","z -
     A                                      index":"8","locked in place":"true"-
     A                                      ,"css class":"tab-panel","css class-
     A                                       2":"stationary"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0029F_SCR01_BtnHiddenSave","-
     A                                      value":"btnSave","top":"100px","res-
     A                                      ponse":{"fieldName":"btnSave","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant1","field type":"output f-
     A                                      ield","left":"281px","cursor column-
     A                                      ":"2","top":"110px","cursor row":"1-
     A                                      ","css class":"top-line","value":"j-
     A                                      s: currentUser()","css class 2":"ou-
     A                                      tput-field","parent tab panel":"W00-
     A                                      29F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"SCCONM","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCCONM","designValu')
     A                                  1  2HTML('e":"[SCCONM]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"110px","cursor row":"1","-
     A                                      css class 2":"top-line","css class -
     A                                      3":"HI","parent tab panel":"W0029F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant2","field type":"-
     A                                      output field","left":"778px","curso-
     A                                      r column":"73","top":"110px","curso-
     A                                      r row":"1","css class":"top-line","-
     A                                      value":"js: currentDate()","css cla-
     A                                      ss 2":"output-field","parent tab pa-
     A                                      nel":"W0029F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"W0029F_SCR01-
     A                                      _fkeyMenu","field type":"menu","lef-
     A                                      t":"10px","top":"120px","height":"3-
     A                                      50px","width":"230px","hover backgr-
     A                                      ound color":"#9AAA61","hover text c-
     A                                      olor":"#FFFFFF","border color":"#4C-
     A                                      6106","menu option indent":"10px","-
     A                                      background color":"#758B27","css cl-
     A                                      ass":"action-menu","css class 2":"s-
     A                                      tationary","z index":"101"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W0029F_SCR01_BtnHid-
     A                                      denRefresh","value":"btnRefresh","t-
     A                                      op":"125px","response":{"fieldName"-
     A                                      :"btnRefresh","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"Q1PGM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"Q1PGM","designValue":"[Q1PG-
     A                                      M]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one","dataLength":"10"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"W00-
     A                                      29F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCPRDS","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCPRDS","designValue":"[SCPRDS]",-
     A                                      "refField":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"414px","cu-
     A                                      rsor column":"21","top":"130px","cu-
     A                                      rsor row":"2","css class 2":"HI","p-
     A                                      arent tab panel":"W0029F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","visibil-
     A                                      ity":"hidden","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant3","f-
     A                                      ield type":"output field","value":"-
     A                                      SCR01","css class":"constant","left-
     A                                      ":"799px","cursor column":"76","top-
     A                                      ":"130px","cursor row":"2","parent -
     A                                      tab panel":"W0029F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCMODE-
     A                                      ","field type":"outpu')
     A                                  1  2HTML('t field","value":{"fieldName"-
     A                                      :"SCMODE","designValue":"[SCMODE]",-
     A                                      "refField":"PGM","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"764px","cur-
     A                                      sor column":"71","top":"150px","cur-
     A                                      sor row":"3","css class 2":"HI","pa-
     A                                      rent tab panel":"W0029F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0029F_SCR01_BtnHidd-
     A                                      enSearch","value":"btnSearch","top"-
     A                                      :"150px","response":{"fieldName":"b-
     A                                      tnSearch","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant4","field -
     A                                      type":"output field","value":"Group-
     A                                      :","css class":"constant","left":"2-
     A                                      81px","cursor column":"2","top":"17-
     A                                      0px","cursor row":"4","parent tab p-
     A                                      anel":"W0029F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCFND","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCFND","designValue":"[S-
     A                                      CFND]","refField":"FND","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"true","curSym":"","un-
     A                                      its":"","negNum":"-999.00"},"css cl-
     A                                      ass":"output-field","left":"330px",-
     A                                      "cursor column":"9","top":"170px","-
     A                                      cursor row":"4","width":"21px","tex-
     A                                      t align":"right","parent tab panel"-
     A                                      :"W0029F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCFNAM","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCFNAM","designValue":"[SCFN-
     A                                      AM]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"57"},"css class-
     A                                      ":"output-field","left":"365px","cu-
     A                                      rsor column":"14","top":"170px","cu-
     A                                      rsor row":"4","parent tab panel":"W-
     A                                      0029F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W00-
     A                                      29F_SCR01_BtnHiddenDiaryItems","val-
     A                                      ue":"btnDiary","top":"175px","respo-
     A                                      nse":{"fieldName":"btnDiary","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0029F_SCR01_BtnHi-
     A                                      ddenSystemMessages","value":"btnMes-
     A                                      sage","top":"200px","response":{"fi-
     A                                      eldName":"btnMessage"')
     A                                  1  2HTML(',"dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant5","field typ-
     A                                      e":"output field","value":"Type inf-
     A                                      ormation, press Enter.","css class"-
     A                                      :"constant","left":"281px","cursor -
     A                                      column":"2","top":"210px","cursor r-
     A                                      ow":"6","css class 2":"BLU","parent-
     A                                       tab panel":"W0029F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0029F_SCR01_BtnHiddenWo-
     A                                      rkSubmitJob","value":"btnWrksbmjob"-
     A                                      ,"top":"225px","response":{"fieldNa-
     A                                      me":"btnWrkJob","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant6","-
     A                                      field type":"output field","value":-
     A                                      "Start with cancellations effective-
     A                                       on                      :","css cl-
     A                                      ass":"constant","left":"295px","cur-
     A                                      sor column":"4","top":"250px","curs-
     A                                      or row":"8","parent tab panel":"W00-
     A                                      29F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCCFSD","field type":-
     A                                      "date field","css class":"input","c-
     A                                      ss class 2":"date-field","value":{"-
     A                                      fieldName":"SCCFSD","designValue":"-
     A                                      [SCCFSD]","dataType":"zoned","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"false","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"-999.00","dataLength":"8","decPos-
     A                                      ":"0","edtWrd":"''  /  /    ''","da-
     A                                      teFormat":"m/d/Y"},"left":"722px","-
     A                                      cursor column":"65","top":"250px","-
     A                                      cursor row":"8","width":"71px","css-
     A                                       class 3":"HI","css class 4":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"set fo-
     A                                      cus":{"fieldName":"81","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"erro-
     A                                      r message id":"WCR0503","error mess-
     A                                      age file":"WMESGG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"71","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      3 messages","error message id 2":"W-
     A                                      CR0500","error message file 2":"WME-
     A                                      SGG","error message library 2":"*LI-
     A                                      BL","error condition 2":{"fieldName-
     A                                      ":"72","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error message id 3":"WC3000-
     A                                      0","error message file 3":"WMESGG",-
     A                                      "error message librar')
     A                                  1  2HTML('y 3":"*LIBL","error condition-
     A                                       3":{"fieldName":"78","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"parent tab p-
     A                                      anel":"W0029F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 6":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0029F_SCR01_BtnHiddenWorkPrin-
     A                                      terOutput","value":"btnWrkprtout","-
     A                                      top":"250px","response":{"fieldName-
     A                                      ":"btnWrkPrnt","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant7","f-
     A                                      ield type":"output field","value":"-
     A                                      Generate confirmation notice       -
     A                                                              :","css cla-
     A                                      ss":"constant","left":"295px","curs-
     A                                      or column":"4","top":"270px","curso-
     A                                      r row":"9","parent tab panel":"W002-
     A                                      9F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCNOTC","field type":"-
     A                                      checkbox","css class":"input","css -
     A                                      class 2":"checkbox","value":{"field-
     A                                      Name":"SCNOTC","designValue":"[SCNO-
     A                                      TC]","refField":"FLAG","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "722px","top":"270px","width":"8px"-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"css class 4":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 5":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR"-
     A                                      ,"customFalse":""},"error message i-
     A                                      d":"WCR0571","error message file":"-
     A                                      WMESGG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"73","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"1 message",-
     A                                      "parent tab panel":"W0029F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted","check-
     A                                      ed value":"Y","unchecked value":" "-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W0029F_SCR-
     A                                      01_BtnHiddenImageQueue","value":"bt-
     A                                      nImgQue","top":"275px","response":{-
     A                                      "fieldName":"btnImgQue","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant8","field type":"')
     A                                  1  2HTML('output field","value":"Genera-
     A                                      te audit request                   -
     A                                                        :","css class":"c-
     A                                      onstant","left":"295px","cursor col-
     A                                      umn":"4","top":"290px","cursor row"-
     A                                      :"10","parent tab panel":"W0029F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCAURQ","field type":"check-
     A                                      box","css class":"input","css class-
     A                                       2":"checkbox","value":{"fieldName"-
     A                                      :"SCAURQ","designValue":"[SCAURQ]",-
     A                                      "refField":"FLAG","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase"},"text -
     A                                      transform":"uppercase","left":"722p-
     A                                      x","top":"290px","width":"8px","css-
     A                                       class 3":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"css class 4":{"fieldName":"N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"read only":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 5":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"error message id":"W-
     A                                      CR0571","error message file":"WMESG-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"74"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error messages":"1 message","pare-
     A                                      nt tab panel":"W0029F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      6":"profound-converted","checked va-
     A                                      lue":"Y","unchecked value":" "},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0029F_SCR01_Bt-
     A                                      nHiddenHelp","value":"btnHelp","top-
     A                                      ":"300px","response":{"fieldName":"-
     A                                      btnHelp","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"constant9","field t-
     A                                      ype":"output field","value":"Update-
     A                                       quote tracking                    -
     A                                                        :","css class":"c-
     A                                      onstant","left":"295px","cursor col-
     A                                      umn":"4","top":"310px","cursor row"-
     A                                      :"11","parent tab panel":"W0029F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCQTRK","field type":"check-
     A                                      box","css class":"input","css class-
     A                                       2":"checkbox","value":{"fieldName"-
     A                                      :"SCQTRK","designValue":"[SCQTRK]",-
     A                                      "refField":"FLAG","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase"},"text -
     A                                      transform":"uppercase","left":"722p-
     A                                      x","top":"310px","wid')
     A                                  1  2HTML('th":"8px","css class 3":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"css class 4":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 5":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      error message id":"WCR0571","error -
     A                                      message file":"WMESGG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"75","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"1 message","parent tab panel":"-
     A                                      W0029F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted","checked value":"Y","unche-
     A                                      cked value":" "},{"id":"constant10"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Allow confirm date different fro-
     A                                      m cancellation eff dt      :","css -
     A                                      class":"constant","left":"295px","c-
     A                                      ursor column":"4","top":"330px","cu-
     A                                      rsor row":"12","parent tab panel":"-
     A                                      W0029F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCNECX","field typ-
     A                                      e":"checkbox","css class":"input","-
     A                                      css class 2":"checkbox","value":{"f-
     A                                      ieldName":"SCNECX","designValue":"[-
     A                                      SCNECX]","refField":"FLAG","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"722px","top":"330px","width":"-
     A                                      8px","css class 3":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"css class 4":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 5":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"error messa-
     A                                      ge id":"WCR0571","error message fil-
     A                                      e":"WMESGG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"76","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"1 messa-
     A                                      ge","parent tab panel":"W0029F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted","c-
     A                                      hecked value":"Y","unchecked value"-
     A                                      :" "},{"id":"constant')
     A                                  1  2HTML('11","field type":"output fiel-
     A                                      d","value":"Confirmation DARTS rema-
     A                                      rk code                            -
     A                                       :","css class":"constant","left":"-
     A                                      295px","cursor column":"4","top":"3-
     A                                      50px","cursor row":"13","parent tab-
     A                                       panel":"W0029F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCCFDR","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCCFDR","designVa-
     A                                      lue":"[SCCFDR]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase","dataLength":"-
     A                                      5"},"text transform":"uppercase","l-
     A                                      eft":"722px","cursor column":"65","-
     A                                      top":"350px","cursor row":"13","wid-
     A                                      th":"36px","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"82","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"err-
     A                                      or message id":"WCR0878","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"77","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","parent tab panel":"W00-
     A                                      29F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"constant12","field ty-
     A                                      pe":"output field","value":"Resolve-
     A                                       document to DARTS                 -
     A                                                   (Y/):","css class":"co-
     A                                      nstant","left":"295px","cursor colu-
     A                                      mn":"4","top":"370px","cursor row":-
     A                                      "14","parent tab panel":"W0029F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCDART","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CDART","designValue":"[SCDART]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      ","dataLength":"1"},"text transform-
     A                                      ":"uppercase","left":"722px","curso-
     A                                      r column":"65","top":"370px","curso-
     A                                      r row":"14","width":"8px","css clas-
     A                                      s 3":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"css-
     A                                       class 4":{"fieldName')
     A                                  1  2HTML('":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"error-
     A                                       message id":"WCR0571","error messa-
     A                                      ge file":"WMESGG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"79","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"1-
     A                                       message","parent tab panel":"W0029-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed"},{"id":"constant13","field type-
     A                                      ":"output field","value":"Print S/R-
     A                                       info with audit request           -
     A                                                   :","css class":"consta-
     A                                      nt","left":"310px","cursor column":-
     A                                      "4","top":"410px","cursor row":"15"-
     A                                      ,"parent tab panel":"W0029F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCSRFL","field type":"checkbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      checkbox","value":{"fieldName":"SCS-
     A                                      RFL","designValue":"[SCSRFL]","refF-
     A                                      ield":"FLAG","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase"},"text trans-
     A                                      form":"uppercase","left":"720px","t-
     A                                      op":"410px","width":"8px","css clas-
     A                                      s 3":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"cs-
     A                                      s class 4":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"read only":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"css class 5":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"PR","customFa-
     A                                      lse":""},"error message id":"WCR124-
     A                                      1","error message file":"WMESGG","e-
     A                                      rror message library":"*LIBL","erro-
     A                                      r condition":{"fieldName":"53","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"1 message","parent ta-
     A                                      b panel":"W0029F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted","checked value":-
     A                                      "Y","unchecked value":" "},{"id":"c-
     A                                      onstant16","field type":"output fie-
     A                                      ld","value":" ","css class":"consta-
     A                                      nt","visibility":{"fieldName":"N40 -
     A                                      and N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"281px",-
     A                                      "cursor column":"2","')
     A                                  1  2HTML('top":"550px","cursor row":"23-
     A                                      ","css class 2":"BLU","parent tab p-
     A                                      anel":"W0029F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant15"-
     A                                      ,"field type":"output field","value-
     A                                      ":" ","css class":"constant","visib-
     A                                      ility":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"550px","cursor row":"23","c-
     A                                      ss class 2":"BLU","parent tab panel-
     A                                      ":"W0029F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant14","fi-
     A                                      eld type":"output field","value":" -
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"40","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"550px","cursor row":"23","css c-
     A                                      lass 2":"BLU","parent tab panel":"W-
     A                                      0029F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"btnSubmit","field t-
     A                                      ype":"button","value":"Enter","shor-
     A                                      tcut key":"Enter","left":"14px","to-
     A                                      p":"150px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF03","field type":"butt-
     A                                      on","visibility":{"fieldName":"40 o-
     A                                      r 09 or N40 and N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"va-
     A                                      lue":"Exit","shortcut key":"F3","le-
     A                                      ft":"14px","top":"183px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF05","fie-
     A                                      ld type":"button","visibility":{"fi-
     A                                      eldName":"N40","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"value":"-
     A                                      Refresh","shortcut key":"F5","left"-
     A                                      :"14px","top":"216px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF10","field -
     A                                      type":"button","visibility":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"value":"Sea-
     A                                      rch","shortcut key":"F10","left":"1-
     A                                      4px","top":"249px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF12","field typ-
     A                                      e":"button","visibility":{"fieldNam-
     A                                      e":"40 or 09 or N40 and N09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"value":"Cancel","shortcut key-
     A                                      ":"F12","left":"14px","top":"282px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"lb-
     A                                      lAuditRequestDefaults","field type"-
     A                                      :"output field","css class":"label"-
     A                                      ,"value":"Audit Reque')
     A                                  1  2HTML('st Defaults","left":"295px","-
     A                                      top":"390px","width":"150px","paren-
     A                                      t tab panel":"W0029F_SCR01_MainTabP-
     A                                      anel","parent tab":"0"},{"id":"LblG-
     A                                      en301Endorsement","field type":"out-
     A                                      put field","css class":"constant","-
     A                                      value":"Generate WC 00 03 01 Endors-
     A                                      ement Forms                   :","c-
     A                                      ursor row":"15","cursor column":"4"-
     A                                      ,"left":"310px","top":"430px","pare-
     A                                      nt tab panel":"W0029F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted","width":"29-
     A                                      5px"},{"id":"CbxGen301Endorsement",-
     A                                      "field type":"checkbox","css class"-
     A                                      :"checkbox","value":{"fieldName":"s-
     A                                      cg301E","refField":"FLAG","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"reference","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[scg301E]"},"left"-
     A                                      :"720px","top":"430px","parent tab -
     A                                      panel":"W0029F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","checked value":"Y-
     A                                      "},{"id":"LblGen311Endorsement","fi-
     A                                      eld type":"output field","css class-
     A                                      ":"constant","value":"Generate WC 0-
     A                                      0 03 11 Endorsement Forms          -
     A                                               :","cursor row":"15","curs-
     A                                      or column":"4","left":"310px","top"-
     A                                      :"450px","width":"295px","parent ta-
     A                                      b panel":"W0029F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"CbxGen31-
     A                                      1Endorsement","field type":"checkbo-
     A                                      x","css class":"checkbox","value":{-
     A                                      "fieldName":"scg311E","refField":"F-
     A                                      LAG","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"ref-
     A                                      erence","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[scg-
     A                                      311E]"},"checked value":"Y","left":-
     A                                      "720px","top":"450px","parent tab p-
     A                                      anel":"W0029F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","text transform":"u-
     A                                      ppercase","read only":{"fieldName":-
     A                                      "09","customTrue":"","customFalse":-
     A                                      "","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"}},{"id":"LblGenAREachDivNo-
     A                                      tice","field type":"output field","-
     A                                      css class":"constant","value":"Gene-
     A                                      rate Audit Request with Each Divisi-
     A                                      on''s Notice       :","cursor row":-
     A                                      "15","cursor column":"4","left":"31-
     A                                      0px","top":"470px","width":"295px",-
     A                                      "parent tab panel":"W0029F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"LblGenARStateReportDiv","field ty-
     A                                      pe":"output field","css class":"con-
     A                                      stant","value":"Generate Audit Requ-
     A                                      est with State Reporting Division  -
     A                                         :","cursor row":"15","cursor col-
     A                                      umn":"4","left":"310px","top":"490p-
     A                                      x","width":"295px","parent tab pane-
     A                                      l":"W0029F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"BtnGenAREachDi-
     A                                      vNotice","field type"')
     A                                  1  2HTML(':"radio button","css class":"-
     A                                      radio-button","value":" ","left":"7-
     A                                      25px","top":"470px","parent tab pan-
     A                                      el":"W0029F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","radio button group":-
     A                                      {"fieldName":"scGaSrD","refField":"-
     A                                      FLAG","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"re-
     A                                      ference","formatting":"Text","textT-
     A                                      ransform":"none"},"read only":{"fie-
     A                                      ldName":"09","customTrue":"","custo-
     A                                      mFalse":"","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"}},{"id":"BtnGenArS-
     A                                      tateRepDiv","field type":"radio but-
     A                                      ton","css class":"radio-button","ra-
     A                                      dio button group":{"fieldName":"scG-
     A                                      aSrD","refField":"FLAG","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"reference","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      ,"left":"725px","top":"490px","pare-
     A                                      nt tab panel":"W0029F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","value":"Y"-
     A                                      ,"read only":{"fieldName":"09","cus-
     A                                      tomTrue":"","customFalse":"","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      }]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCFDR         5A  H
     A            SCCFSD         8S 0H
     A            SCDART         1A  H
     A            SCFNAM        57A  H
     A            SCAURQ    R        H      REFFLD(FLAG)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFND     R        H      REFFLD(FND)
     A            SCG301E   R        H      REFFLD(FLAG)
     A            SCG311E   R        H      REFFLD(FLAG)
     A            SCGASRD   R        H      REFFLD(FLAG)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCNECX    R        H      REFFLD(FLAG)
     A            SCNOTC    R        H      REFFLD(FLAG)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCQTRK    R        H      REFFLD(FLAG)
     A            SCSRFL    R        H      REFFLD(FLAG)
     A          R SCR02
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"W0029F_SCR02_avKeys","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"AV_KEYS","dataLength":"1134",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[AV_KEYS]"},"l-
     A                                      eft":"0px","top":"0px","visibility"-
     A                                      :"hidden"},{"id":"W0029F_SCR02_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"W-
     A                                      0029F_SCR02_BtnIconMenuSystemTools"-
     A                                      ,"tool tip":"System Tools","icon so-
     A                                      urce":"/profoundui/userdata/images/-
     A                                      systool/systools.png","data functio-
     A                                      n":"SystemToolbarSystools","show do-
     A                                      wn arrow":"Yes"},{"field type":"pan-
     A                                      el","panel style":"TransformButtonB-
     A                                      ar","id":"W0029F_SCR02_ButtonBar","-
     A                                      top":"35px","left":"1036px","width"-
     A                                      :"187px","height":"28px","css class-
     A                                      ":"stationary","visibility":"hidden-
     A                                      ","locked in place":"true"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1040px","id":"W0029F-
     A                                      _SCR02_BtnSave","tool tip":"Save","-
     A                                      onclick":"SystemToolbarSave","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/save.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1066px","id":-
     A                                      "W0029F_SCR02_BtnRefr')
     A                                  1  2HTML('esh","tool tip":"Refresh","on-
     A                                      click":"SystemToolbarRefresh","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/refresh.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1092px","-
     A                                      id":"W0029F_SCR02_BtnSearch","tool -
     A                                      tip":"Search","onclick":"SystemTool-
     A                                      barSearch","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/search.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1118px","id":"W0029F_SCR02_Bt-
     A                                      nDiaryItems","tool tip":"Diary/Work-
     A                                       Items - IDARTS","onclick":"SystemT-
     A                                      oolbarDiary","background image":{"f-
     A                                      ieldName":"DryIcnURL","dataLength":-
     A                                      "128","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"}},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1144px","id":"W0029F_SCR02_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"}},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1196px"-
     A                                      ,"id":"W0029F_SCR02_BtnHelp","tool -
     A                                      tip":"Help","onclick":"SystemToolba-
     A                                      rHelp","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/h-
     A                                      elp.png'')"},{"id":"W0029F_SCR02_Im-
     A                                      gSysToolBottom","fiel')
     A                                  1  2HTML('d type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"W0029F_SCR02_MainTabPanel","fie-
     A                                      ld type":"tab panel","tab panel sty-
     A                                      le":"Transform","tab names":{"field-
     A                                      Name":"SCPRDS","designValue":"[SCPR-
     A                                      DS]","refField":"NAME","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"acti-
     A                                      ve tab":"0","left":"250px","top":"7-
     A                                      0px","width":"970px","height":"657p-
     A                                      x","z index":"8","locked in place":-
     A                                      "true","css class":"tab-panel","css-
     A                                       class 2":"stationary"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W0029F_SCR02_BtnHiddenS-
     A                                      ave","value":"btnSave","top":"100px-
     A                                      ","response":{"fieldName":"btnSave"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant17","field type":"o-
     A                                      utput field","left":"281px","cursor-
     A                                       column":"2","top":"110px","cursor -
     A                                      row":"1","css class":"top-line","va-
     A                                      lue":"js: currentUser()","css class-
     A                                       2":"output-field","parent tab pane-
     A                                      l":"W0029F_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"SCR02_SCCONM",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCCONM","designValue-
     A                                      ":"[SCCONM]","refField":"NAME","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"414px","cursor column":"21","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss 2":"top-line","css class 3":"HI"-
     A                                      ,"parent tab panel":"W0029F_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 4":"profound-converted"},{"id-
     A                                      ":"constant18","field type":"output-
     A                                       field","left":"778px","cursor colu-
     A                                      mn":"73","top":"110px","cursor row"-
     A                                      :"1","css class":"top-line","value"-
     A                                      :"js: currentDate()","css class 2":-
     A                                      "output-field","parent tab panel":"-
     A                                      W0029F_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"W0029F_SCR02_fkeyM-
     A                                      enu","field type":"menu","left":"10-
     A                                      px","top":"120px","height":"350px",-
     A                                      "width":"230px","hover background c-
     A                                      olor":"#9AAA61","hover text color":-
     A                                      "#FFFFFF","border color":"#4C6106",-
     A                                      "menu option indent":"10px","backgr-
     A                                      ound color":"#758B27","css class":"-
     A                                      action-menu","css class 2":"station-
     A                                      ary","z index":"101"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","vis')
     A                                  1  2HTML('ibility":"hidden","id":"W0029-
     A                                      F_SCR02_BtnHiddenRefresh","value":"-
     A                                      btnRefresh","top":"125px","response-
     A                                      ":{"fieldName":"btnRefresh","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      SCR02_Q1PGM","field type":"output f-
     A                                      ield","value":{"fieldName":"Q1PGM",-
     A                                      "designValue":"[Q1PGM]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"10"},"css class":"output-field"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"130px","cursor row":"2","pa-
     A                                      rent tab panel":"W0029F_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CR02_SCPRDS","field type":"output f-
     A                                      ield","value":{"fieldName":"SCPRDS"-
     A                                      ,"designValue":"[SCPRDS]","refField-
     A                                      ":"NAME","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"414px","cursor colu-
     A                                      mn":"21","top":"130px","cursor row"-
     A                                      :"2","css class 2":"HI","parent tab-
     A                                       panel":"W0029F_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","visibility":"hid-
     A                                      den","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant19","field typ-
     A                                      e":"output field","value":"SCR02","-
     A                                      css class":"constant","left":"799px-
     A                                      ","cursor column":"76","top":"130px-
     A                                      ","cursor row":"2","parent tab pane-
     A                                      l":"W0029F_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCR02_SCMODE",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCMODE","designValue-
     A                                      ":"[SCMODE]","refField":"PGM","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"764px","cursor column":"71","top"-
     A                                      :"150px","cursor row":"3","css clas-
     A                                      s 2":"HI","parent tab panel":"W0029-
     A                                      F_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W0029F_-
     A                                      SCR02_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0029F_SCR02_BtnHiddenDi-
     A                                      aryItems","value":"btnDiary","top":-
     A                                      "175px","response":{"fieldName":"bt-
     A                                      nDiary","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":')
     A                                  1  2HTML('"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W0029F_SCR02_BtnHid-
     A                                      denSystemMessages","value":"btnMess-
     A                                      age","top":"200px","response":{"fie-
     A                                      ldName":"btnMessage","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0029F_SCR02_BtnHiddenWork-
     A                                      SubmitJob","value":"btnWrksbmjob","-
     A                                      top":"225px","response":{"fieldName-
     A                                      ":"btnWrkJob","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0029F_SCR02_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0029F_SCR02_BtnHiddenImageQueue","-
     A                                      value":"btnImgQue","top":"275px","r-
     A                                      esponse":{"fieldName":"btnImgQue","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W0029F_SCR02_-
     A                                      BtnHiddenHelp","value":"btnHelp","t-
     A                                      op":"300px","response":{"fieldName"-
     A                                      :"btnHelp","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"150px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF03","field type":"bu-
     A                                      tton","value":"Exit","shortcut key"-
     A                                      :"F3","left":"14px","top":"183px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F12","field type":"button","value":-
     A                                      "Cancel","shortcut key":"F12","left-
     A                                      ":"14px","top":"216px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR03
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"W0029F_SCR03_avKeys","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"AV_KEYS","dataLength":"1134",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[AV_KEYS]"},"l-
     A                                      eft":"0px","top":"0px","visibility"-
     A                                      :"hidden"},{"id":"W0029F_SCR03_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"W-
     A                                      0029F_SCR03_BtnIconMenuSystemTools"-
     A                                      ,"tool tip":"System Tools","icon so-
     A                                      urce":"/profoundui/userdata/images/-
     A                                      systool/systools.png","data functio-
     A                                      n":"SystemToolbarSystools","show do-
     A                                      wn arrow":"Yes"},{"field type":"pan-
     A                                      el","panel style":"TransformButtonB-
     A                                      ar","id":"W0029F_SCR03_ButtonBar","-
     A                                      top":"35px","left":"1036px","width"-
     A                                      :"187px","height":"28px","css class-
     A                                      ":"stationary","visibility":"hidden-
     A                                      ","locked in place":"true"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1040px","id":"W0029F-
     A                                      _SCR03_BtnSave","tool tip":"Save","-
     A                                      onclick":"SystemToolbarSave","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/save.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1066px","id":-
     A                                      "W0029F_SCR03_BtnRefr')
     A                                  1  2HTML('esh","tool tip":"Refresh","on-
     A                                      click":"SystemToolbarRefresh","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/refresh.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1092px","-
     A                                      id":"W0029F_SCR03_BtnSearch","tool -
     A                                      tip":"Search","onclick":"SystemTool-
     A                                      barSearch","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/search.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1118px","id":"W0029F_SCR03_Bt-
     A                                      nDiaryItems","tool tip":"Diary/Work-
     A                                       Items - IDARTS","onclick":"SystemT-
     A                                      oolbarDiary","background image":{"f-
     A                                      ieldName":"DryIcnURL","dataLength":-
     A                                      "128","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"}},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1144px","id":"W0029F_SCR03_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"}},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1196px"-
     A                                      ,"id":"W0029F_SCR03_BtnHelp","tool -
     A                                      tip":"Help","onclick":"SystemToolba-
     A                                      rHelp","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/h-
     A                                      elp.png'')"},{"id":"W0029F_SCR03_Im-
     A                                      gSysToolBottom","fiel')
     A                                  1  2HTML('d type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"W0029F_SCR03_MainTabPanel","fie-
     A                                      ld type":"tab panel","tab panel sty-
     A                                      le":"Transform","tab names":{"field-
     A                                      Name":"SCPRDS","designValue":"[SCPR-
     A                                      DS]","refField":"NAME","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"acti-
     A                                      ve tab":"0","left":"250px","top":"7-
     A                                      0px","width":"970px","height":"657p-
     A                                      x","z index":"8","locked in place":-
     A                                      "true","css class":"tab-panel","css-
     A                                       class 2":"stationary"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W0029F_SCR03_BtnHiddenS-
     A                                      ave","value":"btnSave","top":"100px-
     A                                      ","response":{"fieldName":"btnSave"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant20","field type":"o-
     A                                      utput field","left":"281px","cursor-
     A                                       column":"2","top":"110px","cursor -
     A                                      row":"1","css class":"top-line","va-
     A                                      lue":"js: currentUser()","css class-
     A                                       2":"output-field","parent tab pane-
     A                                      l":"W0029F_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"SCR03_SCCONM",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCCONM","designValue-
     A                                      ":"[SCCONM]","refField":"NAME","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"414px","cursor column":"21","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss 2":"top-line","css class 3":"HI"-
     A                                      ,"parent tab panel":"W0029F_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 4":"profound-converted"},{"id-
     A                                      ":"constant21","field type":"output-
     A                                       field","left":"778px","cursor colu-
     A                                      mn":"73","top":"110px","cursor row"-
     A                                      :"1","css class":"top-line","value"-
     A                                      :"js: currentDate()","css class 2":-
     A                                      "output-field","parent tab panel":"-
     A                                      W0029F_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"W0029F_SCR03_fkeyM-
     A                                      enu","field type":"menu","left":"10-
     A                                      px","top":"120px","height":"350px",-
     A                                      "width":"230px","hover background c-
     A                                      olor":"#9AAA61","hover text color":-
     A                                      "#FFFFFF","border color":"#4C6106",-
     A                                      "menu option indent":"10px","backgr-
     A                                      ound color":"#758B27","css class":"-
     A                                      action-menu","css class 2":"station-
     A                                      ary","z index":"101"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","vis')
     A                                  1  2HTML('ibility":"hidden","id":"W0029-
     A                                      F_SCR03_BtnHiddenRefresh","value":"-
     A                                      btnRefresh","top":"125px","response-
     A                                      ":{"fieldName":"btnRefresh","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      SCR03_Q1PGM","field type":"output f-
     A                                      ield","value":{"fieldName":"Q1PGM",-
     A                                      "designValue":"[Q1PGM]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"10"},"css class":"output-field"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"130px","cursor row":"2","pa-
     A                                      rent tab panel":"W0029F_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CR03_SCPRDS","field type":"output f-
     A                                      ield","value":{"fieldName":"SCPRDS"-
     A                                      ,"designValue":"[SCPRDS]","refField-
     A                                      ":"NAME","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"414px","cursor colu-
     A                                      mn":"21","top":"130px","cursor row"-
     A                                      :"2","css class 2":"HI","parent tab-
     A                                       panel":"W0029F_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","visibility":"hid-
     A                                      den","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant22","field typ-
     A                                      e":"output field","value":"SCR03","-
     A                                      css class":"constant","left":"799px-
     A                                      ","cursor column":"76","top":"130px-
     A                                      ","cursor row":"2","parent tab pane-
     A                                      l":"W0029F_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCR03_SCMODE",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCMODE","designValue-
     A                                      ":"[SCMODE]","refField":"PGM","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"764px","cursor column":"71","top"-
     A                                      :"150px","cursor row":"3","css clas-
     A                                      s 2":"HI","parent tab panel":"W0029-
     A                                      F_SCR03_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W0029F_-
     A                                      SCR03_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0029F_SCR03_BtnHiddenDi-
     A                                      aryItems","value":"btnDiary","top":-
     A                                      "175px","response":{"fieldName":"bt-
     A                                      nDiary","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":')
     A                                  1  2HTML('"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W0029F_SCR03_BtnHid-
     A                                      denSystemMessages","value":"btnMess-
     A                                      age","top":"200px","response":{"fie-
     A                                      ldName":"btnMessage","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0029F_SCR03_BtnHiddenWork-
     A                                      SubmitJob","value":"btnWrksbmjob","-
     A                                      top":"225px","response":{"fieldName-
     A                                      ":"btnWrkJob","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0029F_SCR03_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0029F_SCR03_BtnHiddenImageQueue","-
     A                                      value":"btnImgQue","top":"275px","r-
     A                                      esponse":{"fieldName":"btnImgQue","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W0029F_SCR03_-
     A                                      BtnHiddenHelp","value":"btnHelp","t-
     A                                      op":"300px","response":{"fieldName"-
     A                                      :"btnHelp","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"150px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF03","field type":"bu-
     A                                      tton","value":"Exit","shortcut key"-
     A                                      :"F3","left":"14px","top":"183px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F12","field type":"button","value":-
     A                                      "Cancel","shortcut key":"F12","left-
     A                                      ":"14px","top":"216px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
