     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A*PUI                                  SFLDEFINE(18)
     A*PUI                                  SFLDEFINE(19)
     A          R SCR01
     A  10 11 18
     A  19 20                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                      SETOF(19 'Response Indicator *IN19')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCFL01C7    WCR0600C6    WMESGGC0-
     A                                          C0    E1    3     20')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"vali-
     A                                      d command key":{"fieldName":"*IN11"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"W0036F_SCR01_avKeys","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"AV_KEYS","dataLength":"1134",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[AV_KEYS]"},"l-
     A                                      eft":"0px","top":"0px","visibility"-
     A                                      :"hidden"},{"id":"W0036F_SCR01_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"W-
     A                                      0036F_SCR01_BtnIconMenuSystemTools"-
     A                                      ,"tool tip":"System Tools","icon al-
     A                                      ignment":"middle left","icon width"-
     A                                      :"16px","icon height":"24px","icon -
     A                                      source":"/profoundui/userdata/image-
     A                                      s/systool/systools.png","data funct-
     A                                      ion":"SystemToolbarSystools","show -
     A                                      down arrow":"Yes"},{"field type":"p-
     A                                      anel","panel style":"TransformButto-
     A                                      nBar","id":"W0036F_SCR01_ButtonBar"-
     A                                      ,"top":"35px","left":"1036px","widt-
     A                                      h":"187px","height":"28px","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en","locked in place":"true"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1040px","id":"W003-
     A                                      6F_SCR01_BtnSave","tool tip":"Save"-
     A                                      ,"onclick":"SystemToolbarSave","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/save.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1066px","id-
     A                                      ":"W0036F_SCR01_BtnRefresh","tool t-
     A                                      ip":"Refresh","onclick":"SystemTool-
     A                                      barRefresh","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/refresh.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1092px","id":"W0036F_SCR01_-
     A                                      BtnSearch","tool tip":"Search","onc-
     A                                      lick":"SystemToolbarSearch","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/search.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1118px","id"-
     A                                      :"W0036F_SCR01_BtnDiaryItems","tool-
     A                                       tip":"Diary/Work Items - IDARTS","-
     A                                      onclick":"SystemToolbarDiary","back-
     A                                      ground image":{"fieldName":"DryIcnU-
     A                                      RL","dataLength":"128","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"}},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1144px","id":"W00-
     A                                      36F_SCR01_BtnSystemMessages","tool -
     A                                      tip":"System Messages","on')
     A                                  1  4HTML('click":"SystemToolbarMessages-
     A                                      ","background image":{"fieldName":"-
     A                                      MsgIcnURL","dataLength":"128","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      }},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1196px","i-
     A                                      d":"W0036F_SCR01_BtnHelp","tool tip-
     A                                      ":"Help","onclick":"SystemToolbarHe-
     A                                      lp","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/help-
     A                                      .png'')"},{"id":"W0036F_SCR01_ImgSy-
     A                                      sToolBottom","field type":"image","-
     A                                      image source":"/profoundui/userdata-
     A                                      /images/systool/butbarbot.png","lef-
     A                                      t":"1036px","top":"64px","width":"1-
     A                                      87px","locked in place":"true","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden"},{"id":"W0036F_SCR01_MainTa-
     A                                      bPanel","field type":"tab panel","t-
     A                                      ab panel style":"Transform","tab na-
     A                                      mes":{"fieldName":"SCPRDS","designV-
     A                                      alue":"[SCPRDS]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"active tab":"0","left":"250-
     A                                      px","top":"70px","width":"970px","h-
     A                                      eight":"657px","z index":"8","locke-
     A                                      d in place":"true","css class":"tab-
     A                                      -panel","css class 2":"stationary"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0036F_SCR0-
     A                                      1_BtnHiddenSave","value":"btnSave",-
     A                                      "top":"100px","response":{"fieldNam-
     A                                      e":"btnSave","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"SCUSER","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCUSER","designValue":"[SCU-
     A                                      SER]","refField":"USER","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"281p-
     A                                      x","cursor column":"2","top":"110px-
     A                                      ","cursor row":"1","css class 2":"t-
     A                                      op-line","parent tab panel":"W0036F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCCONM","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CCONM","designValue":"[SCCONM]","re-
     A                                      fField":"NAME","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"414px","curso-
     A                                      r column":"21","top":"110px","curso-
     A                                      r row":"1","css class 2":"top-line"-
     A                                      ,"description":"COMPANY NAME","pare-
     A                                      nt tab panel":"W0036F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant1","field type":"output field"-
     A                                      ,"left":"778px","cursor column":"73-
     A                                      ","top":"110px","cursor row":"1","c-
     A                                      ss class":"top-line","value":"js: c-
     A                                      urrentDate()","css class 2":"output-
     A                                      -field","parent tab panel":"W0036F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"W0036F_SCR01_fkeyMenu","f-
     A                                      ield type":"menu","left":"10px","to-
     A                                      p":"120px","height":"350px","width"-
     A                                      :"230px","hover background color":"-
     A                                      #9AAA61","hover text color":"#FFFFF-
     A                                      F","border color":"#4C6106","menu o-
     A                                      ption indent":"10px","background co-
     A                                      lor":"#758B27","css class":"action--
     A                                      menu","css class 2":"stationary","z-
     A                                       index":"101"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0036F_SCR01_BtnHiddenRefresh","-
     A                                      value":"btnRefresh","top":"125px","-
     A                                      response":{"fieldName":"btnRefresh"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant2","field type":"ou-
     A                                      tput field","value":"W0036F","css c-
     A                                      lass":"constant","left":"281px","cu-
     A                                      rsor column":"2","top":"130px","cur-
     A                                      sor row":"2","parent tab panel":"W0-
     A                                      036F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCPRDS","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCPRDS","designValue":"[SCPRDS]"-
     A                                      ,"refField":"NAME","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"414px","c-
     A                                      ursor column":"21","top":"130px","c-
     A                                      ursor row":"2","description":"PROGR-
     A                                      AM NAME","parent tab panel":"W0036F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","visibility":"hidden","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant3","field type":"output field-
     A                                      ","value":"SCR01","css class":"cons-
     A                                      tant","left":"799px","cursor column-
     A                                      ":"76","top":"130px","curs')
     A                                  1  5HTML('or row":"2","parent tab panel-
     A                                      ":"W0036F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W0036F_SCR01_BtnHiddenSearch","val-
     A                                      ue":"btnSearch","top":"150px","resp-
     A                                      onse":{"fieldName":"btnSearch","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W0036F_SCR01_Btn-
     A                                      HiddenDiaryItems","value":"btnDiary-
     A                                      ","top":"175px","response":{"fieldN-
     A                                      ame":"btnDiary","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant4","-
     A                                      field type":"output field","value":-
     A                                      "Tax ID:","css class":"constant","l-
     A                                      eft":"288px","cursor column":"3","t-
     A                                      op":"190px","cursor row":"5","paren-
     A                                      t tab panel":"W0036F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCFE-
     A                                      IN","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCFEIN","des-
     A                                      ignValue":"[SCFEIN]","refField":"FE-
     A                                      IN","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00","numBlankFill":"true"},"lef-
     A                                      t":"344px","cursor column":"11","to-
     A                                      p":"190px","cursor row":"5","width"-
     A                                      :"64px","text align":"right","css c-
     A                                      lass 3":"UL","parent tab panel":"W0-
     A                                      036F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 4":"profound-conv-
     A                                      erted"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W003-
     A                                      6F_SCR01_BtnHiddenSystemMessages","-
     A                                      value":"btnMessage","top":"200px","-
     A                                      response":{"fieldName":"btnMessage"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant5","field type":"ou-
     A                                      tput field","value":"Tax ID","css c-
     A                                      lass":"constant","left":"302px","cu-
     A                                      rsor column":"5","top":"210px","cur-
     A                                      sor row":"6","parent tab panel":"W0-
     A                                      036F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"constant6","field ty-
     A                                      pe":"output field","value":"Mod","c-
     A                                      ss class":"constant","left":"365px"-
     A                                      ,"cursor column":"14","top":"210px"-
     A                                      ,"cursor row":"6","parent tab panel-
     A                                      ":"W0036F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"constant7","fie-
     A                                      ld type":"output field","value":"Na-
     A                                      me","css class":"constant","left":"-
     A                                      400px","cursor column":"19","top":"-
     A                                      210px","cursor row":"6","parent tab-
     A                                       panel":"W0036F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"constant8-
     A                                      ","field type":"output field","valu-
     A                                      e":"Group Tp","css class":"constant-
     A                                      ","left":"694px","cursor column":"6-
     A                                      1","top":"210px","cursor row":"6","-
     A                                      parent tab panel":"W0036F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant9","field type":"output fi-
     A                                      eld","value":"Status","css class":"-
     A                                      constant","left":"771px","cursor co-
     A                                      lumn":"72","top":"210px","cursor ro-
     A                                      w":"6","parent tab panel":"W0036F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W0036F_SCR-
     A                                      01_BtnHiddenWorkSubmitJob","value":-
     A                                      "btnWrksbmjob","top":"225px","respo-
     A                                      nse":{"fieldName":"btnWrkJob","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"SCFL01","field type":"password fi-
     A                                      eld","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCFL01","designValue":"[SCFL01]","-
     A                                      refField":"FLAG","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"274px-
     A                                      ","cursor column":"1","top":"250px"-
     A                                      ,"cursor row":"8","width":"8px","er-
     A                                      ror message id":"WCR0600","error me-
     A                                      ssage file":"WMESGG","error conditi-
     A                                      on":{"fieldName":"20","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"1 message","parent tab panel":-
     A                                      "W0036F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"SCFE01","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCFE01","designValue":"[SCFE0-
     A                                      1]","refField":"FEIN","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"999.00"},"css cla-
     A                                      ss":"output-field","left":')
     A                                  1  6HTML('"288px","cursor column":"3","-
     A                                      top":"250px","cursor row":"8","widt-
     A                                      h":"63px","text align":"right","par-
     A                                      ent tab panel":"W0036F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      MO01","field type":"output field","-
     A                                      value":{"fieldName":"SCMO01","desig-
     A                                      nValue":"[SCMO01]","refField":"MOD"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"false","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"999-
     A                                      .00"},"css class":"output-field","l-
     A                                      eft":"365px","cursor column":"14","-
     A                                      top":"250px","cursor row":"8","widt-
     A                                      h":"21px","text align":"right","par-
     A                                      ent tab panel":"W0036F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      NM01","field type":"output field","-
     A                                      value":{"fieldName":"SCNM01","desig-
     A                                      nValue":"[SCNM01]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"400px","cursor column":"19-
     A                                      ","top":"250px","cursor row":"8","p-
     A                                      arent tab panel":"W0036F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCGT01","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCGT01","des-
     A                                      ignValue":"[SCGT01]","refField":"FL-
     A                                      AG","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"715px","cursor column":"-
     A                                      64","top":"250px","cursor row":"8",-
     A                                      "parent tab panel":"W0036F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCST01","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCST01","d-
     A                                      esignValue":"[SCST01]","refField":"-
     A                                      FLAG","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"785px","cursor column"-
     A                                      :"74","top":"250px","cursor row":"8-
     A                                      ","parent tab panel":"W0036F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0036F_SCR01_Bt-
     A                                      nHiddenWorkPrinterOutput","value":"-
     A                                      btnWrkprtout","top":"250px","respon-
     A                                      se":{"fieldName":"btnWrkPrnt","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"SCFL02","field type":"password fi-
     A                                      eld","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCFL02","designValue":"[SCFL02]","-
     A                                      refField":"FLAG","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"274px-
     A                                      ","cursor column":"1","top":"270px"-
     A                                      ,"cursor row":"9","width":"8px","pa-
     A                                      rent tab panel":"W0036F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CFE02","field type":"output field",-
     A                                      "value":{"fieldName":"SCFE02","desi-
     A                                      gnValue":"[SCFE02]","refField":"FEI-
     A                                      N","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"false","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"9-
     A                                      99.00"},"css class":"output-field",-
     A                                      "left":"288px","cursor column":"3",-
     A                                      "top":"270px","cursor row":"9","wid-
     A                                      th":"63px","text align":"right","pa-
     A                                      rent tab panel":"W0036F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CMO02","field type":"output field",-
     A                                      "value":{"fieldName":"SCMO02","desi-
     A                                      gnValue":"[SCMO02]","refField":"MOD-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"99-
     A                                      9.00"},"css class":"output-field","-
     A                                      left":"365px","cursor column":"14",-
     A                                      "top":"270px","cursor row":"9","wid-
     A                                      th":"21px","text align":"right","pa-
     A                                      rent tab panel":"W0036F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CNM02","field type":"output field",-
     A                                      "value":{"fieldName":"SCNM02","desi-
     A                                      gnValue":"[SCNM02]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"400px","cursor column":"1-
     A                                      9","top":"270px","cursor row":"9","-
     A                                      parent tab panel":"W0036F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCGT02","field type":"output field-
     A                                      ","value":{"fieldName":"SCGT02","de-
     A                                      signValue":"[SCGT02]","refField":"F-
     A                                      LAG","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"715px","cursor column":-
     A                                      "64","top":"270px","cursor')
     A                                  1  7HTML(' row":"9","parent tab panel":-
     A                                      "W0036F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCST02","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCST02","designValue":"[SCST0-
     A                                      2]","refField":"FLAG","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"785px"-
     A                                      ,"cursor column":"74","top":"270px"-
     A                                      ,"cursor row":"9","parent tab panel-
     A                                      ":"W0036F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W0036F_SCR01_BtnHiddenImageQueue",-
     A                                      "value":"btnImgQue","top":"275px","-
     A                                      response":{"fieldName":"btnImgQue",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"SLFL03","field type":"passwo-
     A                                      rd field","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SLFL03","designValue":"[SLFL0-
     A                                      3]","refField":"FLAG","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase"},"t-
     A                                      ext transform":"uppercase","left":"-
     A                                      274px","cursor column":"1","top":"2-
     A                                      90px","cursor row":"10","width":"8p-
     A                                      x","parent tab panel":"W0036F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"SCFE03","field type":"output f-
     A                                      ield","value":{"fieldName":"SCFE03"-
     A                                      ,"designValue":"[SCFE03]","refField-
     A                                      ":"FEIN","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00"},"css class":"output-f-
     A                                      ield","left":"288px","cursor column-
     A                                      ":"3","top":"290px","cursor row":"1-
     A                                      0","width":"63px","text align":"rig-
     A                                      ht","parent tab panel":"W0036F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCMO03","field type":"output -
     A                                      field","value":{"fieldName":"SCMO03-
     A                                      ","designValue":"[SCMO03]","refFiel-
     A                                      d":"MOD","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00"},"css class":"output-f-
     A                                      ield","left":"365px","cursor column-
     A                                      ":"14","top":"290px","cursor row":"-
     A                                      10","width":"21px","text align":"ri-
     A                                      ght","parent tab panel":"W0036F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCNM03","field type":"output-
     A                                       field","value":{"fieldName":"SCNM0-
     A                                      3","designValue":"[SCNM03]","refFie-
     A                                      ld":"NAME","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"400px","cursor co-
     A                                      lumn":"19","top":"290px","cursor ro-
     A                                      w":"10","parent tab panel":"W0036F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCGT03","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      GT03","designValue":"[SCGT03]","ref-
     A                                      Field":"FLAG","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"715px","cursor-
     A                                       column":"64","top":"290px","cursor-
     A                                       row":"10","parent tab panel":"W003-
     A                                      6F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCST03","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCST03","designValue":"[SCST03]","-
     A                                      refField":"FLAG","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"785px","cur-
     A                                      sor column":"74","top":"290px","cur-
     A                                      sor row":"10","parent tab panel":"W-
     A                                      0036F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W00-
     A                                      36F_SCR01_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCFL04"-
     A                                      ,"field type":"password field","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCFL04",-
     A                                      "designValue":"[SCFL04]","refField"-
     A                                      :"FLAG","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","left":"274px","cursor-
     A                                       column":"1","top":"310px","cursor -
     A                                      row":"11","width":"8px","parent tab-
     A                                       panel":"W0036F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCFE04","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCFE04","des')
     A                                  1  8HTML('ignValue":"[SCFE04]","refFiel-
     A                                      d":"FEIN","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00"},"css class":"output--
     A                                      field","left":"288px","cursor colum-
     A                                      n":"3","top":"310px","cursor row":"-
     A                                      11","width":"63px","text align":"ri-
     A                                      ght","parent tab panel":"W0036F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCMO04","field type":"output-
     A                                       field","value":{"fieldName":"SCMO0-
     A                                      4","designValue":"[SCMO04]","refFie-
     A                                      ld":"MOD","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00"},"css class":"output--
     A                                      field","left":"365px","cursor colum-
     A                                      n":"14","top":"310px","cursor row":-
     A                                      "11","width":"21px","text align":"r-
     A                                      ight","parent tab panel":"W0036F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCNM04","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCNM-
     A                                      04","designValue":"[SCNM04]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"400px","cursor c-
     A                                      olumn":"19","top":"310px","cursor r-
     A                                      ow":"11","parent tab panel":"W0036F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCGT04","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CGT04","designValue":"[SCGT04]","re-
     A                                      fField":"FLAG","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"715px","curso-
     A                                      r column":"64","top":"310px","curso-
     A                                      r row":"11","parent tab panel":"W00-
     A                                      36F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCST04","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCST04","designValue":"[SCST04]",-
     A                                      "refField":"FLAG","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"785px","cu-
     A                                      rsor column":"74","top":"310px","cu-
     A                                      rsor row":"11","parent tab panel":"-
     A                                      W0036F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCFL05","field typ-
     A                                      e":"password field","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCFL05","designValu-
     A                                      e":"[SCFL05]","refField":"FLAG","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase"},"text transform":"uppercase-
     A                                      ","left":"274px","cursor column":"1-
     A                                      ","top":"330px","cursor row":"12","-
     A                                      width":"8px","parent tab panel":"W0-
     A                                      036F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"SCFE05","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCFE05","designValue":"[SCFE05]"-
     A                                      ,"refField":"FEIN","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00"},"css class"-
     A                                      :"output-field","left":"288px","cur-
     A                                      sor column":"3","top":"330px","curs-
     A                                      or row":"12","width":"63px","text a-
     A                                      lign":"right","parent tab panel":"W-
     A                                      0036F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCMO05","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCMO05","designValue":"[SCMO05]-
     A                                      ","refField":"MOD","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00"},"css class"-
     A                                      :"output-field","left":"365px","cur-
     A                                      sor column":"14","top":"330px","cur-
     A                                      sor row":"12","width":"21px","text -
     A                                      align":"right","parent tab panel":"-
     A                                      W0036F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCNM05","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCNM05","designValue":"[SCNM05-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"400px",-
     A                                      "cursor column":"19","top":"330px",-
     A                                      "cursor row":"12","parent tab panel-
     A                                      ":"W0036F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCGT05","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCGT05","designValue":"[SCG-
     A                                      T05]","refField":"FLAG","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"715p-
     A                                      x","cursor column":"64","top":"330p-
     A                                      x","cursor row":"12","parent tab pa-
     A                                      nel":"W0036F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCS')
     A                                  1  9HTML('T05","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCST05","-
     A                                      designValue":"[SCST05]","refField":-
     A                                      "FLAG","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"785px","cursor column-
     A                                      ":"74","top":"330px","cursor row":"-
     A                                      12","parent tab panel":"W0036F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCFL06","field type":"passwor-
     A                                      d field","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCFL06","designValue":"[SCFL06-
     A                                      ]","refField":"FLAG","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"2-
     A                                      74px","cursor column":"1","top":"35-
     A                                      0px","cursor row":"13","width":"8px-
     A                                      ","parent tab panel":"W0036F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"SCFE06","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCFE06",-
     A                                      "designValue":"[SCFE06]","refField"-
     A                                      :"FEIN","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"false","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"999.00"},"css class":"output-fi-
     A                                      eld","left":"288px","cursor column"-
     A                                      :"3","top":"350px","cursor row":"13-
     A                                      ","width":"63px","text align":"righ-
     A                                      t","parent tab panel":"W0036F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCMO06","field type":"output f-
     A                                      ield","value":{"fieldName":"SCMO06"-
     A                                      ,"designValue":"[SCMO06]","refField-
     A                                      ":"MOD","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"false","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"999.00"},"css class":"output-fi-
     A                                      eld","left":"365px","cursor column"-
     A                                      :"14","top":"350px","cursor row":"1-
     A                                      3","width":"21px","text align":"rig-
     A                                      ht","parent tab panel":"W0036F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCNM06","field type":"output -
     A                                      field","value":{"fieldName":"SCNM06-
     A                                      ","designValue":"[SCNM06]","refFiel-
     A                                      d":"NAME","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"400px","cursor col-
     A                                      umn":"19","top":"350px","cursor row-
     A                                      ":"13","parent tab panel":"W0036F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCGT06","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCG-
     A                                      T06","designValue":"[SCGT06]","refF-
     A                                      ield":"FLAG","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"715px","cursor -
     A                                      column":"64","top":"350px","cursor -
     A                                      row":"13","parent tab panel":"W0036-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCST06","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCST06","designValue":"[SCST06]","r-
     A                                      efField":"FLAG","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"785px","curs-
     A                                      or column":"74","top":"350px","curs-
     A                                      or row":"13","parent tab panel":"W0-
     A                                      036F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCFL07","field type"-
     A                                      :"password field","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCFL07","designValue"-
     A                                      :"[SCFL07]","refField":"FLAG","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "left":"274px","cursor column":"1",-
     A                                      "top":"370px","cursor row":"14","wi-
     A                                      dth":"8px","parent tab panel":"W003-
     A                                      6F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"SCFE07","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCFE07","designValue":"[SCFE07]","-
     A                                      refField":"FEIN","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00"},"css class":"-
     A                                      output-field","left":"288px","curso-
     A                                      r column":"3","top":"370px","cursor-
     A                                       row":"14","width":"63px","text ali-
     A                                      gn":"right","parent tab panel":"W00-
     A                                      36F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCMO07","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCMO07","designValue":"[SCMO07]",-
     A                                      "refField":"MOD","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00"},"css class":"-
     A                                      output-field","left":"365px","curso-
     A                                      r column":"14","top":"370px","curso-
     A                                      r row":"14","width":"21px"')
     A                                  1 10HTML(',"text align":"right","parent-
     A                                       tab panel":"W0036F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCNM0-
     A                                      7","field type":"output field","val-
     A                                      ue":{"fieldName":"SCNM07","designVa-
     A                                      lue":"[SCNM07]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"400px","cursor column":"19","-
     A                                      top":"370px","cursor row":"14","par-
     A                                      ent tab panel":"W0036F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      GT07","field type":"output field","-
     A                                      value":{"fieldName":"SCGT07","desig-
     A                                      nValue":"[SCGT07]","refField":"FLAG-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"715px","cursor column":"64-
     A                                      ","top":"370px","cursor row":"14","-
     A                                      parent tab panel":"W0036F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCST07","field type":"output field-
     A                                      ","value":{"fieldName":"SCST07","de-
     A                                      signValue":"[SCST07]","refField":"F-
     A                                      LAG","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"785px","cursor column":-
     A                                      "74","top":"370px","cursor row":"14-
     A                                      ","parent tab panel":"W0036F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCFL08","field type":"password -
     A                                      field","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCFL08","designValue":"[SCFL08]"-
     A                                      ,"refField":"FLAG","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase"},"text-
     A                                       transform":"uppercase","left":"274-
     A                                      px","cursor column":"1","top":"390p-
     A                                      x","cursor row":"15","width":"8px",-
     A                                      "parent tab panel":"W0036F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"SCFE08","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCFE08","d-
     A                                      esignValue":"[SCFE08]","refField":"-
     A                                      FEIN","dataType":"reference","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"false","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"999.00"},"css class":"output-fiel-
     A                                      d","left":"288px","cursor column":"-
     A                                      3","top":"390px","cursor row":"15",-
     A                                      "width":"63px","text align":"right"-
     A                                      ,"parent tab panel":"W0036F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCMO08","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCMO08","-
     A                                      designValue":"[SCMO08]","refField":-
     A                                      "MOD","dataType":"reference","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"false","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"999.00"},"css class":"output-fiel-
     A                                      d","left":"365px","cursor column":"-
     A                                      14","top":"390px","cursor row":"15"-
     A                                      ,"width":"21px","text align":"right-
     A                                      ","parent tab panel":"W0036F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCNM08","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCNM08",-
     A                                      "designValue":"[SCNM08]","refField"-
     A                                      :"NAME","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"400px","cursor colum-
     A                                      n":"19","top":"390px","cursor row":-
     A                                      "15","parent tab panel":"W0036F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCGT08","field type":"output-
     A                                       field","value":{"fieldName":"SCGT0-
     A                                      8","designValue":"[SCGT08]","refFie-
     A                                      ld":"FLAG","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"715px","cursor co-
     A                                      lumn":"64","top":"390px","cursor ro-
     A                                      w":"15","parent tab panel":"W0036F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCST08","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      ST08","designValue":"[SCST08]","ref-
     A                                      Field":"FLAG","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"785px","cursor-
     A                                       column":"74","top":"390px","cursor-
     A                                       row":"15","parent tab panel":"W003-
     A                                      6F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCFL09","field type":"-
     A                                      password field","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCFL09","designValue":"-
     A                                      [SCFL09]","refField":"FLAG","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e"},"text transform":"uppercase","l-
     A                                      eft":"274px","cursor column":"1","t-
     A                                      op":"410px","cursor row":"')
     A                                  1 11HTML('16","width":"8px","parent tab-
     A                                       panel":"W0036F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCFE09","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCFE09","designValue"-
     A                                      :"[SCFE09]","refField":"FEIN","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"999.00"},-
     A                                      "css class":"output-field","left":"-
     A                                      288px","cursor column":"3","top":"4-
     A                                      10px","cursor row":"16","width":"63-
     A                                      px","text align":"right","parent ta-
     A                                      b panel":"W0036F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCMO09",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCMO09","designValue-
     A                                      ":"[SCMO09]","refField":"MOD","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"999.00"},-
     A                                      "css class":"output-field","left":"-
     A                                      365px","cursor column":"14","top":"-
     A                                      410px","cursor row":"16","width":"2-
     A                                      1px","text align":"right","parent t-
     A                                      ab panel":"W0036F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCNM09"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCNM09","designValu-
     A                                      e":"[SCNM09]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"400px","cursor column":"19","to-
     A                                      p":"410px","cursor row":"16","paren-
     A                                      t tab panel":"W0036F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCGT-
     A                                      09","field type":"output field","va-
     A                                      lue":{"fieldName":"SCGT09","designV-
     A                                      alue":"[SCGT09]","refField":"FLAG",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"715px","cursor column":"64",-
     A                                      "top":"410px","cursor row":"16","pa-
     A                                      rent tab panel":"W0036F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CST09","field type":"output field",-
     A                                      "value":{"fieldName":"SCST09","desi-
     A                                      gnValue":"[SCST09]","refField":"FLA-
     A                                      G","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"785px","cursor column":"7-
     A                                      4","top":"410px","cursor row":"16",-
     A                                      "parent tab panel":"W0036F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCFL10","field type":"password fi-
     A                                      eld","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCFL10","designValue":"[SCFL10]","-
     A                                      refField":"FLAG","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"274px-
     A                                      ","cursor column":"1","top":"430px"-
     A                                      ,"cursor row":"17","width":"8px","p-
     A                                      arent tab panel":"W0036F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      SCFE10","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCFE10","des-
     A                                      ignValue":"[SCFE10]","refField":"FE-
     A                                      IN","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"288px","cursor column":"3"-
     A                                      ,"top":"430px","cursor row":"17","w-
     A                                      idth":"63px","text align":"right","-
     A                                      parent tab panel":"W0036F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCMO10","field type":"output field-
     A                                      ","value":{"fieldName":"SCMO10","de-
     A                                      signValue":"[SCMO10]","refField":"M-
     A                                      OD","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"365px","cursor column":"14-
     A                                      ","top":"430px","cursor row":"17","-
     A                                      width":"21px","text align":"right",-
     A                                      "parent tab panel":"W0036F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCNM10","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCNM10","d-
     A                                      esignValue":"[SCNM10]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"400px","cursor column"-
     A                                      :"19","top":"430px","cursor row":"1-
     A                                      7","parent tab panel":"W0036F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCGT10","field type":"output f-
     A                                      ield","value":{"fieldName":"SCGT10"-
     A                                      ,"designValue":"[SCGT10]","refField-
     A                                      ":"FLAG","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class')
     A                                  1 12HTML('":"output-field","left":"715p-
     A                                      x","cursor column":"64","top":"430p-
     A                                      x","cursor row":"17","parent tab pa-
     A                                      nel":"W0036F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCST10","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCST10","designValue":"[-
     A                                      SCST10]","refField":"FLAG","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"7-
     A                                      85px","cursor column":"74","top":"4-
     A                                      30px","cursor row":"17","parent tab-
     A                                       panel":"W0036F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCFL11","-
     A                                      field type":"password field","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCFL11","d-
     A                                      esignValue":"[SCFL11]","refField":"-
     A                                      FLAG","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","left":"274px","cursor c-
     A                                      olumn":"1","top":"450px","cursor ro-
     A                                      w":"18","width":"8px","parent tab p-
     A                                      anel":"W0036F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"SCFE11","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCFE11","designValue":"-
     A                                      [SCFE11]","refField":"FEIN","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00"},"c-
     A                                      ss class":"output-field","left":"28-
     A                                      8px","cursor column":"3","top":"450-
     A                                      px","cursor row":"18","width":"63px-
     A                                      ","text align":"right","parent tab -
     A                                      panel":"W0036F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCMO11","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCMO11","designValue":-
     A                                      "[SCMO11]","refField":"MOD","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00"},"c-
     A                                      ss class":"output-field","left":"36-
     A                                      5px","cursor column":"14","top":"45-
     A                                      0px","cursor row":"18","width":"21p-
     A                                      x","text align":"right","parent tab-
     A                                       panel":"W0036F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCNM11","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCNM11","designValue"-
     A                                      :"[SCNM11]","refField":"NAME","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"400px","cursor column":"19","top"-
     A                                      :"450px","cursor row":"18","parent -
     A                                      tab panel":"W0036F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCGT11-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCGT11","designVal-
     A                                      ue":"[SCGT11]","refField":"FLAG","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"715px","cursor column":"64","t-
     A                                      op":"450px","cursor row":"18","pare-
     A                                      nt tab panel":"W0036F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCS-
     A                                      T11","field type":"output field","v-
     A                                      alue":{"fieldName":"SCST11","design-
     A                                      Value":"[SCST11]","refField":"FLAG"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"785px","cursor column":"74"-
     A                                      ,"top":"450px","cursor row":"18","p-
     A                                      arent tab panel":"W0036F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCFL12","field type":"password fiel-
     A                                      d","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CFL12","designValue":"[SCFL12]","re-
     A                                      fField":"FLAG","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase"},"text tra-
     A                                      nsform":"uppercase","left":"274px",-
     A                                      "cursor column":"1","top":"470px","-
     A                                      cursor row":"19","width":"8px","par-
     A                                      ent tab panel":"W0036F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"SC-
     A                                      FE12","field type":"output field","-
     A                                      value":{"fieldName":"SCFE12","desig-
     A                                      nValue":"[SCFE12]","refField":"FEIN-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"99-
     A                                      9.00"},"css class":"output-field","-
     A                                      left":"288px","cursor column":"3","-
     A                                      top":"470px","cursor row":"19","wid-
     A                                      th":"63px","text align":"right","pa-
     A                                      rent tab panel":"W0036F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CMO12","field type":"output field",-
     A                                      "value":{"fieldName":"SCMO12","desi-
     A                                      gnValue":"[SCMO12]","refField":"MOD-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"fals')
     A                                  1 13HTML('e","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00"},"css class":"-
     A                                      output-field","left":"365px","curso-
     A                                      r column":"14","top":"470px","curso-
     A                                      r row":"19","width":"21px","text al-
     A                                      ign":"right","parent tab panel":"W0-
     A                                      036F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCNM12","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCNM12","designValue":"[SCNM12]"-
     A                                      ,"refField":"NAME","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"400px","c-
     A                                      ursor column":"19","top":"470px","c-
     A                                      ursor row":"19","parent tab panel":-
     A                                      "W0036F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCGT12","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCGT12","designValue":"[SCGT1-
     A                                      2]","refField":"FLAG","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"715px"-
     A                                      ,"cursor column":"64","top":"470px"-
     A                                      ,"cursor row":"19","parent tab pane-
     A                                      l":"W0036F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCST12","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCST12","designValue":"[SC-
     A                                      ST12]","refField":"FLAG","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"785-
     A                                      px","cursor column":"74","top":"470-
     A                                      px","cursor row":"19","parent tab p-
     A                                      anel":"W0036F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCFL13","fi-
     A                                      eld type":"password field","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCFL13","des-
     A                                      ignValue":"[SCFL13]","refField":"FL-
     A                                      AG","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase"},"text transform":"up-
     A                                      percase","left":"274px","cursor col-
     A                                      umn":"1","top":"490px","cursor row"-
     A                                      :"20","width":"8px","parent tab pan-
     A                                      el":"W0036F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCFE13","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCFE13","designValue":"[S-
     A                                      CFE13]","refField":"FEIN","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00"},"css-
     A                                       class":"output-field","left":"288p-
     A                                      x","cursor column":"3","top":"490px-
     A                                      ","cursor row":"20","width":"63px",-
     A                                      "text align":"right","parent tab pa-
     A                                      nel":"W0036F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCMO13","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCMO13","designValue":"[-
     A                                      SCMO13]","refField":"MOD","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00"},"css-
     A                                       class":"output-field","left":"365p-
     A                                      x","cursor column":"14","top":"490p-
     A                                      x","cursor row":"20","width":"21px"-
     A                                      ,"text align":"right","parent tab p-
     A                                      anel":"W0036F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCNM13","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCNM13","designValue":"-
     A                                      [SCNM13]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      400px","cursor column":"19","top":"-
     A                                      490px","cursor row":"20","parent ta-
     A                                      b panel":"W0036F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCGT13",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCGT13","designValue-
     A                                      ":"[SCGT13]","refField":"FLAG","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"715px","cursor column":"64","top-
     A                                      ":"490px","cursor row":"20","parent-
     A                                       tab panel":"W0036F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCST1-
     A                                      3","field type":"output field","val-
     A                                      ue":{"fieldName":"SCST13","designVa-
     A                                      lue":"[SCST13]","refField":"FLAG","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"785px","cursor column":"74","-
     A                                      top":"490px","cursor row":"20","par-
     A                                      ent tab panel":"W0036F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      FL14","field type":"password field"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCF-
     A                                      L14","designValue":"[SCFL14]","refF-
     A                                      ield":"FLAG","dataType":"r')
     A                                  1 14HTML('eference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e"},"text transform":"uppercase","l-
     A                                      eft":"274px","cursor column":"1","t-
     A                                      op":"510px","cursor row":"21","widt-
     A                                      h":"8px","parent tab panel":"W0036F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCFE14","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CFE14","designValue":"[SCFE14]","re-
     A                                      fField":"FEIN","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"999.00"},"css class":"ou-
     A                                      tput-field","left":"288px","cursor -
     A                                      column":"3","top":"510px","cursor r-
     A                                      ow":"21","width":"63px","text align-
     A                                      ":"right","parent tab panel":"W0036-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCMO14","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCMO14","designValue":"[SCMO14]","r-
     A                                      efField":"MOD","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"999.00"},"css class":"ou-
     A                                      tput-field","left":"365px","cursor -
     A                                      column":"14","top":"510px","cursor -
     A                                      row":"21","width":"21px","text alig-
     A                                      n":"right","parent tab panel":"W003-
     A                                      6F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCNM14","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCNM14","designValue":"[SCNM14]","-
     A                                      refField":"NAME","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"400px","cur-
     A                                      sor column":"19","top":"510px","cur-
     A                                      sor row":"21","parent tab panel":"W-
     A                                      0036F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCGT14","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCGT14","designValue":"[SCGT14]-
     A                                      ","refField":"FLAG","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"715px","-
     A                                      cursor column":"64","top":"510px","-
     A                                      cursor row":"21","parent tab panel"-
     A                                      :"W0036F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCST14","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCST14","designValue":"[SCST-
     A                                      14]","refField":"FLAG","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"785px-
     A                                      ","cursor column":"74","top":"510px-
     A                                      ","cursor row":"21","parent tab pan-
     A                                      el":"W0036F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCUP","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCUP","designValue":"[SCUP]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"9"},"css class":"o-
     A                                      utput-field","left":"631px","cursor-
     A                                       column":"52","top":"550px","cursor-
     A                                       row":"23","parent tab panel":"W003-
     A                                      6F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCDOWN","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCDOWN","designValue":"[SCDOWN]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none",-
     A                                      "dataLength":"9"},"css class":"outp-
     A                                      ut-field","left":"736px","cursor co-
     A                                      lumn":"67","top":"550px","cursor ro-
     A                                      w":"23","parent tab panel":"W0036F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"btnSubmit","field type":"-
     A                                      button","value":"Enter","shortcut k-
     A                                      ey":"Enter","left":"14px","top":"15-
     A                                      0px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF03","field type":"button","v-
     A                                      alue":"Exit         ","shortcut key-
     A                                      ":"F3","left":"14px","top":"183px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF12","field type":"button","value"-
     A                                      :"Cancel      ","shortcut key":"F12-
     A                                      ","left":"14px","top":"216px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnHELP"-
     A                                      ,"field type":"button","shortcut ke-
     A                                      y":"Alt-F1","bypass validation":"tr-
     A                                      ue","value":"HELP","response":{"fie-
     A                                      ldName":"*IN10","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"left":"14px","top":-
     A                                      "249px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnROLLDOWN","field type":"but-
     A                                      ton","value":"Page Up","shortcut ke-
     A                                      y":"PageUp","response":{"fieldName"-
     A                                      :"*IN19","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","ind')
     A                                  1 15HTML('Format":"1 / 0"},"left":"14px-
     A                                      ","top":"282px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnROLLUP","field type-
     A                                      ":"button","value":"Page Down","sho-
     A                                      rtcut key":"PageDown","response":{"-
     A                                      fieldName":"*IN18","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"left":"14px","to-
     A                                      p":"315px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCDOWN         9A  H
     A            SCUP           9A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFE01    R        H      REFFLD(FEIN)
     A            SCFE02    R        H      REFFLD(FEIN)
     A            SCFE03    R        H      REFFLD(FEIN)
     A            SCFE04    R        H      REFFLD(FEIN)
     A            SCFE05    R        H      REFFLD(FEIN)
     A            SCFE06    R        H      REFFLD(FEIN)
     A            SCFE07    R        H      REFFLD(FEIN)
     A            SCFE08    R        H      REFFLD(FEIN)
     A            SCFE09    R        H      REFFLD(FEIN)
     A            SCFE10    R        H      REFFLD(FEIN)
     A            SCFE11    R        H      REFFLD(FEIN)
     A            SCFE12    R        H      REFFLD(FEIN)
     A            SCFE13    R        H      REFFLD(FEIN)
     A            SCFE14    R        H      REFFLD(FEIN)
     A            SCFEIN    R        H      REFFLD(FEIN)
     A            SCFL01    R        H      REFFLD(FLAG)
     A            SCFL02    R        H      REFFLD(FLAG)
     A            SCFL04    R        H      REFFLD(FLAG)
     A            SCFL05    R        H      REFFLD(FLAG)
     A            SCFL06    R        H      REFFLD(FLAG)
     A            SCFL07    R        H      REFFLD(FLAG)
     A            SCFL08    R        H      REFFLD(FLAG)
     A            SCFL09    R        H      REFFLD(FLAG)
     A            SCFL10    R        H      REFFLD(FLAG)
     A            SCFL11    R        H      REFFLD(FLAG)
     A            SCFL12    R        H      REFFLD(FLAG)
     A            SCFL13    R        H      REFFLD(FLAG)
     A            SCFL14    R        H      REFFLD(FLAG)
     A            SCGT01    R        H      REFFLD(FLAG)
     A            SCGT02    R        H      REFFLD(FLAG)
     A            SCGT03    R        H      REFFLD(FLAG)
     A            SCGT04    R        H      REFFLD(FLAG)
     A            SCGT05    R        H      REFFLD(FLAG)
     A            SCGT06    R        H      REFFLD(FLAG)
     A            SCGT07    R        H      REFFLD(FLAG)
     A            SCGT08    R        H      REFFLD(FLAG)
     A            SCGT09    R        H      REFFLD(FLAG)
     A            SCGT10    R        H      REFFLD(FLAG)
     A            SCGT11    R        H      REFFLD(FLAG)
     A            SCGT12    R        H      REFFLD(FLAG)
     A            SCGT13    R        H      REFFLD(FLAG)
     A            SCGT14    R        H      REFFLD(FLAG)
     A            SCMO01    R        H      REFFLD(MOD)
     A            SCMO02    R        H      REFFLD(MOD)
     A            SCMO03    R        H      REFFLD(MOD)
     A            SCMO04    R        H      REFFLD(MOD)
     A            SCMO05    R        H      REFFLD(MOD)
     A            SCMO06    R        H      REFFLD(MOD)
     A            SCMO07    R        H      REFFLD(MOD)
     A            SCMO08    R        H      REFFLD(MOD)
     A            SCMO09    R        H      REFFLD(MOD)
     A            SCMO10    R        H      REFFLD(MOD)
     A            SCMO11    R        H      REFFLD(MOD)
     A            SCMO12    R        H      REFFLD(MOD)
     A            SCMO13    R        H      REFFLD(MOD)
     A            SCMO14    R        H      REFFLD(MOD)
     A            SCNM01    R        H      REFFLD(NAME)
     A            SCNM02    R        H      REFFLD(NAME)
     A            SCNM03    R        H      REFFLD(NAME)
     A            SCNM04    R        H      REFFLD(NAME)
     A            SCNM05    R        H      REFFLD(NAME)
     A            SCNM06    R        H      REFFLD(NAME)
     A            SCNM07    R        H      REFFLD(NAME)
     A            SCNM08    R        H      REFFLD(NAME)
     A            SCNM09    R        H      REFFLD(NAME)
     A            SCNM10    R        H      REFFLD(NAME)
     A            SCNM11    R        H      REFFLD(NAME)
     A            SCNM12    R        H      REFFLD(NAME)
     A            SCNM13    R        H      REFFLD(NAME)
     A            SCNM14    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCST01    R        H      REFFLD(FLAG)
     A            SCST02    R        H      REFFLD(FLAG)
     A            SCST03    R        H      REFFLD(FLAG)
     A            SCST04    R        H      REFFLD(FLAG)
     A            SCST05    R        H      REFFLD(FLAG)
     A            SCST06    R        H      REFFLD(FLAG)
     A            SCST07    R        H      REFFLD(FLAG)
     A            SCST08    R        H      REFFLD(FLAG)
     A            SCST09    R        H      REFFLD(FLAG)
     A            SCST10    R        H      REFFLD(FLAG)
     A            SCST11    R        H      REFFLD(FLAG)
     A            SCST12    R        H      REFFLD(FLAG)
     A            SCST13    R        H      REFFLD(FLAG)
     A            SCST14    R        H      REFFLD(FLAG)
     A            SCUSER    R        H      REFFLD(USER)
     A            SLFL03    R        H      REFFLD(FLAG)
     A          R SCR99
     A  10 11 18
     A  19                                  CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                      SETOF(19 'Response Indicator *IN19')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C1    1 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"1-1"},"items"-
     A                                      :[{"id":"W0036F_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"W0036F_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W0036F_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"W0036F_SCR99_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1040px","id":"-
     A                                      W0036F_SCR99_BtnSave","tool tip":"S-
     A                                      ave","onclick":"SystemToolbarSave",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/save.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1066px"-
     A                                      ,"id":"W0036F_SCR99_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"W0036F_SC-
     A                                      R99_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"W0036F_SCR99_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "W0036F_SCR99_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLe')
     A                                  1  4HTML('ading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"W0036F_SCR99_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"W0036F_SCR99_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"W0036F_SCR99_Ma-
     A                                      inTabPanel","field type":"tab panel-
     A                                      ","tab panel style":"Transform","ta-
     A                                      b names":"Tab 1","active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      0036F_SCR99_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCR99-
     A                                      _SCFL01","field type":"output field-
     A                                      ","value":{"fieldName":"SCFL01","de-
     A                                      signValue":"[SCFL01]","refField":"F-
     A                                      LAG","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"110px","cursor row":"1",-
     A                                      "css class 2":"top-line","visibilit-
     A                                      y":"hidden","description":"DUMMY FI-
     A                                      ELD","parent tab panel":"W0036F_SCR-
     A                                      99_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"W0036F_SCR99_fkeyMenu","fiel-
     A                                      d type":"menu","left":"10px","top":-
     A                                      "120px","height":"350px","width":"2-
     A                                      30px","hover background color":"#9A-
     A                                      AA61","hover text color":"#FFFFFF",-
     A                                      "border color":"#4C6106","menu opti-
     A                                      on indent":"10px","background color-
     A                                      ":"#758B27","css class":"action-men-
     A                                      u","css class 2":"stationary","z in-
     A                                      dex":"101"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0036F_SCR99_BtnHiddenRefresh","val-
     A                                      ue":"btnRefresh","top":"125px","res-
     A                                      ponse":{"fieldName":"btnRefresh","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0036F_SCR99_B-
     A                                      tnHiddenSearch","value":"btnSearch"-
     A                                      ,"top":"150px","response":{"fieldNa-
     A                                      me":"btnSearch","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W0036F_SCR99_BtnHiddenDiaryItem-
     A                                      s","value":"btnDiary","top":"175px"-
     A                                      ,"response":{"fieldName":"btnDiary"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0036F_SCR9-
     A                                      9_BtnHiddenSystemMessages","value":-
     A                                      "btnMessage","top":"200px","respons-
     A                                      e":{"fieldName":"btnMessage","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0036F_SCR99_BtnHi-
     A                                      ddenWorkSubmitJob","value":"btnWrks-
     A                                      bmjob","top":"225px","response":{"f-
     A                                      ieldName":"btnWrkJob","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0036F_SCR99_BtnHiddenWor-
     A                                      kPrinterOutput","value":"btnWrkprto-
     A                                      ut","top":"250px","response":{"fiel-
     A                                      dName":"btnWrkPrnt","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility')
     A                                  1  5HTML('":"hidden","id":"W0036F_SCR99-
     A                                      _BtnHiddenImageQueue","value":"btnI-
     A                                      mgQue","top":"275px","response":{"f-
     A                                      ieldName":"btnImgQue","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0036F_SCR99_BtnHiddenHel-
     A                                      p","value":"btnHelp","top":"300px",-
     A                                      "response":{"fieldName":"btnHelp","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"btnSubmit","field type":"butt-
     A                                      on","value":"Enter","shortcut key":-
     A                                      "Enter","left":"14px","top":"150px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF03","field type":"button","value-
     A                                      ":"Exit         ","shortcut key":"F-
     A                                      3","left":"14px","top":"183px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF12-
     A                                      ","field type":"button","value":"Ca-
     A                                      ncel      ","shortcut key":"F12","l-
     A                                      eft":"14px","top":"216px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnHELP","fi-
     A                                      eld type":"button","shortcut key":"-
     A                                      Alt-F1","bypass validation":"true",-
     A                                      "value":"HELP","response":{"fieldNa-
     A                                      me":"*IN10","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"left":"14px","top":"249-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnROLLDOWN","field type":"button"-
     A                                      ,"value":"Page Up","shortcut key":"-
     A                                      PageUp","response":{"fieldName":"*I-
     A                                      N19","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"left":"14px","top":"282px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnROL-
     A                                      LUP","field type":"button","value":-
     A                                      "Page Down","shortcut key":"PageDow-
     A                                      n","response":{"fieldName":"*IN18",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      left":"14px","top":"315px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFL01    R        H      REFFLD(FLAG)
