     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 16
     A  20 21 22
     A  23 24 25                            CA01(10 'Response Indicator *IN10')
     A  26 27 28
     A  30 31 32
     A  33 34 35                            CA02(11 'Response Indicator *IN11')
     A  55 56 57
     A  58 59 62
     A  63 64 65                            CA03(16 'Response Indicator *IN16')
     A  66 67 68
     A  69 70 71
     A  72 73 84                            CA04(20 'Response Indicator *IN20')
     A  85 86 87
     A  88 93 09
     A  94 40 29                            CA05(21 'Response Indicator *IN21')
     A  36 37 38
     A  39 41 91
     A  42 43 44                            CA06(22 'Response Indicator *IN22')
     A  45 46 47
     A  48 49 50
     A  51 52 53                            CA07(23 'Response Indicator *IN23')
     A  54 74 75
     A  76 77 78
     A  79 80 81                            CA08(24 'Response Indicator *IN24')
     A  82 83                               CA09(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(33 'Response Indicator *IN33')
     A                                      SETOF(34 'Response Indicator *IN34')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(55 'Response Indicator *IN55')
     A                                      SETOF(56 'Response Indicator *IN56')
     A                                      SETOF(57 'Response Indicator *IN57')
     A                                      SETOF(58 'Response Indicator *IN58')
     A                                      SETOF(59 'Response Indicator *IN59')
     A                                      SETOF(62 'Response Indicator *IN62')
     A                                      SETOF(63 'Response Indicator *IN63')
     A                                      SETOF(64 'Response Indicator *IN64')
     A                                      SETOF(65 'Response Indicator *IN65')
     A                                      SETOF(66 'Response Indicator *IN66')
     A                                      SETOF(67 'Response Indicator *IN67')
     A                                      SETOF(68 'Response Indicator *IN68')
     A                                      SETOF(69 'Response Indicator *IN69')
     A                                      SETOF(70 'Response Indicator *IN70')
     A                                      SETOF(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                      SETOF(84 'Response Indicator *IN84')
     A                                      SETOF(85 'Response Indicator *IN85')
     A                                      SETOF(86 'Response Indicator *IN86')
     A                                      SETOF(87 'Response Indicator *IN87')
     A                                      SETOF(88 'Response Indicator *IN88')
     A                                      SETOF(93 'Response Indicator *IN93')
     A                                  1  2HTML('QPUIREC37   RROWS      2    C-
     A                                      1    1C2    24 RERRMSG    2    C6  -
     A                                        SCEFD1C46   Dates must fall withi-
     A                                      n policy year date range.E1    3   -
     A                                        58RERRMSG    2    C6    SCEFD1C58-
     A                                         Other screens contain data. Use -
     A                                      ''Clear data'' function key.E1    3-
     A                                           30RERRMSGID  5    C6    SCEFD1-
     A                                      C7    WCR0500C6    WMESGGC5    *LIB-
     A                                      LC0    E1    3     55RERRMSGID  5  -
     A                                        C6    SCEFD1C7    WCR0774C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     56-
     A                                      RERRMSGID  5    C6    SCEFD1C7    W-
     A                                      CR0529C6    WMESGGC5    *LIBLC0    -
     A                                      E1    3     57RERRMSGID  5    C6   -
     A                                       SCEFD1C7    WC40073C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     86RERRMSG-
     A                                      ID  5    C6    SCEFD1C7    WCR0503C-
     A                                      6    WMESGGC5    *LIBLC0    E1    3-
     A                                           87RERRMSGID  5    C6    SCEFD1-
     A                                      C7    WCR3371C6    WMESGGC5    *LIB-
     A                                      LC0    E1    3     28RERRMSG    2  -
     A                                        C6    SCEXP1C46   Dates must fall-
     A                                       within policy year date range.E1  -
     A                                        3     16RERRMSGID  5    C6    SCE-
     A                                      XP1C7    WCR0500C6    WMESGGC5    *-
     A                                      LIBLC0    E1    3     59RERRMSGID  -
     A                                      5    C6    SCDES1C7    WCR0503C6   -
     A                                       WMESGGC5    *LIBLC0    E1    3    -
     A                                       62RERRMSGID  5    C6    SCTYP1C7  -
     A                                        WCR1087C6    WMESGGC5    *LIBLC0 -
     A                                         E1    3     63RERRMSGID  5    C6-
     A                                          SCTYP1C7    WCR0503C6    WMESGG-
     A                                      C5    *LIBLC0    E1    3     64RERR-
     A                                      MSGID  5    C6    SCAMP1C7    WCR05-
     A                                      47C6    WMESGGC5    *LIBLC0    E1  -
     A                                        3     65RERRMSG    2    C6    SCA-
     A                                      MG1C41   Aggregate differs from oth-
     A                                      er division(s).E1    3     29REMSGI-
     A                                      D    5    C33   TxbAggregateDeducti-
     A                                      ble1PercentageFMSADP1    C6    WMES-
     A                                      GGC5    *LIBLC0    FERADP1    RERRM-
     A                                      SGID  5    C6    SCPLN1C7    WCR108-
     A                                      7C6    WMESGGC5    *LIBLC0    E1   -
     A                                       3     72RERRMSGID  5    C6    SCVR-
     A                                      B1C7    WCR1087C6    WMESGGC5    *L-
     A                                      IBLC0    E1    3     66RERRMSGID  5-
     A                                          C6    SCVRB1C7    WCR0503C6    -
     A                                      WMESGGC5    *LIBLC0    E1    3     -
     A                                      67RERRMSGID  5    C6    SCOCV1C7   -
     A                                       WCR1087C6    WMESGGC5    *LIBLC0  -
     A                                        E1    3     68RERRMSGID  5    C6 -
     A                                         SCTOT1C7    WCR1241C6    WMESGGC-
     A                                      5    *LIBLC0    E1    3     69RERRM-
     A                                      SGID  5    C6    SCCLS1C7    WCR050-
     A                                      3C6    WMESGGC5    *LIBLC0    E1   -
     A                                       3     85RERRMSGID  5    C6    SCPL-
     A                                      V1C7    WCR1087C6    WMESGGC5    *L-
     A                                      IBLC0    E1    3     73RERRMSGID  5-
     A                                          C6    SCR101C7    WCR1087C6    -
     A                                      WMESGGC5    *LIBLC0    E1    3     -
     A                                      74RERRMSGID  5    C6    SCR101C7   -
     A                                       WC40029C6    WMESGGC5    *LIBLC0  -
     A                                        E1    3     84RERRMSGID  5    C6 -
     A                                         SCR102C7    WCR1087C6    WMESGGC-
     A                                      5    *LIBLC0    E1    3     75RERRM-
     A                                      SGID  5    C6    SCR103C7    WCR108-
     A                                      7C6    WMESGGC5    *LIBLC0    E1   -
     A                                       3     76RERRMSGID  5    C6    SCR1-
     A                                      04C7    WCR1087C6    WMESGGC5    *L-
     A                                      IBLC0    E1    3     77RERRMSGID  5-
     A                                          C6    SCR105C7    WCR')
     A                                  1  2HTML('QPUI1087C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     78RERRMSGID  5 -
     A                                         C6    SCR106C7    WCR1087C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     7-
     A                                      9RERRMSGID  5    C6    SCR107C7    -
     A                                      WCR1087C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     80RERRMSGID  5    C6  -
     A                                        SCR108C7    WCR1087C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     81RERRMS-
     A                                      GID  5    C6    SCR109C7    WCR1087-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     82RERRMSGID  5    C6    SCR11-
     A                                      0C7    WCR1087C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     83RERRMSGID  5 -
     A                                         C6    SCALA1C7    WCR1241C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     7-
     A                                      0RERRMSGID  5    C6    SCRNW1C7    -
     A                                      WCR1241C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     71')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN16","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN20","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN21","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN22","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN23","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN24","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN25","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN26","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN27","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N28","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN3-
     A                                      0","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN31"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN32","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN33","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN34","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 16":{"fieldName":"*IN35","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       17":{"fieldName":"*IN55","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 1-
     A                                      8":{"fieldName":"*IN56","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 19"-
     A                                      :{"fieldName":"*IN57","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 20":{-
     A                                      "fieldName":"*IN58","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 21":{"f-
     A                                      ieldName":"*IN59","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 22":{"fie-
     A                                      ldName":"*IN62","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 23":{"field-
     A                                      Name":"*IN63","dataTy')
     A                                  1  2HTML('pe":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 24":{"fieldName":"*IN64","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 25":{"fieldName":"*IN65","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 26":{"fieldName":"*IN66","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       27":{"fieldName":"*IN67","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 2-
     A                                      8":{"fieldName":"*IN68","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 29"-
     A                                      :{"fieldName":"*IN69","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 30":{-
     A                                      "fieldName":"*IN70","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 31":{"f-
     A                                      ieldName":"*IN71","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 32":{"fie-
     A                                      ldName":"*IN72","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 33":{"field-
     A                                      Name":"*IN73","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 34":{"fieldNa-
     A                                      me":"*IN84","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 35":{"fieldName-
     A                                      ":"*IN85","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 36":{"fieldName":-
     A                                      "*IN86","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"set off 37":{"fieldName":"*-
     A                                      IN87","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 38":{"fieldName":"*IN-
     A                                      88","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 39":{"fieldName":"*IN93-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"return cursor record":{"fieldName-
     A                                      ":"HREC","dataLength":"10","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"none"},"return-
     A                                       cursor field":{"fieldName":"HFLD",-
     A                                      "dataLength":"10","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"none"},"valid command k-
     A                                      ey":{"fieldName":"*IN11","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"overlay ra-
     A                                      nge":"1-24"},"items":[{"id":"SCDIV"-
     A                                      ,"field type":"output field","visib-
     A                                      ility":"hidden","value":{"fieldName-
     A                                      ":"SCDIV","designValue":"[SCDIV]","-
     A                                      refField":"DIV","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"true","zeroF-
     A                                      ill":"true","curSym":"","units":"",-
     A                                      "negNum":"-999.00"},"left":"0px","t-
     A                                      op":"-30px","width":"')
     A                                  1  2HTML('35px","text align":"right","c-
     A                                      ss class":"profound-converted"},{"i-
     A                                      d":"SCEMP#","field type":"output fi-
     A                                      eld","visibility":"hidden","value":-
     A                                      {"fieldName":"SCEMP#","designValue"-
     A                                      :"[SCEMP#]","refField":"EMP#","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"true","zeroFill":"true","curSym":-
     A                                      "","units":"","negNum":"-999.00"},"-
     A                                      left":"0px","top":"-30px","width":"-
     A                                      63px","text align":"right","css cla-
     A                                      ss":"profound-converted"},{"id":"HF-
     A                                      LD","field type":"output field","vi-
     A                                      sibility":"hidden","value":{"fieldN-
     A                                      ame":"HFLD","designValue":"[HFLD]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"none",-
     A                                      "dataLength":"10"},"left":"0px","to-
     A                                      p":"-30px","css class":"profound-co-
     A                                      nverted"},{"id":"HREC","field type"-
     A                                      :"output field","visibility":"hidde-
     A                                      n","value":{"fieldName":"HREC","des-
     A                                      ignValue":"[HREC]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"none","dataLength":"10-
     A                                      "},"left":"0px","top":"-30px","css -
     A                                      class":"profound-converted"},{"id":-
     A                                      "W0051F38_SCR01_avKeys","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"AV_KEYS","dataLength":"1134","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[AV_KEYS]"},"lef-
     A                                      t":"0px","top":"0px","visibility":"-
     A                                      hidden"},{"id":"W0051F38_SCR01_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"W-
     A                                      0051F38_SCR01_BtnIconMenuSystemTool-
     A                                      s","tool tip":"System Tools","icon -
     A                                      source":"/profoundui/userdata/image-
     A                                      s/systool/systools.png","data funct-
     A                                      ion":"SystemToolbarSystools","show -
     A                                      down arrow":"Yes"},{"field type":"p-
     A                                      anel","panel style":"TransformButto-
     A                                      nBar","id":"W0051F38_SCR01_ButtonBa-
     A                                      r","top":"35px","left":"1036px","wi-
     A                                      dth":"187px","height":"28px","css c-
     A                                      lass":"stationary","visibility":"hi-
     A                                      dden","locked in place":"true"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25')
     A                                  1  2HTML('px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1040px","id":"W0051F38_SCR01_Bt-
     A                                      nSave","tool tip":"Save","onclick":-
     A                                      "SystemToolbarSave","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/save.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1066px","id":"W0051F38-
     A                                      _SCR01_BtnRefresh","tool tip":"Refr-
     A                                      esh","onclick":"SystemToolbarRefres-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/refre-
     A                                      sh.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      092px","id":"W0051F38_SCR01_BtnSear-
     A                                      ch","tool tip":"Search","onclick":"-
     A                                      SystemToolbarSearch","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/search.png'')"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1118px","id":"W0051-
     A                                      F38_SCR01_BtnDiaryItems","tool tip"-
     A                                      :"Diary/Work Items - IDARTS","oncli-
     A                                      ck":"SystemToolbarDiary","backgroun-
     A                                      d image":{"fieldName":"DryIcnURL","-
     A                                      dataLength":"128","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"}},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1144px","id":"W0051F38-
     A                                      _SCR01_BtnSystemMessa')
     A                                  1  2HTML('ges","tool tip":"System Messa-
     A                                      ges","onclick":"SystemToolbarMessag-
     A                                      es","background image":{"fieldName"-
     A                                      :"MsgIcnURL","dataLength":"128","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"}},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1196px",-
     A                                      "id":"W0051F38_SCR01_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"W0051F38_SCR01-
     A                                      _ImgSysToolBottom","field type":"im-
     A                                      age","image source":"/profoundui/us-
     A                                      erdata/images/systool/butbarbot.png-
     A                                      ","left":"1036px","top":"64px","wid-
     A                                      th":"187px","locked in place":"true-
     A                                      ","css class":"stationary","visibil-
     A                                      ity":"hidden"},{"id":"W0051F38_SCR0-
     A                                      1_MainTabPanel","field type":"tab p-
     A                                      anel","tab panel style":"Transform"-
     A                                      ,"tab names":{"fieldName":"SCPRDS",-
     A                                      "designValue":"[SCPRDS]","refField"-
     A                                      :"NAME","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1060px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W00-
     A                                      51F38_SCR01_BtnHiddenWorkSubmitJob"-
     A                                      ,"value":"btnWrksbmjob","top":"100p-
     A                                      x","response":{"fieldName":"btnWrkJ-
     A                                      ob","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W0051F38-
     A                                      _SCR01_BtnHiddenSave","value":"btnS-
     A                                      ave","top":"100px","response":{"fie-
     A                                      ldName":"btnSave","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"constant1"-
     A                                      ,"field type":"output field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                      ":"top-line","value":"js: currentUs-
     A                                      er()","css class 2":"output-field",-
     A                                      "parent tab panel":"W0051F38_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"SCCONM","field type":"output fi-
     A                                      eld","value":{"fieldN')
     A                                  1  2HTML('ame":"SCCONM","designValue":"-
     A                                      [SCCONM]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      414px","cursor column":"21","top":"-
     A                                      110px","cursor row":"1","css class -
     A                                      2":"top-line","css class 3":"HI","d-
     A                                      escription":"COMPANY NAME","parent -
     A                                      tab panel":"W0051F38_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 4-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant2","field type":"output field",-
     A                                      "left":"778px","cursor column":"73"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class":"top-line","value":"js: cu-
     A                                      rrentDate()","css class 2":"output--
     A                                      field","parent tab panel":"W0051F38-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"W0051F38_SCR01_fkeyMenu"-
     A                                      ,"field type":"menu","left":"10px",-
     A                                      "top":"120px","height":"350px","wid-
     A                                      th":"230px","hover background color-
     A                                      ":"#9AAA61","hover text color":"#FF-
     A                                      FFFF","border color":"#4C6106","men-
     A                                      u option indent":"10px","background-
     A                                       color":"#758B27","css class":"acti-
     A                                      on-menu","css class 2":"stationary"-
     A                                      ,"z index":"101"},{"field type":"bu-
     A                                      tton","left":"1060px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0051F38_SCR01_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"125px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0051F38_SCR01_BtnHiddenRefre-
     A                                      sh","value":"btnRefresh","top":"125-
     A                                      px","response":{"fieldName":"btnRef-
     A                                      resh","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"Q1PGM","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      Q1PGM","designValue":"[Q1PGM]","ref-
     A                                      Field":"DS10","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"281px","cursor-
     A                                       column":"2","top":"130px","cursor -
     A                                      row":"2","parent tab panel":"W0051F-
     A                                      38_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCPRDS","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCPRDS","designValue":"[SCPRDS]","-
     A                                      refField":"NAME","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"414px","cur-
     A                                      sor column":"21","top":"130px","cur-
     A                                      sor row":"2","css cla')
     A                                  1  2HTML('ss 2":"HI","description":"PRO-
     A                                      GRAM NAME","parent tab panel":"W005-
     A                                      1F38_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","visibility":"hidden","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant3","field type":"output f-
     A                                      ield","value":"SCR01","css class":"-
     A                                      constant","left":"799px","cursor co-
     A                                      lumn":"76","top":"130px","cursor ro-
     A                                      w":"2","parent tab panel":"W0051F38-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px","top":"1-
     A                                      50px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"constant4","field type":"output -
     A                                      field","value":"Group:","css class"-
     A                                      :"constant","left":"281px","cursor -
     A                                      column":"2","top":"150px","cursor r-
     A                                      ow":"3","parent tab panel":"W0051F3-
     A                                      8_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCFND","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CFND","designValue":"[SCFND]","refF-
     A                                      ield":"FND","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00"},"css class":"outpu-
     A                                      t-field","left":"337px","cursor col-
     A                                      umn":"10","top":"150px","cursor row-
     A                                      ":"3","width":"21px","text align":"-
     A                                      right","parent tab panel":"W0051F38-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCNAME","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CNAME","designValue":"[SCNAME]","re-
     A                                      fField":"NM50","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"372px","curso-
     A                                      r column":"15","top":"150px","curso-
     A                                      r row":"3","description":"FUND NAME-
     A                                      ","parent tab panel":"W0051F38_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCMODE","field type":"output -
     A                                      field","value":{"fieldName":"SCMODE-
     A                                      ","designValue":"[SCMODE]","refFiel-
     A                                      d":"NM10","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"764px","cursor col-
     A                                      umn":"71","top":"150px","cursor row-
     A                                      ":"3","css class 2":"HI","descripti-
     A                                      on":"ADD/UPDATE MODE","parent tab p-
     A                                      anel":"W0051F38_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1060px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0051F38_SCR01_BtnHiddenImag-
     A                                      eQueue","value":"btnI')
     A                                  1  2HTML('mgQue","top":"150px","respons-
     A                                      e":{"fieldName":"btnImgQue","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W0051F38_SCR01_BtnH-
     A                                      iddenSearch","value":"btnSearch","t-
     A                                      op":"150px","response":{"fieldName"-
     A                                      :"btnSearch","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant7","fie-
     A                                      ld type":"output field","value":"Em-
     A                                      p #:","css class":"constant","visib-
     A                                      ility":{"fieldName":"N91","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"281px","cursor column":"2-
     A                                      ","top":"170px","cursor row":"4","p-
     A                                      arent tab panel":"W0051F38_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant5","field type":"output f-
     A                                      ield","value":"State:","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"91","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"281px","c-
     A                                      ursor column":"2","top":"170px","cu-
     A                                      rsor row":"4","parent tab panel":"W-
     A                                      0051F38_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCST","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCST","designValue":"[SCST]","r-
     A                                      efField":"ST","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","visibility":{"fieldNa-
     A                                      me":"91","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"330px",-
     A                                      "cursor column":"9","top":"170px","-
     A                                      cursor row":"4","parent tab panel":-
     A                                      "W0051F38_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCEDN","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCEDN","designValue":"[SCEDN-
     A                                      ]","refField":"DS50","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","visibility":{"-
     A                                      fieldName":"N91","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "337px","cursor column":"10","top":-
     A                                      "170px","cursor row":"4","parent ta-
     A                                      b panel":"W0051F38_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt6","field type":"output field","v-
     A                                      alue":"Effective Date:","css class"-
     A                                      :"constant","visibility":{"fieldNam-
     A                                      e":"91","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"358px","-
     A                                      cursor column":"13","')
     A                                  1  2HTML('top":"170px","cursor row":"4"-
     A                                      ,"parent tab panel":"W0051F38_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCEFDT","field type":"output f-
     A                                      ield","value":{"fieldName":"SCEFDT"-
     A                                      ,"designValue":"[SCEFDT]","refField-
     A                                      ":"DT8","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00","edtWrd":"''  /  /    ''-
     A                                      "},"css class":"output-field","visi-
     A                                      bility":{"fieldName":"91","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"470px","cursor column":"2-
     A                                      9","top":"170px","cursor row":"4","-
     A                                      width":"70px","text align":"right",-
     A                                      "parent tab panel":"W0051F38_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant8","field type":"output-
     A                                       field","value":"Year :","css class-
     A                                      ":"constant","visibility":{"fieldNa-
     A                                      me":"N91","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"701px"-
     A                                      ,"cursor column":"62","top":"170px"-
     A                                      ,"cursor row":"4","parent tab panel-
     A                                      ":"W0051F38_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCFYR","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCFYR","designValue":"[SCF-
     A                                      YR]","refField":"FYR","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"true",-
     A                                      "zeroFill":"true","curSym":"","unit-
     A                                      s":"","negNum":"-999.00"},"css clas-
     A                                      s":"output-field","visibility":{"fi-
     A                                      eldName":"N91","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"7-
     A                                      50px","cursor column":"69","top":"1-
     A                                      70px","cursor row":"4","width":"21p-
     A                                      x","text align":"right","parent tab-
     A                                       panel":"W0051F38_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1060px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0051F38_SCR01_BtnHiddenHe-
     A                                      lp","value":"btnHelp","top":"175px"-
     A                                      ,"response":{"fieldName":"btnHelp",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0051F38_SCR-
     A                                      01_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"btnCF0-
     A                                      3","field type":"button","visibilit-
     A                                      y":{"fieldName":"09 or N09 and N40 -
     A                                      or 40","dataType":"ex')
     A                                  1  2HTML('pression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"value":"Exit","shortcut key":"F-
     A                                      3","left":"14px","top":"183px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"constan-
     A                                      t9","field type":"output field","va-
     A                                      lue":"Large deductible #1:","css cl-
     A                                      ass":"constant","left":"281px","cur-
     A                                      sor column":"2","top":"190px","curs-
     A                                      or row":"5","css class 2":"BLU","pa-
     A                                      rent tab panel":"W0051F38_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant10","field type":"output f-
     A                                      ield","value":"Cx Date:","css class-
     A                                      ":"constant","visibility":{"fieldNa-
     A                                      me":"41 and N91","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "701px","cursor column":"62","top":-
     A                                      "190px","cursor row":"5","parent ta-
     A                                      b panel":"W0051F38_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCCXDT-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCCXDT","designVal-
     A                                      ue":"[SCCXDT]","refField":"DT8","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"true","zeroFill":"true","curSym-
     A                                      ":"","units":"","negNum":"-999.00",-
     A                                      "edtWrd":"''  /  /    ''"},"css cla-
     A                                      ss":"output-field","visibility":{"f-
     A                                      ieldName":"41 and N91","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"764px","cursor column":"71",-
     A                                      "top":"190px","cursor row":"5","wid-
     A                                      th":"70px","text align":"right","pa-
     A                                      rent tab panel":"W0051F38_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0051F38_SCR01_Btn-
     A                                      HiddenSystemMessages","value":"btnM-
     A                                      essage","top":"200px","response":{"-
     A                                      fieldName":"btnMessage","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant11","field type":"output field"-
     A                                      ,"value":"Effective date           -
     A                                       :","css class":"constant","visibil-
     A                                      ity":{"fieldName":"N91","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"295px","cursor column":"4",-
     A                                      "top":"210px","cursor row":"6","par-
     A                                      ent tab panel":"W0051F38_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCEFD1","field type":"date field","-
     A                                      css class":"input","css class 2":"d-
     A                                      ate-field","value":{"fieldName":"SC-
     A                                      EFD1","designValue":"[SCEFD1]","ref-
     A                                      Field":"DT8","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"f')
     A                                  1  2HTML('alse","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0","numBlankFill":"true","edtWrd":"-
     A                                      ''  /  /    ''","dateFormat":"m/d/Y-
     A                                      "},"visibility":{"fieldName":"N91",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"498px","cursor c-
     A                                      olumn":"33","top":"210px","cursor r-
     A                                      ow":"6","width":"71px","text align"-
     A                                      :"right","css class 3":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"css class 4":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"read only":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 5"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"PR","customFalse":""},"error m-
     A                                      essage":"Dates must fall within pol-
     A                                      icy year date range.","error condit-
     A                                      ion":{"fieldName":"58","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"8 messages","error message 2"-
     A                                      :"Other screens contain data. Use '-
     A                                      '''Clear data'''' function key.","e-
     A                                      rror condition 2":{"fieldName":"30"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error message id 3":"WCR0500","er-
     A                                      ror message file 3":"WMESGG","error-
     A                                       message library 3":"*LIBL","error -
     A                                      condition 3":{"fieldName":"55","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or message id 4":"WCR0774","error m-
     A                                      essage file 4":"WMESGG","error mess-
     A                                      age library 4":"*LIBL","error condi-
     A                                      tion 4":{"fieldName":"56","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssage id 5":"WCR0529","error messag-
     A                                      e file 5":"WMESGG","error message l-
     A                                      ibrary 5":"*LIBL","error condition -
     A                                      5":{"fieldName":"57","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                       id 6":"WC40073","error message fil-
     A                                      e 6":"WMESGG","error message librar-
     A                                      y 6":"*LIBL","error condition 6":{"-
     A                                      fieldName":"86","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error message id 7-
     A                                      ":"WCR0503","error message file 7":-
     A                                      "WMESGG","error message library 7":-
     A                                      "*LIBL","error condition 7":{"field-
     A                                      Name":"87","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error message id 8":"WC-
     A                                      R3371","error message file 8":"WMES-
     A                                      GG","error message library 8":"*LIB-
     A                                      L","error condition 8":{"fieldName"-
     A                                      :"28","dataType":"expression","form-
     A                                      atting":"Indicator","')
     A                                  1  2HTML('indFormat":"1 / 0"},"parent t-
     A                                      ab panel":"W0051F38_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted","set focus":"-
     A                                      true"},{"id":"btnCF05","field type"-
     A                                      :"button","visibility":{"fieldName"-
     A                                      :"N09 and N40","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"value":"-
     A                                      Refresh","shortcut key":"F5","left"-
     A                                      :"14px","top":"216px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"constant12","fie-
     A                                      ld type":"output field","value":"Ex-
     A                                      piration date           :","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"N91","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"295p-
     A                                      x","cursor column":"4","top":"230px-
     A                                      ","cursor row":"7","parent tab pane-
     A                                      l":"W0051F38_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCEXP1","fie-
     A                                      ld type":"date field","css class":"-
     A                                      input","css class 2":"date-field","-
     A                                      value":{"fieldName":"SCEXP1","desig-
     A                                      nValue":"[SCEXP1]","refField":"DT8"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"false","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00","numBlankFill":"true","edtWrd-
     A                                      ":"''  /  /    ''","dateFormat":"m/-
     A                                      d/Y"},"visibility":{"fieldName":"N9-
     A                                      1","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"498px","curso-
     A                                      r column":"33","top":"230px","curso-
     A                                      r row":"7","width":"71px","text ali-
     A                                      gn":"right","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"read only":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       5":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"set -
     A                                      focus":{"fieldName":"31","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message":"Dates must fall withi-
     A                                      n policy year date range.","error c-
     A                                      ondition":{"fieldName":"16","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"2 messages","error messa-
     A                                      ge id 2":"WCR0500","error message f-
     A                                      ile 2":"WMESGG","error message libr-
     A                                      ary 2":"*LIBL","error condition 2":-
     A                                      {"fieldName":"59","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"pa')
     A                                  1  2HTML('rent tab panel":"W0051F38_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted"},-
     A                                      {"id":"btnCF10","field type":"butto-
     A                                      n","visibility":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"value":"Search","shortc-
     A                                      ut key":"F10","left":"14px","top":"-
     A                                      249px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"constant13","field type":"outpu-
     A                                      t field","value":"Description      -
     A                                               :","css class":"constant",-
     A                                      "left":"295px","cursor column":"4",-
     A                                      "top":"250px","cursor row":"8","par-
     A                                      ent tab panel":"W0051F38_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCDES1","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCDES1",-
     A                                      "designValue":"[SCDES1]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"uppercase","data-
     A                                      Length":"40"},"text transform":"upp-
     A                                      ercase","left":"498px","cursor colu-
     A                                      mn":"33","top":"250px","cursor row"-
     A                                      :"8","width":"281px","css class 3":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"HI","customFalse":""},"css clas-
     A                                      s 4":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"re-
     A                                      ad only":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 5":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"set focus":{"fieldName":"32","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"error message id":"WCR0503",-
     A                                      "error message file":"WMESGG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"62","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"1 message","parent tab p-
     A                                      anel":"W0051F38_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted"},{"id":"constant1-
     A                                      4","field type":"output field","val-
     A                                      ue":"Discount %                :","-
     A                                      css class":"constant","left":"295px-
     A                                      ","cursor column":"4","top":"270px"-
     A                                      ,"cursor row":"9","parent tab panel-
     A                                      ":"W0051F38_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCPCT1","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCPCT1","designValue"-
     A                                      :"[SCPCT1]","dataType":"zoned","for-
     A                                      matting":"Number","nu')
     A                                  1  2HTML('mSep":"true","zeroBalance":"t-
     A                                      rue","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","data-
     A                                      Length":"12","decPos":"9","numBlank-
     A                                      Fill":"true"},"left":"498px","curso-
     A                                      r column":"33","top":"270px","curso-
     A                                      r row":"9","width":"92px","text ali-
     A                                      gn":"right","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"read only":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       5":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"set -
     A                                      focus":{"fieldName":"33","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"pa-
     A                                      rent tab panel":"W0051F38_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted"},{"id":-
     A                                      "btnCF12","field type":"button","vi-
     A                                      sibility":{"fieldName":"09 or N09 a-
     A                                      nd N40 or 40","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"value":"C-
     A                                      ancel","shortcut key":"F12","left":-
     A                                      "14px","top":"282px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"constant15","fiel-
     A                                      d type":"output field","value":"Gro-
     A                                      ss/Net                 :","css clas-
     A                                      s":"constant","left":"295px","curso-
     A                                      r column":"4","top":"290px","cursor-
     A                                       row":"10","parent tab panel":"W005-
     A                                      1F38_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCTYP1","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCTYP1","designValue":"[SCTY-
     A                                      P1]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase","dataLength":"1"},"text t-
     A                                      ransform":"uppercase","left":"498px-
     A                                      ","cursor column":"33","top":"290px-
     A                                      ","cursor row":"10","width":"8px","-
     A                                      css class 3":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"css class 4":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 5":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","cust')
     A                                  1  2HTML('omTrue":"PR","customFalse":""-
     A                                      },"set focus":{"fieldName":"34","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"error message id":"WCR1087","e-
     A                                      rror message file":"WMESGG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"63","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"2 messages","error message-
     A                                       id 2":"WCR0503","error message fil-
     A                                      e 2":"WMESGG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"64","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"parent tab panel":-
     A                                      "W0051F38_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 6":"profound-
     A                                      -converted"},{"id":"constant16","fi-
     A                                      eld type":"output field","value":"G-
     A                                      =Gross, N=Net","css class":"constan-
     A                                      t","left":"526px","cursor column":"-
     A                                      37","top":"290px","cursor row":"10"-
     A                                      ,"parent tab panel":"W0051F38_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"constant17","field type":"outp-
     A                                      ut field","value":"Deductible amoun-
     A                                      t         :","css class":"constant"-
     A                                      ,"left":"295px","cursor column":"4"-
     A                                      ,"top":"310px","cursor row":"11","p-
     A                                      arent tab panel":"W0051F38_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCAMP1","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCAMP1-
     A                                      ","designValue":"[SCAMP1]","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","dataLe-
     A                                      ngth":"9","decPos":"0","numBlankFil-
     A                                      l":"true"},"left":"498px","cursor c-
     A                                      olumn":"33","top":"310px","cursor r-
     A                                      ow":"11","width":"64px","text align-
     A                                      ":"right","css class 3":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"css class 4":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"set fo-
     A                                      cus":{"fieldName":"35","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"erro-
     A                                      r message id":"WCR0547","error mess-
     A                                      age file":"WMESGG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"65","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"err')
     A                                  1  2HTML('or messages":"1 message","par-
     A                                      ent tab panel":"W0051F38_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 6":"profound-converted"},{"id":"-
     A                                      btnCF20","field type":"button","vis-
     A                                      ibility":{"fieldName":"or N91 and N-
     A                                      09 and N40 and N26","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"val-
     A                                      ue":"Clear data","shortcut key":"F2-
     A                                      0","left":"14px","top":"315px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"constan-
     A                                      t18","field type":"output field","v-
     A                                      alue":"Deductible aggregate      :"-
     A                                      ,"css class":"constant","left":"295-
     A                                      px","cursor column":"4","top":"330p-
     A                                      x","cursor row":"12","parent tab pa-
     A                                      nel":"W0051F38_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCAMG1","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCAMG1","designVal-
     A                                      ue":"[SCAMG1]","dataType":"zoned","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"-999.00","dataLength":"9","d-
     A                                      ecPos":"0","numBlankFill":"true"},"-
     A                                      left":"498px","cursor column":"33",-
     A                                      "top":"330px","cursor row":"12","wi-
     A                                      dth":"64px","text align":"right","c-
     A                                      ss class 3":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"HI","customFalse":"-
     A                                      "},"css class 4":{"fieldName":"N09 -
     A                                      and N94","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"94 or 09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       5":{"fieldName":"94 or 09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"set focus":{"fieldName":"36","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"error message":"Aggregate diffe-
     A                                      rs from other division(s).","error -
     A                                      condition":{"fieldName":"29","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"1 message","parent tab -
     A                                      panel":"W0051F38_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted"},{"id":"CbxVarAg-
     A                                      gregateAmountIndicator1","field typ-
     A                                      e":"checkbox","css class":"input","-
     A                                      description":"Large Deductible #1 T-
     A                                      otal Incurred Checkbox","value":{"f-
     A                                      ieldName":"SCVARA1","dataLength":"1-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue"')
     A                                  1  2HTML(':"[SCVARA1]"},"checked value"-
     A                                      :"Y","unchecked value":" ","disable-
     A                                      d":{"fieldName":"DisblVarA","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"la-
     A                                      bel":"Variable","read only":{"field-
     A                                      Name":"09 or 94","customTrue":"","c-
     A                                      ustomFalse":"","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"left":"585px-
     A                                      ","top":"330px","z index":"99","loc-
     A                                      ked in place":"false","css class 2"-
     A                                      :"checkbox","visibility":{"fieldNam-
     A                                      e":"VisibVarA","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"css class 3-
     A                                      ":{"fieldName":"09","customTrue":"H-
     A                                      I","customFalse":"","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values"},"css cl-
     A                                      ass 4":{"fieldName":"N09 and N94","-
     A                                      customTrue":"UL","customFalse":"","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues"},"css class 5":{"fieldName":"-
     A                                      09 or 94","customTrue":"PR","custom-
     A                                      False":"","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values"}},{"id":"TxbAggreg-
     A                                      ateDeductible1Percentage","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      description":"Aggregate Deductible -
     A                                      1 Percentage","value":{"fieldName":-
     A                                      "SCADP1","dataLength":"12","decPos"-
     A                                      :"9","numSep":"true","zeroBalance":-
     A                                      "false","numBlankFill":"false","zer-
     A                                      oFill":"false","noExtraSpaces":"fal-
     A                                      se","curSym":"","dataType":"zoned",-
     A                                      "formatting":"Number","negNum":"-99-
     A                                      9.00","units":"","designValue":"[SC-
     A                                      ADP1]"},"text align":"right","read -
     A                                      only":{"fieldName":"09 or 94","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "error messages":"1 message","error-
     A                                       message id":{"fieldName":"msADP1",-
     A                                      "dataLength":"10","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"},"error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"erADP1","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error enhanced -
     A                                      mode":"1","left":"665px","top":"330-
     A                                      px","width":"110px","z index":"99",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"textbox","tool tip":"Endorsem-
     A                                      ent information only.","visibility"-
     A                                      :{"fieldName":"VisibAggrP","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "css class 3":{"fieldName":"09","cu-
     A                                      stomTrue":"HI","customFalse":"","da-
     A                                      taType":"expression",')
     A                                  1  2HTML('"formatting":"Indicator","ind-
     A                                      Format":"Custom Values"},"css class-
     A                                       4":{"fieldName":"N09 and N94","cus-
     A                                      tomTrue":"UL","customFalse":"","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s"},"css class 5":{"fieldName":"09 -
     A                                      or 94","customTrue":"PR","customFal-
     A                                      se":"","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values"}},{"id":"LblAggregate-
     A                                      DeductiblePct1","field type":"outpu-
     A                                      t field","css class":"constant","va-
     A                                      lue":"%","cursor row":"12","cursor -
     A                                      column":"4","left":"780px","top":"3-
     A                                      32px","parent tab panel":"W0051F38_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      ","visibility":{"fieldName":"VisibA-
     A                                      ggrP","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"}},{"id":"btnHELP","fie-
     A                                      ld type":"button","shortcut key":"A-
     A                                      lt-F1","bypass validation":"true","-
     A                                      value":"HELP","response":{"fieldNam-
     A                                      e":"*IN10","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"left":"14px","top":"348p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      constant19","field type":"output fi-
     A                                      eld","value":"Deductible plan type -
     A                                           :","css class":"constant","lef-
     A                                      t":"295px","cursor column":"4","top-
     A                                      ":"350px","cursor row":"13","parent-
     A                                       tab panel":"W0051F38_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCP-
     A                                      LN1","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SCPLN1","de-
     A                                      signValue":"[SCPLN1]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase","dataLen-
     A                                      gth":"2"},"text transform":"upperca-
     A                                      se","left":"498px","cursor column":-
     A                                      "33","top":"350px","cursor row":"13-
     A                                      ","width":"15px","css class 3":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"css class 4"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 5":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "set focus":{"fieldName":"37","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"error message id":"WCR1087","err-
     A                                      or message file":"WMESGG","error me-
     A                                      ssage library":"*LIBL')
     A                                  1  2HTML('","error condition":{"fieldNa-
     A                                      me":"72","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"1 messag-
     A                                      e","parent tab panel":"W0051F38_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted"},-
     A                                      {"id":"constant20","field type":"ou-
     A                                      tput field","value":"Per claim/per -
     A                                      occurrence. :","css class":"constan-
     A                                      t","left":"295px","cursor column":"-
     A                                      4","top":"370px","cursor row":"14",-
     A                                      "parent tab panel":"W0051F38_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCVRB1","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCVR-
     A                                      B1","designValue":"[SCVRB1]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase","-
     A                                      dataLength":"1"},"text transform":"-
     A                                      uppercase","left":"498px","cursor c-
     A                                      olumn":"33","top":"370px","cursor r-
     A                                      ow":"14","width":"8px","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"css cl-
     A                                      ass 4":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"set focus":{"fieldName":"38"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"error message id":"WCR1087-
     A                                      ","error message file":"WMESGG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"66","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"2 messages","error mes-
     A                                      sage id 2":"WCR0503","error message-
     A                                       file 2":"WMESGG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"67","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"parent tab pan-
     A                                      el":"W0051F38_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 6":"prof-
     A                                      ound-converted"},{"id":"constant21"-
     A                                      ,"field type":"output field","value-
     A                                      ":"C=Per Claim, O=Per Occurrence","-
     A                                      css class":"constant","left":"526px-
     A                                      ","cursor column":"37","top":"370px-
     A                                      ","cursor row":"14","parent tab pan-
     A                                      el":"W0051F38_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"constant22"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Occupational Disease Only :","cs-
     A                                      s class":"constant","left":"295px",-
     A                                      "cursor column":"4","')
     A                                  1  2HTML('top":"390px","cursor row":"15-
     A                                      ","parent tab panel":"W0051F38_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCOCV1","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      OCV1","designValue":"[SCOCV1]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      ,"dataLength":"1"},"text transform"-
     A                                      :"uppercase","left":"498px","cursor-
     A                                       column":"33","top":"390px","cursor-
     A                                       row":"15","width":"8px","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"css -
     A                                      class 4":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 5":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"set focus":{"fieldName":"3-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"error message id":"WCR10-
     A                                      87","error message file":"WMESGG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"68","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"1 message","parent t-
     A                                      ab panel":"W0051F38_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant23","field type":"output field",-
     A                                      "value":"C=Per Claim, O=Per Occurre-
     A                                      nce","css class":"constant","left":-
     A                                      "526px","cursor column":"37","top":-
     A                                      "390px","cursor row":"15","parent t-
     A                                      ab panel":"W0051F38_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant24","field type":"output field",-
     A                                      "value":"Use total incurred for ded-
     A                                      uctible billing      :","css class"-
     A                                      :"constant","left":"295px","cursor -
     A                                      column":"4","top":"410px","cursor r-
     A                                      ow":"16","parent tab panel":"W0051F-
     A                                      38_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCTOT1","field type":"-
     A                                      checkbox","css class":"input","css -
     A                                      class 2":"checkbox","value":{"field-
     A                                      Name":"SCTOT1","designValue":"[SCTO-
     A                                      T1]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase","dataLength":"1"},"text t-
     A                                      ransform":"uppercase","left":"645px-
     A                                      ","top":"410px","width":"8px","css -
     A                                      class 3":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Cu')
     A                                  1  2HTML('stom Values","customTrue":"HI-
     A                                      ","customFalse":""},"css class 4":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"s-
     A                                      et focus":{"fieldName":"40","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "error message id":"WCR1241","error-
     A                                       message file":"WMESGG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"69","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"1 message","parent tab panel":-
     A                                      "W0051F38_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 6":"profound-
     A                                      -converted","checked value":"Y","un-
     A                                      checked value":" "},{"id":"constant-
     A                                      25","field type":"output field","va-
     A                                      lue":"Statistical code          :",-
     A                                      "css class":"constant","left":"295p-
     A                                      x","cursor column":"4","top":"430px-
     A                                      ","cursor row":"17","parent tab pan-
     A                                      el":"W0051F38_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCCLS1","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCCLS1","designValu-
     A                                      e":"[SCCLS1]","dataType":"zoned","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"-999.00","dataLength":"5","de-
     A                                      cPos":"0","numBlankFill":"true"},"l-
     A                                      eft":"498px","cursor column":"33","-
     A                                      top":"430px","cursor row":"17","wid-
     A                                      th":"36px","text align":"right","cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"set focus":{"fieldN-
     A                                      ame":"88","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"error message id"-
     A                                      :"WCR0503","error message file":"WM-
     A                                      ESGG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      85","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":')
     A                                  1  2HTML('"1 message","parent tab panel-
     A                                      ":"W0051F38_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 6":"profou-
     A                                      nd-converted"},{"id":"constant26","-
     A                                      field type":"output field","value":-
     A                                      "Billing calculation level :","css -
     A                                      class":"constant","left":"295px","c-
     A                                      ursor column":"4","top":"450px","cu-
     A                                      rsor row":"18","parent tab panel":"-
     A                                      W0051F38_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCPLV1","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCPLV1","designValue":"[-
     A                                      SCPLV1]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase","dataLength":"1"},"te-
     A                                      xt transform":"uppercase","left":"4-
     A                                      98px","cursor column":"33","top":"4-
     A                                      50px","cursor row":"18","width":"8p-
     A                                      x","css class 3":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"HI","customFal-
     A                                      se":""},"css class 4":{"fieldName":-
     A                                      "N09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 5":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"set focus":{"-
     A                                      fieldName":"42","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"error messa-
     A                                      ge id":"WCR1087","error message fil-
     A                                      e":"WMESGG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"73","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"1 messa-
     A                                      ge","parent tab panel":"W0051F38_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 6":"profound-converted"}-
     A                                      ,{"id":"constant27","field type":"o-
     A                                      utput field","value":"Reserve hiera-
     A                                      rchy for","css class":"constant","l-
     A                                      eft":"295px","cursor column":"4","t-
     A                                      op":"470px","cursor row":"19","pare-
     A                                      nt tab panel":"W0051F38_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"c-
     A                                      onstant28","field type":"output fie-
     A                                      ld","value":"(1)","css class":"cons-
     A                                      tant","left":"498px","cursor column-
     A                                      ":"33","top":"470px","cursor row":"-
     A                                      19","parent tab panel":"W0051F38_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCR101","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCR101","designValue":"[SCR101]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransf')
     A                                  1  2HTML('orm":"uppercase","dataLength"-
     A                                      :"2"},"text transform":"uppercase",-
     A                                      "left":"526px","cursor column":"37"-
     A                                      ,"top":"470px","cursor row":"19","w-
     A                                      idth":"15px","css class 3":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"HI",-
     A                                      "customFalse":""},"css class 4":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 5":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"set-
     A                                       focus":{"fieldName":"43","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"e-
     A                                      rror message id":"WCR1087","error m-
     A                                      essage file":"WMESGG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"74","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"WC40029","error message file 2":"-
     A                                      WMESGG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"84","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"parent tab panel":"W0051-
     A                                      F38_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"constant29","field ty-
     A                                      pe":"output field","value":"(2)","c-
     A                                      ss class":"constant","left":"554px"-
     A                                      ,"cursor column":"41","top":"470px"-
     A                                      ,"cursor row":"19","parent tab pane-
     A                                      l":"W0051F38_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCR102","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCR102","designValue-
     A                                      ":"[SCR102]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase","dataLength":"2"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"582px","cursor column":"45","top-
     A                                      ":"470px","cursor row":"19","width"-
     A                                      :"15px","css class 3":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"css class 4":{"fieldN-
     A                                      ame":"N09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 5":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"PR","customFalse"')
     A                                  1  2HTML(':""},"set focus":{"fieldName"-
     A                                      :"44","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"error message id":"WC-
     A                                      R1087","error message file":"WMESGG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"75",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"1 message","paren-
     A                                      t tab panel":"W0051F38_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"co-
     A                                      nstant30","field type":"output fiel-
     A                                      d","value":"(3)","css class":"const-
     A                                      ant","left":"610px","cursor column"-
     A                                      :"49","top":"470px","cursor row":"1-
     A                                      9","parent tab panel":"W0051F38_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCR103","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CR103","designValue":"[SCR103]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      ","dataLength":"2"},"text transform-
     A                                      ":"uppercase","left":"638px","curso-
     A                                      r column":"53","top":"470px","curso-
     A                                      r row":"19","width":"15px","css cla-
     A                                      ss 3":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"cs-
     A                                      s class 4":{"fieldName":"N09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"read only":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"css class 5":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"set focus":{"fieldName":-
     A                                      "45","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"WCR-
     A                                      1087","error message file":"WMESGG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"76","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"1 message","parent-
     A                                       tab panel":"W0051F38_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      6":"profound-converted"},{"id":"con-
     A                                      stant31","field type":"output field-
     A                                      ","value":"(4)","css class":"consta-
     A                                      nt","left":"666px","cursor column":-
     A                                      "57","top":"470px","cursor row":"19-
     A                                      ","parent tab panel":"W0051F38_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCR104","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      R104","designValue":"[SCR104]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false",')
     A                                  1  2HTML('"trimTrailing":"true","textTr-
     A                                      ansform":"uppercase","dataLength":"-
     A                                      2"},"text transform":"uppercase","l-
     A                                      eft":"694px","cursor column":"61","-
     A                                      top":"470px","cursor row":"19","wid-
     A                                      th":"15px","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"46","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"err-
     A                                      or message id":"WCR1087","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"77","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","parent tab panel":"W00-
     A                                      51F38_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted"},{"id":"constant32","field -
     A                                      type":"output field","value":"( 5)"-
     A                                      ,"css class":"constant","left":"722-
     A                                      px","cursor column":"65","top":"470-
     A                                      px","cursor row":"19","parent tab p-
     A                                      anel":"W0051F38_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCR105","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCR105","designVa-
     A                                      lue":"[SCR105]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase","dataLength":"-
     A                                      2"},"text transform":"uppercase","l-
     A                                      eft":"757px","cursor column":"70","-
     A                                      top":"470px","cursor row":"19","wid-
     A                                      th":"15px","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"47","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"err-
     A                                      or message id":"WCR1087","error mes-
     A                                      sage file":"WMESGG","')
     A                                  1  2HTML('error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"7-
     A                                      8","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"1 message","pa-
     A                                      rent tab panel":"W0051F38_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted"},{"id":-
     A                                      "constant33","field type":"output f-
     A                                      ield","value":"  deductible billing-
     A                                      s     :","css class":"constant","le-
     A                                      ft":"295px","cursor column":"4","to-
     A                                      p":"490px","cursor row":"20","paren-
     A                                      t tab panel":"W0051F38_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant34","field type":"output fiel-
     A                                      d","value":"(6)","css class":"const-
     A                                      ant","left":"498px","cursor column"-
     A                                      :"33","top":"490px","cursor row":"2-
     A                                      0","parent tab panel":"W0051F38_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCR106","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CR106","designValue":"[SCR106]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      ","dataLength":"2"},"text transform-
     A                                      ":"uppercase","left":"526px","curso-
     A                                      r column":"37","top":"490px","curso-
     A                                      r row":"20","width":"15px","css cla-
     A                                      ss 3":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"cs-
     A                                      s class 4":{"fieldName":"N09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"read only":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"css class 5":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"set focus":{"fieldName":-
     A                                      "48","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"WCR-
     A                                      1087","error message file":"WMESGG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"79","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"1 message","parent-
     A                                       tab panel":"W0051F38_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      6":"profound-converted"},{"id":"con-
     A                                      stant35","field type":"output field-
     A                                      ","value":"(7)","css class":"consta-
     A                                      nt","left":"554px","cursor column":-
     A                                      "41","top":"490px","cursor row":"20-
     A                                      ","parent tab panel":"W0051F38_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCR107","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"')
     A                                  1  2HTML('fieldName":"SCR107","designVa-
     A                                      lue":"[SCR107]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase","dataLength":"-
     A                                      2"},"text transform":"uppercase","l-
     A                                      eft":"582px","cursor column":"45","-
     A                                      top":"490px","cursor row":"20","wid-
     A                                      th":"15px","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"49","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"err-
     A                                      or message id":"WCR1087","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"80","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","parent tab panel":"W00-
     A                                      51F38_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted"},{"id":"constant36","field -
     A                                      type":"output field","value":"(8)",-
     A                                      "css class":"constant","left":"610p-
     A                                      x","cursor column":"49","top":"490p-
     A                                      x","cursor row":"20","parent tab pa-
     A                                      nel":"W0051F38_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCR108","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCR108","designVal-
     A                                      ue":"[SCR108]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase","dataLength":"2-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"638px","cursor column":"53","t-
     A                                      op":"490px","cursor row":"20","widt-
     A                                      h":"15px","css class 3":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"css class 4":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"set fo-
     A                                      cus":{"fieldName":"50","dataType":"-
     A                                      expression","formatti')
     A                                  1  2HTML('ng":"Indicator","indFormat":"-
     A                                      true / false"},"error message id":"-
     A                                      WCR1087","error message file":"WMES-
     A                                      GG","error message library":"*LIBL"-
     A                                      ,"error condition":{"fieldName":"81-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"1 message","par-
     A                                      ent tab panel":"W0051F38_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 6":"profound-converted"},{"id":"-
     A                                      constant37","field type":"output fi-
     A                                      eld","value":"(9)","css class":"con-
     A                                      stant","left":"666px","cursor colum-
     A                                      n":"57","top":"490px","cursor row":-
     A                                      "20","parent tab panel":"W0051F38_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR109","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCR109","designValue":"[SCR109]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se","dataLength":"2"},"text transfo-
     A                                      rm":"uppercase","left":"694px","cur-
     A                                      sor column":"61","top":"490px","cur-
     A                                      sor row":"20","width":"15px","css c-
     A                                      lass 3":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      css class 4":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"read only":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 5":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"set focus":{"fieldName-
     A                                      ":"51","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"error message id":"W-
     A                                      CR1087","error message file":"WMESG-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"82"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error messages":"1 message","pare-
     A                                      nt tab panel":"W0051F38_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"id":"c-
     A                                      onstant38","field type":"output fie-
     A                                      ld","value":"(10)","css class":"con-
     A                                      stant","left":"722px","cursor colum-
     A                                      n":"65","top":"490px","cursor row":-
     A                                      "20","parent tab panel":"W0051F38_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR110","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCR110","designValue":"[SCR110]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se","dataLength":"2"}')
     A                                  1  2HTML(',"text transform":"uppercase"-
     A                                      ,"left":"757px","cursor column":"70-
     A                                      ","top":"490px","cursor row":"20","-
     A                                      width":"15px","css class 3":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"css class 4":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"se-
     A                                      t focus":{"fieldName":"52","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      error message id":"WCR1087","error -
     A                                      message file":"WMESGG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"83","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"1 message","parent tab panel":"-
     A                                      W0051F38_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"constant39","fie-
     A                                      ld type":"output field","value":"AL-
     A                                      AE included             :","css cla-
     A                                      ss":"constant","left":"295px","curs-
     A                                      or column":"4","top":"510px","curso-
     A                                      r row":"21","parent tab panel":"W00-
     A                                      51F38_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCALA1","field type-
     A                                      ":"checkbox","css class":"input","c-
     A                                      ss class 2":"checkbox","value":{"fi-
     A                                      eldName":"SCALA1","designValue":"[S-
     A                                      CALA1]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"uppercase","dataLength":"1"},"tex-
     A                                      t transform":"uppercase","left":"49-
     A                                      8px","top":"510px","width":"8px","c-
     A                                      ss class 3":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"HI","customFalse":"-
     A                                      "},"css class 4":{"fieldName":"N09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"UL","customFa-
     A                                      lse":""},"read only":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 5":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"set focus":{"field-
     A                                      Name":"53","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error message id-
     A                                      ":"WCR1241","error message file":"W-
     A                                      MESGG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "70","dataType":"expr')
     A                                  1  2HTML('ession","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"1 message","parent tab pane-
     A                                      l":"W0051F38_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted","checked value":"Y",-
     A                                      "unchecked value":" "},{"id":"const-
     A                                      ant40","field type":"output field",-
     A                                      "value":"Auto Renew                -
     A                                      :","css class":"constant","left":"2-
     A                                      95px","cursor column":"4","top":"53-
     A                                      0px","cursor row":"22","parent tab -
     A                                      panel":"W0051F38_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCRNW1",-
     A                                      "field type":"checkbox","css class"-
     A                                      :"input","css class 2":"checkbox","-
     A                                      value":{"fieldName":"SCRNW1","desig-
     A                                      nValue":"[SCRNW1]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase","dataLength-
     A                                      ":"1"},"text transform":"uppercase"-
     A                                      ,"left":"498px","top":"530px","widt-
     A                                      h":"8px","css class 3":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"css class 4":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"read only":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 5"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"PR","customFalse":""},"set foc-
     A                                      us":{"fieldName":"54","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"error-
     A                                       message id":"WCR1241","error messa-
     A                                      ge file":"WMESGG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"71","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"1-
     A                                       message","parent tab panel":"W0051-
     A                                      F38_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted","checked value":"Y","unchecke-
     A                                      d value":" "},{"id":"constant44","f-
     A                                      ield type":"output field","value":"-
     A                                       ","css class":"constant","visibili-
     A                                      ty":{"fieldName":"40","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"570px","cursor row":"24","css -
     A                                      class 2":"BLU","parent tab panel":"-
     A                                      W0051F38_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant42","fie-
     A                                      ld type":"output field","value":" "-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"N09 and N40","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"281px","cursor column"-
     A                                      :"2","top":"570px","c')
     A                                  1  2HTML('ursor row":"24","css class 2"-
     A                                      :"BLU","parent tab panel":"W0051F38-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant41","field type"-
     A                                      :"output field","value":" ","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"281p-
     A                                      x","cursor column":"2","top":"570px-
     A                                      ","cursor row":"24","css class 2":"-
     A                                      BLU","parent tab panel":"W0051F38_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant43","field type":"-
     A                                      output field","value":" ","css clas-
     A                                      s":"constant","visibility":{"fieldN-
     A                                      ame":"or N91 and N09 and N40 and N2-
     A                                      6","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"624px","curso-
     A                                      r column":"51","top":"570px","curso-
     A                                      r row":"24","css class 2":"BLU","pa-
     A                                      rent tab panel":"W0051F38_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DISBLVARA      1A  H
     A            DRYICNURL    128A  H
     A            ERADP1         1A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSADP1        10A  H
     A            MSGICNURL    128A  H
     A            SCADP1        12S 9H
     A            SCALA1         1A  H
     A            SCAMG1         9S 0H
     A            SCAMP1         9S 0H
     A            SCCLS1         5S 0H
     A            SCDES1        40A  H
     A            SCOCV1         1A  H
     A            SCPCT1        12S 9H
     A            SCPLN1         2A  H
     A            SCPLV1         1A  H
     A            SCR101         2A  H
     A            SCR102         2A  H
     A            SCR103         2A  H
     A            SCR104         2A  H
     A            SCR105         2A  H
     A            SCR106         2A  H
     A            SCR107         2A  H
     A            SCR108         2A  H
     A            SCR109         2A  H
     A            SCR110         2A  H
     A            SCRNW1         1A  H
     A            SCTOT1         1A  H
     A            SCTYP1         1A  H
     A            SCVARA1        1A  H
     A            SCVRB1         1A  H
     A            VISIBAGGRP     1A  H
     A            VISIBVARA      1A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCXDT    R        H      REFFLD(DT8)
     A            SCDIV     R        H      REFFLD(DIV)
     A            SCEDN     R        H      REFFLD(DS50)
     A            SCEFD1    R        H      REFFLD(DT8)
     A            SCEFDT    R        H      REFFLD(DT8)
     A            SCEMP#    R        H      REFFLD(EMP#)
     A            SCEXP1    R        H      REFFLD(DT8)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCNAME    R        H      REFFLD(NM50)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCST      R        H      REFFLD(ST)
     A          R SCR02
     A  10 11 16
     A  20 21 22
     A  23 24 25                            CA01(10 'Response Indicator *IN10')
     A  26 27 28
     A  30 31 32
     A  33 34 35                            CA02(11 'Response Indicator *IN11')
     A  55 56 57
     A  58 59 61
     A  62 63 64                            CA03(16 'Response Indicator *IN16')
     A  65 66 67
     A  68 69 70
     A  71 72 73                            CA04(20 'Response Indicator *IN20')
     A  84 85 86
     A  87 88 93
     A  09 94 40                            CA05(21 'Response Indicator *IN21')
     A  29 36 37
     A  38 39 41
     A  91 42 43                            CA06(22 'Response Indicator *IN22')
     A  44 45 46
     A  47 48 49
     A  50 51 52                            CA07(23 'Response Indicator *IN23')
     A  53 74 75
     A  76 77 78
     A  79 80 81                            CA08(24 'Response Indicator *IN24')
     A  82 83 89                            CA09(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(33 'Response Indicator *IN33')
     A                                      SETOF(34 'Response Indicator *IN34')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(55 'Response Indicator *IN55')
     A                                      SETOF(56 'Response Indicator *IN56')
     A                                      SETOF(57 'Response Indicator *IN57')
     A                                      SETOF(58 'Response Indicator *IN58')
     A                                      SETOF(59 'Response Indicator *IN59')
     A                                      SETOF(61 'Response Indicator *IN61')
     A                                      SETOF(62 'Response Indicator *IN62')
     A                                      SETOF(63 'Response Indicator *IN63')
     A                                      SETOF(64 'Response Indicator *IN64')
     A                                      SETOF(65 'Response Indicator *IN65')
     A                                      SETOF(66 'Response Indicator *IN66')
     A                                      SETOF(67 'Response Indicator *IN67')
     A                                      SETOF(68 'Response Indicator *IN68')
     A                                      SETOF(69 'Response Indicator *IN69')
     A                                      SETOF(70 'Response Indicator *IN70')
     A                                      SETOF(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                      SETOF(84 'Response Indicator *IN84')
     A                                      SETOF(85 'Response Indicator *IN85')
     A                                      SETOF(86 'Response Indicator *IN86')
     A                                      SETOF(87 'Response Indicator *IN87')
     A                                      SETOF(88 'Response Indicator *IN88')
     A                                      SETOF(93 'Response Indicator *IN93')
     A                                  1  2HTML('QPUIREC35   RROWS      2    C-
     A                                      1    1C2    24 RERRMSG    2    C6  -
     A                                        SCEFD2C46   Dates must fall withi-
     A                                      n policy year date range.E1    3   -
     A                                        58RERRMSG    2    C6    SCEFD2C50-
     A                                         Second date range cannot overlap-
     A                                       first date range.E1    3     89RER-
     A                                      RMSGID  5    C6    SCEFD2C7    WCR0-
     A                                      500C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     55RERRMSGID  5    C6    SC-
     A                                      EFD2C7    WCR0774C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     56RERRMSGID -
     A                                       5    C6    SCEFD2C7    WCR0529C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        57RERRMSGID  5    C6    SCEFD2C7 -
     A                                         WC40073C6    WMESGGC5    *LIBLC0-
     A                                          E1    3     86RERRMSGID  5    C-
     A                                      6    SCEFD2C7    WCR0503C6    WMESG-
     A                                      GC5    *LIBLC0    E1    3     87RER-
     A                                      RMSG    2    C6    SCEXP2C46   Date-
     A                                      s must fall within policy year date-
     A                                       range.E1    3     16RERRMSGID  5  -
     A                                        C6    SCEXP2C7    WCR0500C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     59-
     A                                      RERRMSGID  5    C6    SCDES2C7    W-
     A                                      CR0503C6    WMESGGC5    *LIBLC0    -
     A                                      E1    3     62RERRMSGID  5    C6   -
     A                                       SCTYP2C7    WCR1087C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     63RERRMSG-
     A                                      ID  5    C6    SCTYP2C7    WCR0503C-
     A                                      6    WMESGGC5    *LIBLC0    E1    3-
     A                                           64RERRMSGID  5    C6    SCAMP2-
     A                                      C7    WCR0547C6    WMESGGC5    *LIB-
     A                                      LC0    E1    3     65RERRMSG    2  -
     A                                        C6    SCAMG2C41   Aggregate diffe-
     A                                      rs from other division(s).E1    3  -
     A                                         29REMSGID    5    C33   TxbAggre-
     A                                      gateDeductible2PercentageFMSADP2   -
     A                                       C6    WMESGGC5    *LIBLC0    FERAD-
     A                                      P2    RERRMSGID  5    C6    SCPLN2C-
     A                                      7    WCR1087C6    WMESGGC5    *LIBL-
     A                                      C0    E1    3     72RERRMSGID  5   -
     A                                       C6    SCVRB2C7    WCR1087C6    WME-
     A                                      SGGC5    *LIBLC0    E1    3     66R-
     A                                      ERRMSGID  5    C6    SCVRB2C7    WC-
     A                                      R0503C6    WMESGGC5    *LIBLC0    E-
     A                                      1    3     67RERRMSGID  5    C6    -
     A                                      SCOCV2C7    WCR1087C6    WMESGGC5  -
     A                                        *LIBLC0    E1    3     68RERRMSGI-
     A                                      D  5    C6    SCTOT2C7    WCR1241C6-
     A                                          WMESGGC5    *LIBLC0    E1    3 -
     A                                          69RERRMSGID  5    C6    SCCLS2C-
     A                                      7    WCR0503C6    WMESGGC5    *LIBL-
     A                                      C0    E1    3     85RERRMSGID  5   -
     A                                       C6    SCPLV2C7    WCR1087C6    WME-
     A                                      SGGC5    *LIBLC0    E1    3     73R-
     A                                      ERRMSGID  5    C6    SCR201C7    WC-
     A                                      R1087C6    WMESGGC5    *LIBLC0    E-
     A                                      1    3     74RERRMSGID  5    C6    -
     A                                      SCR201C7    WC40029C6    WMESGGC5  -
     A                                        *LIBLC0    E1    3     84RERRMSGI-
     A                                      D  5    C6    SCR202C7    WCR1087C6-
     A                                          WMESGGC5    *LIBLC0    E1    3 -
     A                                          75RERRMSGID  5    C6    SCR203C-
     A                                      7    WCR1087C6    WMESGGC5    *LIBL-
     A                                      C0    E1    3     76RERRMSGID  5   -
     A                                       C6    SCR204C7    WCR1087C6    WME-
     A                                      SGGC5    *LIBLC0    E1    3     77R-
     A                                      ERRMSGID  5    C6    SCR205C7    WC-
     A                                      R1087C6    WMESGGC5    *LIBLC0    E-
     A                                      1    3     78RERRMSGID  5    C6    -
     A                                      SCR206C7    WCR1087C6')
     A                                  1  2HTML('QPUI    WMESGGC5    *LIBLC0  -
     A                                        E1    3     79RERRMSGID  5    C6 -
     A                                         SCR207C7    WCR1087C6    WMESGGC-
     A                                      5    *LIBLC0    E1    3     80RERRM-
     A                                      SGID  5    C6    SCR208C7    WCR108-
     A                                      7C6    WMESGGC5    *LIBLC0    E1   -
     A                                       3     81RERRMSGID  5    C6    SCR2-
     A                                      09C7    WCR1087C6    WMESGGC5    *L-
     A                                      IBLC0    E1    3     82RERRMSGID  5-
     A                                          C6    SCR210C7    WCR1087C6    -
     A                                      WMESGGC5    *LIBLC0    E1    3     -
     A                                      83RERRMSGID  5    C6    SCALA2C7   -
     A                                       WCR1241C6    WMESGGC5    *LIBLC0  -
     A                                        E1    3     70')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN16","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN20","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN21","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN22","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN23","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN24","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN25","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN26","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN27","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N28","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN3-
     A                                      0","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN31"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN32","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN33","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN34","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 16":{"fieldName":"*IN35","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       17":{"fieldName":"*IN55","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 1-
     A                                      8":{"fieldName":"*IN56","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 19"-
     A                                      :{"fieldName":"*IN57","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 20":{-
     A                                      "fieldName":"*IN58","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 21":{"f-
     A                                      ieldName":"*IN59","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 22":{"fie-
     A                                      ldName":"*IN61","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 23":{"field-
     A                                      Name":"*IN62","dataTy')
     A                                  1  2HTML('pe":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 24":{"fieldName":"*IN63","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 25":{"fieldName":"*IN64","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 26":{"fieldName":"*IN65","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       27":{"fieldName":"*IN66","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 2-
     A                                      8":{"fieldName":"*IN67","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 29"-
     A                                      :{"fieldName":"*IN68","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 30":{-
     A                                      "fieldName":"*IN69","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 31":{"f-
     A                                      ieldName":"*IN70","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 32":{"fie-
     A                                      ldName":"*IN71","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 33":{"field-
     A                                      Name":"*IN72","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 34":{"fieldNa-
     A                                      me":"*IN73","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 35":{"fieldName-
     A                                      ":"*IN84","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 36":{"fieldName":-
     A                                      "*IN85","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"set off 37":{"fieldName":"*-
     A                                      IN86","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 38":{"fieldName":"*IN-
     A                                      87","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 39":{"fieldName":"*IN88-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"set off 40":{"fieldName":"*IN93",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      return cursor record":{"fieldName":-
     A                                      "HREC","dataLength":"10","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none"},"return c-
     A                                      ursor field":{"fieldName":"HFLD","d-
     A                                      ataLength":"10","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"none"},"valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"1-24"},"items":[{"id":"SCR02_HR-
     A                                      EC","field type":"output field","vi-
     A                                      sibility":"hidden","value":{"fieldN-
     A                                      ame":"HREC","designValue":"[HREC]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTran')
     A                                  1  2HTML('sform":"none","dataLength":"1-
     A                                      0"},"left":"0px","top":"-30px","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"SCR02_HFLD","field type":"output -
     A                                      field","visibility":"hidden","value-
     A                                      ":{"fieldName":"HFLD","designValue"-
     A                                      :"[HFLD]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"none","dataLength":"10"},"left"-
     A                                      :"0px","top":"-30px","css class":"p-
     A                                      rofound-converted"},{"id":"SCR02_SC-
     A                                      EMP#","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"SCEMP#","designValue":"[SCE-
     A                                      MP#]","refField":"EMP#","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"true","curSym":"","un-
     A                                      its":"","negNum":"-999.00"},"left":-
     A                                      "0px","top":"-30px","width":"63px",-
     A                                      "text align":"right","css class":"p-
     A                                      rofound-converted"},{"id":"SCR02_SC-
     A                                      DIV","field type":"output field","v-
     A                                      isibility":"hidden","value":{"field-
     A                                      Name":"SCDIV","designValue":"[SCDIV-
     A                                      ]","refField":"DIV","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"true","curSym":"","units"-
     A                                      :"","negNum":"-999.00"},"left":"0px-
     A                                      ","top":"-30px","width":"35px","tex-
     A                                      t align":"right","css class":"profo-
     A                                      und-converted"},{"id":"W0051F38_SCR-
     A                                      02_avKeys","field type":"output fie-
     A                                      ld","value":{"fieldName":"AV_KEYS",-
     A                                      "dataLength":"1134","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[AV_KEYS]"},"left":"0px","top-
     A                                      ":"0px","visibility":"hidden"},{"id-
     A                                      ":"W0051F38_SCR02_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"W0051F38_SCR02-
     A                                      _BtnIconMenuSystemTools","tool tip"-
     A                                      :"System Tools","icon source":"/pro-
     A                                      foundui/userdata/images/systool/sys-
     A                                      tools.png","data function":"SystemT-
     A                                      oolbarSystools","show down arrow":"-
     A                                      Yes"},{"field type":"panel","panel -
     A                                      style":"TransformButtonBar","id":"W-
     A                                      0051F38_SCR02_ButtonBar","top":"35p-
     A                                      x","left":"1036px","width":"187px",-
     A                                      "height":"28px","css')
     A                                  1  2HTML(' class":"stationary","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1040px",-
     A                                      "id":"W0051F38_SCR02_BtnSave","tool-
     A                                       tip":"Save","onclick":"SystemToolb-
     A                                      arSave","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      save.png'')"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1066px","id":"W0051F38_SCR02_BtnRe-
     A                                      fresh","tool tip":"Refresh","onclic-
     A                                      k":"SystemToolbarRefresh","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/refresh.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1092px","id":-
     A                                      "W0051F38_SCR02_BtnSearch","tool ti-
     A                                      p":"Search","onclick":"SystemToolba-
     A                                      rSearch","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /search.png'')"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1118px","id":"W0051F38_SCR02_Bt-
     A                                      nDiaryItems","tool tip":"Diary/Work-
     A                                       Items - IDARTS","onclick":"SystemT-
     A                                      oolbarDiary","background image":{"f-
     A                                      ieldName":"DryIcnURL","dataLength":-
     A                                      "128","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"}},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left sty')
     A                                  1  2HTML('le":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1144px","id":"-
     A                                      W0051F38_SCR02_BtnSystemMessages","-
     A                                      tool tip":"System Messages","onclic-
     A                                      k":"SystemToolbarMessages","backgro-
     A                                      und image":{"fieldName":"MsgIcnURL"-
     A                                      ,"dataLength":"128","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none"}},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1196px","id":"W0051F-
     A                                      38_SCR02_BtnHelp","tool tip":"Help"-
     A                                      ,"onclick":"SystemToolbarHelp","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/help.png'')"-
     A                                      },{"id":"W0051F38_SCR02_ImgSysToolB-
     A                                      ottom","field type":"image","image -
     A                                      source":"/profoundui/userdata/image-
     A                                      s/systool/butbarbot.png","left":"10-
     A                                      36px","top":"64px","width":"187px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"stationary","visibility":"hidden-
     A                                      "},{"id":"W0051F38_SCR02_MainTabPan-
     A                                      el","field type":"tab panel","tab p-
     A                                      anel style":"Transform","tab names"-
     A                                      :{"fieldName":"SCPRDS","designValue-
     A                                      ":"[SCPRDS]","refField":"NAME","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"active tab":"0","left":"250px",-
     A                                      "top":"70px","width":"970px","heigh-
     A                                      t":"657px","z index":"8","locked in-
     A                                       place":"true","css class":"tab-pan-
     A                                      el","css class 2":"stationary"},{"f-
     A                                      ield type":"button","left":"1060px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0051F38_SCR02_-
     A                                      BtnHiddenWorkSubmitJob","value":"bt-
     A                                      nWrksbmjob","top":"100px","response-
     A                                      ":{"fieldName":"btnWrkJob","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0051F38_SCR02_BtnHi-
     A                                      ddenSave","value":"btnSave","top":"-
     A                                      100px","response":{"fieldName":"btn-
     A                                      Save","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant45","field typ-
     A                                      e":"output field","left":"281px","c-
     A                                      ursor column":"2","top":"110px","cu-
     A                                      rsor row":"1","css class":"top-line-
     A                                      ","value":"js: currentUser()","css -
     A                                      class 2":"output-field","parent tab-
     A                                       panel":"W0051F38_SCR')
     A                                  1  2HTML('02_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"SCR02_SCCONM","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCCONM","designValue":"[SCCO-
     A                                      NM]","refField":"NAME","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"414px-
     A                                      ","cursor column":"21","top":"110px-
     A                                      ","cursor row":"1","css class 2":"t-
     A                                      op-line","css class 3":"HI","descri-
     A                                      ption":"COMPANY NAME","parent tab p-
     A                                      anel":"W0051F38_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 4":"pr-
     A                                      ofound-converted"},{"id":"constant4-
     A                                      6","field type":"output field","lef-
     A                                      t":"778px","cursor column":"73","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass":"top-line","value":"js: curren-
     A                                      tDate()","css class 2":"output-fiel-
     A                                      d","parent tab panel":"W0051F38_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"W0051F38_SCR02_fkeyMenu","fi-
     A                                      eld type":"menu","left":"10px","top-
     A                                      ":"120px","height":"350px","width":-
     A                                      "230px","hover background color":"#-
     A                                      9AAA61","hover text color":"#FFFFFF-
     A                                      ","border color":"#4C6106","menu op-
     A                                      tion indent":"10px","background col-
     A                                      or":"#758B27","css class":"action-m-
     A                                      enu","css class 2":"stationary","z -
     A                                      index":"101"},{"field type":"button-
     A                                      ","left":"1060px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0051F38_SCR02_BtnHiddenWorkPrint-
     A                                      erOutput","value":"btnWrkprtout","t-
     A                                      op":"125px","response":{"fieldName"-
     A                                      :"btnWrkPrnt","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0051F38_SCR02_BtnHiddenRefresh",-
     A                                      "value":"btnRefresh","top":"125px",-
     A                                      "response":{"fieldName":"btnRefresh-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"SCR02_Q1PGM","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"Q1PGM","designValue":"[Q1PGM]","r-
     A                                      efField":"DS10","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"281px","curs-
     A                                      or column":"2","top":"130px","curso-
     A                                      r row":"2","parent tab panel":"W005-
     A                                      1F38_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCR02_SCPRDS","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCPRDS","designValue":"[SC-
     A                                      PRDS]","refField":"NAME","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","')
     A                                  1  2HTML('trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"414px","cursor col-
     A                                      umn":"21","top":"130px","cursor row-
     A                                      ":"2","css class 2":"HI","descripti-
     A                                      on":"PROGRAM NAME","parent tab pane-
     A                                      l":"W0051F38_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant47","field type":-
     A                                      "output field","value":"SCR02","css-
     A                                       class":"constant","left":"799px","-
     A                                      cursor column":"76","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "W0051F38_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"btnSubmit","fie-
     A                                      ld type":"button","value":"Enter","-
     A                                      shortcut key":"Enter","left":"14px"-
     A                                      ,"top":"150px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"constant48","field type-
     A                                      ":"output field","value":"Group:","-
     A                                      css class":"constant","left":"281px-
     A                                      ","cursor column":"2","top":"150px"-
     A                                      ,"cursor row":"3","parent tab panel-
     A                                      ":"W0051F38_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCR02_SCFND",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCFND","designValue"-
     A                                      :"[SCFND]","refField":"FND","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00"},"c-
     A                                      ss class":"output-field","left":"33-
     A                                      7px","cursor column":"10","top":"15-
     A                                      0px","cursor row":"3","width":"21px-
     A                                      ","text align":"right","parent tab -
     A                                      panel":"W0051F38_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCR02_SC-
     A                                      NAME","field type":"output field","-
     A                                      value":{"fieldName":"SCNAME","desig-
     A                                      nValue":"[SCNAME]","refField":"NM50-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"372px","cursor column":"15-
     A                                      ","top":"150px","cursor row":"3","d-
     A                                      escription":"FUND NAME","parent tab-
     A                                       panel":"W0051F38_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCR02_S-
     A                                      CMODE","field type":"output field",-
     A                                      "value":{"fieldName":"SCMODE","desi-
     A                                      gnValue":"[SCMODE]","refField":"NM1-
     A                                      0","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"764px","cursor column":"7-
     A                                      1","top":"150px","cursor row":"3","-
     A                                      css class 2":"HI","description":"AD-
     A                                      D/UPDATE MODE","parent tab panel":"-
     A                                      W0051F38_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1060px","heig')
     A                                  1  2HTML('ht":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0051F38_SCR02_-
     A                                      BtnHiddenImageQueue","value":"btnIm-
     A                                      gQue","top":"150px","response":{"fi-
     A                                      eldName":"btnImgQue","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0051F38_SCR02_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant49","field typ-
     A                                      e":"output field","value":"State:",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"91","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"170px","cursor row":"4","parent t-
     A                                      ab panel":"W0051F38_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant51","field type":"output field",-
     A                                      "value":"Emp #:","css class":"const-
     A                                      ant","visibility":{"fieldName":"N91-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"281px","cursor-
     A                                       column":"2","top":"170px","cursor -
     A                                      row":"4","parent tab panel":"W0051F-
     A                                      38_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCR02_SCST","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCST","designValue":"[SCST]","-
     A                                      refField":"ST","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","visibility":{"fieldN-
     A                                      ame":"91","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"330px"-
     A                                      ,"cursor column":"9","top":"170px",-
     A                                      "cursor row":"4","parent tab panel"-
     A                                      :"W0051F38_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCR02_SCEDN","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCEDN","designValue":-
     A                                      "[SCEDN]","refField":"DS50","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","visibil-
     A                                      ity":{"fieldName":"N91","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"337px","cursor column":"10"-
     A                                      ,"top":"170px","cursor row":"4","pa-
     A                                      rent tab panel":"W0051F38_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant50","field type":"output f-
     A                                      ield","value":"Effect')
     A                                  1  2HTML('ive Date:","css class":"const-
     A                                      ant","visibility":{"fieldName":"91"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"358px","cursor -
     A                                      column":"13","top":"170px","cursor -
     A                                      row":"4","parent tab panel":"W0051F-
     A                                      38_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCR02_SCEFDT","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCEFDT","designValue":"[SCEF-
     A                                      DT]","refField":"DT8","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"true",-
     A                                      "zeroFill":"true","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","edtWrd":"-
     A                                      ''  /  /    ''"},"css class":"outpu-
     A                                      t-field","visibility":{"fieldName":-
     A                                      "91","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"470px","cur-
     A                                      sor column":"29","top":"170px","cur-
     A                                      sor row":"4","width":"70px","text a-
     A                                      lign":"right","parent tab panel":"W-
     A                                      0051F38_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant52","fiel-
     A                                      d type":"output field","value":"Yea-
     A                                      r :","css class":"constant","visibi-
     A                                      lity":{"fieldName":"N91","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"701px","cursor column":"62-
     A                                      ","top":"170px","cursor row":"4","p-
     A                                      arent tab panel":"W0051F38_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR02_SCFYR","field type":"output-
     A                                       field","value":{"fieldName":"SCFYR-
     A                                      ","designValue":"[SCFYR]","refField-
     A                                      ":"FYR","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00"},"css class":"output-fie-
     A                                      ld","visibility":{"fieldName":"N91"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"750px","cursor -
     A                                      column":"69","top":"170px","cursor -
     A                                      row":"4","width":"21px","text align-
     A                                      ":"right","parent tab panel":"W0051-
     A                                      F38_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1060px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0051-
     A                                      F38_SCR02_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"175px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0051F38_SCR02_BtnHiddenDi-
     A                                      aryItems","value":"btnDiary","top":-
     A                                      "175px","response":{"')
     A                                  1  2HTML('fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      btnCF03","field type":"button","vis-
     A                                      ibility":{"fieldName":"09 or N09 an-
     A                                      d N40 or 40","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"value":"Ex-
     A                                      it","shortcut key":"F3","left":"14p-
     A                                      x","top":"183px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"constant53","field ty-
     A                                      pe":"output field","value":"Large d-
     A                                      eductible #2:","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"190px","cursor row":"5","-
     A                                      css class 2":"BLU","parent tab pane-
     A                                      l":"W0051F38_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"constant54",-
     A                                      "field type":"output field","value"-
     A                                      :"Cx Date:","css class":"constant",-
     A                                      "visibility":{"fieldName":"41 and N-
     A                                      91","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"701px","curs-
     A                                      or column":"62","top":"190px","curs-
     A                                      or row":"5","parent tab panel":"W00-
     A                                      51F38_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCR02_SCCXDT","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCCXDT","designValue":"[S-
     A                                      CCXDT]","refField":"DT8","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"true","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","edtWrd-
     A                                      ":"''  /  /    ''"},"css class":"ou-
     A                                      tput-field","visibility":{"fieldNam-
     A                                      e":"41 and N91","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      764px","cursor column":"71","top":"-
     A                                      190px","cursor row":"5","width":"70-
     A                                      px","text align":"right","parent ta-
     A                                      b panel":"W0051F38_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0051F38_SCR02_BtnHiddenS-
     A                                      ystemMessages","value":"btnMessage"-
     A                                      ,"top":"200px","response":{"fieldNa-
     A                                      me":"btnMessage","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant55"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Effective date            :","cs-
     A                                      s class":"constant","visibility":{"-
     A                                      fieldName":"N91","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "295px","cursor column":"4","top":"-
     A                                      210px","cursor row":"6","parent tab-
     A                                       panel":"W0051F38_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCEFD2"-
     A                                      ,"field type":"date f')
     A                                  1  2HTML('ield","css class":"input","cs-
     A                                      s class 2":"date-field","value":{"f-
     A                                      ieldName":"SCEFD2","designValue":"[-
     A                                      SCEFD2]","refField":"DT8","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"-999.00","num-
     A                                      BlankFill":"true","edtWrd":"''  /  -
     A                                      /    ''","dateFormat":"m/d/Y"},"vis-
     A                                      ibility":{"fieldName":"N91","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"498px","cursor column":-
     A                                      "33","top":"210px","cursor row":"6"-
     A                                      ,"width":"71px","text align":"right-
     A                                      ","css class 3":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"css class 4":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 5":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"set focus":{"f-
     A                                      ieldName":"30","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"error messag-
     A                                      e":"Dates must fall within policy y-
     A                                      ear date range.","error condition":-
     A                                      {"fieldName":"58","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "7 messages","error message 2":"Sec-
     A                                      ond date range cannot overlap first-
     A                                       date range.","error condition 2":{-
     A                                      "fieldName":"89","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error message id -
     A                                      3":"WCR0500","error message file 3"-
     A                                      :"WMESGG","error message library 3"-
     A                                      :"*LIBL","error condition 3":{"fiel-
     A                                      dName":"55","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error message id 4":"W-
     A                                      CR0774","error message file 4":"WME-
     A                                      SGG","error message library 4":"*LI-
     A                                      BL","error condition 4":{"fieldName-
     A                                      ":"56","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error message id 5":"WCR052-
     A                                      9","error message file 5":"WMESGG",-
     A                                      "error message library 5":"*LIBL","-
     A                                      error condition 5":{"fieldName":"57-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 6":"WC40073","e-
     A                                      rror message file 6":"WMESGG","erro-
     A                                      r message library 6":"*LIBL","error-
     A                                       condition 6":{"fieldName":"86","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror message id 7":"WCR0503","error -
     A                                      message file 7":"WMESGG","error mes-
     A                                      sage library 7":"*LIB')
     A                                  1  2HTML('L","error condition 7":{"fiel-
     A                                      dName":"87","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"parent tab panel":"W00-
     A                                      51F38_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted"},{"id":"btnCF05","field typ-
     A                                      e":"button","visibility":{"fieldNam-
     A                                      e":"N09 and N40","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"value"-
     A                                      :"Refresh","shortcut key":"F5","lef-
     A                                      t":"14px","top":"216px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"constant56","f-
     A                                      ield type":"output field","value":"-
     A                                      Expiration date           :","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"N91","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"29-
     A                                      5px","cursor column":"4","top":"230-
     A                                      px","cursor row":"7","parent tab pa-
     A                                      nel":"W0051F38_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCEXP2","f-
     A                                      ield type":"date field","css class"-
     A                                      :"input","css class 2":"date-field"-
     A                                      ,"value":{"fieldName":"SCEXP2","des-
     A                                      ignValue":"[SCEXP2]","refField":"DT-
     A                                      8","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"false","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","numBlankFill":"true","edtW-
     A                                      rd":"''  /  /    ''","dateFormat":"-
     A                                      m/d/Y"},"visibility":{"fieldName":"-
     A                                      N91","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"498px","cur-
     A                                      sor column":"33","top":"230px","cur-
     A                                      sor row":"7","width":"71px","text a-
     A                                      lign":"right","css class 3":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"css class 4":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"se-
     A                                      t focus":{"fieldName":"31","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      error message":"Dates must fall wit-
     A                                      hin policy year date range.","error-
     A                                       condition":{"fieldName":"16","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"2 messages","error mes-
     A                                      sage id 2":"WCR0500","error message-
     A                                       file 2":"WMESGG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"59","')
     A                                  1  2HTML('dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"W0051F38_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"btnCF10","field type":"but-
     A                                      ton","visibility":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"value":"Search","shor-
     A                                      tcut key":"F10","left":"14px","top"-
     A                                      :"249px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"constant57","field type":"out-
     A                                      put field","value":"Description    -
     A                                                 :","css class":"constant-
     A                                      ","left":"295px","cursor column":"4-
     A                                      ","top":"250px","cursor row":"8","p-
     A                                      arent tab panel":"W0051F38_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCDES2","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCDES2-
     A                                      ","designValue":"[SCDES2]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase","da-
     A                                      taLength":"40"},"text transform":"u-
     A                                      ppercase","left":"498px","cursor co-
     A                                      lumn":"33","top":"250px","cursor ro-
     A                                      w":"8","width":"281px","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"css cl-
     A                                      ass 4":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"set focus":{"fieldName":"32"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"error message id":"WCR0503-
     A                                      ","error message file":"WMESGG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"62","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"1 message","parent tab-
     A                                       panel":"W0051F38_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 6":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t58","field type":"output field","v-
     A                                      alue":"Discount %                :"-
     A                                      ,"css class":"constant","left":"295-
     A                                      px","cursor column":"4","top":"270p-
     A                                      x","cursor row":"9","parent tab pan-
     A                                      el":"W0051F38_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCPCT2","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCPCT')
     A                                  1  2HTML('2","designValue":"[SCPCT2]","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","numSep":"true","zeroBalance":-
     A                                      "true","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00","da-
     A                                      taLength":"12","decPos":"9","numBla-
     A                                      nkFill":"true"},"left":"498px","cur-
     A                                      sor column":"33","top":"270px","cur-
     A                                      sor row":"9","width":"92px","text a-
     A                                      lign":"right","css class 3":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"css class 4":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"se-
     A                                      t focus":{"fieldName":"33","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      parent tab panel":"W0051F38_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"btnCF12","field type":"button","-
     A                                      visibility":{"fieldName":"09 or N09-
     A                                       and N40 or 40","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"value":-
     A                                      "Cancel","shortcut key":"F12","left-
     A                                      ":"14px","top":"282px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"constant59","fi-
     A                                      eld type":"output field","value":"G-
     A                                      ross/Net                 :","css cl-
     A                                      ass":"constant","left":"295px","cur-
     A                                      sor column":"4","top":"290px","curs-
     A                                      or row":"10","parent tab panel":"W0-
     A                                      051F38_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCTYP2","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCTYP2","designValue":"[SC-
     A                                      TYP2]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase","dataLength":"1"},"text-
     A                                       transform":"uppercase","left":"498-
     A                                      px","cursor column":"33","top":"290-
     A                                      px","cursor row":"10","width":"8px"-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"css class 4":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 5":{"field-
     A                                      Name":"09","dataType"')
     A                                  1  2HTML(':"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"set focus":{"fieldName":"34","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"error message id":"WCR1087",-
     A                                      "error message file":"WMESGG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"63","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"2 messages","error messa-
     A                                      ge id 2":"WCR0503","error message f-
     A                                      ile 2":"WMESGG","error message libr-
     A                                      ary 2":"*LIBL","error condition 2":-
     A                                      {"fieldName":"64","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"parent tab panel-
     A                                      ":"W0051F38_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 6":"profou-
     A                                      nd-converted"},{"id":"constant60","-
     A                                      field type":"output field","value":-
     A                                      "G=Gross, N=Net","css class":"const-
     A                                      ant","left":"526px","cursor column"-
     A                                      :"37","top":"290px","cursor row":"1-
     A                                      0","parent tab panel":"W0051F38_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"constant61","field type":"ou-
     A                                      tput field","value":"Deductible amo-
     A                                      unt         :","css class":"constan-
     A                                      t","left":"295px","cursor column":"-
     A                                      4","top":"310px","cursor row":"11",-
     A                                      "parent tab panel":"W0051F38_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCAMP2","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCAM-
     A                                      P2","designValue":"[SCAMP2]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"9","decPos":"0","numBlankF-
     A                                      ill":"true"},"left":"498px","cursor-
     A                                       column":"33","top":"310px","cursor-
     A                                       row":"11","width":"64px","text ali-
     A                                      gn":"right","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"read only":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       5":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"set -
     A                                      focus":{"fieldName":"35","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"WCR0547","error me-
     A                                      ssage file":"WMESGG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"65","d')
     A                                  1  2HTML('ataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"1 message","p-
     A                                      arent tab panel":"W0051F38_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"id"-
     A                                      :"btnHELP","field type":"button","s-
     A                                      hortcut key":"Alt-F1","bypass valid-
     A                                      ation":"true","value":"HELP","respo-
     A                                      nse":{"fieldName":"*IN10","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"left":"14-
     A                                      px","top":"315px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"constant62","field t-
     A                                      ype":"output field","value":"Deduct-
     A                                      ible aggregate      :","css class":-
     A                                      "constant","left":"295px","cursor c-
     A                                      olumn":"4","top":"330px","cursor ro-
     A                                      w":"12","parent tab panel":"W0051F3-
     A                                      8_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCAMG2","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCAMG2","designValue":"[SCAMG2]-
     A                                      ","dataType":"zoned","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"false","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0","dataLength":"9","decPos":"0","n-
     A                                      umBlankFill":"true"},"left":"498px"-
     A                                      ,"cursor column":"33","top":"330px"-
     A                                      ,"cursor row":"12","width":"64px","-
     A                                      text align":"right","css class 3":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"css class-
     A                                       4":{"fieldName":"N09 and N94","cus-
     A                                      tomTrue":"UL","customFalse":"","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s"},"read only":{"fieldName":"94 or-
     A                                       09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 5":{"fieldNa-
     A                                      me":"94 or 09","customTrue":"PR","c-
     A                                      ustomFalse":"","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values"},"set focus":-
     A                                      {"fieldName":"36","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"error mes-
     A                                      sage":"Aggregate differs from other-
     A                                       division(s).","error condition":{"-
     A                                      fieldName":"29","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"1-
     A                                       message","parent tab panel":"W0051-
     A                                      F38_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"CbxVarAggregateAmount-
     A                                      Indicator2","field type":"checkbox"-
     A                                      ,"css class":"input","description":-
     A                                      "Large Deductible #1 Total Incurred-
     A                                       Checkbox","value":{"fieldName":"SC-
     A                                      VARA2","dataLength":"1","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char"')
     A                                  1  2HTML(',"formatting":"Text","textTra-
     A                                      nsform":"none","designValue":"[SCVA-
     A                                      RA2]"},"checked value":"Y","uncheck-
     A                                      ed value":" ","disabled":{"fieldNam-
     A                                      e":"DisblVarA","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"label":"Variabl-
     A                                      e","read only":{"fieldName":"inquir-
     A                                      y_D","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"left":"585px","top":"33-
     A                                      0px","z index":"99","locked in plac-
     A                                      e":"false","css class 2":"checkbox"-
     A                                      ,"visibility":{"fieldName":"VisibVa-
     A                                      rA","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"css class 3":{"fieldNa-
     A                                      me":"09","customTrue":"HI","customF-
     A                                      alse":"","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values"},"css class 4":{"fi-
     A                                      eldName":"N09 and N94","customTrue"-
     A                                      :"UL","customFalse":"","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values"},"css-
     A                                       class 5":{"fieldName":"09 or 94","-
     A                                      customTrue":"PR","customFalse":"","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues"}},{"id":"TxbAggregateDeductib-
     A                                      le2Percentage","field type":"textbo-
     A                                      x","css class":"input","description-
     A                                      ":"Aggregate Deductible 2 Percentag-
     A                                      e","value":{"fieldName":"SCADP2","d-
     A                                      ataLength":"12","decPos":"9","numSe-
     A                                      p":"true","zeroBalance":"false","nu-
     A                                      mBlankFill":"false","zeroFill":"fal-
     A                                      se","noExtraSpaces":"false","curSym-
     A                                      ":"","dataType":"zoned","formatting-
     A                                      ":"Number","negNum":"-999.00","unit-
     A                                      s":"","designValue":"[SCADP2]"},"te-
     A                                      xt align":"right","read only":{"fie-
     A                                      ldName":"09 or 94","customTrue":"",-
     A                                      "customFalse":"","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"error mess-
     A                                      ages":"1 message","error message id-
     A                                      ":{"fieldName":"msADP2","dataLength-
     A                                      ":"10","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"},"error message file":-
     A                                      "WMESGG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"erADP2","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error enhanced mode":"1","-
     A                                      left":"665px","top":"330px","width"-
     A                                      :"110px","z index":"99","locked in -
     A                                      place":"false","css class 2":"textb-
     A                                      ox","visibility":{"fieldName":"Visi-
     A                                      bAggrP","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"css class 3":{"fie-
     A                                      ldName":"09","customTrue":"HI","cus-
     A                                      tomFalse":"","dataType":"expression-
     A                                      ","formatting":"Indic')
     A                                  1  2HTML('ator","indFormat":"Custom Val-
     A                                      ues"},"css class 4":{"fieldName":"N-
     A                                      09 and N94","customTrue":"UL","cust-
     A                                      omFalse":"","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values"},"css class 5":{-
     A                                      "fieldName":"09 or 94","customTrue"-
     A                                      :"PR","customFalse":"","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values"}},{"i-
     A                                      d":"LblAggregateDeductiblePct2","fi-
     A                                      eld type":"output field","css class-
     A                                      ":"constant","value":"%","cursor ro-
     A                                      w":"12","cursor column":"4","left":-
     A                                      "780px","top":"332px","parent tab p-
     A                                      anel":"W0051F38_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted","visibility":{"fi-
     A                                      eldName":"VisibAggrP","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"}},{"id-
     A                                      ":"constant63","field type":"output-
     A                                       field","value":"Deductible plan ty-
     A                                      pe      :","css class":"constant","-
     A                                      left":"295px","cursor column":"4","-
     A                                      top":"350px","cursor row":"13","par-
     A                                      ent tab panel":"W0051F38_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCPLN2","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCPLN2",-
     A                                      "designValue":"[SCPLN2]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"uppercase","data-
     A                                      Length":"2"},"text transform":"uppe-
     A                                      rcase","left":"498px","cursor colum-
     A                                      n":"33","top":"350px","cursor row":-
     A                                      "13","width":"15px","css class 3":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"css class-
     A                                       4":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"set focus":{"fieldName":"37","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"error message id":"WCR1087","-
     A                                      error message file":"WMESGG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"72","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"1 message","parent tab pa-
     A                                      nel":"W0051F38_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 6":"pro-
     A                                      found-converted"},{"id":"constant64-
     A                                      ","field type":"output field","valu-
     A                                      e":"Per claim/per occurrence. :","c-
     A                                      ss class":"constant",')
     A                                  1  2HTML('"left":"295px","cursor column-
     A                                      ":"4","top":"370px","cursor row":"1-
     A                                      4","parent tab panel":"W0051F38_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCVRB2","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CVRB2","designValue":"[SCVRB2]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      ","dataLength":"1"},"text transform-
     A                                      ":"uppercase","left":"498px","curso-
     A                                      r column":"33","top":"370px","curso-
     A                                      r row":"14","width":"8px","css clas-
     A                                      s 3":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"css-
     A                                       class 4":{"fieldName":"N09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"UL","customFalse":""-
     A                                      },"read only":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"css class 5":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"PR","customFa-
     A                                      lse":""},"set focus":{"fieldName":"-
     A                                      38","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"error message id":"WCR1-
     A                                      087","error message file":"WMESGG",-
     A                                      "error message library":"*LIBL","er-
     A                                      ror condition":{"fieldName":"66","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"2 messages","error -
     A                                      message id 2":"WCR0503","error mess-
     A                                      age file 2":"WMESGG","error message-
     A                                       library 2":"*LIBL","error conditio-
     A                                      n 2":{"fieldName":"67","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"parent tab -
     A                                      panel":"W0051F38_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      65","field type":"output field","va-
     A                                      lue":"C=Per Claim, O=Per Occurrence-
     A                                      ","css class":"constant","left":"52-
     A                                      6px","cursor column":"37","top":"37-
     A                                      0px","cursor row":"14","parent tab -
     A                                      panel":"W0051F38_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      66","field type":"output field","va-
     A                                      lue":"Occupational Disease Only :",-
     A                                      "css class":"constant","left":"295p-
     A                                      x","cursor column":"4","top":"390px-
     A                                      ","cursor row":"15","parent tab pan-
     A                                      el":"W0051F38_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCOCV2","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCOCV2","designValu-
     A                                      e":"[SCOCV2]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"t')
     A                                  1  2HTML('rue","textTransform":"upperca-
     A                                      se","dataLength":"1"},"text transfo-
     A                                      rm":"uppercase","left":"498px","cur-
     A                                      sor column":"33","top":"390px","cur-
     A                                      sor row":"15","width":"8px","css cl-
     A                                      ass 3":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"c-
     A                                      ss class 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"set focus":{"fieldName"-
     A                                      :"39","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"error message id":"WC-
     A                                      R1087","error message file":"WMESGG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"68",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"1 message","paren-
     A                                      t tab panel":"W0051F38_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"co-
     A                                      nstant67","field type":"output fiel-
     A                                      d","value":"C=Per Claim, O=Per Occu-
     A                                      rrence","css class":"constant","lef-
     A                                      t":"526px","cursor column":"37","to-
     A                                      p":"390px","cursor row":"15","paren-
     A                                      t tab panel":"W0051F38_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant68","field type":"output fiel-
     A                                      d","value":"Use total incurred for -
     A                                          ","css class":"constant","left"-
     A                                      :"295px","cursor column":"4","top":-
     A                                      "410px","cursor row":"16","parent t-
     A                                      ab panel":"W0051F38_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant69","field type":"output field",-
     A                                      "value":"  deductible billing      -
     A                                      :","css class":"constant","left":"2-
     A                                      95px","cursor column":"4","top":"43-
     A                                      0px","cursor row":"17","parent tab -
     A                                      panel":"W0051F38_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCTOT2",-
     A                                      "field type":"checkbox","css class"-
     A                                      :"input","css class 2":"checkbox","-
     A                                      value":{"fieldName":"SCTOT2","desig-
     A                                      nValue":"[SCTOT2]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase","dataLength-
     A                                      ":"1"},"text transform":"uppercase"-
     A                                      ,"left":"498px","top":"430px","widt-
     A                                      h":"8px","css class 3":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"css class 4":{"field-
     A                                      Name":"N09","dataType')
     A                                  1  2HTML('":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"read only":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 5":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"set focus":{"fieldName-
     A                                      ":"40","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"error message id":"W-
     A                                      CR1241","error message file":"WMESG-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"69"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error messages":"1 message","pare-
     A                                      nt tab panel":"W0051F38_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted","checked -
     A                                      value":"Y","unchecked value":" "},{-
     A                                      "id":"constant70","field type":"out-
     A                                      put field","value":"Statistical cod-
     A                                      e          :","css class":"constant-
     A                                      ","left":"295px","cursor column":"4-
     A                                      ","top":"450px","cursor row":"18","-
     A                                      parent tab panel":"W0051F38_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCCLS2","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCCLS-
     A                                      2","designValue":"[SCCLS2]","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00","dataL-
     A                                      ength":"5","decPos":"0","numBlankFi-
     A                                      ll":"true"},"left":"498px","cursor -
     A                                      column":"33","top":"450px","cursor -
     A                                      row":"18","width":"36px","text alig-
     A                                      n":"right","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"88","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"err-
     A                                      or message id":"WCR0503","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"85","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","parent tab panel":"W00-
     A                                      51F38_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 6"')
     A                                  1  2HTML(':"profound-converted"},{"id":-
     A                                      "constant71","field type":"output f-
     A                                      ield","value":"Billing calculation -
     A                                      level :","css class":"constant","le-
     A                                      ft":"295px","cursor column":"4","to-
     A                                      p":"470px","cursor row":"19","paren-
     A                                      t tab panel":"W0051F38_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      PLV2","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCPLV2","d-
     A                                      esignValue":"[SCPLV2]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase","dataLe-
     A                                      ngth":"1"},"text transform":"upperc-
     A                                      ase","left":"498px","cursor column"-
     A                                      :"33","top":"470px","cursor row":"1-
     A                                      9","width":"8px","css class 3":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"css class 4"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 5":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "set focus":{"fieldName":"42","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"error message id":"WCR1087","err-
     A                                      or message file":"WMESGG","error me-
     A                                      ssage library":"*LIBL","error condi-
     A                                      tion":{"fieldName":"73","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      ages":"1 message","parent tab panel-
     A                                      ":"W0051F38_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 6":"profou-
     A                                      nd-converted"},{"id":"constant72","-
     A                                      field type":"output field","value":-
     A                                      "Reserve hierarchy for","css class"-
     A                                      :"constant","left":"295px","cursor -
     A                                      column":"4","top":"490px","cursor r-
     A                                      ow":"20","parent tab panel":"W0051F-
     A                                      38_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant73","field typ-
     A                                      e":"output field","value":"(1)","cs-
     A                                      s class":"constant","left":"498px",-
     A                                      "cursor column":"33","top":"490px",-
     A                                      "cursor row":"20","parent tab panel-
     A                                      ":"W0051F38_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCR201","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCR201","designValue"-
     A                                      :"[SCR201]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase","dataLength":"2"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"526px","cursor colu')
     A                                  1  2HTML('mn":"37","top":"490px","curso-
     A                                      r row":"20","width":"15px","css cla-
     A                                      ss 3":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"cs-
     A                                      s class 4":{"fieldName":"N09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"read only":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"css class 5":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"set focus":{"fieldName":-
     A                                      "43","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"WCR-
     A                                      1087","error message file":"WMESGG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"74","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"2 messages","error-
     A                                       message id 2":"WC40029","error mes-
     A                                      sage file 2":"WMESGG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"84","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"parent tab-
     A                                       panel":"W0051F38_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 6":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t74","field type":"output field","v-
     A                                      alue":"(2)","css class":"constant",-
     A                                      "left":"554px","cursor column":"41"-
     A                                      ,"top":"490px","cursor row":"20","p-
     A                                      arent tab panel":"W0051F38_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR202","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCR202-
     A                                      ","designValue":"[SCR202]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase","da-
     A                                      taLength":"2"},"text transform":"up-
     A                                      percase","left":"582px","cursor col-
     A                                      umn":"45","top":"490px","cursor row-
     A                                      ":"20","width":"15px","css class 3"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"css cla-
     A                                      ss 4":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 5":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"set focus":{"fieldName":"44",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFor')
     A                                  1  2HTML('mat":"true / false"},"error m-
     A                                      essage id":"WCR1087","error message-
     A                                       file":"WMESGG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"75","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"1 m-
     A                                      essage","parent tab panel":"W0051F3-
     A                                      8_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed"},{"id":"constant75","field type-
     A                                      ":"output field","value":"(3)","css-
     A                                       class":"constant","left":"610px","-
     A                                      cursor column":"49","top":"490px","-
     A                                      cursor row":"20","parent tab panel"-
     A                                      :"W0051F38_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCR203","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCR203","designValue":-
     A                                      "[SCR203]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase","dataLength":"2"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "638px","cursor column":"53","top":-
     A                                      "490px","cursor row":"20","width":"-
     A                                      15px","css class 3":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"css class 4":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"set focus"-
     A                                      :{"fieldName":"45","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"error me-
     A                                      ssage id":"WCR1087","error message -
     A                                      file":"WMESGG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"76","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"1 me-
     A                                      ssage","parent tab panel":"W0051F38-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 6":"profound-converte-
     A                                      d"},{"id":"constant76","field type"-
     A                                      :"output field","value":"(4)","css -
     A                                      class":"constant","left":"666px","c-
     A                                      ursor column":"57","top":"490px","c-
     A                                      ursor row":"20","parent tab panel":-
     A                                      "W0051F38_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR204","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCR204","designValue":"-
     A                                      [SCR204]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"uppercase","dataLength":"2"},"t-
     A                                      ext transform":"upper')
     A                                  1  2HTML('case","left":"694px","cursor -
     A                                      column":"61","top":"490px","cursor -
     A                                      row":"20","width":"15px","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"css -
     A                                      class 4":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 5":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"set focus":{"fieldName":"4-
     A                                      6","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"error message id":"WCR10-
     A                                      87","error message file":"WMESGG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"77","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"1 message","parent t-
     A                                      ab panel":"W0051F38_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant77","field type":"output field",-
     A                                      "value":"( 5)","css class":"constan-
     A                                      t","left":"722px","cursor column":"-
     A                                      65","top":"490px","cursor row":"20"-
     A                                      ,"parent tab panel":"W0051F38_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCR205","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCR-
     A                                      205","designValue":"[SCR205]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase",-
     A                                      "dataLength":"2"},"text transform":-
     A                                      "uppercase","left":"757px","cursor -
     A                                      column":"70","top":"490px","cursor -
     A                                      row":"20","width":"15px","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"css -
     A                                      class 4":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 5":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"set focus":{"fieldName":"4-
     A                                      7","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"error message id":"WCR10-
     A                                      87","error message file":"WMESGG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"78","da-
     A                                      taType":"expression",')
     A                                  1  2HTML('"formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      1 message","parent tab panel":"W005-
     A                                      1F38_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted"},{"id":"constant78","field t-
     A                                      ype":"output field","value":"  dedu-
     A                                      ctible billings     :","css class":-
     A                                      "constant","left":"295px","cursor c-
     A                                      olumn":"4","top":"510px","cursor ro-
     A                                      w":"21","parent tab panel":"W0051F3-
     A                                      8_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant79","field type-
     A                                      ":"output field","value":"(6)","css-
     A                                       class":"constant","left":"498px","-
     A                                      cursor column":"33","top":"510px","-
     A                                      cursor row":"21","parent tab panel"-
     A                                      :"W0051F38_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCR206","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCR206","designValue":-
     A                                      "[SCR206]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase","dataLength":"2"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "526px","cursor column":"37","top":-
     A                                      "510px","cursor row":"21","width":"-
     A                                      15px","css class 3":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"css class 4":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"set focus"-
     A                                      :{"fieldName":"48","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"error me-
     A                                      ssage id":"WCR1087","error message -
     A                                      file":"WMESGG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"79","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"1 me-
     A                                      ssage","parent tab panel":"W0051F38-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 6":"profound-converte-
     A                                      d"},{"id":"constant80","field type"-
     A                                      :"output field","value":"(7)","css -
     A                                      class":"constant","left":"554px","c-
     A                                      ursor column":"41","top":"510px","c-
     A                                      ursor row":"21","parent tab panel":-
     A                                      "W0051F38_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR207","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCR207","designValue":"-
     A                                      [SCR207]","dataType":"char","format-
     A                                      ting":"Text","trimLea')
     A                                  1  2HTML('ding":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase",-
     A                                      "dataLength":"2"},"text transform":-
     A                                      "uppercase","left":"582px","cursor -
     A                                      column":"45","top":"510px","cursor -
     A                                      row":"21","width":"15px","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"css -
     A                                      class 4":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 5":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"set focus":{"fieldName":"4-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"error message id":"WCR10-
     A                                      87","error message file":"WMESGG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"80","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"1 message","parent t-
     A                                      ab panel":"W0051F38_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant81","field type":"output field",-
     A                                      "value":"(8)","css class":"constant-
     A                                      ","left":"610px","cursor column":"4-
     A                                      9","top":"510px","cursor row":"21",-
     A                                      "parent tab panel":"W0051F38_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCR208","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCR2-
     A                                      08","designValue":"[SCR208]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase","-
     A                                      dataLength":"2"},"text transform":"-
     A                                      uppercase","left":"638px","cursor c-
     A                                      olumn":"53","top":"510px","cursor r-
     A                                      ow":"21","width":"15px","css class -
     A                                      3":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"css c-
     A                                      lass 4":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 5":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"set focus":{"fieldName":"50-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"error message id":"WCR108-
     A                                      7","error message fil')
     A                                  1  2HTML('e":"WMESGG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"81","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"1-
     A                                       message","parent tab panel":"W0051-
     A                                      F38_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"constant82","field ty-
     A                                      pe":"output field","value":"(9)","c-
     A                                      ss class":"constant","left":"666px"-
     A                                      ,"cursor column":"57","top":"510px"-
     A                                      ,"cursor row":"21","parent tab pane-
     A                                      l":"W0051F38_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCR209","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCR209","designValue-
     A                                      ":"[SCR209]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase","dataLength":"2"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"694px","cursor column":"61","top-
     A                                      ":"510px","cursor row":"21","width"-
     A                                      :"15px","css class 3":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"css class 4":{"fieldN-
     A                                      ame":"N09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 5":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"PR","customFalse":""},"set focu-
     A                                      s":{"fieldName":"51","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"error -
     A                                      message id":"WCR1087","error messag-
     A                                      e file":"WMESGG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"82","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"1 -
     A                                      message","parent tab panel":"W0051F-
     A                                      38_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 6":"profound-conver-
     A                                      ted"},{"id":"constant83","field typ-
     A                                      e":"output field","value":"(10)","c-
     A                                      ss class":"constant","left":"722px"-
     A                                      ,"cursor column":"65","top":"510px"-
     A                                      ,"cursor row":"21","parent tab pane-
     A                                      l":"W0051F38_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCR210","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCR210","designValue-
     A                                      ":"[SCR210]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase","dataLength":"2"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"757px","cursor column":"70","top-
     A                                      ":"510px","cursor row')
     A                                  1  2HTML('":"21","width":"15px","css cl-
     A                                      ass 3":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"c-
     A                                      ss class 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"set focus":{"fieldName"-
     A                                      :"52","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"error message id":"WC-
     A                                      R1087","error message file":"WMESGG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"83",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"1 message","paren-
     A                                      t tab panel":"W0051F38_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"co-
     A                                      nstant84","field type":"output fiel-
     A                                      d","value":"ALAE included          -
     A                                         :","css class":"constant","left"-
     A                                      :"295px","cursor column":"4","top":-
     A                                      "530px","cursor row":"22","parent t-
     A                                      ab panel":"W0051F38_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCALA-
     A                                      2","field type":"checkbox","css cla-
     A                                      ss":"input","css class 2":"checkbox-
     A                                      ","value":{"fieldName":"SCALA2","de-
     A                                      signValue":"[SCALA2]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase","dataLen-
     A                                      gth":"1"},"text transform":"upperca-
     A                                      se","left":"498px","top":"530px","w-
     A                                      idth":"8px","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"read only":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       5":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"set -
     A                                      focus":{"fieldName":"53","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"WCR1241","error me-
     A                                      ssage file":"WMESGG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"70","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"1 message","parent')
     A                                  1  2HTML(' tab panel":"W0051F38_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted","chec-
     A                                      ked value":"Y","unchecked value":" -
     A                                      "},{"id":"constant86","field type":-
     A                                      "output field","value":" ","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"N09 and N40","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"570px","cursor row":"24","css cl-
     A                                      ass 2":"BLU","parent tab panel":"W0-
     A                                      051F38_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant85","field-
     A                                       type":"output field","value":" ","-
     A                                      css class":"constant","visibility":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "570px","cursor row":"24","css clas-
     A                                      s 2":"BLU","parent tab panel":"W005-
     A                                      1F38_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant88","field t-
     A                                      ype":"output field","value":" ","cs-
     A                                      s class":"constant","visibility":{"-
     A                                      fieldName":"40","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      281px","cursor column":"2","top":"5-
     A                                      70px","cursor row":"24","css class -
     A                                      2":"BLU","parent tab panel":"W0051F-
     A                                      38_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant87","field typ-
     A                                      e":"output field","value":" ","css -
     A                                      class":"constant","visibility":{"fi-
     A                                      eldName":"or N91 and N09 and N40 an-
     A                                      d N26","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"596px","c-
     A                                      ursor column":"47","top":"570px","c-
     A                                      ursor row":"24","css class 2":"BLU"-
     A                                      ,"parent tab panel":"W0051F38_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DISBLVARA      1A  H
     A            DRYICNURL    128A  H
     A            ERADP2         1A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            INQUIRY_D      1A  H
     A            MSADP2        10A  H
     A            MSGICNURL    128A  H
     A            SCADP2        12S 9H
     A            SCALA2         1A  H
     A            SCAMG2         9S 0H
     A            SCAMP2         9S 0H
     A            SCCLS2         5S 0H
     A            SCDES2        40A  H
     A            SCOCV2         1A  H
     A            SCPCT2        12S 9H
     A            SCPLN2         2A  H
     A            SCPLV2         1A  H
     A            SCR201         2A  H
     A            SCR202         2A  H
     A            SCR203         2A  H
     A            SCR204         2A  H
     A            SCR205         2A  H
     A            SCR206         2A  H
     A            SCR207         2A  H
     A            SCR208         2A  H
     A            SCR209         2A  H
     A            SCR210         2A  H
     A            SCTOT2         1A  H
     A            SCTYP2         1A  H
     A            SCVARA2        1A  H
     A            SCVRB2         1A  H
     A            VISIBAGGRP     1A  H
     A            VISIBVARA      1A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCXDT    R        H      REFFLD(DT8)
     A            SCDIV     R        H      REFFLD(DIV)
     A            SCEDN     R        H      REFFLD(DS50)
     A            SCEFD2    R        H      REFFLD(DT8)
     A            SCEFDT    R        H      REFFLD(DT8)
     A            SCEMP#    R        H      REFFLD(EMP#)
     A            SCEXP2    R        H      REFFLD(DT8)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCNAME    R        H      REFFLD(NM50)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCST      R        H      REFFLD(ST)
     A          R SCR03
     A  10 11 20
     A  21 22 23
     A  24 25 26                            CA01(10 'Response Indicator *IN10')
     A  27 28 29
     A  96 97 09
     A  40 41 94                            CA02(11 'Response Indicator *IN11')
     A  95                                  CA03(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(96 'Response Indicator *IN96')
     A                                      SETOF(97 'Response Indicator *IN97')
     A                                  1  2HTML('QPUIREC3    RROWS      2    C-
     A                                      1    1C2    24 RERRMSGID  5    C6  -
     A                                        SCLIRTC7    WCR0502C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     96RERRMS-
     A                                      GID  5    C6    SCCLALC7    WCR0502-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     97')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN26","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN28","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N29","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN9-
     A                                      6","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN97"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "return cursor record":{"fieldName"-
     A                                      :"HREC","dataLength":"10","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none"},"return -
     A                                      cursor field":{"fieldName":"HFLD","-
     A                                      dataLength":"10","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none"},"valid command ke-
     A                                      y":{"fieldName":"*IN11","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"overlay ran-
     A                                      ge":"1-24"},"items":[{"id":"SCR03_S-
     A                                      CDIV","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"SCDIV","designValue":"[SCDI-
     A                                      V]","refField":"DIV","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"true","-
     A                                      zeroFill":"true","curSym":"","units-
     A                                      ":"","negNum":"-999.00"},"left":"0p-
     A                                      x","top":"-30px","width":"35px","te-
     A                                      xt align":"right","css class":"prof-
     A                                      ound-converted"},{"id":"SCR03_HREC"-
     A                                      ,"field type":"output field","visib-
     A                                      ility":"hidden","value":{"fieldName-
     A                                      ":"HREC","designValue":"[HREC]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransfo')
     A                                  1  2HTML('rm":"none","dataLength":"10"}-
     A                                      ,"left":"0px","top":"-30px","css cl-
     A                                      ass":"profound-converted"},{"id":"S-
     A                                      CR03_SCEMP#","field type":"output f-
     A                                      ield","visibility":"hidden","value"-
     A                                      :{"fieldName":"SCEMP#","designValue-
     A                                      ":"[SCEMP#]","refField":"EMP#","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"true","curSym"-
     A                                      :"","units":"","negNum":"-999.00"},-
     A                                      "left":"0px","top":"-30px","width":-
     A                                      "63px","text align":"right","css cl-
     A                                      ass":"profound-converted"},{"id":"S-
     A                                      CR03_HFLD","field type":"output fie-
     A                                      ld","visibility":"hidden","value":{-
     A                                      "fieldName":"HFLD","designValue":"[-
     A                                      HFLD]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none","dataLength":"10"},"left":"0-
     A                                      px","top":"-30px","css class":"prof-
     A                                      ound-converted"},{"id":"W0051F38_SC-
     A                                      R03_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"W0051F38_SCR03_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"W0051F38_SCR0-
     A                                      3_BtnIconMenuSystemTools","tool tip-
     A                                      ":"System Tools","icon source":"/pr-
     A                                      ofoundui/userdata/images/systool/sy-
     A                                      stools.png","data function":"System-
     A                                      ToolbarSystools","show down arrow":-
     A                                      "Yes"},{"field type":"panel","panel-
     A                                       style":"TransformButtonBar","id":"-
     A                                      W0051F38_SCR03_ButtonBar","top":"35-
     A                                      px","left":"1036px","width":"187px"-
     A                                      ,"height":"28px","css class":"stati-
     A                                      onary","visibility":"hidden","locke-
     A                                      d in place":"true"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in p')
     A                                  1  2HTML('lace":"true","left":"1040px",-
     A                                      "id":"W0051F38_SCR03_BtnSave","tool-
     A                                       tip":"Save","onclick":"SystemToolb-
     A                                      arSave","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      save.png'')"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1066px","id":"W0051F38_SCR03_BtnRe-
     A                                      fresh","tool tip":"Refresh","onclic-
     A                                      k":"SystemToolbarRefresh","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/refresh.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1092px","id":-
     A                                      "W0051F38_SCR03_BtnSearch","tool ti-
     A                                      p":"Search","onclick":"SystemToolba-
     A                                      rSearch","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /search.png'')"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1118px","id":"W0051F38_SCR03_Bt-
     A                                      nDiaryItems","tool tip":"Diary/Work-
     A                                       Items - IDARTS","onclick":"SystemT-
     A                                      oolbarDiary","background image":{"f-
     A                                      ieldName":"DryIcnURL","dataLength":-
     A                                      "128","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"}},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1144px","id":"W0051F38_SCR03_BtnSy-
     A                                      stemMessages","tool tip":"System Me-
     A                                      ssages","onclick":"SystemToolbarMes-
     A                                      sages","background image":{"fieldNa-
     A                                      me":"MsgIcnURL","dataLength":"128",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","te')
     A                                  1  2HTML('xtTransform":"none"}},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1196px","id":"W0051F-
     A                                      38_SCR03_BtnHelp","tool tip":"Help"-
     A                                      ,"onclick":"SystemToolbarHelp","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/help.png'')"-
     A                                      },{"id":"W0051F38_SCR03_ImgSysToolB-
     A                                      ottom","field type":"image","image -
     A                                      source":"/profoundui/userdata/image-
     A                                      s/systool/butbarbot.png","left":"10-
     A                                      36px","top":"64px","width":"187px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"stationary","visibility":"hidden-
     A                                      "},{"id":"W0051F38_SCR03_MainTabPan-
     A                                      el","field type":"tab panel","tab p-
     A                                      anel style":"Transform","tab names"-
     A                                      :{"fieldName":"SCPRDS","designValue-
     A                                      ":"[SCPRDS]","refField":"NAME","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"active tab":"0","left":"250px",-
     A                                      "top":"70px","width":"970px","heigh-
     A                                      t":"657px","z index":"8","locked in-
     A                                       place":"true","css class":"tab-pan-
     A                                      el","css class 2":"stationary"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0051F38_SCR03_-
     A                                      BtnHiddenSave","value":"btnSave","t-
     A                                      op":"100px","response":{"fieldName"-
     A                                      :"btnSave","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant89","fiel-
     A                                      d type":"output field","left":"281p-
     A                                      x","cursor column":"2","top":"110px-
     A                                      ","cursor row":"1","css class":"top-
     A                                      -line","value":"js: currentUser()",-
     A                                      "css class 2":"output-field","paren-
     A                                      t tab panel":"W0051F38_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"SC-
     A                                      R03_SCCONM","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCCONM",-
     A                                      "designValue":"[SCCONM]","refField"-
     A                                      :"NAME","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"414px","cursor colum-
     A                                      n":"21","top":"110px","cursor row":-
     A                                      "1","css class 2":"top-line","descr-
     A                                      iption":"COMPANY NAME","parent tab -
     A                                      panel":"W0051F38_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      90","field type":"output field","le-
     A                                      ft":"778px","cursor column":"73","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass":"top-line","value":"js: curre-
     A                                      ntDate()","css class')
     A                                  1  2HTML(' 2":"output-field","parent ta-
     A                                      b panel":"W0051F38_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"W0051F-
     A                                      38_SCR03_fkeyMenu","field type":"me-
     A                                      nu","left":"10px","top":"120px","he-
     A                                      ight":"350px","width":"230px","hove-
     A                                      r background color":"#9AAA61","hove-
     A                                      r text color":"#FFFFFF","border col-
     A                                      or":"#4C6106","menu option indent":-
     A                                      "10px","background color":"#758B27"-
     A                                      ,"css class":"action-menu","css cla-
     A                                      ss 2":"stationary","z index":"101"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0051F38_SC-
     A                                      R03_BtnHiddenRefresh","value":"btnR-
     A                                      efresh","top":"125px","response":{"-
     A                                      fieldName":"btnRefresh","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"SCR0-
     A                                      3_Q1PGM","field type":"output field-
     A                                      ","value":{"fieldName":"Q1PGM","des-
     A                                      ignValue":"[Q1PGM]","refField":"DS1-
     A                                      0","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"W0051F38_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR03_SCPRDS","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCPR-
     A                                      DS","designValue":"[SCPRDS]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"414px","cursor c-
     A                                      olumn":"21","top":"130px","cursor r-
     A                                      ow":"2","description":"PROGRAM NAME-
     A                                      ","parent tab panel":"W0051F38_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","v-
     A                                      isibility":"hidden","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t91","field type":"output field","v-
     A                                      alue":"SCR03","css class":"constant-
     A                                      ","left":"799px","cursor column":"7-
     A                                      6","top":"130px","cursor row":"2","-
     A                                      parent tab panel":"W0051F38_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant92","field type":"output-
     A                                       field","value":"Group:","css class-
     A                                      ":"constant","left":"281px","cursor-
     A                                       column":"2","top":"150px","cursor -
     A                                      row":"3","parent tab panel":"W0051F-
     A                                      38_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCR03_SCFND","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCFND","designValue":"[SCFND]-
     A                                      ","refField":"FND","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00"},"css class"-
     A                                      :"output-field","left')
     A                                  1  2HTML('":"337px","cursor column":"10-
     A                                      ","top":"150px","cursor row":"3","w-
     A                                      idth":"21px","text align":"right","-
     A                                      parent tab panel":"W0051F38_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCR03_SCNAME","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCN-
     A                                      AME","designValue":"[SCNAME]","refF-
     A                                      ield":"NM50","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"372px","cursor -
     A                                      column":"15","top":"150px","cursor -
     A                                      row":"3","description":"FUND NAME",-
     A                                      "parent tab panel":"W0051F38_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCR03_SCMODE","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      MODE","designValue":"[SCMODE]","ref-
     A                                      Field":"NM10","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"764px","cursor-
     A                                       column":"71","top":"150px","cursor-
     A                                       row":"3","css class 2":"HI","visib-
     A                                      ility":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"hidden","customFalse":"v-
     A                                      isible"},"description":"ADD/UPDATE -
     A                                      MODE","parent tab panel":"W0051F38_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W0051F38_-
     A                                      SCR03_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant93","field type":"output field",-
     A                                      "value":"Emp #:","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"170px","cursor row":"4"-
     A                                      ,"parent tab panel":"W0051F38_SCR03-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCR03_SCEDN","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      EDN","designValue":"[SCEDN]","refFi-
     A                                      eld":"DS50","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"337px","cursor c-
     A                                      olumn":"10","top":"170px","cursor r-
     A                                      ow":"4","parent tab panel":"W0051F3-
     A                                      8_SCR03_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant94","field type-
     A                                      ":"output field","value":"Cx Date:"-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"41","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible /')
     A                                  1  2HTML(' hidden"},"left":"701px","cur-
     A                                      sor column":"62","top":"170px","cur-
     A                                      sor row":"4","parent tab panel":"W0-
     A                                      051F38_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCR03_SCCXDT","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCCXDT","designValue":"[-
     A                                      SCCXDT]","refField":"DT8","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"tr-
     A                                      ue","zeroFill":"true","curSym":"","-
     A                                      units":"","negNum":"-999.00","edtWr-
     A                                      d":"''  /  /    ''"},"css class":"o-
     A                                      utput-field","visibility":{"fieldNa-
     A                                      me":"41","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"764px",-
     A                                      "cursor column":"71","top":"170px",-
     A                                      "cursor row":"4","width":"70px","te-
     A                                      xt align":"right","parent tab panel-
     A                                      ":"W0051F38_SCR03_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0051F38_SCR03_BtnHiddenDiaryIte-
     A                                      ms","value":"btnDiary","top":"175px-
     A                                      ","response":{"fieldName":"btnDiary-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W0051F38_S-
     A                                      CR03_BtnHiddenSystemMessages","valu-
     A                                      e":"btnMessage","top":"200px","resp-
     A                                      onse":{"fieldName":"btnMessage","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant95","field type":"outpu-
     A                                      t field","value":"Claims liability -
     A                                      rate  :","css class":"constant","vi-
     A                                      sibility":{"fieldName":"94","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"281px","cursor column":-
     A                                      "2","top":"210px","cursor row":"6",-
     A                                      "parent tab panel":"W0051F38_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCLIRT","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCLI-
     A                                      RT","designValue":"[SCLIRT]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"true","zeroBalance":"true-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"999.00","dataLen-
     A                                      gth":"10","decPos":"9","numBlankFil-
     A                                      l":"true"},"left":"456px","cursor c-
     A                                      olumn":"27","top":"210px","cursor r-
     A                                      ow":"6","width":"78px","text align"-
     A                                      :"right","css class 3":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"css class 4":{"field-
     A                                      Name":"N09 and 94","d')
     A                                  1  2HTML('ataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"N94 or 09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 5":-
     A                                      {"fieldName":"N94 or 09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"v-
     A                                      isibility":{"fieldName":"N94","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"hidden","customFals-
     A                                      e":"visible"},"error message id":"W-
     A                                      CR0502","error message file":"WMESG-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"96"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error messages":"1 message","pare-
     A                                      nt tab panel":"W0051F38_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0051F38_SCR03_BtnHi-
     A                                      ddenWorkSubmitJob","value":"btnWrks-
     A                                      bmjob","top":"225px","response":{"f-
     A                                      ieldName":"btnWrkJob","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt96","field type":"output field","-
     A                                      value":"Claims allowance amount:","-
     A                                      css class":"constant","visibility":-
     A                                      {"fieldName":"95","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "230px","cursor row":"7","parent ta-
     A                                      b panel":"W0051F38_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCCLAL-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCCLAL","desig-
     A                                      nValue":"[SCCLAL]","dataType":"zone-
     A                                      d","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"-999.00","dataLength":"9-
     A                                      ","decPos":"0","numBlankFill":"true-
     A                                      "},"left":"456px","cursor column":"-
     A                                      27","top":"230px","cursor row":"7",-
     A                                      "width":"64px","text align":"right"-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"css class 4":{"fieldName":"N-
     A                                      09 and 95","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"read only":{"fi-
     A                                      eldName":"N95 or 09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 5":{"fieldName":"N95 or 09","da-
     A                                      taType":"expression",')
     A                                  1  2HTML('"formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"visibilit-
     A                                      y":{"fieldName":"N95","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"hidden","customFalse":"visi-
     A                                      ble"},"error message id":"WCR0502",-
     A                                      "error message file":"WMESGG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"97","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"1 message","parent tab p-
     A                                      anel":"W0051F38_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0051F38_SCR03_BtnHiddenWork-
     A                                      PrinterOutput","value":"btnWrkprtou-
     A                                      t","top":"250px","response":{"field-
     A                                      Name":"btnWrkPrnt","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0051F38_SCR03_BtnHiddenImag-
     A                                      eQueue","value":"btnImgQue","top":"-
     A                                      275px","response":{"fieldName":"btn-
     A                                      ImgQue","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W005-
     A                                      1F38_SCR03_BtnHiddenHelp","value":"-
     A                                      btnHelp","top":"300px","response":{-
     A                                      "fieldName":"btnHelp","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt99","field type":"output field","-
     A                                      value":" ","css class":"constant","-
     A                                      visibility":{"fieldName":"40","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"281px","cursor column-
     A                                      ":"2","top":"570px","cursor row":"2-
     A                                      4","css class 2":"BLU","parent tab -
     A                                      panel":"W0051F38_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      97","field type":"output field","va-
     A                                      lue":" ","css class":"constant","vi-
     A                                      sibility":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"281px","cursor column":-
     A                                      "2","top":"570px","cursor row":"24"-
     A                                      ,"css class 2":"BLU","parent tab pa-
     A                                      nel":"W0051F38_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant98-
     A                                      ","field type":"output field","valu-
     A                                      e":" ","css class":"constant","visi-
     A                                      bility":{"fieldName":"or N91 and N0-
     A                                      9 and N40","dataType"')
     A                                  1  2HTML(':"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"281px","cursor colum-
     A                                      n":"2","top":"570px","cursor row":"-
     A                                      24","css class 2":"BLU","parent tab-
     A                                       panel":"W0051F38_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"btnSubm-
     A                                      it","field type":"button","value":"-
     A                                      Enter","shortcut key":"Enter","left-
     A                                      ":"14px","top":"150px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF03","field-
     A                                       type":"button","visibility":{"fiel-
     A                                      dName":"09 or or N91 and N09 and N4-
     A                                      0 or 40","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"value":"Exit",-
     A                                      "shortcut key":"F3","left":"14px","-
     A                                      top":"183px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF05","field type":"bu-
     A                                      tton","visibility":{"fieldName":"N0-
     A                                      9 and N40","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"value":"Refr-
     A                                      esh","shortcut key":"F5","left":"14-
     A                                      px","top":"216px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF10","field type-
     A                                      ":"button","visibility":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"value":"Search"-
     A                                      ,"shortcut key":"F10","left":"14px"-
     A                                      ,"top":"249px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnCF12","field type":"-
     A                                      button","visibility":{"fieldName":"-
     A                                      09 or or N91 and N09 and N40 or 40"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"value":"Cancel","short-
     A                                      cut key":"F12","left":"14px","top":-
     A                                      "282px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnHELP","field type":"button"-
     A                                      ,"shortcut key":"Alt-F1","bypass va-
     A                                      lidation":"true","value":"HELP","re-
     A                                      sponse":{"fieldName":"*IN10","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"left":-
     A                                      "14px","top":"315px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            SCCLAL         9S 0H
     A            SCLIRT        10S 9H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCXDT    R        H      REFFLD(DT8)
     A            SCDIV     R        H      REFFLD(DIV)
     A            SCEDN     R        H      REFFLD(DS50)
     A            SCEMP#    R        H      REFFLD(EMP#)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCNAME    R        H      REFFLD(NM50)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R KUWDW
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RWINDOW    0     -
     A                                      RROWS      2    C1    1C1    7 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"KUWDW","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"6","window left":"7","valid comm-
     A                                      and key":{"fieldName":"*IN11","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"overl-
     A                                      ay range":"1-7"},"items":[{"id":"KU-
     A                                      WDW","field type":"panel","panel st-
     A                                      yle":"Transform Dialog","text align-
     A                                      ":"center","left":"5px","top":"5px"-
     A                                      ,"height":"290px","width":"506px","-
     A                                      z index":"8","locked in place":"tru-
     A                                      e"},{"id":"constant100","field type-
     A                                      ":"output field","left":"29px","cur-
     A                                      sor column":"2","top":"65px","curso-
     A                                      r row":"1","value":"js: currentUser-
     A                                      ()","css class":"output-field","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"KUWDW_SCCONM","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      CONM","designValue":"[SCCONM]","ref-
     A                                      Field":"NAME","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"120px","cursor-
     A                                       column":"15","top":"65px","cursor -
     A                                      row":"1","css class 2":"HI","descri-
     A                                      ption":"COMPANY NAME","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant101","field type":"output field"-
     A                                      ,"left":"421px","cursor column":"58-
     A                                      ","top":"65px","cursor row":"1","va-
     A                                      lue":"js: currentDate()","css class-
     A                                      ":"output-field","css class 2":"pro-
     A                                      found-converted"},{"id":"KUWDW_Q1PG-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"Q1PGM","designVal-
     A                                      ue":"[Q1PGM]","refField":"DS10","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"29px","cursor column":"2","top"-
     A                                      :"85px","cursor row":"2","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant102","field type":"output fie-
     A                                      ld","value":"Clear Data","css class-
     A                                      ":"constant","left":"225px","cursor-
     A                                       column":"30","top":"85px","cursor -
     A                                      row":"2","css class 2":"HI","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant103","field type":"output -
     A                                      field","value":"KUWDW","css class":-
     A                                      "constant","left":"442px","cursor c-
     A                                      olumn":"61","top":"85px","cursor ro-
     A                                      w":"2","css class 2":"profound-conv-
     A                                      erted"},{"id":"constant104","field -
     A                                      type":"output field","value":"This -
     A                                      will clear data on ALL screens.  Pr-
     A                                      ess Enter to continue.","css class"-
     A                                      :"constant","left":"36px","cursor c-
     A                                      olumn":"3","top":"145px","cursor ro-
     A                                      w":"5","css class 2":"HI","css clas-
     A                                      s 3":"profound-converted"},{"id":"b-
     A                                      tnSubmit","field type":"button","va-
     A                                      lue":"Enter","shortcu')
     A                                  1  2HTML('t key":"Enter","left":"14px",-
     A                                      "top":"250px","width":"80px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF12","field type":"bu-
     A                                      tton","value":"Cancel","shortcut ke-
     A                                      y":"F12","left":"104px","top":"250p-
     A                                      x","width":"80px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnHELP","field type":"button","shor-
     A                                      tcut key":"Alt-F1","bypass validati-
     A                                      on":"true","value":"HELP","response-
     A                                      ":{"fieldName":"*IN10","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"left":"194px-
     A                                      ","top":"250px","width":"80px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","visibility":"h-
     A                                      idden","cursor":"default"}]}')
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A          R AGGWDW
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    14 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"AGGWDW","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"show as window":"true","window to-
     A                                      p":"6","window left":"7","valid com-
     A                                      mand key":{"fieldName":"*IN11","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"over-
     A                                      lay range":"1-14"},"items":[{"id":"-
     A                                      AGGWDW","field type":"panel","panel-
     A                                       style":"Transform Dialog","text al-
     A                                      ign":"center","left":"5px","top":"5-
     A                                      px","height":"430px","width":"506px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true"},{"id":"constant105","field t-
     A                                      ype":"output field","left":"29px","-
     A                                      cursor column":"2","top":"65px","cu-
     A                                      rsor row":"1","value":"js: currentU-
     A                                      ser()","css class":"output-field","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"AGGWDW_SCCONM","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCCONM","designValue":"[SCCONM]",-
     A                                      "refField":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"120px","cu-
     A                                      rsor column":"15","top":"65px","cur-
     A                                      sor row":"1","css class 2":"HI","de-
     A                                      scription":"COMPANY NAME","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant106","field type":"output fi-
     A                                      eld","left":"421px","cursor column"-
     A                                      :"58","top":"65px","cursor row":"1"-
     A                                      ,"value":"js: currentDate()","css c-
     A                                      lass":"output-field","css class 2":-
     A                                      "profound-converted"},{"id":"AGGWDW-
     A                                      _Q1PGM","field type":"output field"-
     A                                      ,"value":{"fieldName":"Q1PGM","desi-
     A                                      gnValue":"[Q1PGM]","refField":"DS10-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"29px","cursor column":"2",-
     A                                      "top":"85px","cursor row":"2","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant107","field type":"outpu-
     A                                      t field","value":"Aggregate Conflic-
     A                                      t","css class":"constant","left":"1-
     A                                      90px","cursor column":"25","top":"8-
     A                                      5px","cursor row":"2","css class 2"-
     A                                      :"HI","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant108","field t-
     A                                      ype":"output field","value":"AGGWDW-
     A                                      ","css class":"constant","left":"43-
     A                                      5px","cursor column":"60","top":"85-
     A                                      px","cursor row":"2","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt109","field type":"output field",-
     A                                      "value":"The aggregate entered here-
     A                                      :","css class":"constant","left":"3-
     A                                      6px","cursor column":"3","top":"145-
     A                                      px","cursor row":"5","css class 2":-
     A                                      "HI","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant110","field ty-
     A                                      pe":"output field","value":"Aggrega-
     A                                      te:","css class":"con')
     A                                  1  2HTML('stant","left":"50px","cursor -
     A                                      column":"5","top":"165px","cursor r-
     A                                      ow":"6","css class 2":"profound-con-
     A                                      verted"},{"id":"SCAGG1","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCAGG1","designValue":"[SCAGG1]-
     A                                      ","dataType":"zoned","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"false","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"999.00-
     A                                      ","dataLength":"9","decPos":"0"},"c-
     A                                      ss class":"output-field","left":"12-
     A                                      7px","cursor column":"16","top":"16-
     A                                      5px","cursor row":"6","width":"63px-
     A                                      ","text align":"right","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant111","field type":"output field-
     A                                      ","value":"is different from:","css-
     A                                       class":"constant","left":"36px","c-
     A                                      ursor column":"3","top":"205px","cu-
     A                                      rsor row":"8","css class 2":"HI","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant112","field type":"ou-
     A                                      tput field","value":"Division :","c-
     A                                      ss class":"constant","left":"50px",-
     A                                      "cursor column":"5","top":"225px","-
     A                                      cursor row":"9","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCAGGDIV","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCAGGDIV","designValu-
     A                                      e":"[SCAGGDIV]","refField":"DIV","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"false","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"127px","cursor column":"16","to-
     A                                      p":"225px","cursor row":"9","width"-
     A                                      :"35px","text align":"right","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant113","field type":"output-
     A                                       field","value":"Aggregate:","css c-
     A                                      lass":"constant","left":"50px","cur-
     A                                      sor column":"5","top":"245px","curs-
     A                                      or row":"10","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCAGG2","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCAGG2","designValue":"[SC-
     A                                      AGG2]","dataType":"zoned","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"false","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"9-
     A                                      99.00","dataLength":"9","decPos":"0-
     A                                      "},"css class":"output-field","left-
     A                                      ":"127px","cursor column":"16","top-
     A                                      ":"245px","cursor row":"10","width"-
     A                                      :"63px","text align":"right","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant114","field type":"output-
     A                                       field","value":"Use ''Continue'' f-
     A                                      unction to accept this value.","css-
     A                                       class":"constant","left":"36px","c-
     A                                      ursor column":"3","top":"285px","cu-
     A                                      rsor row":"12","css class 2":"BLU",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"btnSubmit","field type":"bu-
     A                                      tton","value":"Enter","shortcut key-
     A                                      ":"Enter","left":"14px","top":"390p-
     A                                      x","width":"80px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF07","field type":')
     A                                  1  2HTML('"button","value":"Continue","-
     A                                      shortcut key":"F7","left":"104px","-
     A                                      top":"390px","width":"80px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF12","field type":"but-
     A                                      ton","value":"Cancel","shortcut key-
     A                                      ":"F12","left":"194px","top":"390px-
     A                                      ","width":"80px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nHELP","field type":"button","short-
     A                                      cut key":"Alt-F1","bypass validatio-
     A                                      n":"true","value":"HELP","response"-
     A                                      :{"fieldName":"*IN10","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"left":"284px"-
     A                                      ,"top":"390px","width":"80px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","visibility":"hi-
     A                                      dden","cursor":"default"}]}')
     A            SCAGG1         9S 0H
     A            SCAGG2         9S 0H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCAGGDIV  R        H      REFFLD(DIV)
     A            SCCONM    R        H      REFFLD(NAME)
     A          R UPDALL
     A  10 11 91
     A  98                                  CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC3    RWINDOW    0     -
     A                                      RROWS      2    C1    1C1    7 RERR-
     A                                      MSGID  5    C5    SCUPDC7    WCR050-
     A                                      1C6    WMESGGC5    *LIBLC0    E1   -
     A                                       3     98')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"UPDALL","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"show as window":"true","window to-
     A                                      p":"6","window left":"7","valid com-
     A                                      mand key":{"fieldName":"*IN11","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"over-
     A                                      lay range":"1-7"},"items":[{"id":"U-
     A                                      PDALL","field type":"panel","panel -
     A                                      style":"Transform Dialog","text ali-
     A                                      gn":"center","left":"5px","top":"5p-
     A                                      x","height":"310px","width":"506px"-
     A                                      ,"z index":"8","locked in place":"t-
     A                                      rue"},{"id":"constant115","field ty-
     A                                      pe":"output field","left":"29px","c-
     A                                      ursor column":"2","top":"65px","cur-
     A                                      sor row":"1","value":"js: currentUs-
     A                                      er()","css class":"output-field","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"UPDALL_SCCONM","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCCONM","designValue":"[SCCONM]","-
     A                                      refField":"NAME","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"120px","cur-
     A                                      sor column":"15","top":"65px","curs-
     A                                      or row":"1","css class 2":"HI","des-
     A                                      cription":"COMPANY NAME","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant116","field type":"output fie-
     A                                      ld","left":"421px","cursor column":-
     A                                      "58","top":"65px","cursor row":"1",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass":"output-field","css class 2":"-
     A                                      profound-converted"},{"id":"UPDALL_-
     A                                      Q1PGM","field type":"output field",-
     A                                      "value":{"fieldName":"Q1PGM","desig-
     A                                      nValue":"[Q1PGM]","refField":"DS10"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"29px","cursor column":"2","-
     A                                      top":"85px","cursor row":"2","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant117","field type":"output-
     A                                       field","value":"UPDALL","css class-
     A                                      ":"constant","left":"435px","cursor-
     A                                       column":"60","top":"85px","cursor -
     A                                      row":"2","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant118","fiel-
     A                                      d type":"output field","value":"Upd-
     A                                      ate all policies within this group -
     A                                           :","css class":"constant","vis-
     A                                      ibility":{"fieldName":"91","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"36px","cursor column":"3-
     A                                      ","top":"145px","cursor row":"5","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant119","field type":"ou-
     A                                      tput field","value":"Update all div-
     A                                      isions                  (Y/N):","cs-
     A                                      s class":"constant","visibility":{"-
     A                                      fieldName":"N91","dataType":"expres-
     A                                      sion","formatting":"I')
     A                                  1  2HTML('ndicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"36px","cursor -
     A                                      column":"3","top":"145px","cursor r-
     A                                      ow":"5","css class 2":"profound-con-
     A                                      verted"},{"id":"SCUPD","field type"-
     A                                      :"checkbox","css class":"input","cs-
     A                                      s class 2":"checkbox","value":{"fie-
     A                                      ldName":"SCUPD","designValue":"[SCU-
     A                                      PD]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase","dataLength":"1"},"text t-
     A                                      ransform":"uppercase","left":"358px-
     A                                      ","top":"145px","width":"8px","css -
     A                                      class 3":"HI","css class 4":"UL","e-
     A                                      rror message id":"WCR0501","error m-
     A                                      essage file":"WMESGG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"98","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"1 message","css class 5":"profou-
     A                                      nd-converted","checked value":"Y","-
     A                                      unchecked value":"N"},{"id":"btnSub-
     A                                      mit","field type":"button","value":-
     A                                      "Enter","shortcut key":"Enter","lef-
     A                                      t":"14px","top":"270px","width":"80-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF12","field-
     A                                       type":"button","value":"Cancel","s-
     A                                      hortcut key":"F12","left":"104px","-
     A                                      top":"270px","width":"80px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnHELP","field type":"but-
     A                                      ton","shortcut key":"Alt-F1","bypas-
     A                                      s validation":"true","value":"HELP"-
     A                                      ,"response":{"fieldName":"*IN10","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"le-
     A                                      ft":"194px","top":"270px","width":"-
     A                                      80px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","visi-
     A                                      bility":"hidden","cursor":"default"-
     A                                      }]}')
     A            SCUPD          1A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A          R KVWDW
     A  10 11 91
     A  98                                  CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    14 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"KVWDW","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"6","window left":"7","valid comm-
     A                                      and key":{"fieldName":"*IN11","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"overl-
     A                                      ay range":"1-14"},"items":[{"id":"K-
     A                                      VWDW","field type":"panel","panel s-
     A                                      tyle":"Transform Dialog","text alig-
     A                                      n":"center","left":"5px","top":"5px-
     A                                      ","height":"430px","width":"506px",-
     A                                      "z index":"8","locked in place":"tr-
     A                                      ue"},{"id":"constant120","field typ-
     A                                      e":"output field","left":"29px","cu-
     A                                      rsor column":"2","top":"65px","curs-
     A                                      or row":"1","value":"js: currentUse-
     A                                      r()","css class":"output-field","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"KVWDW_SCCONM","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CCONM","designValue":"[SCCONM]","re-
     A                                      fField":"NAME","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"120px","curso-
     A                                      r column":"15","top":"65px","cursor-
     A                                       row":"1","css class 2":"HI","descr-
     A                                      iption":"COMPANY NAME","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant121","field type":"output field-
     A                                      ","left":"421px","cursor column":"5-
     A                                      8","top":"65px","cursor row":"1","v-
     A                                      alue":"js: currentDate()","css clas-
     A                                      s":"output-field","css class 2":"pr-
     A                                      ofound-converted"},{"id":"KVWDW_Q1P-
     A                                      GM","field type":"output field","va-
     A                                      lue":{"fieldName":"Q1PGM","designVa-
     A                                      lue":"[Q1PGM]","refField":"DS10","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"29px","cursor column":"2","top-
     A                                      ":"85px","cursor row":"2","css clas-
     A                                      s 2":"profound-converted"},{"id":"c-
     A                                      onstant122","field type":"output fi-
     A                                      eld","value":"KVWDW","css class":"c-
     A                                      onstant","left":"442px","cursor col-
     A                                      umn":"61","top":"85px","cursor row"-
     A                                      :"2","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant124","field ty-
     A                                      pe":"output field","value":"Divisio-
     A                                      ns might exist that do not have Lar-
     A                                      ge Deductible plan.","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "N91","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"36px","cur-
     A                                      sor column":"3","top":"145px","curs-
     A                                      or row":"5","css class 2":"profound-
     A                                      -converted"},{"id":"constant123","f-
     A                                      ield type":"output field","value":"-
     A                                      Policies might exist that do not ha-
     A                                      ve a Large Deductible plan.","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"91","dataTyp')
     A                                  1  2HTML('e":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"left":"36px","cursor colu-
     A                                      mn":"3","top":"145px","cursor row":-
     A                                      "5","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant125","field typ-
     A                                      e":"output field","value":"Press Su-
     A                                      bmit or Cancel.","css class":"const-
     A                                      ant","left":"36px","cursor column":-
     A                                      "3","top":"185px","cursor row":"7",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"constant126","field type":"-
     A                                      output field","value":"An exception-
     A                                       report will be generated.","css cl-
     A                                      ass":"constant","left":"36px","curs-
     A                                      or column":"3","top":"225px","curso-
     A                                      r row":"9","css class 2":"profound--
     A                                      converted"},{"id":"constant127","fi-
     A                                      eld type":"output field","value":"D-
     A                                      etail will be written to WXL7P in l-
     A                                      ibrary","css class":"constant","lef-
     A                                      t":"36px","cursor column":"3","top"-
     A                                      :"265px","cursor row":"11","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCLIB","field type":"output field",-
     A                                      "value":{"fieldName":"SCLIB","desig-
     A                                      nValue":"[SCLIB]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"left":"344px","cursor column":"4-
     A                                      7","top":"265px","cursor row":"11",-
     A                                      "css class":"profound-converted"},{-
     A                                      "id":"constant128","field type":"ou-
     A                                      tput field","value":"Press Submit o-
     A                                      r Cancel to proceed.","css class":"-
     A                                      constant","left":"36px","cursor col-
     A                                      umn":"3","top":"305px","cursor row"-
     A                                      :"13","css class 2":{"fieldName":"9-
     A                                      8","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"visibility":{"fieldName-
     A                                      ":"N98","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"hidden-
     A                                      ","customFalse":"visible"},"css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      btnSubmit","field type":"button","v-
     A                                      alue":"Enter","shortcut key":"Enter-
     A                                      ","left":"14px","top":"390px","widt-
     A                                      h":"80px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF07",-
     A                                      "field type":"button","value":"Subm-
     A                                      it","shortcut key":"F7","left":"104-
     A                                      px","top":"390px","width":"80px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnCF12","field type"-
     A                                      :"button","value":"Cancel","shortcu-
     A                                      t key":"F12","left":"194px","top":"-
     A                                      390px","width":"80px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnHELP","field type":"button","-
     A                                      shortcut key":"Alt-F1","bypass vali-
     A                                      dation":"true","value":"HELP","resp-
     A                                      onse":{"fieldName":"*IN10","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"left":"2-
     A                                      84px","top":"390px","')
     A                                  1  2HTML('width":"80px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","visibility":"hidden","cur-
     A                                      sor":"default"}]}')
     A            SCLIB         10A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
