     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(01)
     A*PUI                                  SFLDEFINE(02)
     A          R SCR01S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A  08        QPUI000001     1A  O  2  2
     A            SCAFTR        39A  H
     A            SCBFOR        39A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  01 02 03
     A  04 21 22
     A  23 24 25                            CA01(01 'Response Indicator *IN01')
     A  26 27 28
     A  29 58 71
     A  91 92 93                            CA02(02 'Response Indicator *IN02')
     A  94 95                               CA03
     A                                  1  2HTML('QPUICTL1    SCR01S    5    RS-
     A                                      FLDSP    0    E1    3     04RSFLDSP-
     A                                      CTL 0    E1    3    N03RSFLCLR    0-
     A                                          E1    3     03RSFLPAG    1    C-
     A                                      2    11 RSFLSIZ    1    C2    12 1 -
     A                                         RSFLNXTCHG 0    E1    3     087 -
     A                                         ROVERLAY   0     RROWS      2   -
     A                                       C1    1C2    22 RSFLMSGID  4    C7-
     A                                          CPD6A81C7    QCPFMSGC5    *LIBL-
     A                                      C0    E1    3     92RSFLMSGID  4   -
     A                                       C7    CPD6A7CC7    QCPFMSGC5    *L-
     A                                      IBLC0    E1    3     93RERRMSGID  5-
     A                                          C6    SCCONMC7    CPF5203C7    -
     A                                      QCPFMSGC5    *LIBLC0    E1    3    -
     A                                       91RERRMSGID  5    C6    SCCONMC7  -
     A                                        CPF5204C7    QCPFMSGC5    *LIBLC0-
     A                                          E1    3     94RERRMSGID  5    C-
     A                                      6    SCDES1C7    WCR0503C6    WMESG-
     A                                      GC5    *LIBLC0    E1    3     71')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","error message id-
     A                                      ":"CPD6A81","error message file":"Q-
     A                                      CPFMSG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"92","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"2 messages"-
     A                                      ,"error message id 2":"CPD6A7C","er-
     A                                      ror message file 2":"QCPFMSG","erro-
     A                                      r message library 2":"*LIBL","error-
     A                                       condition 2":{"fieldName":"93","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"ov-
     A                                      erlay range":"1-22"},"items":[{"id"-
     A                                      :"SCPST6","field type":"output fiel-
     A                                      d","visibility":{"fieldName":"26","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"value":{"fieldName":"SCP-
     A                                      ST6","designValue":"[SCPST6]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none","data-
     A                                      Length":"1"},"left":"0px","top":"-3-
     A                                      0px","css class":"profound-converte-
     A                                      d"},{"id":"SFLMOD","field type":"ou-
     A                                      tput field","visibility":"hidden","-
     A                                      value":{"fieldName":"SFLMOD","desig-
     A                                      nValue":"[SFLMOD]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"none","dataLength":"1"-
     A                                      },"left":"0px","top":"-30px","css c-
     A                                      lass":"profound-converted"},{"id":"-
     A                                      SCPST4","field type":"output field"-
     A                                      ,"visibility":{"fieldName":"24","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"value":{"fieldName":"SCPST-
     A                                      4","designValue":"[SCPST4]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"none","dataLe-
     A                                      ngth":"1"},"left":"0px","top":"-30p-
     A                                      x","css class":"profound-converted"-
     A                                      },{"id":"SCOPL1","field type":"outp-
     A                                      ut field","visibility":"hidden","va-
     A                                      lue":{"fieldName":"SCOPL1","designV-
     A                                      alue":"[SCOPL1]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none","dataLength":"76"}-
     A                                      ,"left":"0px","top":"-30px","css cl-
     A                                      ass":"profound-converted"},{"id":"S-
     A                                      CPST3","field type":"output field",-
     A                                      "visibility":{"fieldName":"23","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"value":{"fieldName":"SCPST3-
     A                                      ","designValue":"[SCPST3]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"none","dataLen-
     A                                      gth":"1"},"left":"0px","top":"-30px-
     A                                      ","css class":"profound-converted"}-
     A                                      ,{"id":"SCPST9","field type":"outpu-
     A                                      t field","visibility":{"fieldName":-
     A                                      "29","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"value":{"fieldName-
     A                                      ":"SCPST9","designValue":"[SCPST9]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      ,"dataLength":"1"},"left":"0px","to-
     A                                      p":"-30px","css class":"profound-co-
     A                                      nverted"},{"id":"SCPST2","field typ-
     A                                      e":"output field","visibility":{"fi-
     A                                      eldName":"22","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"value":{"-
     A                                      fieldName":"SCPST2","designValue":"-
     A                                      [SCPST2]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"none","dataLength":"1"},"left":-
     A                                      "0px","top":"-30px","css class":"pr-
     A                                      ofound-converted"},{"id":"SCPST7","-
     A                                      field type":"output field","visibil-
     A                                      ity":{"fieldName":"27","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      value":{"fieldName":"SCPST7","desig-
     A                                      nValue":"[SCPST7]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"none","dataLength":"1"-
     A                                      },"left":"0px","top":"-30px","css c-
     A                                      lass":"profound-converted"},{"id":"-
     A                                      SCRRN1","field type":"output field"-
     A                                      ,"visibility":"hidden","value":{"fi-
     A                                      eldName":"SCRRN1","designValue":"[S-
     A                                      CRRN1]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"true",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","dataLength":"4","decPos":"0-
     A                                      "},"left":"0px","top":"-30px","widt-
     A                                      h":"28px","text align":"right","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"SCEMP#","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"SCEMP#","designValue":"-
     A                                      [SCEMP#]","refField":"EMP#","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      true","zeroFill":"true","curSym":""-
     A                                      ,"units":"","negNum":"-999.00"},"le-
     A                                      ft":"0px","top":"-30px","width":"63-
     A                                      px","text align":"right","css class-
     A                                      ":"profound-converted"},{"id":"SCDI-
     A                                      V","field type":"output field","vis-
     A                                      ibility":"hidden","value":')
     A                                  1  4HTML('{"fieldName":"SCDIV","designV-
     A                                      alue":"[SCDIV]","refField":"DIV","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"true","zeroFill":"true","curSy-
     A                                      m":"","units":"","negNum":"-999.00"-
     A                                      },"left":"0px","top":"-30px","width-
     A                                      ":"35px","text align":"right","css -
     A                                      class":"profound-converted"},{"id":-
     A                                      "SCPST1","field type":"output field-
     A                                      ","visibility":{"fieldName":"21","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"value":{"fieldName":"SCPS-
     A                                      T1","designValue":"[SCPST1]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none","dataL-
     A                                      ength":"1"},"left":"0px","top":"-30-
     A                                      px","css class":"profound-converted-
     A                                      "},{"id":"SCPST8","field type":"out-
     A                                      put field","visibility":{"fieldName-
     A                                      ":"28","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"value":{"fieldNa-
     A                                      me":"SCPST8","designValue":"[SCPST8-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e","dataLength":"1"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"SCOPL2","field t-
     A                                      ype":"output field","visibility":"h-
     A                                      idden","value":{"fieldName":"SCOPL2-
     A                                      ","designValue":"[SCOPL2]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"none","dataLen-
     A                                      gth":"76"},"left":"0px","top":"-30p-
     A                                      x","css class":"profound-converted"-
     A                                      },{"id":"SCPST5","field type":"outp-
     A                                      ut field","visibility":{"fieldName"-
     A                                      :"25","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"value":{"fieldNam-
     A                                      e":"SCPST5","designValue":"[SCPST5]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"1"},"left":"0px","t-
     A                                      op":"-30px","css class":"profound-c-
     A                                      onverted"},{"id":"W0051F17_SCR01C_a-
     A                                      vKeys","field type":"output field",-
     A                                      "value":{"fieldName":"AV_KEYS","dat-
     A                                      aLength":"1134","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[AV_KEYS]"},"left":"0px","top":"0-
     A                                      px","visibility":"hidden"},{"id":"W-
     A                                      0051F17_SCR01C_action","field type"-
     A                                      :"html container","white space":"no-
     A                                      rmal","left":"0px","top":"10px","wi-
     A                                      dth":"230px","css class":"action-pa-
     A                                      nel-converted","height":"700px","ht-
     A                                      ml":"<div class=\"top\"></div><div -
     A                                      class=\"imagetop\"><img src=\"/prof-
     A                                      oundui/userdata/images/bar_top.png\-
     A                                      " /></div><div class=\"menulinks\">-
     A                                      </div><div class=\"imagebottom\"><i-
     A                                      mg src=\"/profoundui/userdata/image-
     A                                      s/bar_bottom.png\" /></div><div cla-
     A                                      ss=\"bottom\"></div>"},{"field type-
     A                                      ":"icon menu button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"32px","z index":"20",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1170px","id":"W0051F17_SCR01C_B-
     A                                      tnIconMenuSystemTools","tool tip":"-
     A                                      System Tools","icon alignment":"mid-
     A                                      dle left","icon width":"16px","icon-
     A                                       height":"24px","icon source":"/pro-
     A                                      foundui/userdata/images/systool/sys-
     A                                      tools.png","data function":"SystemT-
     A                                      oolbarSystools","show down arrow":"-
     A                                      Yes"},{"field type":"panel","panel -
     A                                      style":"TransformButtonBar","id":"W-
     A                                      0051F17_SCR01C_ButtonBar","top":"35-
     A                                      px","left":"1036px","width":"187px"-
     A                                      ,"height":"28px","css class":"stati-
     A                                      onary","visibility":"hidden","locke-
     A                                      d in place":"true"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1040px","id":"W0051F17_SCR01-
     A                                      C_BtnSave","tool tip":"Save","oncli-
     A                                      ck":"SystemToolbarSave","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/save.png'')"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1066px","id":"W005-
     A                                      1F17_SCR01C_BtnRefresh","tool tip":-
     A                                      "Refresh","onclick":"SystemToolbarR-
     A                                      efresh","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      refresh.png'')"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bott')
     A                                  1  5HTML('om style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1092px","id":"W0-
     A                                      051F17_SCR01C_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"W0051F17_SCR01C_Btn-
     A                                      DiaryItems","tool tip":"Diary/Work -
     A                                      Items - IDARTS","onclick":"SystemTo-
     A                                      olbarDiary","background image":{"fi-
     A                                      eldName":"DryIcnURL","dataLength":"-
     A                                      128","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"}},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1144px","id":"W0051F17_SCR01C_BtnSy-
     A                                      stemMessages","tool tip":"System Me-
     A                                      ssages","onclick":"SystemToolbarMes-
     A                                      sages","background image":{"fieldNa-
     A                                      me":"MsgIcnURL","dataLength":"128",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"}},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1196p-
     A                                      x","id":"W0051F17_SCR01C_BtnHelp","-
     A                                      tool tip":"Help","onclick":"SystemT-
     A                                      oolbarHelp","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/help.png'')"},{"id":"W0051F17_S-
     A                                      CR01C_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"W0051F17-
     A                                      _SCR01C_MainTabPanel","field type":-
     A                                      "tab panel","tab panel style":"Tran-
     A                                      sform","tab names":{"fieldName":"SC-
     A                                      PRDS","designValue":"[SCPRDS]","ref-
     A                                      Field":"NAME","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"active tab":"-
     A                                      0","left":"250px","top":"70px","wid-
     A                                      th":"970px","height":"657px","z ind-
     A                                      ex":"8","locked in place":"true","c-
     A                                      ss class":"tab-panel","css class 2"-
     A                                      :"stationary"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0051F17_SCR01C_BtnHiddenSave","-
     A                                      value":"btnSave","top":"100px","res-
     A                                      ponse":{"fieldName":"btnSave","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant1","field type":"output f-
     A                                      ield","left":"281px","cursor column-
     A                                      ":"2","top":"110px","cursor row":"1-
     A                                      ","css class":"top-line","value":"j-
     A                                      s: currentUser()","css class 2":"ou-
     A                                      tput-field","parent tab panel":"W00-
     A                                      51F17_SCR01C_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCCONM","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCCONM","designValue":"[SCCONM-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"414px",-
     A                                      "cursor column":"21","top":"110px",-
     A                                      "cursor row":"1","css class 2":"top-
     A                                      -line","css class 3":"HI","error me-
     A                                      ssage id":"CPF5203","error message -
     A                                      file":"QCPFMSG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"91","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"2 m-
     A                                      essages","error message id 2":"CPF5-
     A                                      204","error message file 2":"QCPFMS-
     A                                      G","error message library 2":"*LIBL-
     A                                      ","error condition 2":{"fieldName":-
     A                                      "94","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"W0051F17_S-
     A                                      CR01C_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant2","field type":"-
     A                                      output field","left":"778px","curso-
     A                                      r column":"73","top":"110px","curso-
     A                                      r row":"1","css class":"top-line","-
     A                                      value":"js: currentDate()"')
     A                                  1  6HTML(',"css class 2":"output-field"-
     A                                      ,"parent tab panel":"W0051F17_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"W0051F17_SCR01C_fkeyMenu","fi-
     A                                      eld type":"menu","left":"10px","top-
     A                                      ":"120px","height":"350px","width":-
     A                                      "230px","hover background color":"#-
     A                                      9AAA61","hover text color":"#FFFFFF-
     A                                      ","border color":"#4C6106","menu op-
     A                                      tion indent":"10px","background col-
     A                                      or":"#758B27","css class":"action-m-
     A                                      enu","css class 2":"stationary","z -
     A                                      index":"101"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0051F17_SCR01C_BtnHiddenRefresh"-
     A                                      ,"value":"btnRefresh","top":"125px"-
     A                                      ,"response":{"fieldName":"btnRefres-
     A                                      h","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"Q1PGM","field type":"outp-
     A                                      ut field","value":{"fieldName":"Q1P-
     A                                      GM","designValue":"[Q1PGM]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none","dataL-
     A                                      ength":"10"},"css class":"output-fi-
     A                                      eld","left":"281px","cursor column"-
     A                                      :"2","top":"130px","cursor row":"2"-
     A                                      ,"parent tab panel":"W0051F17_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCPRDS","field type":"output -
     A                                      field","value":{"fieldName":"SCPRDS-
     A                                      ","designValue":"[SCPRDS]","refFiel-
     A                                      d":"NAME","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"414px","cursor col-
     A                                      umn":"21","top":"130px","cursor row-
     A                                      ":"2","css class 2":"HI","parent ta-
     A                                      b panel":"W0051F17_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","visibility":-
     A                                      "hidden","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant3","field -
     A                                      type":"output field","value":"SCR01-
     A                                      ","css class":"constant","left":"79-
     A                                      9px","cursor column":"76","top":"13-
     A                                      0px","cursor row":"2","parent tab p-
     A                                      anel":"W0051F17_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      4","field type":"output field","val-
     A                                      ue":"Group:","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"150px","cursor row":"3","pa-
     A                                      rent tab panel":"W0051F17_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCFND","field type":"output field-
     A                                      ","value":{"fieldName":"SCFND","des-
     A                                      ignValue":"[SCFND]","refField":"FND-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"99-
     A                                      9.00"},"css class":"output-field","-
     A                                      left":"337px","cursor column":"10",-
     A                                      "top":"150px","cursor row":"3","wid-
     A                                      th":"21px","text align":"right","pa-
     A                                      rent tab panel":"W0051F17_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCNAME","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCNAME","d-
     A                                      esignValue":"[SCNAME]","refField":"-
     A                                      NM60","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"372px","cursor column"-
     A                                      :"15","top":"150px","cursor row":"3-
     A                                      ","description":"NAME","parent tab -
     A                                      panel":"W0051F17_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0051F17_SCR01C_BtnHiddenS-
     A                                      earch","value":"btnSearch","top":"1-
     A                                      50px","response":{"fieldName":"btnS-
     A                                      earch","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant5","field typ-
     A                                      e":"output field","value":"Emp #:",-
     A                                      "css class":"constant","left":"281p-
     A                                      x","cursor column":"2","top":"170px-
     A                                      ","cursor row":"4","parent tab pane-
     A                                      l":"W0051F17_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCEDN","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCEDN","designValue":"[S-
     A                                      CEDN]","refField":"DS50","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"337-
     A                                      px","cursor column":"10","top":"170-
     A                                      px","cursor row":"4","parent tab pa-
     A                                      nel":"W0051F17_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"constant6-
     A                                      ","field type":"output field","valu-
     A                                      e":"Cx Date:","css class":"constant-
     A                                      ","visibility":{"fieldName":"58","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"left":"701px","cursor col-
     A                                      umn":"62","top":"170px","cursor row-
     A                                      ":"4","parent tab panel":"W0051F17_-
     A                                      SCR01C_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound')
     A                                  1  7HTML('-converted"},{"id":"SCCXDT","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCCXDT","designValue"-
     A                                      :"[SCCXDT]","refField":"DT8","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00","ed-
     A                                      tWrd":"''  /  /    ''"},"css class"-
     A                                      :"output-field","visibility":{"fiel-
     A                                      dName":"58","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"764p-
     A                                      x","cursor column":"71","top":"170p-
     A                                      x","cursor row":"4","width":"70px",-
     A                                      "text align":"right","parent tab pa-
     A                                      nel":"W0051F17_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0051F17_SCR01C_BtnHiddenDia-
     A                                      ryItems","value":"btnDiary","top":"-
     A                                      175px","response":{"fieldName":"btn-
     A                                      Diary","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant7","field typ-
     A                                      e":"output field","value":"Agt #:",-
     A                                      "css class":"constant","left":"281p-
     A                                      x","cursor column":"2","top":"190px-
     A                                      ","cursor row":"5","parent tab pane-
     A                                      l":"W0051F17_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCAGT#","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCAGT#","designValue":"-
     A                                      [SCAGT#]","refField":"AGT#","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00"},"c-
     A                                      ss class":"output-field","left":"33-
     A                                      7px","cursor column":"10","top":"19-
     A                                      0px","cursor row":"5","width":"35px-
     A                                      ","text align":"right","parent tab -
     A                                      panel":"W0051F17_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCANAM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCANAM","designValu-
     A                                      e":"[SCANAM]","refField":"NM20","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"386px","cursor column":"17","to-
     A                                      p":"190px","cursor row":"5","parent-
     A                                       tab panel":"W0051F17_SCR01C_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant8","field type":"output field-
     A                                      ","value":"Producer:","css class":"-
     A                                      constant","left":"575px","cursor co-
     A                                      lumn":"44","top":"190px","cursor ro-
     A                                      w":"5","parent tab panel":"W0051F17-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCPROD","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCPROD","designValue":"[SCPROD]","r-
     A                                      efField":"AGT#","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"999.00"},"css class":"o-
     A                                      utput-field","left":"652px","cursor-
     A                                       column":"55","top":"190px","cursor-
     A                                       row":"5","width":"35px","text alig-
     A                                      n":"right","parent tab panel":"W005-
     A                                      1F17_SCR01C_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCPNAM","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCPNAM","designValue":"[SCPNAM]-
     A                                      ","refField":"NM20","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"694px","-
     A                                      cursor column":"61","top":"190px","-
     A                                      cursor row":"5","parent tab panel":-
     A                                      "W0051F17_SCR01C_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0051F17_SCR01C_BtnHiddenSystemMe-
     A                                      ssages","value":"btnMessage","top":-
     A                                      "200px","response":{"fieldName":"bt-
     A                                      nMessage","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant9","field -
     A                                      type":"output field","value":"Endor-
     A                                      sement Effective Date:","css class"-
     A                                      :"constant","left":"281px","cursor -
     A                                      column":"2","top":"210px","cursor r-
     A                                      ow":"6","parent tab panel":"W0051F1-
     A                                      7_SCR01C_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCEEDT","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCEEDT","designValue":"[SCEEDT]","-
     A                                      refField":"DT8","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"true","zeroF-
     A                                      ill":"true","curSym":"","units":"",-
     A                                      "negNum":"-999.00","edtWrd":"''  / -
     A                                       /    ''"},"css class":"output-fiel-
     A                                      d","left":"477px","cursor column":"-
     A                                      30","top":"210px","cursor row":"6",-
     A                                      "width":"70px","text align":"right"-
     A                                      ,"parent tab panel":"W0051F17_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "field type":"button","lef')
     A                                  1  8HTML('t":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0051F17_SCR01C_BtnHiddenWorkSubm-
     A                                      itJob","value":"btnWrksbmjob","top"-
     A                                      :"225px","response":{"fieldName":"b-
     A                                      tnWrkJob","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant10","field-
     A                                       type":"output field","value":"Misc-
     A                                      ellaneous Endorsement Description",-
     A                                      "css class":"constant","left":"281p-
     A                                      x","cursor column":"2","top":"230px-
     A                                      ","cursor row":"7","css class 2":"B-
     A                                      LU","parent tab panel":"W0051F17_SC-
     A                                      R01C_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"SCDES1","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCDES1","designValue":"[SCDES1]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","dataLength":"60"},"left-
     A                                      ":"295px","cursor column":"4","top"-
     A                                      :"250px","cursor row":"8","width":"-
     A                                      421px","css class 3":"UL","css clas-
     A                                      s 4":"HI","set focus":"true","error-
     A                                       message id":"WCR0503","error messa-
     A                                      ge file":"WMESGG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"71","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"1-
     A                                       message","parent tab panel":"W0051-
     A                                      F17_SCR01C_MainTabPanel","parent ta-
     A                                      b":"0","css class 5":"profound-conv-
     A                                      erted"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W005-
     A                                      1F17_SCR01C_BtnHiddenWorkPrinterOut-
     A                                      put","value":"btnWrkprtout","top":"-
     A                                      250px","response":{"fieldName":"btn-
     A                                      WrkPrnt","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"SCDES2","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCDES2","designValue":"[SCD-
     A                                      ES2]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","dataLength":"60"-
     A                                      },"left":"295px","cursor column":"4-
     A                                      ","top":"270px","cursor row":"9","w-
     A                                      idth":"421px","css class 3":"UL","p-
     A                                      arent tab panel":"W0051F17_SCR01C_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 4":"profound-converted"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W0051F17_SCR01C_-
     A                                      BtnHiddenImageQueue","value":"btnIm-
     A                                      gQue","top":"275px","response":{"fi-
     A                                      eldName":"btnImgQue","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0051F17_SCR01C_BtnHiddenH-
     A                                      elp","value":"btnHelp","top":"300px-
     A                                      ","response":{"fieldName":"btnHelp"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"SCHDL1","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCHD-
     A                                      L1","designValue":"[SCHDL1]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none","data-
     A                                      Length":"78"},"css class":"output-f-
     A                                      ield","left":"281px","cursor column-
     A                                      ":"2","top":"310px","cursor row":"1-
     A                                      1","css class 2":"HI","parent tab p-
     A                                      anel":"W0051F17_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted","css class 4":"s-
     A                                      ubfile-heading"},{"id":"SCR01S","fi-
     A                                      eld type":"grid","number of columns-
     A                                      ":"2","record format name":"SCR01S"-
     A                                      ,"subfile next changed":{"fieldName-
     A                                      ":"08","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"display subfile":{"f-
     A                                      ieldName":"04","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"display cont-
     A                                      rol record":{"fieldName":"N03","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"clear subfile":{"fieldName":"03-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"subfile size":"12","place-
     A                                       cursor":"true","header height":"20-
     A                                      ","row height":"20","css class":"su-
     A                                      bfilegrid","css class 2":"profound--
     A                                      converted","parent tab panel":"W005-
     A                                      1F17_SCR01C_MainTabPanel","parent t-
     A                                      ab":"0","subfile end":{"fieldName":-
     A                                      "95","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"page down response":{"-
     A                                      fieldName":"*IN01","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"page up response-
     A                                      ":{"fieldName":"*IN02","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"show paging -
     A                                      controls":"true","scrollbar":"none"-
     A                                      ,"number of rows":"12","top":"310px-
     A                                      ","left":"276px","column widths":"2-
     A                                      80,308","return mode":{"fi')
     A                                  1  9HTML('eldName":"SFLMOD","dataLength-
     A                                      ":"1","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"subfile record number":{"fi-
     A                                      eldName":"SCRRN1","designValue":"[S-
     A                                      CRRN1]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"true",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","dataLength":"4","decPos":"0-
     A                                      "}},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px","top":"1-
     A                                      50px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF03","field type":"button","-
     A                                      value":"F3","shortcut key":"F3","le-
     A                                      ft":"14px","top":"183px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF12","fie-
     A                                      ld type":"button","value":"Cancel",-
     A                                      "shortcut key":"F12","left":"14px",-
     A                                      "top":"216px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"SCDBRR","field type":"ou-
     A                                      tput field","visibility":"hidden","-
     A                                      value":{"fieldName":"SCDBRR","desig-
     A                                      nValue":"[SCDBRR]","dataType":"zone-
     A                                      d","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"true","curSym":"","units":"","-
     A                                      negNum":"-999.00","dataLength":"9",-
     A                                      "decPos":"0"},"left":"-58px","top":-
     A                                      "-359px","width":"63px","text align-
     A                                      ":"right","css class":"profound-con-
     A                                      verted","grid":"SCR01S","column":"0-
     A                                      "},{"id":"SCSEL","field type":"outp-
     A                                      ut field","visibility":"hidden","va-
     A                                      lue":{"fieldName":"SCSEL","designVa-
     A                                      lue":"[SCSEL]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none","dataLength":"2"},"l-
     A                                      eft":"-45px","top":"-359px","descri-
     A                                      ption":"Selection Field","css class-
     A                                      ":"profound-converted","grid":"SCR0-
     A                                      1S","column":"0"},{"id":"SCBFOR","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCBFOR","designVal-
     A                                      ue":"[SCBFOR]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","dataLen-
     A                                      gth":"39"},"left":"5px","cursor col-
     A                                      umn":"2","top":"1px","cursor row":"-
     A                                      12","width":"274px","description":"-
     A                                      BEFORE VALUE","css class 3":"profou-
     A                                      nd-converted","grid":"SCR01S","colu-
     A                                      mn":"0"},{"id":"SCAFTR","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCAFTR","designValue":"[SCA-
     A                                      FTR]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","dataLength":"39"-
     A                                      },"left":"5px","cursor column":"42"-
     A                                      ,"top":"1px","cursor row":"12","wid-
     A                                      th":"274px","description":"AFTER VA-
     A                                      LUE","css class 3":"profound-conver-
     A                                      ted","grid":"SCR01S","column":"1"}]-
     A                                      }')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCDES1        60A  H
     A            SCDES2        60A  H
     A            SCHDL1        78A  H
     A            SCOPL1        76A  H
     A            SCOPL2        76A  H
     A            SCPST1         1A  H
     A            SCPST2         1A  H
     A            SCPST3         1A  H
     A            SCPST4         1A  H
     A            SCPST5         1A  H
     A            SCPST6         1A  H
     A            SCPST7         1A  H
     A            SCPST8         1A  H
     A            SCPST9         1A  H
     A            SCRRN1         4S 0H
     A            SFLMOD         1A  H
     A            SCAGT#    R        H      REFFLD(AGT#)
     A            SCANAM    R        H      REFFLD(NM20)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCXDT    R        H      REFFLD(DT8)
     A            SCDIV     R        H      REFFLD(DIV)
     A            SCEDN     R        H      REFFLD(DS50)
     A            SCEEDT    R        H      REFFLD(DT8)
     A            SCEMP#    R        H      REFFLD(EMP#)
     A            SCFND     R        H      REFFLD(FND)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCPNAM    R        H      REFFLD(NM20)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPROD    R        H      REFFLD(AGT#)
     A          R SCR01
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","overlay range":"2-
     A                                      4-24"},"items":[{"id":"SCFKL2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      FKL2","designValue":"[SCFKL2]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"78"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"W0051F17_SCR01_avKeys"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"AV_KEYS","dataLengt-
     A                                      h":"1134","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[AV_-
     A                                      KEYS]"},"left":"0px","top":"0px","v-
     A                                      isibility":"hidden"},{"id":"W0051F1-
     A                                      7_SCR01_action","field type":"html -
     A                                      container","white space":"normal","-
     A                                      left":"0px","top":"10px","width":"2-
     A                                      30px","css class":"action-panel-con-
     A                                      verted","height":"700px","html":"<d-
     A                                      iv class=\"top\"></div><div class=\-
     A                                      "imagetop\"><img src=\"/profoundui/-
     A                                      userdata/images/bar_top.png\" /></d-
     A                                      iv><div class=\"menulinks\"></div><-
     A                                      div class=\"imagebottom\"><img src=-
     A                                      \"/profoundui/userdata/images/bar_b-
     A                                      ottom.png\" /></div><div class=\"bo-
     A                                      ttom\"></div>"},{"field type":"icon-
     A                                       menu button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"32px","z index":"20","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"117-
     A                                      0px","id":"W0051F17_SCR01_BtnIconMe-
     A                                      nuSystemTools","tool tip":"System T-
     A                                      ools","icon alignment":"middle left-
     A                                      ","icon width":"16px","icon height"-
     A                                      :"24px","icon source":"/profoundui/-
     A                                      userdata/images/systool/systools.pn-
     A                                      g","data function":"SystemToolbarSy-
     A                                      stools","show down arrow":"Yes"},{"-
     A                                      field type":"panel","panel style":"-
     A                                      TransformButtonBar","id":"W0051F17_-
     A                                      SCR01_ButtonBar","top":"35px","left-
     A                                      ":"1036px","width":"187px","height"-
     A                                      :"28px","css class":"stationary","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"10-
     A                                      40px","id":"W0051F17_SCR01_BtnSave"-
     A                                      ,"tool tip":"Save","onclick":"Syste-
     A                                      mToolbarSave","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/save.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1066px","id":"W0051F17_SCR01-
     A                                      _BtnRefresh","tool tip":"Refresh","-
     A                                      onclick":"SystemToolbarRefresh","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/refresh.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1092px"-
     A                                      ,"id":"W0051F17_SCR01_BtnSearch","t-
     A                                      ool tip":"Search","onclick":"System-
     A                                      ToolbarSearch","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/search.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1118px","id":"W0051F17_SC-
     A                                      R01_BtnDiaryItems","tool tip":"Diar-
     A                                      y/Work Items - IDARTS","onclick":"S-
     A                                      ystemToolbarDiary","background imag-
     A                                      e":{"fieldName":"DryIcnURL","dataLe-
     A                                      ngth":"128","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none"}},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","vis')
     A                                  1  4HTML('ibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "W0051F17_SCR01_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"W0051-
     A                                      F17_SCR01_BtnHelp","tool tip":"Help-
     A                                      ","onclick":"SystemToolbarHelp","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/help.png'')-
     A                                      "},{"id":"W0051F17_SCR01_ImgSysTool-
     A                                      Bottom","field type":"image","image-
     A                                       source":"/profoundui/userdata/imag-
     A                                      es/systool/butbarbot.png","left":"1-
     A                                      036px","top":"64px","width":"187px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n"},{"id":"W0051F17_SCR01_MainTabPa-
     A                                      nel","field type":"tab panel","tab -
     A                                      panel style":"Transform","tab names-
     A                                      ":"Tab 1","active tab":"0","left":"-
     A                                      250px","top":"70px","width":"970px"-
     A                                      ,"height":"657px","z index":"8","lo-
     A                                      cked in place":"true","css class":"-
     A                                      tab-panel","css class 2":"stationar-
     A                                      y"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W0051F17-
     A                                      _SCR01_BtnHiddenSave","value":"btnS-
     A                                      ave","top":"100px","response":{"fie-
     A                                      ldName":"btnSave","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"W0051F17_S-
     A                                      CR01_fkeyMenu","field type":"menu",-
     A                                      "left":"10px","top":"120px","height-
     A                                      ":"350px","width":"230px","hover ba-
     A                                      ckground color":"#9AAA61","hover te-
     A                                      xt color":"#FFFFFF","border color":-
     A                                      "#4C6106","menu option indent":"10p-
     A                                      x","background color":"#758B27","cs-
     A                                      s class":"action-menu","css class 2-
     A                                      ":"stationary","z index":"101"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0051F17_SCR01_-
     A                                      BtnHiddenRefresh","value":"btnRefre-
     A                                      sh","top":"125px","response":{"fiel-
     A                                      dName":"btnRefresh","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W0051F17_SCR01_BtnHiddenSea-
     A                                      rch","value":"btnSearch","top":"150-
     A                                      px","response":{"fieldName":"btnSea-
     A                                      rch","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W0051F1-
     A                                      7_SCR01_BtnHiddenDiaryItems","value-
     A                                      ":"btnDiary","top":"175px","respons-
     A                                      e":{"fieldName":"btnDiary","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0051F17_SCR01_BtnHi-
     A                                      ddenSystemMessages","value":"btnMes-
     A                                      sage","top":"200px","response":{"fi-
     A                                      eldName":"btnMessage","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0051F17_SCR01_BtnHiddenW-
     A                                      orkSubmitJob","value":"btnWrksbmjob-
     A                                      ","top":"225px","response":{"fieldN-
     A                                      ame":"btnWrkJob","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0051F17_SCR01_BtnHiddenWorkPr-
     A                                      interOutput","value":"btnWrkprtout"-
     A                                      ,"top":"250px","response":{"fieldNa-
     A                                      me":"btnWrkPrnt","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0051F17_SCR01_BtnHiddenImageQ-
     A                                      ueue","value":"btnImgQue","top":"27-
     A                                      5px","response":{"fieldName":"btnIm-
     A                                      gQue","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px",')
     A                                  1  5HTML('"width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0051F17_SCR01_BtnHiddenHe-
     A                                      lp","value":"btnHelp","top":"300px"-
     A                                      ,"response":{"fieldName":"btnHelp",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"SCFKL1","field type":"output-
     A                                       field","value":{"fieldName":"SCFKL-
     A                                      1","designValue":"[SCFKL1]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none","dataL-
     A                                      ength":"78"},"css class":"output-fi-
     A                                      eld","left":"281px","cursor column"-
     A                                      :"2","top":"570px","cursor row":"24-
     A                                      ","css class 2":"BLU","parent tab p-
     A                                      anel":"W0051F17_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","visibility":"hid-
     A                                      den","css class 3":"profound-conver-
     A                                      ted"},{"id":"btnSubmit","field type-
     A                                      ":"button","value":"Enter","shortcu-
     A                                      t key":"Enter","left":"14px","top":-
     A                                      "150px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnPAGEDOWN","field type":"but-
     A                                      ton","value":"Page Down","shortcut -
     A                                      key":"PageDown","response":{"fieldN-
     A                                      ame":"*IN01","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"left":"14px","top":"18-
     A                                      3px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnPAGEUP","field type":"button",-
     A                                      "value":"Page Up","shortcut key":"P-
     A                                      ageUp","response":{"fieldName":"*IN-
     A                                      02","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"left":"14px","top":"216px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFKL1        78A  H
     A            SCFKL2        78A  H
     A          R SCR02S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            SCDATA        70A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCSF1R         4S 0H
     A          R QSFLCTL002                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  01 02 13
     A  14 15                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR02S    5    RS-
     A                                      FLDSP    0    E1    3     14RSFLDSP-
     A                                      CTL 0    E1    3    N13RSFLCLR    0-
     A                                          E1    3     13RSFLPAG    1    C-
     A                                      2    14 RSFLSIZ    1    C2    15 1 -
     A                                         RSFLNXTCHG 0     2    ROVERLAY  -
     A                                       0     RROWS      2    C1    1C2   -
     A                                       21 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","overlay range":"-
     A                                      1-21"},"items":[{"id":"SCRRN2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      RRN2","designValue":"[SCRRN2]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"4","decPos":"0"},"left":"0-
     A                                      px","top":"-30px","width":"28px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted"},{"id":"W0051F17_S-
     A                                      CR02C_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"W0051F17_SCR02C_action","fiel-
     A                                      d type":"html container","white spa-
     A                                      ce":"normal","left":"0px","top":"10-
     A                                      px","width":"230px","css class":"ac-
     A                                      tion-panel-converted","height":"700-
     A                                      px","html":"<div class=\"top\"></di-
     A                                      v><div class=\"imagetop\"><img src=-
     A                                      \"/profoundui/userdata/images/bar_t-
     A                                      op.png\" /></div><div class=\"menul-
     A                                      inks\"></div><div class=\"imagebott-
     A                                      om\"><img src=\"/profoundui/userdat-
     A                                      a/images/bar_bottom.png\" /></div><-
     A                                      div class=\"bottom\"></div>"},{"fie-
     A                                      ld type":"icon menu button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"32px","z index-
     A                                      ":"20","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1170px","id":"W0051F17_S-
     A                                      CR02C_BtnIconMenuSystemTools","tool-
     A                                       tip":"System Tools","icon alignmen-
     A                                      t":"middle left","icon width":"16px-
     A                                      ","icon height":"24px","icon source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/systools.png","data function":"-
     A                                      SystemToolbarSystools","show down a-
     A                                      rrow":"Yes"},{"field type":"panel",-
     A                                      "panel style":"TransformButtonBar",-
     A                                      "id":"W0051F17_SCR02C_ButtonBar","t-
     A                                      op":"35px","left":"1036px","width":-
     A                                      "187px","height":"28px","css class"-
     A                                      :"stationary","visibility":"hidden"-
     A                                      ,"locked in place":"true"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1040px","id":"W0051F1-
     A                                      7_SCR02C_BtnSave","tool tip":"Save"-
     A                                      ,"onclick":"SystemToolbarSave","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/save.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1066px","id-
     A                                      ":"W0051F17_SCR02C_BtnRefresh","too-
     A                                      l tip":"Refresh","onclick":"SystemT-
     A                                      oolbarRefresh","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/refresh.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1092px","id":"W0051F17_S-
     A                                      CR02C_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"W0051F17_SCR02C_BtnDiaryIte-
     A                                      ms","tool tip":"Diary/Work Items - -
     A                                      IDARTS","onclick":"SystemToolbarDia-
     A                                      ry","background image":{"fieldName"-
     A                                      :"DryIcnURL","dataLength":"128","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"}},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right sty')
     A                                  1  4HTML('le":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1144px","id":"W0051F17_SCR02-
     A                                      C_BtnSystemMessages","tool tip":"Sy-
     A                                      stem Messages","onclick":"SystemToo-
     A                                      lbarMessages","background image":{"-
     A                                      fieldName":"MsgIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1196px","id":"W0051F17_SCR02C_Btn-
     A                                      Help","tool tip":"Help","onclick":"-
     A                                      SystemToolbarHelp","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/help.png'')"},{"id":"W00-
     A                                      51F17_SCR02C_ImgSysToolBottom","fie-
     A                                      ld type":"image","image source":"/p-
     A                                      rofoundui/userdata/images/systool/b-
     A                                      utbarbot.png","left":"1036px","top"-
     A                                      :"64px","width":"187px","locked in -
     A                                      place":"true","css class":"stationa-
     A                                      ry","visibility":"hidden"},{"id":"W-
     A                                      0051F17_SCR02C_MainTabPanel","field-
     A                                       type":"tab panel","tab panel style-
     A                                      ":"Transform","tab names":{"fieldNa-
     A                                      me":"SCPRD2","designValue":"[SCPRD2-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"active-
     A                                       tab":"0","left":"250px","top":"70p-
     A                                      x","width":"970px","height":"657px"-
     A                                      ,"z index":"8","locked in place":"t-
     A                                      rue","css class":"tab-panel","css c-
     A                                      lass 2":"stationary"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0051F17_SCR02C_BtnHidden-
     A                                      Save","value":"btnSave","top":"100p-
     A                                      x","response":{"fieldName":"btnSave-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant11","field type":"-
     A                                      output field","left":"281px","curso-
     A                                      r column":"2","top":"110px","cursor-
     A                                       row":"1","css class":"top-line","v-
     A                                      alue":"js: currentUser()","css clas-
     A                                      s 2":"output-field","parent tab pan-
     A                                      el":"W0051F17_SCR02C_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"SCR02C_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","parent tab panel":"W0051F17_-
     A                                      SCR02C_MainTabPanel","parent tab":"-
     A                                      0","css class 4":"profound-converte-
     A                                      d"},{"id":"constant12","field type"-
     A                                      :"output field","left":"778px","cur-
     A                                      sor column":"73","top":"110px","cur-
     A                                      sor row":"1","css class":"top-line"-
     A                                      ,"value":"js: currentDate()","css c-
     A                                      lass 2":"output-field","parent tab -
     A                                      panel":"W0051F17_SCR02C_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"W0051F1-
     A                                      7_SCR02C_fkeyMenu","field type":"me-
     A                                      nu","left":"10px","top":"120px","he-
     A                                      ight":"350px","width":"230px","hove-
     A                                      r background color":"#9AAA61","hove-
     A                                      r text color":"#FFFFFF","border col-
     A                                      or":"#4C6106","menu option indent":-
     A                                      "10px","background color":"#758B27"-
     A                                      ,"css class":"action-menu","css cla-
     A                                      ss 2":"stationary","z index":"101"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0051F17_SC-
     A                                      R02C_BtnHiddenRefresh","value":"btn-
     A                                      Refresh","top":"125px","response":{-
     A                                      "fieldName":"btnRefresh","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"SCR-
     A                                      02C_Q1PGM","field type":"output fie-
     A                                      ld","value":{"fieldName":"Q1PGM","d-
     A                                      esignValue":"[Q1PGM]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"10"},"css class":"output-field","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"130px","cursor row":"2","pare-
     A                                      nt tab panel":"W0051F17_SCR02C_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCPRD2","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCPRD2","des-
     A                                      ignValue":"[SCPRD2]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"130px","cursor row":"2",-
     A                                      "css class 2":"HI","parent')
     A                                  1  5HTML(' tab panel":"W0051F17_SCR02C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant13","field type":"outpu-
     A                                      t field","value":"SCR02","css class-
     A                                      ":"constant","left":"799px","cursor-
     A                                       column":"76","top":"130px","cursor-
     A                                       row":"2","parent tab panel":"W0051-
     A                                      F17_SCR02C_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W005-
     A                                      1F17_SCR02C_BtnHiddenSearch","value-
     A                                      ":"btnSearch","top":"150px","respon-
     A                                      se":{"fieldName":"btnSearch","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "constant14","field type":"output f-
     A                                      ield","value":"Press Enter to confi-
     A                                      rm your choices for 4=Delete.","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"170px","c-
     A                                      ursor row":"4","css class 2":"BLU",-
     A                                      "parent tab panel":"W0051F17_SCR02C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0051F17_SCR02-
     A                                      C_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t15","field type":"output field","v-
     A                                      alue":"Press F12 to return to chang-
     A                                      e your choices.","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"190px","cursor row":"5"-
     A                                      ,"css class 2":"BLU","parent tab pa-
     A                                      nel":"W0051F17_SCR02C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0051F17_SCR02C_BtnHiddenSys-
     A                                      temMessages","value":"btnMessage","-
     A                                      top":"200px","response":{"fieldName-
     A                                      ":"btnMessage","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0051F17_SCR02C_BtnHiddenWorkSub-
     A                                      mitJob","value":"btnWrksbmjob","top-
     A                                      ":"225px","response":{"fieldName":"-
     A                                      btnWrkJob","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"SCR02C_SCHDL1","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCHDL1","designValue":-
     A                                      "[SCHDL1]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"none","dataLength":"78"},"left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"230px","cursor row":"7","css clas-
     A                                      s":"HI","parent tab panel":"W0051F1-
     A                                      7_SCR02C_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted","css class 3":"subfile-heading-
     A                                      "},{"id":"SCR02S","field type":"gri-
     A                                      d","number of columns":"2","record -
     A                                      format name":"SCR02S","subfile next-
     A                                       changed":"true","display subfile":-
     A                                      {"fieldName":"14","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"display c-
     A                                      ontrol record":{"fieldName":"N13","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"clear subfile":{"fieldName":-
     A                                      "13","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"subfile size":"15","he-
     A                                      ader height":"20","row height":"20"-
     A                                      ,"css class":"subfilegrid","css cla-
     A                                      ss 2":"profound-converted","parent -
     A                                      tab panel":"W0051F17_SCR02C_MainTab-
     A                                      Panel","parent tab":"0","subfile en-
     A                                      d":{"fieldName":"N15","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"page -
     A                                      down response":{"fieldName":"*IN01"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "page up response":{"fieldName":"*I-
     A                                      N02","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"show paging controls":"true","-
     A                                      scrollbar":"none","number of rows":-
     A                                      "15","top":"230px","left":"276px","-
     A                                      column widths":"35,525","subfile re-
     A                                      cord number":{"fieldName":"SCRRN2",-
     A                                      "designValue":"[SCRRN2]","dataType"-
     A                                      :"zoned","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"true","-
     A                                      zeroFill":"true","curSym":"","units-
     A                                      ":"","negNum":"-999.00","dataLength-
     A                                      ":"4","decPos":"0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0051F17_SCR02C_BtnHiddenW-
     A                                      orkPrinterOutput","value":"btnWrkpr-
     A                                      tout","top":"250px","response":{"fi-
     A                                      eldName":"btnWrkPrnt","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"fi')
     A                                  1  6HTML('eld type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W0051F17_S-
     A                                      CR02C_BtnHiddenImageQueue","value":-
     A                                      "btnImgQue","top":"302px","response-
     A                                      ":{"fieldName":"btnImgQue","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0051F17_SCR02C_BtnH-
     A                                      iddenHelp","value":"btnHelp","top":-
     A                                      "327px","response":{"fieldName":"bt-
     A                                      nHelp","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"btnSubmit","field typ-
     A                                      e":"button","value":"Enter","shortc-
     A                                      ut key":"Enter","left":"14px","top"-
     A                                      :"150px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF12","field type":"button-
     A                                      ","value":"Cancel","shortcut key":"-
     A                                      F12","left":"14px","top":"183px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"SCR02-
     A                                      S_SCDBRR","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"SCDBRR","designValue":"-
     A                                      [SCDBRR]","dataType":"zoned","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"true","zeroFill":"true-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","dataLength":"9","decPos":-
     A                                      "0"},"left":"-58px","top":"-279px",-
     A                                      "width":"63px","text align":"right"-
     A                                      ,"css class":"profound-converted","-
     A                                      grid":"SCR02S","column":"0"},{"id":-
     A                                      "SCSF1R","field type":"output field-
     A                                      ","visibility":"hidden","value":{"f-
     A                                      ieldName":"SCSF1R","designValue":"[-
     A                                      SCSF1R]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","dataLength":"4","decPos":"-
     A                                      0"},"left":"-23px","top":"-279px","-
     A                                      width":"28px","text align":"right",-
     A                                      "css class":"profound-converted","g-
     A                                      rid":"SCR02S","column":"0"},{"id":"-
     A                                      SCR02S_SCSEL","field type":"output -
     A                                      field","value":{"fieldName":"SCSEL"-
     A                                      ,"designValue":"[SCSEL]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"2"},"css class":"output-field"-
     A                                      ,"left":"5px","cursor column":"2","-
     A                                      top":"1px","cursor row":"8","descri-
     A                                      ption":"Selection Field","css class-
     A                                       2":"profound-converted","grid":"SC-
     A                                      R02S","column":"0"},{"id":"SCDATA",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCDATA","designValue-
     A                                      ":"[SCDATA]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none","dataLength":"70"},"c-
     A                                      ss class":"output-field","left":"5p-
     A                                      x","cursor column":"7","top":"1px",-
     A                                      "cursor row":"8","css class 2":"pro-
     A                                      found-converted","grid":"SCR02S","c-
     A                                      olumn":"1"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        78A  H
     A            SCRRN2         4S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRD2    R        H      REFFLD(NAME)
     A          R SCR02
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"23-23"},"items":[{-
     A                                      "id":"W0051F17_SCR02_avKeys","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"AV_KEYS","dataLength":"113-
     A                                      4","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none","designValue":"[AV_KEYS]"}-
     A                                      ,"left":"0px","top":"0px","visibili-
     A                                      ty":"hidden"},{"id":"W0051F17_SCR02-
     A                                      _action","field type":"html contain-
     A                                      er","white space":"normal","left":"-
     A                                      0px","top":"10px","width":"230px","-
     A                                      css class":"action-panel-converted"-
     A                                      ,"height":"700px","html":"<div clas-
     A                                      s=\"top\"></div><div class=\"imaget-
     A                                      op\"><img src=\"/profoundui/userdat-
     A                                      a/images/bar_top.png\" /></div><div-
     A                                       class=\"menulinks\"></div><div cla-
     A                                      ss=\"imagebottom\"><img src=\"/prof-
     A                                      oundui/userdata/images/bar_bottom.p-
     A                                      ng\" /></div><div class=\"bottom\">-
     A                                      </div>"},{"field type":"icon menu b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      32px","z index":"20","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1170px","i-
     A                                      d":"W0051F17_SCR02_BtnIconMenuSyste-
     A                                      mTools","tool tip":"System Tools","-
     A                                      icon alignment":"middle left","icon-
     A                                       width":"16px","icon height":"24px"-
     A                                      ,"icon source":"/profoundui/userdat-
     A                                      a/images/systool/systools.png","dat-
     A                                      a function":"SystemToolbarSystools"-
     A                                      ,"show down arrow":"Yes"},{"field t-
     A                                      ype":"panel","panel style":"Transfo-
     A                                      rmButtonBar","id":"W0051F17_SCR02_B-
     A                                      uttonBar","top":"35px","left":"1036-
     A                                      px","width":"187px","height":"28px"-
     A                                      ,"css class":"stationary","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1040px","-
     A                                      id":"W0051F17_SCR02_BtnSave","tool -
     A                                      tip":"Save","onclick":"SystemToolba-
     A                                      rSave","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      ave.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1066px","id":"W0051F17_SCR02_BtnRef-
     A                                      resh","tool tip":"Refresh","onclick-
     A                                      ":"SystemToolbarRefresh","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/refresh.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1092px","id":"-
     A                                      W0051F17_SCR02_BtnSearch","tool tip-
     A                                      ":"Search","onclick":"SystemToolbar-
     A                                      Search","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      search.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1118px","id":"W0051F17_SCR02_Btn-
     A                                      DiaryItems","tool tip":"Diary/Work -
     A                                      Items - IDARTS","onclick":"SystemTo-
     A                                      olbarDiary","background image":{"fi-
     A                                      eldName":"DryIcnURL","dataLength":"-
     A                                      128","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"}},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1144px","id":"W0051F17_SCR02_BtnSys-
     A                                      temMessages","tool tip":"System Mes-
     A                                      sages","onclick":"SystemToolbarMess-
     A                                      ages","background image":{"fieldNam-
     A                                      e":"MsgIcnURL","dataLength":"128","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"')
     A                                  1  4HTML('char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1196px","id":"W0051F17_SCR-
     A                                      02_BtnHelp","tool tip":"Help","oncl-
     A                                      ick":"SystemToolbarHelp","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/help.png'')"},{"id-
     A                                      ":"W0051F17_SCR02_ImgSysToolBottom"-
     A                                      ,"field type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"W0051F17_SCR02_MainTabPanel","f-
     A                                      ield type":"tab panel","tab panel s-
     A                                      tyle":"Transform","tab names":"Tab -
     A                                      1","active tab":"0","left":"250px",-
     A                                      "top":"70px","width":"970px","heigh-
     A                                      t":"657px","z index":"8","locked in-
     A                                       place":"true","css class":"tab-pan-
     A                                      el","css class 2":"stationary"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0051F17_SCR02_-
     A                                      BtnHiddenSave","value":"btnSave","t-
     A                                      op":"100px","response":{"fieldName"-
     A                                      :"btnSave","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"W0051F17_SCR02_fk-
     A                                      eyMenu","field type":"menu","left":-
     A                                      "10px","top":"120px","height":"350p-
     A                                      x","width":"230px","hover backgroun-
     A                                      d color":"#9AAA61","hover text colo-
     A                                      r":"#FFFFFF","border color":"#4C610-
     A                                      6","menu option indent":"10px","bac-
     A                                      kground color":"#758B27","css class-
     A                                      ":"action-menu","css class 2":"stat-
     A                                      ionary","z index":"101"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0051F17_SCR02_BtnHidd-
     A                                      enRefresh","value":"btnRefresh","to-
     A                                      p":"125px","response":{"fieldName":-
     A                                      "btnRefresh","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W0051F17_SCR02_BtnHiddenSearch","v-
     A                                      alue":"btnSearch","top":"150px","re-
     A                                      sponse":{"fieldName":"btnSearch","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0051F17_SCR02-
     A                                      _BtnHiddenDiaryItems","value":"btnD-
     A                                      iary","top":"175px","response":{"fi-
     A                                      eldName":"btnDiary","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W0051F17_SCR02_BtnHiddenSys-
     A                                      temMessages","value":"btnMessage","-
     A                                      top":"200px","response":{"fieldName-
     A                                      ":"btnMessage","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0051F17_SCR02_BtnHiddenWorkSubm-
     A                                      itJob","value":"btnWrksbmjob","top"-
     A                                      :"225px","response":{"fieldName":"b-
     A                                      tnWrkJob","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W0-
     A                                      051F17_SCR02_BtnHiddenWorkPrinterOu-
     A                                      tput","value":"btnWrkprtout","top":-
     A                                      "250px","response":{"fieldName":"bt-
     A                                      nWrkPrnt","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W0-
     A                                      051F17_SCR02_BtnHiddenImageQueue","-
     A                                      value":"btnImgQue","top":"275px","r-
     A                                      esponse":{"fieldName":"btnImgQue","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W0051F17_SCR0-
     A                                      2_BtnHiddenHelp","value":"btnHelp",-
     A                                      "top":"300px","response":{"fieldNam-
     A                                      e":"btnHelp","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"btnSubmit","fie-
     A                                      ld type":"button","value":')
     A                                  1  5HTML('"Enter","shortcut key":"Enter-
     A                                      ","left":"14px","top":"150px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnPAGED-
     A                                      OWN","field type":"button","value":-
     A                                      "Page Down","shortcut key":"PageDow-
     A                                      n","response":{"fieldName":"*IN01",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      left":"14px","top":"183px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnPAGEUP",-
     A                                      "field type":"button","value":"Page-
     A                                       Up","shortcut key":"PageUp","respo-
     A                                      nse":{"fieldName":"*IN02","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"left":"14-
     A                                      px","top":"216px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR03
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    RWINDOW    0     -
     A                                      RROWS      2    C1    1C1    9 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"4","overlay ra-
     A                                      nge":"1-9"},"items":[{"id":"SCR03",-
     A                                      "field type":"panel","panel style":-
     A                                      "Transform Dialog","text align":"ce-
     A                                      nter","left":"5px","top":"5px","hei-
     A                                      ght":"330px","width":"534px","z ind-
     A                                      ex":"8","locked in place":"true"},{-
     A                                      "id":"constant16","field type":"out-
     A                                      put field","left":"29px","cursor co-
     A                                      lumn":"2","top":"65px","cursor row"-
     A                                      :"1","value":"js: currentUser()","c-
     A                                      ss class":"output-field","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      PRD3","field type":"output field","-
     A                                      value":{"fieldName":"SCPRD3","desig-
     A                                      nValue":"[SCPRD3]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"127px","cursor column":"16-
     A                                      ","top":"65px","cursor row":"1","cs-
     A                                      s class 2":"HI","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant17"-
     A                                      ,"field type":"output field","value-
     A                                      ":"SCR03","css class":"constant","l-
     A                                      eft":"477px","cursor column":"66","-
     A                                      top":"65px","cursor row":"1","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant18","field type":"output -
     A                                      field","value":"Type choices, press-
     A                                       Enter.","css class":"constant","le-
     A                                      ft":"29px","cursor column":"2","top-
     A                                      ":"105px","cursor row":"3","css cla-
     A                                      ss 2":"BLU","css class 3":"profound-
     A                                      -converted"},{"id":"btnSubmit","fie-
     A                                      ld type":"button","value":"Enter","-
     A                                      shortcut key":"Enter","left":"14px"-
     A                                      ,"top":"290px","width":"80px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF12","field type":"b-
     A                                      utton","value":"Cancel","shortcut k-
     A                                      ey":"F12","left":"104px","top":"290-
     A                                      px","width":"80px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnPAGEDOWN","field type":"button",-
     A                                      "value":"Page Down","shortcut key":-
     A                                      "PageDown","response":{"fieldName":-
     A                                      "*IN01","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"left":"194px","top":"290px"-
     A                                      ,"width":"80px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","visibility":"hidden","cursor"-
     A                                      :"default"},{"id":"btnPAGEUP","fiel-
     A                                      d type":"button","value":"Page Up",-
     A                                      "shortcut key":"PageUp","response":-
     A                                      {"fieldName":"*IN02","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"left":"284px",-
     A                                      "top":"290px","width":"80px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","visibility":"hid-
     A                                      den","cursor":"default"}]}')
     A            SCPRD3    R        H      REFFLD(NAME)
     A          R MSGSFL                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            MSGKEY         4A  H
     A            Q1PGM         10A  H
     A          R QSFLCTL003                SFLCTL(MSGSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLMSGSFLC')
     A          R MSGSFLC
     A  01 02 10                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    MSGSFL    6    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LINZ    0     RSFLPAG    1    C1   -
     A                                       1 RSFLSIZ    1    C1    5 FQ1PGM  -
     A                                         SFLPGMQ   0     2    FMSGKEY    -
     A                                      SFLMSGKEY 0     FQ1PGM     SFLPGMQ -
     A                                        0     1    RROWS      2    C2    -
     A                                      24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"MSGSFLC","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","overlay range":"24-24"},"items":-
     A                                      [{"id":"W0051F17_MSGSFLC_avKeys","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"AV_KEYS","dataLength":-
     A                                      "1134","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[AV_KEY-
     A                                      S]"},"left":"0px","top":"0px","visi-
     A                                      bility":"hidden"},{"id":"W0051F17_M-
     A                                      SGSFLC_action","field type":"html c-
     A                                      ontainer","white space":"normal","l-
     A                                      eft":"0px","top":"10px","width":"23-
     A                                      0px","css class":"action-panel-conv-
     A                                      erted","height":"700px","html":"<di-
     A                                      v class=\"top\"></div><div class=\"-
     A                                      imagetop\"><img src=\"/profoundui/u-
     A                                      serdata/images/bar_top.png\" /></di-
     A                                      v><div class=\"menulinks\"></div><d-
     A                                      iv class=\"imagebottom\"><img src=\-
     A                                      "/profoundui/userdata/images/bar_bo-
     A                                      ttom.png\" /></div><div class=\"bot-
     A                                      tom\"></div>"},{"field type":"icon -
     A                                      menu button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"32px","z index":"20","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1170-
     A                                      px","id":"W0051F17_MSGSFLC_BtnIconM-
     A                                      enuSystemTools","tool tip":"System -
     A                                      Tools","icon alignment":"middle lef-
     A                                      t","icon width":"16px","icon height-
     A                                      ":"24px","icon source":"/profoundui-
     A                                      /userdata/images/systool/systools.p-
     A                                      ng","data function":"SystemToolbarS-
     A                                      ystools","show down arrow":"Yes"},{-
     A                                      "field type":"panel","panel style":-
     A                                      "TransformButtonBar","id":"W0051F17-
     A                                      _MSGSFLC_ButtonBar","top":"35px","l-
     A                                      eft":"1036px","width":"187px","heig-
     A                                      ht":"28px","css class":"stationary"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1040px","id":"W0051F17_MSGSFLC_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"W0051F17_-
     A                                      MSGSFLC_BtnRefresh","tool tip":"Ref-
     A                                      resh","onclick":"SystemToolbarRefre-
     A                                      sh","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/refr-
     A                                      esh.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1092px","id":"W0051F17_MSGSFLC_BtnS-
     A                                      earch","tool tip":"Search","onclick-
     A                                      ":"SystemToolbarSearch","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/search.png'')"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1118px","id":"W0-
     A                                      051F17_MSGSFLC_BtnDiaryItems","tool-
     A                                       tip":"Diary/Work Items - IDARTS","-
     A                                      onclick":"SystemToolbarDiary","back-
     A                                      ground image":{"fieldName":"DryIcnU-
     A                                      RL","dataLength":"128","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"}},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1144px","id":"W00-
     A                                      51F17_MSGSFLC_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":')
     A                                  1  4HTML('"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"W0051F17_MSGSFLC_BtnHelp","-
     A                                      tool tip":"Help","onclick":"SystemT-
     A                                      oolbarHelp","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/help.png'')"},{"id":"W0051F17_M-
     A                                      SGSFLC_ImgSysToolBottom","field typ-
     A                                      e":"image","image source":"/profoun-
     A                                      dui/userdata/images/systool/butbarb-
     A                                      ot.png","left":"1036px","top":"64px-
     A                                      ","width":"187px","locked in place"-
     A                                      :"true","css class":"stationary","v-
     A                                      isibility":"hidden"},{"id":"W0051F1-
     A                                      7_MSGSFLC_MainTabPanel","field type-
     A                                      ":"tab panel","tab panel style":"Tr-
     A                                      ansform","tab names":"Tab 1","activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0051F17_MSGSFLC_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"W0051F17_MSGSFLC_fkeyMen-
     A                                      u","field type":"menu","left":"10px-
     A                                      ","top":"120px","height":"350px","w-
     A                                      idth":"230px","hover background col-
     A                                      or":"#9AAA61","hover text color":"#-
     A                                      FFFFFF","border color":"#4C6106","m-
     A                                      enu option indent":"10px","backgrou-
     A                                      nd color":"#758B27","css class":"ac-
     A                                      tion-menu","css class 2":"stationar-
     A                                      y","z index":"101"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W0051F17_MSGSFLC_BtnHiddenR-
     A                                      efresh","value":"btnRefresh","top":-
     A                                      "125px","response":{"fieldName":"bt-
     A                                      nRefresh","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W0-
     A                                      051F17_MSGSFLC_BtnHiddenSearch","va-
     A                                      lue":"btnSearch","top":"150px","res-
     A                                      ponse":{"fieldName":"btnSearch","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0051F17_MSGSFL-
     A                                      C_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0051F17_MSGSFLC_BtnHidden-
     A                                      SystemMessages","value":"btnMessage-
     A                                      ","top":"200px","response":{"fieldN-
     A                                      ame":"btnMessage","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0051F17_MSGSFLC_BtnHiddenWor-
     A                                      kSubmitJob","value":"btnWrksbmjob",-
     A                                      "top":"225px","response":{"fieldNam-
     A                                      e":"btnWrkJob","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0051F17_MSGSFLC_BtnHiddenWorkPr-
     A                                      interOutput","value":"btnWrkprtout"-
     A                                      ,"top":"250px","response":{"fieldNa-
     A                                      me":"btnWrkPrnt","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0051F17_MSGSFLC_BtnHiddenImag-
     A                                      eQueue","value":"btnImgQue","top":"-
     A                                      275px","response":{"fieldName":"btn-
     A                                      ImgQue","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W005-
     A                                      1F17_MSGSFLC_BtnHiddenHelp","value"-
     A                                      :"btnHelp","top":"300px","response"-
     A                                      :{"fieldName":"btnHelp","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"')
     A                                  1  5HTML('id":"MSGSFL","field type":"gr-
     A                                      id","number of columns":"1","record-
     A                                       format name":"MSGSFL","display sub-
     A                                      file":"true","display control recor-
     A                                      d":"true","subfile size":"5","initi-
     A                                      alize subfile":"true","row height":-
     A                                      "20","css class":"subfilegrid","css-
     A                                       class 2":"profound-converted","par-
     A                                      ent tab panel":"W0051F17_MSGSFLC_Ma-
     A                                      inTabPanel","parent tab":"0","subfi-
     A                                      le end":{"fieldName":"N10","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      number of rows":"1","has header":"f-
     A                                      alse","subfile program message queu-
     A                                      e":{"fieldName":"Q1PGM","dataLength-
     A                                      ":"10","trimLeading":"false","trimT-
     A                                      railing":"true","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none"},"subfile control program me-
     A                                      ssage queue":{"fieldName":"Q1PGM","-
     A                                      dataLength":"10","trimLeading":"fal-
     A                                      se","trimTrailing":"true","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"},"subfile message -
     A                                      key":{"fieldName":"MSGKEY","dataLen-
     A                                      gth":"4","trimLeading":"false","tri-
     A                                      mTrailing":"true","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"},"top":"570px","left":"269-
     A                                      px","column widths":"595"},{"id":"b-
     A                                      tnSubmit","field type":"button","va-
     A                                      lue":"Enter","shortcut key":"Enter"-
     A                                      ,"left":"14px","top":"150px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnPAGEDO-
     A                                      WN","field type":"button","value":"-
     A                                      Page Down","shortcut key":"PageDown-
     A                                      ","response":{"fieldName":"*IN01","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"l-
     A                                      eft":"14px","top":"183px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnPAGEUP","-
     A                                      field type":"button","value":"Page -
     A                                      Up","shortcut key":"PageUp","respon-
     A                                      se":{"fieldName":"*IN02","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"left":"14p-
     A                                      x","top":"216px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
