     A                                      REF(*LIBL/WREFP)
     A          R SCR01
     A  71 72 73
     A  74 75 76
     A  77 78 81                            CA01(71 'Response Indicator *IN71')
     A  82 83 84
     A  85 86 87
     A  09 80                               CA02(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                      SETOF(74 'Response Indicator *IN74')
     A                                      SETOF(75 'Response Indicator *IN75')
     A                                      SETOF(76 'Response Indicator *IN76')
     A                                      SETOF(77 'Response Indicator *IN77')
     A                                      SETOF(78 'Response Indicator *IN78')
     A                                      SETOF(81 'Response Indicator *IN81')
     A                                      SETOF(82 'Response Indicator *IN82')
     A                                      SETOF(83 'Response Indicator *IN83')
     A                                      SETOF(84 'Response Indicator *IN84')
     A                                      SETOF(85 'Response Indicator *IN85')
     A                                      SETOF(86 'Response Indicator *IN86')
     A                                      SETOF(87 'Response Indicator *IN87')
     A                                  1  2HTML('QPUIREC14   RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C6    SCPREPC7    WCR0-
     A                                      500C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     71RERRMSGID  5    C5    SC-
     A                                      1A2C7    WCR0501C6    WMESGGC5    *-
     A                                      LIBLC0    E1    3     73RERRMSGID  -
     A                                      5    C5    SC1A2C7    WCR1083C6    -
     A                                      WMESGGC5    *LIBLC0    E1    3     -
     A                                      80RERRMSGID  5    C6    SCTIM2C7   -
     A                                       WCR0542C6    WMESGGC5    *LIBLC0  -
     A                                        E1    3     74RERRMSGID  5    C5 -
     A                                         SCDT2C7    WCR0500C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     77RERRMS-
     A                                      G    2    C6    SCRP01C36   Valid v-
     A                                      alues are "Y", "N" and blank.E1    -
     A                                      3     81RERRMSG    2    C6    SCRP0-
     A                                      2C36   Valid values are "Y", "N" an-
     A                                      d blank.E1    3     82RERRMSG    2 -
     A                                         C6    SCRP03C36   Valid values a-
     A                                      re "Y", "N" and blank.E1    3     8-
     A                                      3RERRMSG    2    C6    SCRP04C36   -
     A                                      Valid values are "Y", "N" and blank-
     A                                      .E1    3     84RERRMSG    2    C6  -
     A                                        SCRP05C36   Valid values are "Y",-
     A                                       "N" and blank.E1    3     85RERRMS-
     A                                      G    2    C6    SCRP06C36   Valid v-
     A                                      alues are "Y", "N" and blank.E1    -
     A                                      3     86RERRMSG    2    C6    SCRP0-
     A                                      7C36   Valid values are "Y", "N" an-
     A                                      d blank.E1    3     87')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","set off":{"fieldNa-
     A                                      me":"*IN71","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 2":{"fieldName"-
     A                                      :"*IN72","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"set off 3":{"fieldName":"*-
     A                                      IN73","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 4":{"fieldName":"*IN7-
     A                                      4","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 5":{"fieldName":"*IN75",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 6":{"fieldName":"*IN76","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 7":{"fieldName":"*IN77","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 8":{"fieldName":"*IN78","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 9-
     A                                      ":{"fieldName":"*IN81","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 10":-
     A                                      {"fieldName":"*IN82","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"set off 11":{"-
     A                                      fieldName":"*IN83","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 12":{"fi-
     A                                      eldName":"*IN84","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"set off 13":{"fiel-
     A                                      dName":"*IN85","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"set off 14":{"fieldN-
     A                                      ame":"*IN86","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 15":{"fieldNam-
     A                                      e":"*IN87","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"return cursor record":{"-
     A                                      fieldName":"HREC","dataLength":"10"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      },"return cursor field":{"fieldName-
     A                                      ":"HFLD","dataLength":"10","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"none"},"overla-
     A                                      y range":"1-23"},"items":[{"id":"HF-
     A                                      LD","field type":"output field","vi-
     A                                      sibility":"hidden","value":{"fieldN-
     A                                      ame":"HFLD","designValue":"[HFLD]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"none",-
     A                                      "dataLength":"10"},"left":"0px","to-
     A                                      p":"-30px","css class":"profound-co-
     A                                      nverted"},{"id":"HREC","field type"-
     A                                      :"output field","visibility":"hidde-
     A                                      n","value":{"fieldName":"HREC","des-
     A                                      ignValue":"[HREC]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"none","dataLength":"10-
     A                                      "},"left":"0px","top":"-30px","css -
     A                                      class":"profound-converted"},{"id":-
     A                                      "W0070FLA_SCR01_avKeys","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"AV_KEYS","dataLength":"1134","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[AV_KEYS]"},"lef-
     A                                      t":"0px","top":"0px","visibility":"-
     A                                      hidden"},{"id":"W0070FLA_SCR01_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"W-
     A                                      0070FLA_SCR01_BtnIconMenuSystemTool-
     A                                      s","tool tip":"System Tools","icon -
     A                                      alignment":"middle left","icon widt-
     A                                      h":"16px","icon height":"24px","ico-
     A                                      n source":"/profoundui/userdata/ima-
     A                                      ges/systool/systools.png","data fun-
     A                                      ction":"SystemToolbarSystools","sho-
     A                                      w down arrow":"Yes"},{"field type":-
     A                                      "panel","panel style":"TransformBut-
     A                                      tonBar","id":"W0070FLA_SCR01_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","lo')
     A                                  1  4HTML('cked in place":"true","left":-
     A                                      "1040px","id":"W0070FLA_SCR01_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1066px","id":"W0070FLA_SC-
     A                                      R01_BtnRefresh","tool tip":"Refresh-
     A                                      ","onclick":"SystemToolbarRefresh",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/refresh.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1092-
     A                                      px","id":"W0070FLA_SCR01_BtnSearch"-
     A                                      ,"tool tip":"Search","onclick":"Sys-
     A                                      temToolbarSearch","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/search.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1118px","id":"W0070FLA-
     A                                      _SCR01_BtnDiaryItems","tool tip":"D-
     A                                      iary/Work Items - IDARTS","onclick"-
     A                                      :"SystemToolbarDiary","background i-
     A                                      mage":{"fieldName":"DryIcnURL","dat-
     A                                      aLength":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1144px","id":"W0070FLA_SC-
     A                                      R01_BtnSystemMessages","tool tip":"-
     A                                      System Messages","onclick":"SystemT-
     A                                      oolbarMessages","background image":-
     A                                      {"fieldName":"MsgIcnURL","dataLengt-
     A                                      h":"128","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none"}},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1196px","id":"W0070FLA_SCR01_Bt-
     A                                      nHelp","tool tip":"Help","onclick":-
     A                                      "SystemToolbarHelp","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/help.png'')"},{"id":"W0-
     A                                      070FLA_SCR01_ImgSysToolBottom","fie-
     A                                      ld type":"image","image source":"/p-
     A                                      rofoundui/userdata/images/systool/b-
     A                                      utbarbot.png","left":"1036px","top"-
     A                                      :"64px","width":"187px","locked in -
     A                                      place":"true","css class":"stationa-
     A                                      ry","visibility":"hidden"},{"id":"W-
     A                                      0070FLA_SCR01_MainTabPanel","field -
     A                                      type":"tab panel","tab panel style"-
     A                                      :"Transform","tab names":{"fieldNam-
     A                                      e":"SCPRDS","designValue":"[SCPRDS]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"active -
     A                                      tab":"0","left":"250px","top":"70px-
     A                                      ","width":"970px","height":"657px",-
     A                                      "z index":"8","locked in place":"tr-
     A                                      ue","css class":"tab-panel","css cl-
     A                                      ass 2":"stationary"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0070FLA_SCR01_BtnHiddenSa-
     A                                      ve","value":"btnSave","top":"100px"-
     A                                      ,"response":{"fieldName":"btnSave",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant1","field type":"out-
     A                                      put field","left":"281px","cursor c-
     A                                      olumn":"2","top":"110px","cursor ro-
     A                                      w":"1","css class":"top-line","valu-
     A                                      e":"js: currentUser()","css class 2-
     A                                      ":"output-field","parent tab panel"-
     A                                      :"W0070FLA_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"SCCONM","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCCONM","designValue":"[SC-
     A                                      CONM]","refField":"NAME","dataType"-
     A                                      :"reference","formatting":')
     A                                  1  5HTML('"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"414px","cursor column":-
     A                                      "21","top":"110px","cursor row":"1"-
     A                                      ,"css class 2":"top-line","css clas-
     A                                      s 3":"HI","parent tab panel":"W0070-
     A                                      FLA_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 4":"profound-conve-
     A                                      rted"},{"id":"constant2","field typ-
     A                                      e":"output field","left":"778px","c-
     A                                      ursor column":"73","top":"110px","c-
     A                                      ursor row":"1","css class":"top-lin-
     A                                      e","value":"js: currentDate()","css-
     A                                       class 2":"output-field","parent ta-
     A                                      b panel":"W0070FLA_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"W0070F-
     A                                      LA_SCR01_fkeyMenu","field type":"me-
     A                                      nu","left":"10px","top":"120px","he-
     A                                      ight":"350px","width":"230px","hove-
     A                                      r background color":"#9AAA61","hove-
     A                                      r text color":"#FFFFFF","border col-
     A                                      or":"#4C6106","menu option indent":-
     A                                      "10px","background color":"#758B27"-
     A                                      ,"css class":"action-menu","css cla-
     A                                      ss 2":"stationary","z index":"101"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0070FLA_SC-
     A                                      R01_BtnHiddenRefresh","value":"btnR-
     A                                      efresh","top":"125px","response":{"-
     A                                      fieldName":"btnRefresh","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"Q1PG-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"Q1PGM","designVal-
     A                                      ue":"[Q1PGM]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none","dataLength":"10"},"-
     A                                      css class":"output-field","left":"2-
     A                                      81px","cursor column":"2","top":"13-
     A                                      0px","cursor row":"2","parent tab p-
     A                                      anel":"W0070FLA_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCPRDS","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCPRDS","designValue"-
     A                                      :"[SCPRDS]","refField":"NAME","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"414px","cursor column":"21","top"-
     A                                      :"130px","cursor row":"2","css clas-
     A                                      s 2":"HI","parent tab panel":"W0070-
     A                                      FLA_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","visibility":"hidden","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant3","field type":"output fi-
     A                                      eld","value":"SCR01","css class":"c-
     A                                      onstant","left":"799px","cursor col-
     A                                      umn":"76","top":"130px","cursor row-
     A                                      ":"2","parent tab panel":"W0070FLA_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCMODE","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      MODE","designValue":"[SCMODE]","ref-
     A                                      Field":"PGM","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"764px","cursor -
     A                                      column":"71","top":"150px","cursor -
     A                                      row":"3","css class 2":"HI","parent-
     A                                       tab panel":"W0070FLA_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0070FLA_SCR01_BtnHidd-
     A                                      enSearch","value":"btnSearch","top"-
     A                                      :"150px","response":{"fieldName":"b-
     A                                      tnSearch","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant4","field -
     A                                      type":"output field","value":"Group-
     A                                      :","css class":"constant","left":"2-
     A                                      81px","cursor column":"2","top":"17-
     A                                      0px","cursor row":"4","parent tab p-
     A                                      anel":"W0070FLA_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCFND","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCFND","designValue":"-
     A                                      [SCFND]","refField":"FND","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00"},"css-
     A                                       class":"output-field","left":"330p-
     A                                      x","cursor column":"9","top":"170px-
     A                                      ","cursor row":"4","width":"21px","-
     A                                      text align":"right","parent tab pan-
     A                                      el":"W0070FLA_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCFNAM","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCFNAM","designValue":"-
     A                                      [SCFNAM]","refField":"NM20","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      358px","cursor column":"13","top":"-
     A                                      170px","cursor row":"4","descriptio-
     A                                      n":"FUND NAME","parent tab panel":"-
     A                                      W0070FLA_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"constant5","fiel-
     A                                      d type":"output field","value":"SS#-
     A                                      :","css class":"constant","left":"5-
     A                                      05px","cursor column":"34"')
     A                                  1  6HTML(',"top":"170px","cursor row":"-
     A                                      4","parent tab panel":"W0070FLA_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCSS#","field type":"output -
     A                                      field","value":{"fieldName":"SCSS#"-
     A                                      ,"designValue":"[SCSS#]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"11"},"css class":"output-field-
     A                                      ","left":"540px","cursor column":"3-
     A                                      9","top":"170px","cursor row":"4","-
     A                                      parent tab panel":"W0070FLA_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCCNAM","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCCNAM","-
     A                                      designValue":"[SCCNAM]","refField":-
     A                                      "NM20","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"624px","cursor column-
     A                                      ":"51","top":"170px","cursor row":"-
     A                                      4","parent tab panel":"W0070FLA_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0070FLA_SCR-
     A                                      01_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt6","field type":"output field","v-
     A                                      alue":"Emp# :","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"190px","cursor row":"5","-
     A                                      parent tab panel":"W0070FLA_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCEDN","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCEDN","de-
     A                                      signValue":"[SCEDN]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none","dataLength":-
     A                                      "70"},"css class":"output-field","l-
     A                                      eft":"330px","cursor column":"9","t-
     A                                      op":"190px","cursor row":"5","descr-
     A                                      iption":"Emp#, DIV, & NAME","parent-
     A                                       tab panel":"W0070FLA_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0070FLA_SCR01_BtnHidd-
     A                                      enSystemMessages","value":"btnMessa-
     A                                      ge","top":"200px","response":{"fiel-
     A                                      dName":"btnMessage","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      7","field type":"output field","val-
     A                                      ue":"Case#:","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"210px","cursor row":"6","pa-
     A                                      rent tab panel":"W0070FLA_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCYRCS","field type":"output field-
     A                                      ","value":{"fieldName":"SCYRCS","de-
     A                                      signValue":"[SCYRCS]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"11"},"css class":"output-field","-
     A                                      left":"330px","cursor column":"9","-
     A                                      top":"210px","cursor row":"6","desc-
     A                                      ription":"FYR-CASE","parent tab pan-
     A                                      el":"W0070FLA_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"constant8",-
     A                                      "field type":"output field","value"-
     A                                      :"SCL#:","css class":"constant","le-
     A                                      ft":"421px","cursor column":"22","t-
     A                                      op":"210px","cursor row":"6","paren-
     A                                      t tab panel":"W0070FLA_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      SCL#","field type":"output field","-
     A                                      value":{"fieldName":"SCSCL#","desig-
     A                                      nValue":"[SCSCL#]","refField":"DS30-
     A                                       25","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"463px","cursor column":-
     A                                      "28","top":"210px","cursor row":"6"-
     A                                      ,"description":"STATE CLAIM #","par-
     A                                      ent tab panel":"W0070FLA_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant9","field type":"output fie-
     A                                      ld","value":"DOI:","css class":"con-
     A                                      stant","left":"645px","cursor colum-
     A                                      n":"54","top":"210px","cursor row":-
     A                                      "6","parent tab panel":"W0070FLA_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCACDT","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCAC-
     A                                      DT","designValue":"[SCACDT]","refFi-
     A                                      eld":"DT8","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"true","zeroFill":-
     A                                      "true","curSym":"","units":"","negN-
     A                                      um":"-999.00","edtWrd":"''  /  /   -
     A                                       ''"},"css class":"output-field","l-
     A                                      eft":"680px","cursor column":"59","-
     A                                      top":"210px","cursor row":"6","widt-
     A                                      h":"70px","text align":"right","par-
     A                                      ent tab panel":"W0070FLA_SCR01_Main-
     A                                      TabPanel","parent tab":"0"')
     A                                  1  7HTML(',"css class 2":"profound-conv-
     A                                      erted"},{"id":"SCATME","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCATME","designValue":"[SCATME]"-
     A                                      ,"dataType":"zoned","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"true","zeroFill":"true","curSym-
     A                                      ":"","units":"","negNum":"-999.00",-
     A                                      "dataLength":"6","decPos":"0","edtW-
     A                                      rd":"''  :  :  ''"},"css class":"ou-
     A                                      tput-field","left":"771px","cursor -
     A                                      column":"72","top":"210px","cursor -
     A                                      row":"6","width":"56px","text align-
     A                                      ":"right","parent tab panel":"W0070-
     A                                      FLA_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0070-
     A                                      FLA_SCR01_BtnHiddenWorkSubmitJob","-
     A                                      value":"btnWrksbmjob","top":"225px"-
     A                                      ,"response":{"fieldName":"btnWrkJob-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant10","field type":"-
     A                                      output field","value":"Report date -
     A                                           :","css class":"constant","lef-
     A                                      t":"295px","cursor column":"4","top-
     A                                      ":"250px","cursor row":"8","parent -
     A                                      tab panel":"W0070FLA_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCPR-
     A                                      EP","field type":"date field","css -
     A                                      class":"input","css class 2":"date--
     A                                      field","value":{"fieldName":"SCPREP-
     A                                      ","designValue":"[SCPREP]","refFiel-
     A                                      d":"DT8","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00","numBlankFill":"true"-
     A                                      ,"edtWrd":"''  /  /    ''","dateFor-
     A                                      mat":"m/d/Y"},"left":"428px","curso-
     A                                      r column":"23","top":"250px","curso-
     A                                      r row":"8","width":"71px","text ali-
     A                                      gn":"right","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"read only":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       5":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"erro-
     A                                      r message id":"WCR0500","error mess-
     A                                      age file":"WMESGG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"71","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      1 message","parent tab panel":"W007-
     A                                      0FLA_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W007-
     A                                      0FLA_SCR01_BtnHiddenWorkPrinterOutp-
     A                                      ut","value":"btnWrkprtout","top":"2-
     A                                      50px","response":{"fieldName":"btnW-
     A                                      rkPrnt","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant11","field t-
     A                                      ype":"output field","value":"Back t-
     A                                      o work date:","css class":"constant-
     A                                      ","left":"295px","cursor column":"4-
     A                                      ","top":"270px","cursor row":"9","p-
     A                                      arent tab panel":"W0070FLA_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCRTW","field type":"output field-
     A                                      ","value":{"fieldName":"SCRTW","des-
     A                                      ignValue":"[SCRTW]","refField":"DT8-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"true","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","edtWrd":"''  /  /    ''"},"cs-
     A                                      s class":"output-field","left":"428-
     A                                      px","cursor column":"23","top":"270-
     A                                      px","cursor row":"9","width":"70px"-
     A                                      ,"text align":"right","parent tab p-
     A                                      anel":"W0070FLA_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"constant1-
     A                                      2","field type":"output field","val-
     A                                      ue":"At same wage?      :","css cla-
     A                                      ss":"constant","left":"512px","curs-
     A                                      or column":"35","top":"270px","curs-
     A                                      or row":"9","parent tab panel":"W00-
     A                                      70FLA_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SC1A2","field type"-
     A                                      :"checkbox","css class":"input","cs-
     A                                      s class 2":"checkbox","value":{"fie-
     A                                      ldName":"SC1A2","designValue":"[SC1-
     A                                      A2]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase","dataLength":"1"},"text t-
     A                                      ransform":"uppercase","left":"659px-
     A                                      ","top":"270px","width":"8px","css -
     A                                      class 3":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"HI","customFalse":""},-
     A                                      "css class 4":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"C')
     A                                  1  8HTML('ustom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"error -
     A                                      message id":"WCR0501","error messag-
     A                                      e file":"WMESGG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"73","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"2 -
     A                                      messages","error message id 2":"WCR-
     A                                      1083","error message file 2":"WMESG-
     A                                      G","error message library 2":"*LIBL-
     A                                      ","error condition 2":{"fieldName":-
     A                                      "80","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"W0070FLA_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      ,"checked value":"Y","unchecked val-
     A                                      ue":"N"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W00-
     A                                      70FLA_SCR01_BtnHiddenImageQueue","v-
     A                                      alue":"btnImgQue","top":"275px","re-
     A                                      sponse":{"fieldName":"btnImgQue","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant13","field type":"outp-
     A                                      ut field","value":"Normal start tim-
     A                                      e:","css class":"constant","left":"-
     A                                      295px","cursor column":"4","top":"2-
     A                                      90px","cursor row":"10","parent tab-
     A                                       panel":"W0070FLA_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCTIM2"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCTIM2","design-
     A                                      Value":"[SCTIM2]","dataType":"zoned-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"false","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"-999.00","dataLength":"6"-
     A                                      ,"decPos":"0","numBlankFill":"true"-
     A                                      ,"edtWrd":"''  :  :  ''"},"left":"4-
     A                                      28px","cursor column":"23","top":"2-
     A                                      90px","cursor row":"10","width":"57-
     A                                      px","text align":"right","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"css -
     A                                      class 4":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 5":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"error message id":"WCR0542-
     A                                      ","error message file":"WMESGG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"74","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"1 message","parent tab-
     A                                       panel":"W0070FLA_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 6":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t14","field type":"output field","v-
     A                                      alue":"Last full day paid:","css cl-
     A                                      ass":"constant","left":"512px","cur-
     A                                      sor column":"35","top":"290px","cur-
     A                                      sor row":"10","parent tab panel":"W-
     A                                      0070FLA_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCDT2","field typ-
     A                                      e":"date field","css class":"input"-
     A                                      ,"css class 2":"date-field","value"-
     A                                      :{"fieldName":"SCDT2","designValue"-
     A                                      :"[SCDT2]","refField":"DT8","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"-999.00","n-
     A                                      umBlankFill":"true","edtWrd":"''  /-
     A                                        /    ''","dateFormat":"m/d/Y"},"l-
     A                                      eft":"652px","cursor column":"55","-
     A                                      top":"290px","cursor row":"10","wid-
     A                                      th":"71px","text align":"right","cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"error message id":"-
     A                                      WCR0500","error message file":"WMES-
     A                                      GG","error message library":"*LIBL"-
     A                                      ,"error condition":{"fieldName":"77-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"1 message","par-
     A                                      ent tab panel":"W0070FLA_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 6":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px')
     A                                  1  9HTML('","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W007-
     A                                      0FLA_SCR01_BtnHiddenHelp","value":"-
     A                                      btnHelp","top":"300px","response":{-
     A                                      "fieldName":"btnHelp","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt15","field type":"output field","-
     A                                      value":"Employer UI Acct#:","css cl-
     A                                      ass":"constant","left":"295px","cur-
     A                                      sor column":"4","top":"310px","curs-
     A                                      or row":"11","parent tab panel":"W0-
     A                                      070FLA_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SC20A2","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SC20A2","designValue":"[SC-
     A                                      20A2]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase","dataLength":"20"},"tex-
     A                                      t transform":"uppercase","left":"42-
     A                                      8px","cursor column":"23","top":"31-
     A                                      0px","cursor row":"11","width":"141-
     A                                      px","css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"parent tab p-
     A                                      anel":"W0070FLA_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted"},{"id":"constant1-
     A                                      6","field type":"output field","val-
     A                                      ue":"Report purpose:","css class":"-
     A                                      constant","left":"295px","cursor co-
     A                                      lumn":"4","top":"350px","cursor row-
     A                                      ":"13","parent tab panel":"W0070FLA-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"constant17","field type"-
     A                                      :"output field","value":"More than -
     A                                      7 days of disability :","css class"-
     A                                      :"constant","left":"309px","cursor -
     A                                      column":"6","top":"370px","cursor r-
     A                                      ow":"14","parent tab panel":"W0070F-
     A                                      LA_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCRP01","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCRP01","designValue":"[SCRP01-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase","dataLength":"1"},"text tra-
     A                                      nsform":"uppercase","left":"540px",-
     A                                      "cursor column":"39","top":"370px",-
     A                                      "cursor row":"14","width":"8px","cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"error message":"Val-
     A                                      id values are \"Y\", \"N\" and blan-
     A                                      k.","error condition":{"fieldName":-
     A                                      "81","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"1 message","-
     A                                      parent tab panel":"W0070FLA_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant18","field type":"output-
     A                                       field","value":"Possible dispute  -
     A                                                   :","css class":"consta-
     A                                      nt","left":"309px","cursor column":-
     A                                      "6","top":"390px","cursor row":"15"-
     A                                      ,"parent tab panel":"W0070FLA_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCRP02","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCR-
     A                                      P02","designValue":"[SCRP02]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase",-
     A                                      "dataLength":"1"},"text transform":-
     A                                      "uppercase","left":"540px","cursor -
     A                                      column":"39","top":"390px","cursor -
     A                                      row":"15","width":"8px","css class -
     A                                      3":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"css c-
     A                                      lass 4":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 5":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","c')
     A                                  1 10HTML('ustomFalse":""},"error messag-
     A                                      e":"Valid values are \"Y\", \"N\" a-
     A                                      nd blank.","error condition":{"fiel-
     A                                      dName":"82","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"1 mes-
     A                                      sage","parent tab panel":"W0070FLA_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"constant19","field type":-
     A                                      "output field","value":"Medical onl-
     A                                      y                   :","css class":-
     A                                      "constant","left":"309px","cursor c-
     A                                      olumn":"6","top":"410px","cursor ro-
     A                                      w":"16","parent tab panel":"W0070FL-
     A                                      A_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCRP03","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCRP03","designValue":"[SCRP03]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase","dataLength":"1"},"text tran-
     A                                      sform":"uppercase","left":"540px","-
     A                                      cursor column":"39","top":"410px","-
     A                                      cursor row":"16","width":"8px","css-
     A                                       class 3":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"css class 4":{"fieldName":"N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"read only":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 5":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"error message":"Vali-
     A                                      d values are \"Y\", \"N\" and blank-
     A                                      .","error condition":{"fieldName":"-
     A                                      83","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"1 message","p-
     A                                      arent tab panel":"W0070FLA_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"id"-
     A                                      :"constant20","field type":"output -
     A                                      field","value":"Injury resulted in -
     A                                      death       :","css class":"constan-
     A                                      t","left":"309px","cursor column":"-
     A                                      6","top":"430px","cursor row":"17",-
     A                                      "parent tab panel":"W0070FLA_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCRP04","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCRP-
     A                                      04","designValue":"[SCRP04]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase","-
     A                                      dataLength":"1"},"text transform":"-
     A                                      uppercase","left":"540px","cursor c-
     A                                      olumn":"39","top":"430px","cursor r-
     A                                      ow":"17","width":"8px","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"css cl-
     A                                      ass 4":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"error message":"Valid values-
     A                                       are \"Y\", \"N\" and blank.","erro-
     A                                      r condition":{"fieldName":"84","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"1 message","parent ta-
     A                                      b panel":"W0070FLA_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt21","field type":"output field","-
     A                                      value":"Lump sum compromise/settlem-
     A                                      ent :","css class":"constant","left-
     A                                      ":"309px","cursor column":"6","top"-
     A                                      :"450px","cursor row":"18","parent -
     A                                      tab panel":"W0070FLA_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCRP-
     A                                      05","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCRP05","des-
     A                                      ignValue":"[SCRP05]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase","dataLeng-
     A                                      th":"1"},"text transform":"uppercas-
     A                                      e","left":"540px","cursor column":"-
     A                                      39","top":"450px","cursor row":"18"-
     A                                      ,"width":"8px","css class 3":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"css class 4":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFals')
     A                                  1 11HTML('e":""},"error message":"Valid-
     A                                       values are \"Y\", \"N\" and blank.-
     A                                      ","error condition":{"fieldName":"8-
     A                                      5","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"1 message","pa-
     A                                      rent tab panel":"W0070FLA_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted"},{"id":-
     A                                      "constant22","field type":"output f-
     A                                      ield","value":"Amputation or disfig-
     A                                      urement    :","css class":"constant-
     A                                      ","left":"309px","cursor column":"6-
     A                                      ","top":"470px","cursor row":"19","-
     A                                      parent tab panel":"W0070FLA_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCRP06","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCRP0-
     A                                      6","designValue":"[SCRP06]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase","d-
     A                                      ataLength":"1"},"text transform":"u-
     A                                      ppercase","left":"540px","cursor co-
     A                                      lumn":"39","top":"470px","cursor ro-
     A                                      w":"19","width":"8px","css class 3"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"css cla-
     A                                      ss 4":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 5":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"error message":"Valid values -
     A                                      are \"Y\", \"N\" and blank.","error-
     A                                       condition":{"fieldName":"86","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"1 message","parent tab-
     A                                       panel":"W0070FLA_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 6":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t23","field type":"output field","v-
     A                                      alue":"Other                       -
     A                                         :","css class":"constant","left"-
     A                                      :"309px","cursor column":"6","top":-
     A                                      "490px","cursor row":"20","parent t-
     A                                      ab panel":"W0070FLA_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCRP0-
     A                                      7","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCRP07","desi-
     A                                      gnValue":"[SCRP07]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase","dataLengt-
     A                                      h":"1"},"text transform":"uppercase-
     A                                      ","left":"540px","cursor column":"3-
     A                                      9","top":"490px","cursor row":"20",-
     A                                      "width":"8px","css class 3":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"css class 4":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"er-
     A                                      ror message":"Valid values are \"Y\-
     A                                      ", \"N\" and blank.","error conditi-
     A                                      on":{"fieldName":"87","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"1 message","parent tab panel":-
     A                                      "W0070FLA_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 6":"profound-
     A                                      -converted"},{"id":"btnSubmit","fie-
     A                                      ld type":"button","value":"Enter","-
     A                                      shortcut key":"Enter","left":"14px"-
     A                                      ,"top":"150px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnCF03","field type":"-
     A                                      button","value":"Exit","shortcut ke-
     A                                      y":"F3","left":"14px","top":"183px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF10","field type":"button","value-
     A                                      ":"F10","shortcut key":"F10","left"-
     A                                      :"14px","top":"216px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF12","field -
     A                                      type":"button","value":"Cancel","sh-
     A                                      ortcut key":"F12","left":"14px","to-
     A                                      p":"249px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SC1A2          1A  H
     A            SC20A2        20A  H
     A            SCATME         6S 0H
     A            SCEDN         70A  H
     A            SCRP01         1A  H
     A            SCRP02         1A  H
     A            SCRP03         1A  H
     A            SCRP04         1A  H
     A            SCRP05         1A  H
     A            SCRP06         1A  H
     A            SCRP07         1A  H
     A            SCSS#         11A  H
     A            SCTIM2         6S 0H
     A            SCYRCS        11A  H
     A            SCACDT    R        H      REFFLD(DT8)
     A            SCCNAM    R        H      REFFLD(NM20)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDT2     R        H      REFFLD(DT8)
     A            SCFNAM    R        H      REFFLD(NM20)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPREP    R        H      REFFLD(DT8)
     A            SCRTW     R        H      REFFLD(DT8)
     A            SCSCL#    R   25   H      REFFLD(DS30)
     A          R SCR02
     A  78 79 09
     A  75                                  CA01(78 'Response Indicator *IN78')
     A                                      SETOF(79 'Response Indicator *IN79')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SC20A3C7    WC30610C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     75')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN78","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN79","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"overlay-
     A                                       range":"1-23"},"items":[{"id":"W00-
     A                                      70FLA_SCR02_avKeys","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      AV_KEYS","dataLength":"1134","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none",-
     A                                      "designValue":"[AV_KEYS]"},"left":"-
     A                                      0px","top":"0px","visibility":"hidd-
     A                                      en"},{"id":"W0070FLA_SCR02_action",-
     A                                      "field type":"html container","whit-
     A                                      e space":"normal","left":"0px","top-
     A                                      ":"10px","width":"230px","css class-
     A                                      ":"action-panel-converted","height"-
     A                                      :"700px","html":"<div class=\"top\"-
     A                                      ></div><div class=\"imagetop\"><img-
     A                                       src=\"/profoundui/userdata/images/-
     A                                      bar_top.png\" /></div><div class=\"-
     A                                      menulinks\"></div><div class=\"imag-
     A                                      ebottom\"><img src=\"/profoundui/us-
     A                                      erdata/images/bar_bottom.png\" /></-
     A                                      div><div class=\"bottom\"></div>"},-
     A                                      {"field type":"icon menu button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"32px","z -
     A                                      index":"20","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1170px","id":"W0070-
     A                                      FLA_SCR02_BtnIconMenuSystemTools","-
     A                                      tool tip":"System Tools","icon alig-
     A                                      nment":"middle left","icon width":"-
     A                                      16px","icon height":"24px","icon so-
     A                                      urce":"/profoundui/userdata/images/-
     A                                      systool/systools.png","data functio-
     A                                      n":"SystemToolbarSystools","show do-
     A                                      wn arrow":"Yes"},{"field type":"pan-
     A                                      el","panel style":"TransformButtonB-
     A                                      ar","id":"W0070FLA_SCR02_ButtonBar"-
     A                                      ,"top":"35px","left":"1036px","widt-
     A                                      h":"187px","height":"28px","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en","locked in place":"true"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1040px","id":"W007-
     A                                      0FLA_SCR02_BtnSave","tool tip":"Sav-
     A                                      e","onclick":"SystemToolbarSave","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/save.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1066px","-
     A                                      id":"W0070FLA_SCR02_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"W0070FLA_-
     A                                      SCR02_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"W0070FLA_SCR02_BtnDiaryItem-
     A                                      s","tool tip":"Diary/Work Items - I-
     A                                      DARTS","onclick":"SystemToolbarDiar-
     A                                      y","background image":{"fieldName":-
     A                                      "DryIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1144px","-
     A                                      id":"W0070FLA_SCR02_BtnSystemMessag-
     A                                      es","tool tip":"System Mes')
     A                                  1  4HTML('sages","onclick":"SystemToolb-
     A                                      arMessages","background image":{"fi-
     A                                      eldName":"MsgIcnURL","dataLength":"-
     A                                      128","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"}},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1196px","id":"W0070FLA_SCR02_BtnHel-
     A                                      p","tool tip":"Help","onclick":"Sys-
     A                                      temToolbarHelp","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/help.png'')"},{"id":"W0070F-
     A                                      LA_SCR02_ImgSysToolBottom","field t-
     A                                      ype":"image","image source":"/profo-
     A                                      undui/userdata/images/systool/butba-
     A                                      rbot.png","left":"1036px","top":"64-
     A                                      px","width":"187px","locked in plac-
     A                                      e":"true","css class":"stationary",-
     A                                      "visibility":"hidden"},{"id":"W0070-
     A                                      FLA_SCR02_MainTabPanel","field type-
     A                                      ":"tab panel","tab panel style":"Tr-
     A                                      ansform","tab names":{"fieldName":"-
     A                                      SCPRDS","designValue":"[SCPRDS]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"active tab"-
     A                                      :"0","left":"250px","top":"70px","w-
     A                                      idth":"970px","height":"657px","z i-
     A                                      ndex":"8","locked in place":"true",-
     A                                      "css class":"tab-panel","css class -
     A                                      2":"stationary"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0070FLA_SCR02_BtnHiddenSave",-
     A                                      "value":"btnSave","top":"100px","re-
     A                                      sponse":{"fieldName":"btnSave","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant24","field type":"output-
     A                                       field","left":"281px","cursor colu-
     A                                      mn":"2","top":"110px","cursor row":-
     A                                      "1","css class":"top-line","value":-
     A                                      "js: currentUser()","css class 2":"-
     A                                      output-field","parent tab panel":"W-
     A                                      0070FLA_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"SCR02_SCCONM","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCCONM","designValue":"-
     A                                      [SCCONM]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      414px","cursor column":"21","top":"-
     A                                      110px","cursor row":"1","css class -
     A                                      2":"top-line","css class 3":"HI","p-
     A                                      arent tab panel":"W0070FLA_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 4":"profound-converted"},{"id"-
     A                                      :"constant25","field type":"output -
     A                                      field","left":"778px","cursor colum-
     A                                      n":"73","top":"110px","cursor row":-
     A                                      "1","css class":"top-line","value":-
     A                                      "js: currentDate()","css class 2":"-
     A                                      output-field","parent tab panel":"W-
     A                                      0070FLA_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"W0070FLA_SCR02_fk-
     A                                      eyMenu","field type":"menu","left":-
     A                                      "10px","top":"120px","height":"350p-
     A                                      x","width":"230px","hover backgroun-
     A                                      d color":"#9AAA61","hover text colo-
     A                                      r":"#FFFFFF","border color":"#4C610-
     A                                      6","menu option indent":"10px","bac-
     A                                      kground color":"#758B27","css class-
     A                                      ":"action-menu","css class 2":"stat-
     A                                      ionary","z index":"101"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0070FLA_SCR02_BtnHidd-
     A                                      enRefresh","value":"btnRefresh","to-
     A                                      p":"125px","response":{"fieldName":-
     A                                      "btnRefresh","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"SCR02_Q1PGM","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"Q1PGM","designValue":"-
     A                                      [Q1PGM]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none","dataLength":"10"},"css c-
     A                                      lass":"output-field","left":"281px"-
     A                                      ,"cursor column":"2","top":"130px",-
     A                                      "cursor row":"2","parent tab panel"-
     A                                      :"W0070FLA_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCR02_SCPRDS",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCPRDS","designValue-
     A                                      ":"[SCPRDS]","refField":"NAME","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"414px","cursor column":"21","top-
     A                                      ":"130px","cursor row":"2","css cla-
     A                                      ss 2":"HI","parent tab panel":"W007-
     A                                      0FLA_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","visibility":"hidden","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant26","field type":"output -
     A                                      field","value":"SCR02","css class":-
     A                                      "constant","left":"799px",')
     A                                  1  5HTML('"cursor column":"76","top":"1-
     A                                      30px","cursor row":"2","parent tab -
     A                                      panel":"W0070FLA_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCR02_SC-
     A                                      MODE","field type":"output field","-
     A                                      value":{"fieldName":"SCMODE","desig-
     A                                      nValue":"[SCMODE]","refField":"PGM"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"764px","cursor column":"71"-
     A                                      ,"top":"150px","cursor row":"3","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "W0070FLA_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W0070FLA_SCR02_BtnHiddenSearch","v-
     A                                      alue":"btnSearch","top":"150px","re-
     A                                      sponse":{"fieldName":"btnSearch","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant27","field type":"outp-
     A                                      ut field","value":"Group:","css cla-
     A                                      ss":"constant","left":"281px","curs-
     A                                      or column":"2","top":"170px","curso-
     A                                      r row":"4","parent tab panel":"W007-
     A                                      0FLA_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCR02_SCFND","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCFND","designValue":"[SCFN-
     A                                      D]","refField":"FND","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00"},"css clas-
     A                                      s":"output-field","left":"330px","c-
     A                                      ursor column":"9","top":"170px","cu-
     A                                      rsor row":"4","width":"21px","text -
     A                                      align":"right","parent tab panel":"-
     A                                      W0070FLA_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCR02_SCFNAM","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCFNAM","designValue":-
     A                                      "[SCFNAM]","refField":"NM20","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "358px","cursor column":"13","top":-
     A                                      "170px","cursor row":"4","descripti-
     A                                      on":"FUND NAME","parent tab panel":-
     A                                      "W0070FLA_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"constant28","fi-
     A                                      eld type":"output field","value":"S-
     A                                      S#:","css class":"constant","left":-
     A                                      "505px","cursor column":"34","top":-
     A                                      "170px","cursor row":"4","parent ta-
     A                                      b panel":"W0070FLA_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR02_-
     A                                      SCSS#","field type":"output field",-
     A                                      "value":{"fieldName":"SCSS#","desig-
     A                                      nValue":"[SCSS#]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none","dataLength":"11-
     A                                      "},"css class":"output-field","left-
     A                                      ":"540px","cursor column":"39","top-
     A                                      ":"170px","cursor row":"4","parent -
     A                                      tab panel":"W0070FLA_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCR0-
     A                                      2_SCCNAM","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCCNAM","d-
     A                                      esignValue":"[SCCNAM]","refField":"-
     A                                      NM20","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"624px","cursor column"-
     A                                      :"51","top":"170px","cursor row":"4-
     A                                      ","parent tab panel":"W0070FLA_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W0070FLA_SCR0-
     A                                      2_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t29","field type":"output field","v-
     A                                      alue":"Emp# :","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"190px","cursor row":"5","-
     A                                      parent tab panel":"W0070FLA_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCR02_SCEDN","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCED-
     A                                      N","designValue":"[SCEDN]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none","dataLe-
     A                                      ngth":"70"},"css class":"output-fie-
     A                                      ld","left":"330px","cursor column":-
     A                                      "9","top":"190px","cursor row":"5",-
     A                                      "description":"Emp#, DIV, & NAME","-
     A                                      parent tab panel":"W0070FLA_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W0070FLA_SCR02_B-
     A                                      tnHiddenSystemMessages","v')
     A                                  1  6HTML('alue":"btnMessage","top":"200-
     A                                      px","response":{"fieldName":"btnMes-
     A                                      sage","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant30","field typ-
     A                                      e":"output field","value":"Case#:",-
     A                                      "css class":"constant","left":"281p-
     A                                      x","cursor column":"2","top":"210px-
     A                                      ","cursor row":"6","parent tab pane-
     A                                      l":"W0070FLA_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCR02_SCYRCS-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCYRCS","designVal-
     A                                      ue":"[SCYRCS]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"11"},-
     A                                      "css class":"output-field","left":"-
     A                                      330px","cursor column":"9","top":"2-
     A                                      10px","cursor row":"6","description-
     A                                      ":"FYR-CASE","parent tab panel":"W0-
     A                                      070FLA_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant31","field-
     A                                       type":"output field","value":"SCL#-
     A                                      :","css class":"constant","left":"4-
     A                                      21px","cursor column":"22","top":"2-
     A                                      10px","cursor row":"6","parent tab -
     A                                      panel":"W0070FLA_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCR02_SC-
     A                                      SCL#","field type":"output field","-
     A                                      value":{"fieldName":"SCSCL#","desig-
     A                                      nValue":"[SCSCL#]","refField":"DS30-
     A                                       25","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"463px","cursor column":-
     A                                      "28","top":"210px","cursor row":"6"-
     A                                      ,"description":"STATE CLAIM #","par-
     A                                      ent tab panel":"W0070FLA_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant32","field type":"output fi-
     A                                      eld","value":"DOI:","css class":"co-
     A                                      nstant","left":"645px","cursor colu-
     A                                      mn":"54","top":"210px","cursor row"-
     A                                      :"6","parent tab panel":"W0070FLA_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR02_SCACDT","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCACDT","designValue":"[SCACDT]"-
     A                                      ,"refField":"DT8","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"true","zer-
     A                                      oFill":"true","curSym":"","units":"-
     A                                      ","negNum":"-999.00","edtWrd":"''  -
     A                                      /  /    ''"},"css class":"output-fi-
     A                                      eld","left":"680px","cursor column"-
     A                                      :"59","top":"210px","cursor row":"6-
     A                                      ","width":"70px","text align":"righ-
     A                                      t","css class 2":"BLU","parent tab -
     A                                      panel":"W0070FLA_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W0070FLA_SCR02_BtnHiddenWor-
     A                                      kSubmitJob","value":"btnWrksbmjob",-
     A                                      "top":"225px","response":{"fieldNam-
     A                                      e":"btnWrkJob","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0070FLA_SCR02_BtnHiddenWorkPrin-
     A                                      terOutput","value":"btnWrkprtout","-
     A                                      top":"250px","response":{"fieldName-
     A                                      ":"btnWrkPrnt","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant33","-
     A                                      field type":"output field","value":-
     A                                      "Parish of injury      :","css clas-
     A                                      s":"constant","left":"295px","curso-
     A                                      r column":"4","top":"270px","cursor-
     A                                       row":"9","parent tab panel":"W0070-
     A                                      FLA_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SC20A3","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SC20A3","designValue":"[SC20A-
     A                                      3]","refField":"DS20","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue"},"left":"463px","cursor column"-
     A                                      :"28","top":"270px","cursor row":"9-
     A                                      ","width":"141px","css class 3":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"css class 4-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 5":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"error message id":"WC30610","erro-
     A                                      r message file":"WMESGG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"75","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"1 message","parent tab panel"-
     A                                      :"W0070FLA_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 6"')
     A                                  1  7HTML(':"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0070FLA_SCR02_Btn-
     A                                      HiddenImageQueue","value":"btnImgQu-
     A                                      e","top":"275px","response":{"field-
     A                                      Name":"btnImgQue","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0070FLA_SCR02_BtnHiddenHelp"-
     A                                      ,"value":"btnHelp","top":"300px","r-
     A                                      esponse":{"fieldName":"btnHelp","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant34","field type":"outpu-
     A                                      t field","value":"Place of injury p-
     A                                      arish:","css class":"constant","lef-
     A                                      t":"295px","cursor column":"4","top-
     A                                      ":"310px","cursor row":"11","parent-
     A                                       tab panel":"W0070FLA_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SC3-
     A                                      0A3","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SC30A3","de-
     A                                      signValue":"[SC30A3]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      dataLength":"30"},"left":"463px","c-
     A                                      ursor column":"28","top":"310px","c-
     A                                      ursor row":"11","width":"211px","cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"description":"DESCR-
     A                                      IPTION","parent tab panel":"W0070FL-
     A                                      A_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed"},{"id":"constant35","field type-
     A                                      ":"output field","value":"Departmen-
     A                                      t            :","css class":"consta-
     A                                      nt","left":"295px","cursor column":-
     A                                      "4","top":"350px","cursor row":"13"-
     A                                      ,"parent tab panel":"W0070FLA_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SC40A4","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SC4-
     A                                      0A4","designValue":"[SC40A4]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","dataLength":"40"},"left":"4-
     A                                      63px","cursor column":"28","top":"3-
     A                                      50px","cursor row":"13","width":"28-
     A                                      1px","css class 3":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"css class 4":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 5":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"parent tab -
     A                                      panel":"W0070FLA_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      36","field type":"output field","va-
     A                                      lue":"Specific activity employee wa-
     A                                      s performing when event occurred:",-
     A                                      "css class":"constant","left":"295p-
     A                                      x","cursor column":"4","top":"390px-
     A                                      ","cursor row":"15","parent tab pan-
     A                                      el":"W0070FLA_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SC60A3","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SC60A3","designValu-
     A                                      e":"[SC60A3]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","dataLeng-
     A                                      th":"60"},"left":"309px","cursor co-
     A                                      lumn":"6","top":"410px","cursor row-
     A                                      ":"16","width":"421px","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"css cl-
     A                                      ass 4":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"parent tab panel":"W0070FLA_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"SC60A4","field t')
     A                                  1  8HTML('ype":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SC60A4","designVal-
     A                                      ue":"[SC60A4]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","dataLen-
     A                                      gth":"60"},"left":"309px","cursor c-
     A                                      olumn":"6","top":"430px","cursor ro-
     A                                      w":"17","width":"421px","css class -
     A                                      3":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"css c-
     A                                      lass 4":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 5":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"parent tab panel":"W0070FLA-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 6":"profound-converte-
     A                                      d"},{"id":"constant37","field type"-
     A                                      :"output field","value":"What cause-
     A                                      d the injury to happen?","css class-
     A                                      ":"constant","left":"295px","cursor-
     A                                       column":"4","top":"470px","cursor -
     A                                      row":"19","parent tab panel":"W0070-
     A                                      FLA_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SC160A","field type":-
     A                                      "text area","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SC160A","designValue":"[SC1-
     A                                      60A]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","dataLength":"160-
     A                                      "},"left":"274px","cursor column":"-
     A                                      1","top":"490px","cursor row":"20",-
     A                                      "width":"560px","height":"60px","cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"parent tab panel":"-
     A                                      W0070FLA_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"btnSubmit","fiel-
     A                                      d type":"button","value":"Enter","s-
     A                                      hortcut key":"Enter","left":"14px",-
     A                                      "top":"150px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF03","field type":"b-
     A                                      utton","value":"Exit","shortcut key-
     A                                      ":"F3","left":"14px","top":"183px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF12","field type":"button","value"-
     A                                      :"Cancel","shortcut key":"F12","lef-
     A                                      t":"14px","top":"216px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SC160A       160A  H
     A            SC30A3        30A  H
     A            SC40A4        40A  H
     A            SC60A3        60A  H
     A            SC60A4        60A  H
     A            SCEDN         70A  H
     A            SCSS#         11A  H
     A            SCYRCS        11A  H
     A            SC20A3    R        H      REFFLD(DS20)
     A            SCACDT    R        H      REFFLD(DT8)
     A            SCCNAM    R        H      REFFLD(NM20)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFNAM    R        H      REFFLD(NM20)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSCL#    R   25   H      REFFLD(DS30)
     A          R SCR03
     A  31 32 71
     A  72 73 09                            CA01(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                  1  2HTML('QPUIREC3    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C5  -
     A                                        SCDT3C7    WCR0500C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     71RERRMSG-
     A                                          2    C5    SC2A1C19   Invalid s-
     A                                      tate code.E1    3     72')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN71","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN72","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN73","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN31","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN32","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"overlay range":"-
     A                                      1-23"},"items":[{"id":"W0070FLA_SCR-
     A                                      03_avKeys","field type":"output fie-
     A                                      ld","value":{"fieldName":"AV_KEYS",-
     A                                      "dataLength":"1134","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[AV_KEYS]"},"left":"0px","top-
     A                                      ":"0px","visibility":"hidden"},{"id-
     A                                      ":"W0070FLA_SCR03_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"W0070FLA_SCR03-
     A                                      _BtnIconMenuSystemTools","tool tip"-
     A                                      :"System Tools","icon alignment":"m-
     A                                      iddle left","icon width":"16px","ic-
     A                                      on height":"24px","icon source":"/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      ystools.png","data function":"Syste-
     A                                      mToolbarSystools","show down arrow"-
     A                                      :"Yes"},{"field type":"panel","pane-
     A                                      l style":"TransformButtonBar","id":-
     A                                      "W0070FLA_SCR03_ButtonBar","top":"3-
     A                                      5px","left":"1036px","width":"187px-
     A                                      ","height":"28px","css class":"stat-
     A                                      ionary","visibility":"hidden","lock-
     A                                      ed in place":"true"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1040px","id":"W0070FLA_SCR0-
     A                                      3_BtnSave","tool tip":"Save","oncli-
     A                                      ck":"SystemToolbarSave","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/save.png'')"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1066px","id":"W007-
     A                                      0FLA_SCR03_BtnRefresh","tool tip":"-
     A                                      Refresh","onclick":"SystemToolbarRe-
     A                                      fresh","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/r-
     A                                      efresh.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1092px","id":"W0070FLA_SCR03_Btn-
     A                                      Search","tool tip":"Search","onclic-
     A                                      k":"SystemToolbarSearch","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/search.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1118px","id":"W-
     A                                      0070FLA_SCR03_BtnDiaryItems","tool -
     A                                      tip":"Diary/Work Items - IDARTS","o-
     A                                      nclick":"SystemToolbarDiary","backg-
     A                                      round image":{"fieldName":"DryIcnUR-
     A                                      L","dataLength":"128","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"}},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","backgrou')
     A                                  1  4HTML('nd color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"114-
     A                                      4px","id":"W0070FLA_SCR03_BtnSystem-
     A                                      Messages","tool tip":"System Messag-
     A                                      es","onclick":"SystemToolbarMessage-
     A                                      s","background image":{"fieldName":-
     A                                      "MsgIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1196px","-
     A                                      id":"W0070FLA_SCR03_BtnHelp","tool -
     A                                      tip":"Help","onclick":"SystemToolba-
     A                                      rHelp","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/h-
     A                                      elp.png'')"},{"id":"W0070FLA_SCR03_-
     A                                      ImgSysToolBottom","field type":"ima-
     A                                      ge","image source":"/profoundui/use-
     A                                      rdata/images/systool/butbarbot.png"-
     A                                      ,"left":"1036px","top":"64px","widt-
     A                                      h":"187px","locked in place":"true"-
     A                                      ,"css class":"stationary","visibili-
     A                                      ty":"hidden"},{"id":"W0070FLA_SCR03-
     A                                      _MainTabPanel","field type":"tab pa-
     A                                      nel","tab panel style":"Transform",-
     A                                      "tab names":{"fieldName":"SCPRDS","-
     A                                      designValue":"[SCPRDS]","refField":-
     A                                      "NAME","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"active tab":"0","lef-
     A                                      t":"250px","top":"70px","width":"97-
     A                                      0px","height":"657px","z index":"8"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"tab-panel","css class 2":"stati-
     A                                      onary"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W007-
     A                                      0FLA_SCR03_BtnHiddenSave","value":"-
     A                                      btnSave","top":"100px","response":{-
     A                                      "fieldName":"btnSave","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt38","field type":"output field","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class":"top-line","value":"js: curr-
     A                                      entUser()","css class 2":"output-fi-
     A                                      eld","parent tab panel":"W0070FLA_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"SCR03_SCCONM","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCCONM","designValue":"[SCCONM]"-
     A                                      ,"refField":"NAME","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"414px","c-
     A                                      ursor column":"21","top":"110px","c-
     A                                      ursor row":"1","css class 2":"top-l-
     A                                      ine","css class 3":"HI","parent tab-
     A                                       panel":"W0070FLA_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 4":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t39","field type":"output field","l-
     A                                      eft":"778px","cursor column":"73","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class":"top-line","value":"js: curr-
     A                                      entDate()","css class 2":"output-fi-
     A                                      eld","parent tab panel":"W0070FLA_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"W0070FLA_SCR03_fkeyMenu","-
     A                                      field type":"menu","left":"10px","t-
     A                                      op":"120px","height":"350px","width-
     A                                      ":"230px","hover background color":-
     A                                      "#9AAA61","hover text color":"#FFFF-
     A                                      FF","border color":"#4C6106","menu -
     A                                      option indent":"10px","background c-
     A                                      olor":"#758B27","css class":"action-
     A                                      -menu","css class 2":"stationary","-
     A                                      z index":"101"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W0070FLA_SCR03_BtnHiddenRefresh-
     A                                      ","value":"btnRefresh","top":"125px-
     A                                      ","response":{"fieldName":"btnRefre-
     A                                      sh","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"SCR03_Q1PGM","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"Q1PGM","designValue":"[Q1PGM]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      ,"dataLength":"10"},"css class":"ou-
     A                                      tput-field","left":"281px","cursor -
     A                                      column":"2","top":"130px","cursor r-
     A                                      ow":"2","parent tab panel":"W0070FL-
     A                                      A_SCR03_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCR03_SCPRDS","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCPRDS","designValue":"[SCPRD-
     A                                      S]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left')
     A                                  1  5HTML('":"414px","cursor column":"21-
     A                                      ","top":"130px","cursor row":"2","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"W0070FLA_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","visibility":"hidden",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant40","field type":"o-
     A                                      utput field","value":"SCR02","css c-
     A                                      lass":"constant","left":"799px","cu-
     A                                      rsor column":"76","top":"130px","cu-
     A                                      rsor row":"2","parent tab panel":"W-
     A                                      0070FLA_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR03_SCMODE","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCMODE","designValue":"-
     A                                      [SCMODE]","refField":"PGM","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"7-
     A                                      64px","cursor column":"71","top":"1-
     A                                      50px","cursor row":"3","css class 2-
     A                                      ":"HI","parent tab panel":"W0070FLA-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W0070FLA-
     A                                      _SCR03_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant41","field type":"output field"-
     A                                      ,"value":"Group:","css class":"cons-
     A                                      tant","left":"281px","cursor column-
     A                                      ":"2","top":"170px","cursor row":"4-
     A                                      ","parent tab panel":"W0070FLA_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCR03_SCFND","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CFND","designValue":"[SCFND]","refF-
     A                                      ield":"FND","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00"},"css class":"outpu-
     A                                      t-field","left":"330px","cursor col-
     A                                      umn":"9","top":"170px","cursor row"-
     A                                      :"4","width":"21px","text align":"r-
     A                                      ight","parent tab panel":"W0070FLA_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCR03_SCFNAM","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCFNAM","designValue":"[SCFNAM]-
     A                                      ","refField":"NM20","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"358px","-
     A                                      cursor column":"13","top":"170px","-
     A                                      cursor row":"4","description":"FUND-
     A                                       NAME","parent tab panel":"W0070FLA-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"constant42","field type"-
     A                                      :"output field","value":"SS#:","css-
     A                                       class":"constant","left":"505px","-
     A                                      cursor column":"34","top":"170px","-
     A                                      cursor row":"4","parent tab panel":-
     A                                      "W0070FLA_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR03_SCSS#","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCSS#","designValue":"-
     A                                      [SCSS#]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none","dataLength":"11"},"css c-
     A                                      lass":"output-field","left":"540px"-
     A                                      ,"cursor column":"39","top":"170px"-
     A                                      ,"cursor row":"4","parent tab panel-
     A                                      ":"W0070FLA_SCR03_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCR03_SCCNAM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCCNAM","designValu-
     A                                      e":"[SCCNAM]","refField":"NM20","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"624px","cursor column":"51","to-
     A                                      p":"170px","cursor row":"4","parent-
     A                                       tab panel":"W0070FLA_SCR03_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0070FLA_SCR03_BtnHidd-
     A                                      enDiaryItems","value":"btnDiary","t-
     A                                      op":"175px","response":{"fieldName"-
     A                                      :"btnDiary","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant43","fie-
     A                                      ld type":"output field","value":"Em-
     A                                      p# :","css class":"constant","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "190px","cursor row":"5","parent ta-
     A                                      b panel":"W0070FLA_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR03_-
     A                                      SCEDN","field type":"output field",-
     A                                      "value":{"fieldName":"SCEDN","desig-
     A                                      nValue":"[SCEDN]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none","dataLength":"70-
     A                                      "},"css class":"output-field","left-
     A                                      ":"330px","cursor column":"9","top"-
     A                                      :"190px","cursor row":"5","descript-
     A                                      ion":"Emp#, DIV, & NAME","')
     A                                  1  6HTML('parent tab panel":"W0070FLA_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W0070FLA_S-
     A                                      CR03_BtnHiddenSystemMessages","valu-
     A                                      e":"btnMessage","top":"200px","resp-
     A                                      onse":{"fieldName":"btnMessage","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant44","field type":"outpu-
     A                                      t field","value":"Case#:","css clas-
     A                                      s":"constant","left":"281px","curso-
     A                                      r column":"2","top":"210px","cursor-
     A                                       row":"6","parent tab panel":"W0070-
     A                                      FLA_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCR03_SCYRCS","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCYRCS","designValue":"[SCY-
     A                                      RCS]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none","dataLength":"11"},"css clas-
     A                                      s":"output-field","left":"330px","c-
     A                                      ursor column":"9","top":"210px","cu-
     A                                      rsor row":"6","description":"FYR-CA-
     A                                      SE","parent tab panel":"W0070FLA_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"constant45","field type":"o-
     A                                      utput field","value":"SCL#:","css c-
     A                                      lass":"constant","left":"421px","cu-
     A                                      rsor column":"22","top":"210px","cu-
     A                                      rsor row":"6","parent tab panel":"W-
     A                                      0070FLA_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR03_SCSCL#","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCSCL#","designValue":"-
     A                                      [SCSCL#]","refField":"DS30 25","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"463px","cursor column":"28","top-
     A                                      ":"210px","cursor row":"6","descrip-
     A                                      tion":"STATE CLAIM #","parent tab p-
     A                                      anel":"W0070FLA_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"constant4-
     A                                      6","field type":"output field","val-
     A                                      ue":"DOI:","css class":"constant","-
     A                                      left":"645px","cursor column":"54",-
     A                                      "top":"210px","cursor row":"6","par-
     A                                      ent tab panel":"W0070FLA_SCR03_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCR03_SCACDT","field type":"output -
     A                                      field","value":{"fieldName":"SCACDT-
     A                                      ","designValue":"[SCACDT]","refFiel-
     A                                      d":"DT8","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"true","zeroFill":"t-
     A                                      rue","curSym":"","units":"","negNum-
     A                                      ":"-999.00","edtWrd":"''  /  /    '-
     A                                      '"},"css class":"output-field","lef-
     A                                      t":"680px","cursor column":"59","to-
     A                                      p":"210px","cursor row":"6","width"-
     A                                      :"70px","text align":"right","css c-
     A                                      lass 2":"BLU","parent tab panel":"W-
     A                                      0070FLA_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      0070FLA_SCR03_BtnHiddenWorkSubmitJo-
     A                                      b","value":"btnWrksbmjob","top":"22-
     A                                      5px","response":{"fieldName":"btnWr-
     A                                      kJob","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W0070F-
     A                                      LA_SCR03_BtnHiddenWorkPrinterOutput-
     A                                      ","value":"btnWrkprtout","top":"250-
     A                                      px","response":{"fieldName":"btnWrk-
     A                                      Prnt","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W0070F-
     A                                      LA_SCR03_BtnHiddenImageQueue","valu-
     A                                      e":"btnImgQue","top":"275px","respo-
     A                                      nse":{"fieldName":"btnImgQue","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant47","field type":"output -
     A                                      field","value":"Occupational diseas-
     A                                      e, date diagnoised:","css class":"c-
     A                                      onstant","left":"295px","cursor col-
     A                                      umn":"4","top":"290px","cursor row"-
     A                                      :"10","parent tab panel":"W0070FLA_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCDT3","field type":"date-
     A                                       field","css class":"input","css cl-
     A                                      ass 2":"date-field","value":{"field-
     A                                      Name":"SCDT3","designValue":"[SCDT3-
     A                                      ]","refField":"DT8","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","numBlankF-
     A                                      ill":"true","edtWrd":"''  /  /    '-
     A                                      '","dateFormat":"m/d/Y"},"left":"56-
     A                                      8px","cursor column":"43","top":"29-
     A                                      0px","cursor row":"10","width":"71p-
     A                                      x","text align":"right","css class -
     A                                      3":{"fieldName":"09","data')
     A                                  1  7HTML('Type":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"error messag-
     A                                      e id":"WCR0500","error message file-
     A                                      ":"WMESGG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"71","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"1 messag-
     A                                      e","parent tab panel":"W0070FLA_SCR-
     A                                      03_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0070FLA_SCR-
     A                                      03_BtnHiddenHelp","value":"btnHelp"-
     A                                      ,"top":"300px","response":{"fieldNa-
     A                                      me":"btnHelp","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant48","f-
     A                                      ield type":"output field","value":"-
     A                                      Person completing this report:","cs-
     A                                      s class":"constant","left":"295px",-
     A                                      "cursor column":"4","top":"330px","-
     A                                      cursor row":"12","parent tab panel"-
     A                                      :"W0070FLA_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCPRNM","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCPRNM","designValue":-
     A                                      "[SCPRNM]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","dataLength"-
     A                                      :"60"},"left":"309px","cursor colum-
     A                                      n":"6","top":"350px","cursor row":"-
     A                                      13","width":"421px","css class 3":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"css class-
     A                                       4":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"parent tab panel":"W0070FLA_SCR-
     A                                      03_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted"},-
     A                                      {"id":"constant49","field type":"ou-
     A                                      tput field","value":"Employers addr-
     A                                      ess if different:","css class":"con-
     A                                      stant","left":"295px","cursor colum-
     A                                      n":"4","top":"390px","cursor row":"-
     A                                      15","parent tab panel":"W0070FLA_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"constant50","field type":"o-
     A                                      utput field","value":"Address:","cs-
     A                                      s class":"constant","left":"316px",-
     A                                      "cursor column":"7","top":"410px","-
     A                                      cursor row":"16","parent tab panel"-
     A                                      :"W0070FLA_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SC40A1","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SC40A1","designValue":-
     A                                      "[SC40A1]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","dataLength"-
     A                                      :"40"},"left":"379px","cursor colum-
     A                                      n":"16","top":"410px","cursor row":-
     A                                      "16","width":"281px","css class 3":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"HI","customFalse":""},"css clas-
     A                                      s 4":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"re-
     A                                      ad only":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 5":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"parent tab panel":"W0070FLA_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 6":"profound-converted"}-
     A                                      ,{"id":"constant51","field type":"o-
     A                                      utput field","value":"City   :","cs-
     A                                      s class":"constant","left":"316px",-
     A                                      "cursor column":"7","top":"430px","-
     A                                      cursor row":"17","parent tab panel"-
     A                                      :"W0070FLA_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SC25A1","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SC25A1","designValue":-
     A                                      "[SC25A1]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","dataLength"-
     A                                      :"25"},"left":"379px","cursor colum-
     A                                      n":"16","top":"430px","cursor row":-
     A                                      "17","width":"176px","css ')
     A                                  1  8HTML('class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"css class 4":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 5":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR"-
     A                                      ,"customFalse":""},"parent tab pane-
     A                                      l":"W0070FLA_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant52",-
     A                                      "field type":"output field","value"-
     A                                      :"State:","css class":"constant","l-
     A                                      eft":"568px","cursor column":"43","-
     A                                      top":"430px","cursor row":"17","par-
     A                                      ent tab panel":"W0070FLA_SCR03_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SC2A1","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SC2A1","d-
     A                                      esignValue":"[SC2A1]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase","dataLen-
     A                                      gth":"2"},"text transform":"upperca-
     A                                      se","left":"617px","cursor column":-
     A                                      "50","top":"430px","cursor row":"17-
     A                                      ","width":"15px","css class 3":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"css class 4"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 5":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "set focus":{"fieldName":"31","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"error message":"Invalid state co-
     A                                      de.","error condition":{"fieldName"-
     A                                      :"72","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"1 message",-
     A                                      "parent tab panel":"W0070FLA_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted"},{"i-
     A                                      d":"constant53","field type":"outpu-
     A                                      t field","value":"Zip:","css class"-
     A                                      :"constant","left":"645px","cursor -
     A                                      column":"54","top":"430px","cursor -
     A                                      row":"17","parent tab panel":"W0070-
     A                                      FLA_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SC9N2A","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SC9N2A","designValue":"[SC9N2-
     A                                      A]","dataType":"zoned","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00","dataLength":"5","decPos":"0","-
     A                                      numBlankFill":"true"},"left":"680px-
     A                                      ","cursor column":"59","top":"430px-
     A                                      ","cursor row":"17","width":"36px",-
     A                                      "text align":"right","css class 3":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"HI","customFalse":""},"css clas-
     A                                      s 4":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"re-
     A                                      ad only":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 5":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"set focus":{"fieldName":"32","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"parent tab panel":"W0070FLA_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"constant54","field type":-
     A                                      "output field","value":"-","css cla-
     A                                      ss":"constant","left":"722px","curs-
     A                                      or column":"65","top":"430px","curs-
     A                                      or row":"17","parent tab panel":"W0-
     A                                      070FLA_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SC9N2B","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SC9N2B","designValue":"[SC-
     A                                      9N2B]","dataType":"zoned","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"false","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"9-
     A                                      99.00","dataLength":"4","decPos":"0-
     A                                      ","numBlankFill":"true"},"left":"73-
     A                                      6px","cursor column":"67","top":"43-
     A                                      0px","cursor row":"17","width":"29p-
     A                                      x","text align":"right","css class -
     A                                      3":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"css c-
     A                                      lass 4":{"fieldName":"N09"')
     A                                  1  9HTML(',"dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"parent tab p-
     A                                      anel":"W0070FLA_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted"},{"id":"btnSubmit-
     A                                      ","field type":"button","value":"En-
     A                                      ter","shortcut key":"Enter","left":-
     A                                      "14px","top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF03","field t-
     A                                      ype":"button","value":"Exit","short-
     A                                      cut key":"F3","left":"14px","top":"-
     A                                      183px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF12","field type":"button",-
     A                                      "value":"Cancel","shortcut key":"F1-
     A                                      2","left":"14px","top":"216px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SC25A1        25A  H
     A            SC2A1          2A  H
     A            SC40A1        40A  H
     A            SC9N2A         5S 0H
     A            SC9N2B         4S 0H
     A            SCEDN         70A  H
     A            SCPRNM        60A  H
     A            SCSS#         11A  H
     A            SCYRCS        11A  H
     A            SCACDT    R        H      REFFLD(DT8)
     A            SCCNAM    R        H      REFFLD(NM20)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDT3     R        H      REFFLD(DT8)
     A            SCFNAM    R        H      REFFLD(NM20)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSCL#    R   25   H      REFFLD(DS30)
