     A                                      REF(*LIBL/WREFP)
     A          R SCR01
     A  71 72 73
     A  74 75 76
     A  77 78 89                            CA01(71 'Response Indicator *IN71')
     A  09 40                               CA02(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                      SETOF(74 'Response Indicator *IN74')
     A                                      SETOF(75 'Response Indicator *IN75')
     A                                      SETOF(76 'Response Indicator *IN76')
     A                                      SETOF(77 'Response Indicator *IN77')
     A                                      SETOF(78 'Response Indicator *IN78')
     A                                      SETOF(89 'Response Indicator *IN89')
     A                                  1  2HTML('QPUIREC11   RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C6    SCPRCDC7    WCR0-
     A                                      503C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     71RERRMSGID  5    C6    SC-
     A                                      PRCDC7    WC30005C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     78RERRMSGID -
     A                                       5    C6    SCPAYEC7    WCR0503C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        77RERRMSGID  5    C5    SCAMTC7  -
     A                                        WCR0502C6    WMESGGC5    *LIBLC0 -
     A                                         E1    3     72RERRMSGID  5    C6-
     A                                          SCSTDTC7    WCR0529C6    WMESGG-
     A                                      C5    *LIBLC0    E1    3     76RERR-
     A                                      MSGID  5    C6    SCSTDTC7    WCR05-
     A                                      00C6    WMESGGC5    *LIBLC0    E1  -
     A                                        3     73RERRMSGID  5    C6    SCE-
     A                                      NDTC7    WCR0529C6    WMESGGC5    *-
     A                                      LIBLC0    E1    3     76RERRMSGID  -
     A                                      5    C6    SCENDTC7    WCR0500C6   -
     A                                       WMESGGC5    *LIBLC0    E1    3    -
     A                                       74RERRMSGID  5    C6    SCISDTC7  -
     A                                        WCR0500C6    WMESGGC5    *LIBLC0 -
     A                                         E1    3     75')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN71","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN72","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN73","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN74","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN75","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN76","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN77","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN78","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN89","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"assume":"true","return curso-
     A                                      r record":{"fieldName":"HREC","data-
     A                                      Length":"10","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"none"},"return cursor field"-
     A                                      :{"fieldName":"HFLD","dataLength":"-
     A                                      10","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"no-
     A                                      ne"},"overlay range":"1-23"},"items-
     A                                      ":[{"id":"HFLD","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HFLD","designValu-
     A                                      e":"[HFLD]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"HREC",-
     A                                      "field type":"output field","visibi-
     A                                      lity":"hidden","value":{"fieldName"-
     A                                      :"HREC","designValue":"[HREC]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"10"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"W0074F02_SCR01_avKeys"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"AV_KEYS","dataLengt-
     A                                      h":"1134","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[AV_-
     A                                      KEYS]"},"left":"0px","top":"0px","v-
     A                                      isibility":"hidden"},{"id":"W0074F0-
     A                                      2_SCR01_action","field type":"html -
     A                                      container","white space":"normal","-
     A                                      left":"0px","top":"10px","width":"2-
     A                                      30px","css class":"action-panel-con-
     A                                      verted","height":"700px","html":"<d-
     A                                      iv class=\"top\"></div><div class=\-
     A                                      "imagetop\"><img src=\"/profoundui/-
     A                                      userdata/images/bar_top.png\" /></d-
     A                                      iv><div class=\"menulinks\"></div><-
     A                                      div class=\"imagebottom\"><img src=-
     A                                      \"/profoundui/userdata/images/bar_b-
     A                                      ottom.png\" /></div><div class=\"bo-
     A                                      ttom\"></div>"},{"field type":"icon-
     A                                       menu button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"32px","z index":"20","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"117-
     A                                      0px","id":"W0074F02_SCR01_BtnIconMe-
     A                                      nuSystemTools","tool tip":"System T-
     A                                      ools","icon alignment":"middle left-
     A                                      ","icon width":"16px","icon height"-
     A                                      :"24px","icon source":"/profoundui/-
     A                                      userdata/images/systool/systools.pn-
     A                                      g","data function":"SystemToolbarSy-
     A                                      stools","show down arrow":"Yes"},{"-
     A                                      field type":"panel","panel style":"-
     A                                      TransformButtonBar","id":"W0074F02_-
     A                                      SCR01_ButtonBar","top":"35px","left-
     A                                      ":"1036px","width":"187px","height"-
     A                                      :"28px","css class":"stationary","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"10-
     A                                      40px","id":"W0074F02_SCR01_BtnSave"-
     A                                      ,"tool tip":"Save","onclick":"Syste-
     A                                      mToolbarSave","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/save.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1066px","id":"W0074F02_SCR01-
     A                                      _BtnRefresh","tool tip":"Refresh","-
     A                                      onclick":"SystemToolbarRef')
     A                                  1  4HTML('resh","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/refresh.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1092px","id":"W0074F02_SCR0-
     A                                      1_BtnSearch","tool tip":"Search","o-
     A                                      nclick":"SystemToolbarSearch","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/search.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1118px","i-
     A                                      d":"W0074F02_SCR01_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "W0074F02_SCR01_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"W0074-
     A                                      F02_SCR01_BtnHelp","tool tip":"Help-
     A                                      ","onclick":"SystemToolbarHelp","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/help.png'')-
     A                                      "},{"id":"W0074F02_SCR01_ImgSysTool-
     A                                      Bottom","field type":"image","image-
     A                                       source":"/profoundui/userdata/imag-
     A                                      es/systool/butbarbot.png","left":"1-
     A                                      036px","top":"64px","width":"187px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n"},{"id":"W0074F02_SCR01_MainTabPa-
     A                                      nel","field type":"tab panel","tab -
     A                                      panel style":"Transform","tab names-
     A                                      ":{"fieldName":"SCPRDS","designValu-
     A                                      e":"[SCPRDS]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"active tab":"0","left":"250px"-
     A                                      ,"top":"70px","width":"970px","heig-
     A                                      ht":"657px","z index":"8","locked i-
     A                                      n place":"true","css class":"tab-pa-
     A                                      nel","css class 2":"stationary"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0074F02_SCR01-
     A                                      _BtnHiddenSave","value":"btnSave","-
     A                                      top":"100px","response":{"fieldName-
     A                                      ":"btnSave","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"SCUSER","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCUSER","designValue":"[SCUS-
     A                                      ER]","refField":"USER","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"281px-
     A                                      ","cursor column":"2","top":"110px"-
     A                                      ,"cursor row":"1","css class 2":"to-
     A                                      p-line","parent tab panel":"W0074F0-
     A                                      2_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"SCCONM","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCCONM","designValue":"[SCCONM]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"414px","curs-
     A                                      or column":"21","top":"110px","curs-
     A                                      or row":"1","css class 2":"top-line-
     A                                      ","css class 3":"HI","description":-
     A                                      "COMPANY NAME","parent tab panel":"-
     A                                      W0074F02_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 4":"profound--
     A                                      converted"},{"id":"constant1","fiel-
     A                                      d type":"output field","left":"778p-
     A                                      x","cursor column":"73","top":"110p-
     A                                      x","cursor row":"1","css c')
     A                                  1  5HTML('lass":"top-line","value":"js:-
     A                                       currentDate()","css class 2":"outp-
     A                                      ut-field","parent tab panel":"W0074-
     A                                      F02_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"W0074F02_SCR01_fkeyMe-
     A                                      nu","field type":"menu","left":"10p-
     A                                      x","top":"120px","height":"350px","-
     A                                      width":"230px","hover background co-
     A                                      lor":"#9AAA61","hover text color":"-
     A                                      #FFFFFF","border color":"#4C6106","-
     A                                      menu option indent":"10px","backgro-
     A                                      und color":"#758B27","css class":"a-
     A                                      ction-menu","css class 2":"stationa-
     A                                      ry","z index":"101"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0074F02_SCR01_BtnHiddenRe-
     A                                      fresh","value":"btnRefresh","top":"-
     A                                      125px","response":{"fieldName":"btn-
     A                                      Refresh","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"Q1PGM","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"Q1PGM","designValue":"[Q1PGM]","-
     A                                      refField":"DS10","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"W00-
     A                                      74F02_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCPRDS","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCPRDS","designValue":"[SCPRDS]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"414px","-
     A                                      cursor column":"21","top":"130px","-
     A                                      cursor row":"2","css class 2":"HI",-
     A                                      "description":"PROGRAM NAME","paren-
     A                                      t tab panel":"W0074F02_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","visibilit-
     A                                      y":"hidden","css class 3":"profound-
     A                                      -converted"},{"id":"constant2","fie-
     A                                      ld type":"output field","value":"SC-
     A                                      R01","css class":"constant","left":-
     A                                      "799px","cursor column":"76","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"W0074F02_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCMODE-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCMODE","designVal-
     A                                      ue":"[SCMODE]","refField":"NM10","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"764px","cursor column":"71","t-
     A                                      op":"150px","cursor row":"3","css c-
     A                                      lass 2":"HI","description":"ADD/UPD-
     A                                      ATE MODE","parent tab panel":"W0074-
     A                                      F02_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0074-
     A                                      F02_SCR01_BtnHiddenSearch","value":-
     A                                      "btnSearch","top":"150px","response-
     A                                      ":{"fieldName":"btnSearch","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant3","field type":"output fiel-
     A                                      d","value":"Group:","css class":"co-
     A                                      nstant","left":"281px","cursor colu-
     A                                      mn":"2","top":"170px","cursor row":-
     A                                      "4","parent tab panel":"W0074F02_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCFND","field type":"output-
     A                                       field","value":{"fieldName":"SCFND-
     A                                      ","designValue":"[SCFND]","refField-
     A                                      ":"FND","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"false","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"999.00"},"css class":"output-fi-
     A                                      eld","left":"330px","cursor column"-
     A                                      :"9","top":"170px","cursor row":"4"-
     A                                      ,"width":"21px","text align":"right-
     A                                      ","parent tab panel":"W0074F02_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCFNAM","field type":"output -
     A                                      field","value":{"fieldName":"SCFNAM-
     A                                      ","designValue":"[SCFNAM]","refFiel-
     A                                      d":"DS20","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"358px","cursor col-
     A                                      umn":"13","top":"170px","cursor row-
     A                                      ":"4","parent tab panel":"W0074F02_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant4","field type":"-
     A                                      output field","value":"SS#:","css c-
     A                                      lass":"constant","left":"526px","cu-
     A                                      rsor column":"37","top":"170px","cu-
     A                                      rsor row":"4","parent tab panel":"W-
     A                                      0074F02_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCSS#","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCSS#","designValue":"[SCSS#]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      ","dataLength":"11"},"css class":"o-
     A                                      utput-field","left":"561px')
     A                                  1  6HTML('","cursor column":"42","top":-
     A                                      "170px","cursor row":"4","parent ta-
     A                                      b panel":"W0074F02_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCCNAM-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCCNAM","designVal-
     A                                      ue":"[SCCNAM]","refField":"DS20","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"652px","cursor column":"55","t-
     A                                      op":"170px","cursor row":"4","paren-
     A                                      t tab panel":"W0074F02_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"W0074F02_SCR01_BtnHid-
     A                                      denDiaryItems","value":"btnDiary","-
     A                                      top":"175px","response":{"fieldName-
     A                                      ":"btnDiary","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant5","fie-
     A                                      ld type":"output field","value":"Ca-
     A                                      se#:","css class":"constant","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "190px","cursor row":"5","parent ta-
     A                                      b panel":"W0074F02_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCCS#"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCCS#","designValue-
     A                                      ":"[SCCS#]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none","dataLength":"11"},"cs-
     A                                      s class":"output-field","left":"330-
     A                                      px","cursor column":"9","top":"190p-
     A                                      x","cursor row":"5","parent tab pan-
     A                                      el":"W0074F02_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"constant6",-
     A                                      "field type":"output field","value"-
     A                                      :"SCL#:","css class":"constant","le-
     A                                      ft":"428px","cursor column":"23","t-
     A                                      op":"190px","cursor row":"5","paren-
     A                                      t tab panel":"W0074F02_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      SCL#","field type":"output field","-
     A                                      value":{"fieldName":"SCSCL#","desig-
     A                                      nValue":"[SCSCL#]","refField":"DS25-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"470px","cursor column":"29-
     A                                      ","top":"190px","cursor row":"5","p-
     A                                      arent tab panel":"W0074F02_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant7","field type":"output f-
     A                                      ield","value":"DOI:","css class":"c-
     A                                      onstant","left":"673px","cursor col-
     A                                      umn":"58","top":"190px","cursor row-
     A                                      ":"5","parent tab panel":"W0074F02_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCACDT","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      ACDT","designValue":"[SCACDT]","ref-
     A                                      Field":"DT8","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"true","zeroFill-
     A                                      ":"true","curSym":"","units":"","ne-
     A                                      gNum":"-999.00","edtWrd":"''  /  / -
     A                                         ''"},"css class":"output-field",-
     A                                      "left":"708px","cursor column":"63"-
     A                                      ,"top":"190px","cursor row":"5","wi-
     A                                      dth":"70px","text align":"right","p-
     A                                      arent tab panel":"W0074F02_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W0074F02_SCR01_Bt-
     A                                      nHiddenSystemMessages","value":"btn-
     A                                      Message","top":"200px","response":{-
     A                                      "fieldName":"btnMessage","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0074F02_SCR01_BtnHidd-
     A                                      enWorkSubmitJob","value":"btnWrksbm-
     A                                      job","top":"225px","response":{"fie-
     A                                      ldName":"btnWrkJob","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      8","field type":"output field","val-
     A                                      ue":"Type information, press Enter.-
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"230px","cursor row":"7","css c-
     A                                      lass 2":"BLU","parent tab panel":"W-
     A                                      0074F02_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      0074F02_SCR01_BtnHiddenWorkPrinterO-
     A                                      utput","value":"btnWrkprtout","top"-
     A                                      :"250px","response":{"fieldName":"b-
     A                                      tnWrkPrnt","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant')
     A                                  1  7HTML('9","field type":"output field-
     A                                      ","value":"Payment reason code:","c-
     A                                      ss class":"constant","left":"295px"-
     A                                      ,"cursor column":"4","top":"270px",-
     A                                      "cursor row":"9","parent tab panel"-
     A                                      :"W0074F02_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCPRCD","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCPRCD","designValue":-
     A                                      "[SCPRCD]","refField":"DS3","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e"},"text transform":"uppercase","l-
     A                                      eft":"442px","cursor column":"25","-
     A                                      top":"270px","cursor row":"9","widt-
     A                                      h":"22px","css class 3":{"fieldName-
     A                                      ":"09 or 40","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"css class 4":-
     A                                      {"fieldName":"N09 and 40","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"N40","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 5":{"fieldName":"N40",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"error message id":"WCR0503-
     A                                      ","error message file":"WMESGG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"71","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"2 messages","error mes-
     A                                      sage id 2":"WC30005","error message-
     A                                       file 2":"WMESGG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"78","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"parent tab pan-
     A                                      el":"W0074F02_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 6":"prof-
     A                                      ound-converted"},{"id":"SCDESC","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCDESC","designValue":"-
     A                                      [SCDESC]","refField":"DS25","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      470px","cursor column":"29","top":"-
     A                                      270px","cursor row":"9","parent tab-
     A                                       panel":"W0074F02_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0074F02_SCR01_BtnHiddenIm-
     A                                      ageQueue","value":"btnImgQue","top"-
     A                                      :"275px","response":{"fieldName":"b-
     A                                      tnImgQue","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W0-
     A                                      074F02_SCR01_BtnHiddenHelp","value"-
     A                                      :"btnHelp","top":"300px","response"-
     A                                      :{"fieldName":"btnHelp","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant10","field type":"output field"-
     A                                      ,"value":"Payee              :","cs-
     A                                      s class":"constant","left":"295px",-
     A                                      "cursor column":"4","top":"310px","-
     A                                      cursor row":"11","parent tab panel"-
     A                                      :"W0074F02_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCPAYE","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCPAYE","designValue":-
     A                                      "[SCPAYE]","refField":"DS40","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true"},"left":"442px","cursor -
     A                                      column":"25","top":"310px","cursor -
     A                                      row":"11","width":"281px","css clas-
     A                                      s 3":"HI","css class 4":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 5":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"set focus":-
     A                                      {"fieldName":"89","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"error mes-
     A                                      sage id":"WCR0503","error message f-
     A                                      ile":"WMESGG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"77","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"1 mes-
     A                                      sage","parent tab panel":"W0074F02_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"constant11","field type":-
     A                                      "output field","value":"Check #    -
     A                                              :","css class":"constant","-
     A                                      left":"295px","cursor column":"4","-
     A                                      top":"350px","cursor row":"13","par-
     A                                      ent tab panel":"W0074F02_SCR01_Main-
     A                                      TabPanel","parent tab":"0"')
     A                                  1  8HTML(',"css class 2":"profound-conv-
     A                                      erted"},{"id":"SCCHK#","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCCHK#","designValue":"[SCCH-
     A                                      K#]","dataType":"zoned","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"false","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"999-
     A                                      .00","dataLength":"7","decPos":"0"}-
     A                                      ,"left":"442px","cursor column":"25-
     A                                      ","top":"350px","cursor row":"13","-
     A                                      width":"50px","css class 3":"HI","c-
     A                                      ss class 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"parent tab panel":"W007-
     A                                      4F02_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted"},{"id":"constant12","field t-
     A                                      ype":"output field","value":"Amount-
     A                                                   :","css class":"consta-
     A                                      nt","left":"295px","cursor column":-
     A                                      "4","top":"390px","cursor row":"15"-
     A                                      ,"parent tab panel":"W0074F02_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCAMT","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCAM-
     A                                      T","designValue":"[SCAMT]","refFiel-
     A                                      d":"A92","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"true",-
     A                                      "zeroBalance":"true","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"-999.00","numBlankFill":"true"},-
     A                                      "left":"442px","cursor column":"25"-
     A                                      ,"top":"390px","cursor row":"15","w-
     A                                      idth":"92px","text align":"right","-
     A                                      css class 3":"HI","css class 4":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 5":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"err-
     A                                      or message id":"WCR0502","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"72","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","parent tab panel":"W00-
     A                                      74F02_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted"},{"id":"constant13","field -
     A                                      type":"output field","value":"Perio-
     A                                      d start date  :","css class":"const-
     A                                      ant","left":"295px","cursor column"-
     A                                      :"4","top":"430px","cursor row":"17-
     A                                      ","parent tab panel":"W0074F02_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCSTDT","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      STDT","designValue":"[SCSTDT]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"-999.00","da-
     A                                      taLength":"8","decPos":"0","numBlan-
     A                                      kFill":"true","edtWrd":"''  /  /   -
     A                                      0''"},"left":"442px","cursor column-
     A                                      ":"25","top":"430px","cursor row":"-
     A                                      17","width":"71px","text align":"ri-
     A                                      ght","css class 3":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"css class 4":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 5":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"error messa-
     A                                      ge id":"WCR0529","error message fil-
     A                                      e":"WMESGG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"76","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"2 messa-
     A                                      ges","error message id 2":"WCR0500"-
     A                                      ,"error message file 2":"WMESGG","e-
     A                                      rror message library 2":"*LIBL","er-
     A                                      ror condition 2":{"fieldName":"73",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "parent tab panel":"W0074F02_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted"},{"i-
     A                                      d":"constant14","field type":"outpu-
     A                                      t field","value":"Period end date  -
     A                                      . :","css class":"constant","left":-
     A                                      "295px","cursor column":"4","top":"-
     A                                      470px","cursor row":"19","parent ta-
     A                                      b panel":"W0074F02_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCENDT-
     A                                      ","field type":"textbox","')
     A                                  1  9HTML('css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCENDT","designValue":"[SCENDT]","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"-999.00",-
     A                                      "dataLength":"8","decPos":"0","numB-
     A                                      lankFill":"true","edtWrd":"''  /  /-
     A                                         0''"},"left":"442px","cursor col-
     A                                      umn":"25","top":"470px","cursor row-
     A                                      ":"19","width":"71px","text align":-
     A                                      "right","css class 3":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"css class 4":{"fieldN-
     A                                      ame":"N09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 5":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"PR","customFalse":""},"error me-
     A                                      ssage id":"WCR0529","error message -
     A                                      file":"WMESGG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"76","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"2 me-
     A                                      ssages","error message id 2":"WCR05-
     A                                      00","error message file 2":"WMESGG"-
     A                                      ,"error message library 2":"*LIBL",-
     A                                      "error condition 2":{"fieldName":"7-
     A                                      4","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"parent tab panel":"W0074F02_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted"},-
     A                                      {"id":"constant15","field type":"ou-
     A                                      tput field","value":"Payment issue -
     A                                      date :","css class":"constant","lef-
     A                                      t":"295px","cursor column":"4","top-
     A                                      ":"510px","cursor row":"21","parent-
     A                                       tab panel":"W0074F02_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCI-
     A                                      SDT","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SCISDT","de-
     A                                      signValue":"[SCISDT]","dataType":"z-
     A                                      oned","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"false","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"-999.00","dataLength"-
     A                                      :"8","decPos":"0","numBlankFill":"t-
     A                                      rue","edtWrd":"''  /  /   0''"},"le-
     A                                      ft":"442px","cursor column":"25","t-
     A                                      op":"510px","cursor row":"21","widt-
     A                                      h":"71px","text align":"right","css-
     A                                       class 3":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"css class 4":{"fieldName":"N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"read only":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 5":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"error message id":"W-
     A                                      CR0500","error message file":"WMESG-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"75"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error messages":"1 message","pare-
     A                                      nt tab panel":"W0074F02_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"id":"c-
     A                                      onstant17","field type":"output fie-
     A                                      ld","value":" ","css class":"consta-
     A                                      nt","visibility":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"351px","cursor c-
     A                                      olumn":"12","top":"550px","cursor r-
     A                                      ow":"23","css class 2":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"BLU","cu-
     A                                      stomFalse":""},"parent tab panel":"-
     A                                      W0074F02_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant16","fie-
     A                                      ld type":"output field","value":" "-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"351px","cursor column":"12","t-
     A                                      op":"550px","cursor row":"23","css -
     A                                      class 2":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"BLU","customFalse":""-
     A                                      },"parent tab panel":"W0074F02_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"btnSubmit","field type":"butt-
     A                                      on","value":"Enter","shortcut key":-
     A                                      "Enter","left":"14px","top":"150px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF03","field type":"button","value-
     A                                      ":"Exit","shortcut key":"F3","left"-
     A                                      :"14px","top":"183px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true"')
     A                                  1 10HTML(',"cursor":"default"},{"id":"b-
     A                                      tnCF10","field type":"button","visi-
     A                                      bility":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"value":"Search","shortcut key":-
     A                                      "F10","left":"14px","top":"216px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F12","field type":"button","visibil-
     A                                      ity":{"fieldName":"N09 or 09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"value":"Cancel","shortcut ke-
     A                                      y":"F12","left":"14px","top":"249px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            SCCHK#         7S 0H
     A            SCCS#         11A  H
     A            SCENDT         8S 0H
     A            SCISDT         8S 0H
     A            SCSS#         11A  H
     A            SCSTDT         8S 0H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCACDT    R        H      REFFLD(DT8)
     A            SCAMT     R        H      REFFLD(A92)
     A            SCCNAM    R        H      REFFLD(DS20)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDESC    R        H      REFFLD(DS25)
     A            SCFNAM    R        H      REFFLD(DS20)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCPAYE    R        H      REFFLD(DS40)
     A            SCPRCD    R        H      REFFLD(DS3)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSCL#    R        H      REFFLD(DS25)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR02
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"W0074F02_SCR02_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"W0074F02_SCR02_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W0074F02_SCR02_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"W0074F02_SCR02_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"W0074F02_SCR02_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"W0074F02_SCR02_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"W-
     A                                      0074F02_SCR02_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"W0074F02_SCR02_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"W0074F02_SCR02_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"W0074F02_SCR0-
     A                                      2_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"W0074F02_SCR02_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"W0074F02_SCR02_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0074F02_SCR02_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant18","field type"-
     A                                      :"output field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentUser()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"W0074F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR02_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","parent tab panel":"W0074F02_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant19","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"W0074F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"W0074F02_-
     A                                      SCR02_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0074F02_SCR02-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCR02_Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"W0074F02_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR02_-
     A                                      SCPRDS","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCPRDS","des-
     A                                      ignValue":"[SCPRDS]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"130px","cursor row":"2",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"W0074F02_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant20","field type":-
     A                                      "output field","value":"SCR02","css-
     A                                       class":"constant","left":"799px","-
     A                                      cursor column":"76","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "W0074F02_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR02_SCMODE","-
     A                                      field type":"output field"')
     A                                  1  5HTML(',"value":{"fieldName":"SCMODE-
     A                                      ","designValue":"[SCMODE]","refFiel-
     A                                      d":"PGM","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"764px","cursor colu-
     A                                      mn":"71","top":"150px","cursor row"-
     A                                      :"3","css class 2":"HI","parent tab-
     A                                       panel":"W0074F02_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0074F02_SCR02_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W0074F-
     A                                      02_SCR02_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W0074F02_SCR02_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0074F02_SCR02_BtnHidden-
     A                                      WorkSubmitJob","value":"btnWrksbmjo-
     A                                      b","top":"225px","response":{"field-
     A                                      Name":"btnWrkJob","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0074F02_SCR02_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"250px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0074F02_SCR02_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0074-
     A                                      F02_SCR02_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"btnSubm-
     A                                      it","field type":"button","value":"-
     A                                      Enter","shortcut key":"Enter","left-
     A                                      ":"14px","top":"150px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF03","field-
     A                                       type":"button","value":"Exit","sho-
     A                                      rtcut key":"F3","left":"14px","top"-
     A                                      :"183px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF12","field type":"button-
     A                                      ","value":"Cancel","shortcut key":"-
     A                                      F12","left":"14px","top":"216px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR03
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"W0074F02_SCR03_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"W0074F02_SCR03_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W0074F02_SCR03_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"W0074F02_SCR03_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"W0074F02_SCR03_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"W0074F02_SCR03_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"W-
     A                                      0074F02_SCR03_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"W0074F02_SCR03_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"W0074F02_SCR03_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"W0074F02_SCR0-
     A                                      3_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"W0074F02_SCR03_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"W0074F02_SCR03_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0074F02_SCR03_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant21","field type"-
     A                                      :"output field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentUser()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"W0074F02_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR03_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","parent tab panel":"W0074F02_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant22","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"W0074F02_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"W0074F02_-
     A                                      SCR03_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0074F02_SCR03-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCR03_Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"W0074F02_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR03_-
     A                                      SCPRDS","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCPRDS","des-
     A                                      ignValue":"[SCPRDS]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"130px","cursor row":"2",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"W0074F02_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant23","field type":-
     A                                      "output field","value":"SCR03","css-
     A                                       class":"constant","left":"799px","-
     A                                      cursor column":"76","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "W0074F02_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR03_SCMODE","-
     A                                      field type":"output field"')
     A                                  1  5HTML(',"value":{"fieldName":"SCMODE-
     A                                      ","designValue":"[SCMODE]","refFiel-
     A                                      d":"PGM","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"764px","cursor colu-
     A                                      mn":"71","top":"150px","cursor row"-
     A                                      :"3","css class 2":"HI","parent tab-
     A                                       panel":"W0074F02_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0074F02_SCR03_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W0074F-
     A                                      02_SCR03_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W0074F02_SCR03_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0074F02_SCR03_BtnHidden-
     A                                      WorkSubmitJob","value":"btnWrksbmjo-
     A                                      b","top":"225px","response":{"field-
     A                                      Name":"btnWrkJob","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0074F02_SCR03_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"250px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0074F02_SCR03_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0074-
     A                                      F02_SCR03_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"btnSubm-
     A                                      it","field type":"button","value":"-
     A                                      Enter","shortcut key":"Enter","left-
     A                                      ":"14px","top":"150px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF03","field-
     A                                       type":"button","value":"Exit","sho-
     A                                      rtcut key":"F3","left":"14px","top"-
     A                                      :"183px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF12","field type":"button-
     A                                      ","value":"Cancel","shortcut key":"-
     A                                      F12","left":"14px","top":"216px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
