     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01S                    SFL
     A                                      SETOF(10)
     A  05 21 22
     A  71 25 23
     A  24 72 35  QPUI000001     1A  O  2  2
     A  36        QPUI000002     1A  O  2  2
     A            SCENDT         8S 0H
     A            SCPAID         9S 2H
     A            SCPMCD         3A  H
     A            SCPMCH         3A  H
     A            SCSTDT         8S 0H
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  10 11 21
     A  22 23 24
     A  25 26 27                            CA01(10 'Response Indicator *IN10')
     A  28 30 31
     A  71 72 01
     A  02 03 04                            CA02(11 'Response Indicator *IN11')
     A  95                                  CA03(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                  1  2HTML('QPUICTL1    SCR01S    7    RS-
     A                                      FLDSP    0    E1    3     01RSFLDSP-
     A                                      CTL 0    E1    3     01RSFLINZ    0-
     A                                          E1    3     02RSFLDLT    0    E-
     A                                      1    3     03RSFLCLR    0    E1    -
     A                                      3     04RSFLPAG    1    C2    10 RS-
     A                                      FLSIZ    1    C2    10 1    RSFLNXT-
     A                                      CHG 0    E1    3     056    ROVERLA-
     A                                      Y   0     RROWS      2    C1    1C2-
     A                                          19 RSFLMSGID  4    C7    WC3066-
     A                                      1C6    WMESGGC5    *LIBLC0    E1   -
     A                                       3     21RSFLMSGID  4    C7    WCR0-
     A                                      513C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     22RSFLMSGID  4    C7    WC-
     A                                      R0500C6    WMESGGC5    *LIBLC0    E-
     A                                      2    3     233     24RSFLMSGID  4  -
     A                                        C7    WCR0974C6    WMESGGC5    *L-
     A                                      IBLC0    E1    3     25')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"description":"Subfile Control for-
     A                                       Reduced earnings","set off":{"fiel-
     A                                      dName":"*IN21","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"set off 2":{"fieldNa-
     A                                      me":"*IN22","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 3":{"fieldName"-
     A                                      :"*IN23","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"set off 4":{"fieldName":"*-
     A                                      IN24","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 5":{"fieldName":"*IN2-
     A                                      5","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 6":{"fieldName":"*IN26",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 7":{"fieldName":"*IN27","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 8":{"fieldName":"*IN28","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 9":{"fieldName":"*IN30","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 1-
     A                                      0":{"fieldName":"*IN31","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 11"-
     A                                      :{"fieldName":"*IN71","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 12":{-
     A                                      "fieldName":"*IN72","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"return cursor r-
     A                                      ecord":{"fieldName":"HREC","dataLen-
     A                                      gth":"10","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"none"},"return cursor field":{"-
     A                                      fieldName":"HFLD","dataLength":"10"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      },"overlay":"true","error message i-
     A                                      d":"WC30661","error message file":"-
     A                                      WMESGG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"21","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"4 messages"-
     A                                      ,"error message id 2":"WCR0513","er-
     A                                      ror message file 2":"WMESGG","error-
     A                                       message library 2":"*LIBL","error -
     A                                      condition 2":{"fieldName":"22","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or message id 3":"WCR0500","error m-
     A                                      essage file 3":"WMESGG","error mess-
     A                                      age library 3":"*LIBL","error condi-
     A                                      tion 3":{"fieldName":"23 or 24","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror message id 4":"WCR0974","error -
     A                                      message file 4":"WMESGG","error mes-
     A                                      sage library 4":"*LIBL","error cond-
     A                                      ition 4":{"fieldName":"25","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"valid c-
     A                                      ommand key":{"fieldName":"*IN11","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"ov-
     A                                      erlay range":"1-19"},"items":[{"id"-
     A                                      :"SCRRN3","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"SCRRN3","designValue":"-
     A                                      [SCRRN3]","dataType":"zoned","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"true","zeroFill":"true-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","dataLength":"4","decPos":-
     A                                      "0"},"left":"0px","top":"-30px","wi-
     A                                      dth":"28px","text align":"right","c-
     A                                      ss class":"profound-converted"},{"i-
     A                                      d":"HRRN","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"HRRN","designValue":"[H-
     A                                      RRN]","dataType":"zoned","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"true","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","dataLength":"5","decPos":"0"}-
     A                                      ,"left":"0px","top":"-30px","width"-
     A                                      :"35px","text align":"right","css c-
     A                                      lass":"profound-converted"},{"id":"-
     A                                      HFLD","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"HFLD","designValue":"[HFLD]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"10"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"HREC","field typ-
     A                                      e":"output field","visibility":"hid-
     A                                      den","value":{"fieldName":"HREC","d-
     A                                      esignValue":"[HREC]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"none","dataLength":"-
     A                                      10"},"left":"0px","top":"-30px","cs-
     A                                      s class":"profound-converted"},{"id-
     A                                      ":"W0070F3_SCR01C_avKeys","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"AV_KEYS","dataLength":"1134",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[AV_KEYS]"},"l-
     A                                      eft":"0px","top":"0px","vi')
     A                                  1  4HTML('sibility":"hidden"},{"id":"W0-
     A                                      070F3_SCR01C_action","field type":"-
     A                                      html container","white space":"norm-
     A                                      al","left":"0px","top":"10px","widt-
     A                                      h":"230px","css class":"action-pane-
     A                                      l-converted","height":"700px","html-
     A                                      ":"<div class=\"top\"></div><div cl-
     A                                      ass=\"imagetop\"><img src=\"/profou-
     A                                      ndui/userdata/images/bar_top.png\" -
     A                                      /></div><div class=\"menulinks\"></-
     A                                      div><div class=\"imagebottom\"><img-
     A                                       src=\"/profoundui/userdata/images/-
     A                                      bar_bottom.png\" /></div><div class-
     A                                      =\"bottom\"></div>"},{"field type":-
     A                                      "icon menu button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"32px","z index":"20","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1170px","id":"W0070F3_SCR01C_BtnI-
     A                                      conMenuSystemTools","tool tip":"Sys-
     A                                      tem Tools","icon alignment":"middle-
     A                                       left","icon width":"16px","icon he-
     A                                      ight":"24px","icon source":"/profou-
     A                                      ndui/userdata/images/systool/systoo-
     A                                      ls.png","data function":"SystemTool-
     A                                      barSystools","show down arrow":"Yes-
     A                                      "},{"field type":"panel","panel sty-
     A                                      le":"TransformButtonBar","id":"W007-
     A                                      0F3_SCR01C_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"W0070F3_SCR01C_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"W0070F3_S-
     A                                      CR01C_BtnRefresh","tool tip":"Refre-
     A                                      sh","onclick":"SystemToolbarRefresh-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/refres-
     A                                      h.png'')"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"10-
     A                                      92px","id":"W0070F3_SCR01C_BtnSearc-
     A                                      h","tool tip":"Search","onclick":"S-
     A                                      ystemToolbarSearch","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/search.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1118px","id":"W0070F-
     A                                      3_SCR01C_BtnDiaryItems","tool tip":-
     A                                      "Diary/Work Items - IDARTS","onclic-
     A                                      k":"SystemToolbarDiary","background-
     A                                       image":{"fieldName":"DryIcnURL","d-
     A                                      ataLength":"128","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"}},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1144px","id":"W0070F3_S-
     A                                      CR01C_BtnSystemMessages","tool tip"-
     A                                      :"System Messages","onclick":"Syste-
     A                                      mToolbarMessages","background image-
     A                                      ":{"fieldName":"MsgIcnURL","dataLen-
     A                                      gth":"128","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"}},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1196px","id":"W0070F3_SCR01C_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"')
     A                                  1  5HTML('},{"id":"W0070F3_SCR01C_ImgSy-
     A                                      sToolBottom","field type":"image","-
     A                                      image source":"/profoundui/userdata-
     A                                      /images/systool/butbarbot.png","lef-
     A                                      t":"1036px","top":"64px","width":"1-
     A                                      87px","locked in place":"true","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden"},{"id":"W0070F3_SCR01C_Main-
     A                                      TabPanel","field type":"tab panel",-
     A                                      "tab panel style":"Transform","tab -
     A                                      names":{"fieldName":"SCPRDS","desig-
     A                                      nValue":"[SCPRDS]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"active tab":"0","left":"2-
     A                                      50px","top":"70px","width":"970px",-
     A                                      "height":"657px","z index":"8","loc-
     A                                      ked in place":"true","css class":"t-
     A                                      ab-panel","css class 2":"stationary-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W0070F3_S-
     A                                      CR01C_BtnHiddenSave","value":"btnSa-
     A                                      ve","top":"100px","response":{"fiel-
     A                                      dName":"btnSave","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"SCUSER","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCUSER","designValue":"-
     A                                      [SCUSER]","refField":"USER","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      10px","cursor row":"1","css class 2-
     A                                      ":"top-line","parent tab panel":"W0-
     A                                      070F3_SCR01C_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCCONM","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCCONM","designValue":"[SCCONM-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"414px",-
     A                                      "cursor column":"21","top":"110px",-
     A                                      "cursor row":"1","css class 2":"top-
     A                                      -line","description":"COMPANY NAME"-
     A                                      ,"parent tab panel":"W0070F3_SCR01C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"constant1","field type":"outpu-
     A                                      t field","left":"778px","cursor col-
     A                                      umn":"73","top":"110px","cursor row-
     A                                      ":"1","css class":"top-line","value-
     A                                      ":"js: currentDate()","css class 2"-
     A                                      :"output-field","parent tab panel":-
     A                                      "W0070F3_SCR01C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"W0070F3_SCR01C_-
     A                                      fkeyMenu","field type":"menu","left-
     A                                      ":"10px","top":"120px","height":"35-
     A                                      0px","width":"230px","hover backgro-
     A                                      und color":"#9AAA61","hover text co-
     A                                      lor":"#FFFFFF","border color":"#4C6-
     A                                      106","menu option indent":"10px","b-
     A                                      ackground color":"#758B27","css cla-
     A                                      ss":"action-menu","css class 2":"st-
     A                                      ationary","z index":"101"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0070F3_SCR01C_BtnHi-
     A                                      ddenRefresh","value":"btnRefresh","-
     A                                      top":"125px","response":{"fieldName-
     A                                      ":"btnRefresh","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant2","f-
     A                                      ield type":"output field","value":"-
     A                                      W0070R3","css class":"constant","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"130px","cursor row":"2","parent-
     A                                       tab panel":"W0070F3_SCR01C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCP-
     A                                      RDS","field type":"output field","v-
     A                                      alue":{"fieldName":"SCPRDS","design-
     A                                      Value":"[SCPRDS]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"130px","cursor row":"2","de-
     A                                      scription":"PROGRAM NAME","parent t-
     A                                      ab panel":"W0070F3_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","visibility":-
     A                                      "hidden","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant3","field -
     A                                      type":"output field","value":"SCR01-
     A                                      ","css class":"constant","left":"79-
     A                                      9px","cursor column":"76","top":"13-
     A                                      0px","cursor row":"2","parent tab p-
     A                                      anel":"W0070F3_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0070F3_SCR01C_BtnHiddenSear-
     A                                      ch","value":"btnSearch","top":"150p-
     A                                      x","response":{"fieldName":"btnSear-
     A                                      ch","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant4","field type":-
     A                                      "output field","value":"Group:","cs-
     A                                      s class":"constant","left":"281px",-
     A                                      "cursor column":"2","top":"170px","-
     A                                      cursor row":"4","parent tab panel":-
     A                                      "W0070F3_SCR01C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCFND"')
     A                                  1  6HTML(',"field type":"output field",-
     A                                      "value":{"fieldName":"SCFND","desig-
     A                                      nValue":"[SCFND]","refField":"FND",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00"},"css class":"output-field","le-
     A                                      ft":"330px","cursor column":"9","to-
     A                                      p":"170px","cursor row":"4","width"-
     A                                      :"21px","text align":"right","paren-
     A                                      t tab panel":"W0070F3_SCR01C_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      NAME","field type":"output field","-
     A                                      value":{"fieldName":"SCNAME","desig-
     A                                      nValue":"[SCNAME]","refField":"NM50-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"358px","cursor column":"13-
     A                                      ","top":"170px","cursor row":"4","p-
     A                                      arent tab panel":"W0070F3_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W0070F3_SCR01C_Bt-
     A                                      nHiddenDiaryItems","value":"btnDiar-
     A                                      y","top":"175px","response":{"field-
     A                                      Name":"btnDiary","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant5",-
     A                                      "field type":"output field","value"-
     A                                      :"SS#:","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"190px","cursor row":"5","parent -
     A                                      tab panel":"W0070F3_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCSS-
     A                                      #","field type":"output field","val-
     A                                      ue":{"fieldName":"SCSS#","designVal-
     A                                      ue":"[SCSS#]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none","dataLength":"11"},"-
     A                                      css class":"output-field","left":"3-
     A                                      16px","cursor column":"7","top":"19-
     A                                      0px","cursor row":"5","parent tab p-
     A                                      anel":"W0070F3_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCCLNM","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCCLNM","designValue"-
     A                                      :"[SCCLNM]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none","dataLength":"20"},"cs-
     A                                      s class":"output-field","left":"407-
     A                                      px","cursor column":"20","top":"190-
     A                                      px","cursor row":"5","parent tab pa-
     A                                      nel":"W0070F3_SCR01C_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"constant6"-
     A                                      ,"field type":"output field","value-
     A                                      ":"DOI:","css class":"constant","le-
     A                                      ft":"575px","cursor column":"44","t-
     A                                      op":"190px","cursor row":"5","paren-
     A                                      t tab panel":"W0070F3_SCR01C_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      ACDT","field type":"output field","-
     A                                      value":{"fieldName":"SCACDT","desig-
     A                                      nValue":"[SCACDT]","refField":"DT8"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"true","zeroFill":"true","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00","edtWrd":"''  /  /    ''"},"css-
     A                                       class":"output-field","left":"610p-
     A                                      x","cursor column":"49","top":"190p-
     A                                      x","cursor row":"5","width":"70px",-
     A                                      "text align":"right","parent tab pa-
     A                                      nel":"W0070F3_SCR01C_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0070F3_SCR01C_BtnHiddenSyste-
     A                                      mMessages","value":"btnMessage","to-
     A                                      p":"200px","response":{"fieldName":-
     A                                      "btnMessage","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant7","fie-
     A                                      ld type":"output field","value":"Ca-
     A                                      se#:","css class":"constant","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "210px","cursor row":"6","parent ta-
     A                                      b panel":"W0070F3_SCR01C_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCYRCL-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCYRCL","designVal-
     A                                      ue":"[SCYRCL]","refField":"CASE 10 -
     A                                      00","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"true",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","edtWrd":"''   -       ''"},-
     A                                      "css class":"output-field","left":"-
     A                                      330px","cursor column":"9","top":"2-
     A                                      10px","cursor row":"6","width":"77p-
     A                                      x","text align":"right","parent tab-
     A                                       panel":"W0070F3_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t8","field type":"output field","va-
     A                                      lue":"SCL#:","css class":"constant"-
     A                                      ,"left":"421px","cursor column":"22-
     A                                      ","top":"210px","cursor row":"6","p-
     A                                      arent tab panel":"W0070F3_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCACL#","field type":"ou')
     A                                  1  7HTML('tput field","value":{"fieldNa-
     A                                      me":"SCACL#","designValue":"[SCACL#-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne","dataLength":"25"},"css class":-
     A                                      "output-field","left":"470px","curs-
     A                                      or column":"29","top":"210px","curs-
     A                                      or row":"6","css class 2":"HI","par-
     A                                      ent tab panel":"W0070F3_SCR01C_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W0070F3_SCR01C_BtnH-
     A                                      iddenWorkSubmitJob","value":"btnWrk-
     A                                      sbmjob","top":"225px","response":{"-
     A                                      fieldName":"btnWrkJob","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0070F3_SCR01C_BtnHidden-
     A                                      WorkPrinterOutput","value":"btnWrkp-
     A                                      rtout","top":"250px","response":{"f-
     A                                      ieldName":"btnWrkPrnt","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant9","field type":"output field","-
     A                                      value":"Pmt Code","css class":"cons-
     A                                      tant","left":"281px","cursor column-
     A                                      ":"2","top":"270px","cursor row":"9-
     A                                      ","parent tab panel":"W0070F3_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted","c-
     A                                      ss class 3":"subfile-heading"},{"id-
     A                                      ":"constant10","field type":"output-
     A                                       field","value":"Total Paid      ",-
     A                                      "css class":"constant","left":"358p-
     A                                      x","cursor column":"13","top":"270p-
     A                                      x","cursor row":"9","parent tab pan-
     A                                      el":"W0070F3_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted","css class 3":"subf-
     A                                      ile-heading"},{"id":"constant11","f-
     A                                      ield type":"output field","value":"-
     A                                      Start Date        ","css class":"co-
     A                                      nstant","left":"491px","cursor colu-
     A                                      mn":"32","top":"270px","cursor row"-
     A                                      :"9","parent tab panel":"W0070F3_SC-
     A                                      R01C_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      ,"css class 3":"subfile-heading"},{-
     A                                      "id":"constant12","field type":"out-
     A                                      put field","value":"End Date       -
     A                                       ","css class":"constant","left":"6-
     A                                      38px","cursor column":"53","top":"2-
     A                                      70px","cursor row":"9","parent tab -
     A                                      panel":"W0070F3_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted","css class 3":"s-
     A                                      ubfile-heading"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0070F3_SCR01C_BtnHiddenImageQ-
     A                                      ueue","value":"btnImgQue","top":"27-
     A                                      5px","response":{"fieldName":"btnIm-
     A                                      gQue","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"SCR01S","field type":"-
     A                                      grid","number of columns":"4","reco-
     A                                      rd format name":"SCR01S","descripti-
     A                                      on":"Screen 3 Subfile Record","subf-
     A                                      ile next changed":{"fieldName":"05"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"display subfile":{"fieldNa-
     A                                      me":"01","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"display control re-
     A                                      cord":{"fieldName":"01","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"cle-
     A                                      ar subfile":{"fieldName":"04","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"subfile size":"10","initialize s-
     A                                      ubfile":{"fieldName":"02","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"d-
     A                                      elete subfile":{"fieldName":"03","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"place cursor":"true","header -
     A                                      height":"20","row height":"20","css-
     A                                       class":"subfilegrid","css class 2"-
     A                                      :"profound-converted","parent tab p-
     A                                      anel":"W0070F3_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","subfile end":{"f-
     A                                      ieldName":"95","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"sortable col-
     A                                      umns":"true","number of rows":"11",-
     A                                      "top":"270px","left":"281px","colum-
     A                                      n widths":"72,133,147,201","cursor -
     A                                      record number":{"fieldName":"HRRN",-
     A                                      "dataLength":"5","decPos":"0","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"units":"","negNum":"-999.00"},"su-
     A                                      bfile record number":{"fieldName":"-
     A                                      SCRRN3","designValue":"[SCRRN3]","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00","da-
     A                                      taLength":"4","decPos":"0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0070F3_S')
     A                                  1  8HTML('CR01C_BtnHiddenHelp","value":-
     A                                      "btnHelp","top":"300px","response":-
     A                                      {"fieldName":"btnHelp","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"btnSu-
     A                                      bmit","field type":"button","value"-
     A                                      :"Enter","shortcut key":"Enter","le-
     A                                      ft":"14px","top":"150px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF03","fie-
     A                                      ld type":"button","value":"Exit","s-
     A                                      hortcut key":"F3","left":"14px","to-
     A                                      p":"183px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF10","field type":"butt-
     A                                      on","value":"Search","shortcut key"-
     A                                      :"F10","left":"14px","top":"216px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF12","field type":"button","value"-
     A                                      :"Cancel","shortcut key":"F12","lef-
     A                                      t":"14px","top":"249px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnHELP","fiel-
     A                                      d type":"button","shortcut key":"Al-
     A                                      t-F1","bypass validation":"true","v-
     A                                      alue":"HELP","response":{"fieldName-
     A                                      ":"*IN10","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"left":"14px","top":"282px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"S-
     A                                      CPMCH","field type":"output field",-
     A                                      "visibility":"hidden","value":{"fie-
     A                                      ldName":"SCPMCH","designValue":"[SC-
     A                                      PMCH]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none","dataLength":"3"},"left":"-4-
     A                                      5px","top":"-319px","css class":"pr-
     A                                      ofound-converted","grid":"SCR01S","-
     A                                      column":"0"},{"id":"SCPMCD","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCPMCD","designValue":"-
     A                                      [SCPMCD]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"uppercase","dataLength":"3"},"t-
     A                                      ext transform":"uppercase","left":"-
     A                                      14px","cursor column":"4","top":"1p-
     A                                      x","cursor row":"10","width":"22px"-
     A                                      ,"css class 3":{"fieldName":"21 or -
     A                                      22","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"RI","custo-
     A                                      mFalse":""},"set focus":{"fieldName-
     A                                      ":"21 or 22 or 71","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 4":{"fieldName":"35","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"rea-
     A                                      d only":{"fieldName":"N36","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 5":{"fieldName":"N36","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"css class 6":"profound-conver-
     A                                      ted","grid":"SCR01S","column":"0"},-
     A                                      {"id":"SCPAID","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CPAID","designValue":"[SCPAID]","da-
     A                                      taType":"zoned","formatting":"Numbe-
     A                                      r","numSep":"true","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"-999.00","da-
     A                                      taLength":"9","decPos":"2"},"left":-
     A                                      "5px","cursor column":"13","top":"1-
     A                                      px","cursor row":"10","width":"92px-
     A                                      ","css class 3":{"fieldName":"25","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"RI","customFals-
     A                                      e":""},"set focus":{"fieldName":"25-
     A                                       or 72","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 4":{"fiel-
     A                                      dName":"35","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"read only":{"f-
     A                                      ieldName":"N36","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"N36","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"css c-
     A                                      lass 6":"profound-converted","grid"-
     A                                      :"SCR01S","column":"1"},{"id":"SCST-
     A                                      DT","field type":"date field","css -
     A                                      class":"input","css class 2":"date--
     A                                      field","value":{"fieldName":"SCSTDT-
     A                                      ","designValue":"[SCSTDT]","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","dataLe-
     A                                      ngth":"8","decPos":"0","edtWrd":"''-
     A                                        /  /    ''","dateFormat":"m/d/Y"}-
     A                                      ,"left":"5px","cursor column":"32",-
     A                                      "top":"1px","cursor row":"10","widt-
     A                                      h":"71px","css class 3":{"fieldName-
     A                                      ":"25 or 23","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"R-
     A                                      I","customFalse":""},"set focus":{"-
     A                                      fieldName":"25 or 23","dataType":"e-
     A                                      xpression","formatting":"I')
     A                                  1  9HTML('ndicator","indFormat":"true /-
     A                                       false"},"css class 4":{"fieldName"-
     A                                      :"35","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"read only":{"fieldNa-
     A                                      me":"N36","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 5":{"fi-
     A                                      eldName":"N36","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"css class 6-
     A                                      ":"profound-converted","grid":"SCR0-
     A                                      1S","column":"2"},{"id":"SCENDT","f-
     A                                      ield type":"date field","css class"-
     A                                      :"input","css class 2":"date-field"-
     A                                      ,"value":{"fieldName":"SCENDT","des-
     A                                      ignValue":"[SCENDT]","dataType":"zo-
     A                                      ned","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00","dataLength":-
     A                                      "8","decPos":"0","edtWrd":"''  /  /-
     A                                          ''","dateFormat":"m/d/Y"},"left-
     A                                      ":"5px","cursor column":"53","top":-
     A                                      "1px","cursor row":"10","width":"71-
     A                                      px","css class 3":{"fieldName":"25 -
     A                                      or 24","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"RI","cu-
     A                                      stomFalse":""},"set focus":{"fieldN-
     A                                      ame":"25 or 24","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 4-
     A                                      ":{"fieldName":"35","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"read o-
     A                                      nly":{"fieldName":"N36","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 5":{"fieldName":"N36","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"css class 6":"profound-converted-
     A                                      ","grid":"SCR01S","column":"3"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            HRRN           5S 0H
     A            MSGICNURL    128A  H
     A            SCACL#        25A  H
     A            SCCLNM        20A  H
     A            SCRRN3         4S 0H
     A            SCSS#         11A  H
     A            SCACDT    R        H      REFFLD(DT8)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFND     R        H      REFFLD(FND)
     A            SCNAME    R        H      REFFLD(NM50)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A            SCYRCL    R   10 00H      REFFLD(CASE)
     A          R SCR01
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"23-23"},"items":[{"id":"W0070F3-
     A                                      _SCR01_avKeys","field type":"output-
     A                                       field","value":{"fieldName":"AV_KE-
     A                                      YS","dataLength":"1134","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none","desi-
     A                                      gnValue":"[AV_KEYS]"},"left":"0px",-
     A                                      "top":"0px","visibility":"hidden"},-
     A                                      {"id":"W0070F3_SCR01_action","field-
     A                                       type":"html container","white spac-
     A                                      e":"normal","left":"0px","top":"10p-
     A                                      x","width":"230px","css class":"act-
     A                                      ion-panel-converted","height":"700p-
     A                                      x","html":"<div class=\"top\"></div-
     A                                      ><div class=\"imagetop\"><img src=\-
     A                                      "/profoundui/userdata/images/bar_to-
     A                                      p.png\" /></div><div class=\"menuli-
     A                                      nks\"></div><div class=\"imagebotto-
     A                                      m\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_bottom.png\" /></div><d-
     A                                      iv class=\"bottom\"></div>"},{"fiel-
     A                                      d type":"icon menu button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"32px","z index"-
     A                                      :"20","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1170px","id":"W0070F3_SCR-
     A                                      01_BtnIconMenuSystemTools","tool ti-
     A                                      p":"System Tools","icon alignment":-
     A                                      "middle left","icon width":"16px","-
     A                                      icon height":"24px","icon source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /systools.png","data function":"Sys-
     A                                      temToolbarSystools","show down arro-
     A                                      w":"Yes"},{"field type":"panel","pa-
     A                                      nel style":"TransformButtonBar","id-
     A                                      ":"W0070F3_SCR01_ButtonBar","top":"-
     A                                      35px","left":"1036px","width":"187p-
     A                                      x","height":"28px","css class":"sta-
     A                                      tionary","visibility":"hidden","loc-
     A                                      ked in place":"true"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1040px","id":"W0070F3_SCR0-
     A                                      1_BtnSave","tool tip":"Save","oncli-
     A                                      ck":"SystemToolbarSave","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/save.png'')"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1066px","id":"W007-
     A                                      0F3_SCR01_BtnRefresh","tool tip":"R-
     A                                      efresh","onclick":"SystemToolbarRef-
     A                                      resh","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/re-
     A                                      fresh.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1092px","id":"W0070F3_SCR01_BtnSe-
     A                                      arch","tool tip":"Search","onclick"-
     A                                      :"SystemToolbarSearch","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/search.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1118px","id":"W00-
     A                                      70F3_SCR01_BtnDiaryItems","tool tip-
     A                                      ":"Diary/Work Items - IDARTS","oncl-
     A                                      ick":"SystemToolbarDiary","backgrou-
     A                                      nd image":{"fieldName":"DryIcnURL",-
     A                                      "dataLength":"128","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"}},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1144px","id":"W0070F3-
     A                                      _SCR01_BtnSystemMessages","tool tip-
     A                                      ":"System Messages","onclick":"Syst-
     A                                      emToolbarMessages","background imag-
     A                                      e":{"fieldName":"MsgIcnURL')
     A                                  1  4HTML('","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1196px","id":-
     A                                      "W0070F3_SCR01_BtnHelp","tool tip":-
     A                                      "Help","onclick":"SystemToolbarHelp-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/help.p-
     A                                      ng'')"},{"id":"W0070F3_SCR01_ImgSys-
     A                                      ToolBottom","field type":"image","i-
     A                                      mage source":"/profoundui/userdata/-
     A                                      images/systool/butbarbot.png","left-
     A                                      ":"1036px","top":"64px","width":"18-
     A                                      7px","locked in place":"true","css -
     A                                      class":"stationary","visibility":"h-
     A                                      idden"},{"id":"W0070F3_SCR01_MainTa-
     A                                      bPanel","field type":"tab panel","t-
     A                                      ab panel style":"Transform","tab na-
     A                                      mes":"Tab 1","active tab":"0","left-
     A                                      ":"250px","top":"70px","width":"970-
     A                                      px","height":"657px","z index":"8",-
     A                                      "locked in place":"true","css class-
     A                                      ":"tab-panel","css class 2":"statio-
     A                                      nary"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0070-
     A                                      F3_SCR01_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"W0070F3_-
     A                                      SCR01_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0070F3_SCR01_-
     A                                      BtnHiddenRefresh","value":"btnRefre-
     A                                      sh","top":"125px","response":{"fiel-
     A                                      dName":"btnRefresh","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W0070F3_SCR01_BtnHiddenSear-
     A                                      ch","value":"btnSearch","top":"150p-
     A                                      x","response":{"fieldName":"btnSear-
     A                                      ch","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W0070F3_-
     A                                      SCR01_BtnHiddenDiaryItems","value":-
     A                                      "btnDiary","top":"175px","response"-
     A                                      :{"fieldName":"btnDiary","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0070F3_SCR01_BtnHidde-
     A                                      nSystemMessages","value":"btnMessag-
     A                                      e","top":"200px","response":{"field-
     A                                      Name":"btnMessage","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0070F3_SCR01_BtnHiddenWorkS-
     A                                      ubmitJob","value":"btnWrksbmjob","t-
     A                                      op":"225px","response":{"fieldName"-
     A                                      :"btnWrkJob","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W0070F3_SCR01_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0070F3_SCR01_BtnHiddenImageQueue",-
     A                                      "value":"btnImgQue","top":"275px","-
     A                                      response":{"fieldName":"btnImgQue",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0070F3_SCR0-
     A                                      1_BtnHiddenHelp","value":"btnHelp",-
     A                                      "top":"300px","response":{"fieldNam-
     A                                      e":"btnHelp","dataType":"i')
     A                                  1  5HTML('ndicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      btnSubmit","field type":"button","v-
     A                                      alue":"Enter","shortcut key":"Enter-
     A                                      ","left":"14px","top":"150px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF03"-
     A                                      ,"field type":"button","value":"Exi-
     A                                      t","shortcut key":"F3","left":"14px-
     A                                      ","top":"183px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnHELP","field type":-
     A                                      "button","shortcut key":"Alt-F1","b-
     A                                      ypass validation":"true","value":"H-
     A                                      ELP","response":{"fieldName":"*IN10-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"left":"14px","top":"216px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
