     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(01)
     A*PUI                                  SFLDEFINE(02)
     A          R SCR01S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A  05 07 08
     A  51 74     QPUI000001     1A  O  2  2
     A            SCACL#        25A  H
     A            SCDATA        76A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCADJ     R        H      REFFLD(STAF)
     A            SCAUTH    R        H      REFFLD(FLAG)
     A            SCCASE    R        H      REFFLD(CASE)
     A            SCDIV     R        H      REFFLD(DIV)
     A            SCEMP#    R        H      REFFLD(EMP#)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFSN     R        H      REFFLD(FSN)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCLSN     R        H      REFFLD(LSN)
     A            SCMID     R        H      REFFLD(MID)
     A            SCPART    R        H      REFFLD(DS20)
     A            SCSS#     R        H      REFFLD(SS#)
     A            SCSTAT    R        H      REFFLD(FLAG)
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  01 02 97
     A  03 04 12
     A  21 22 23                            CA01(01 'Response Indicator *IN01')
     A  24 25 26
     A  27 28 29
     A  31 36 63                            CA02(02 'Response Indicator *IN02')
     A  67 72 73
     A  84 85 86
     A  87 88 89                            CA03(97 'Response Indicator *IN97')
     A  91 92 93
     A  94 95 06                            CA04
     A                                  1  2HTML('QPUICTL1    SCR01S    5    RS-
     A                                      FLDSP    0    E1    3     04RSFLDSP-
     A                                      CTL 0    E1    3    N03RSFLCLR    0-
     A                                          E1    3     03RSFLPAG    1    C-
     A                                      1    5 RSFLSIZ    1    C1    6 1   -
     A                                       RSFLNXTCHG 0    E1    3     0825  -
     A                                       ROVERLAY   0     RROWS      2    C-
     A                                      1    1C2    20 RSFLMSGID  4    C7  -
     A                                        WC32374C6    WMESGGC5    *LIBLC0 -
     A                                         E1    3     31RSFLMSGID  4    C7-
     A                                          WC40018C6    WMESGGC5    *LIBLC-
     A                                      0    E1    3     36RSFLMSGID  4    -
     A                                      C7    WCR0608C6    WMESGGC5    *LIB-
     A                                      LC0    E1    3     72RSFLMSGID  4  -
     A                                        C7    WC31099C6    WMESGGC5    *L-
     A                                      IBLC0    E1    3     73RSFLMSGID  4-
     A                                          C7    WC30180C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     84RSFLMSGID -
     A                                       4    C7    WCR0627C6    WMESGGC5  -
     A                                        *LIBLC0    E1    3     85RSFLMSGI-
     A                                      D  4    C7    WCR1220C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     86RSFLMS-
     A                                      GID  4    C7    WCR1150C6    WMESGG-
     A                                      C5    *LIBLC0    E1    3     87RSFL-
     A                                      MSGID  4    C7    WC30177C6    WMES-
     A                                      GGC5    *LIBLC0    E1    3     88RS-
     A                                      FLMSGID  4    C7    WC30003C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     89-
     A                                      RSFLMSGID  4    C7    CPD6A81C7    -
     A                                      QCPFMSGC5    *LIBLC0    E1    3    -
     A                                       92RSFLMSGID  4    C7    CPD6A7FC7 -
     A                                         QCPFMSGC5    *LIBLC0    E1    3 -
     A                                          93RSFLMSGID  4    C7    WCR3342-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     97RERRMSGID  5    C5    Q1PGM-
     A                                      C7    CPF5203C7    QCPFMSGC5    *LI-
     A                                      BLC0    E1    3     91RERRMSGID  5 -
     A                                         C5    Q1PGMC7    CPF5204C7    QC-
     A                                      PFMSGC5    *LIBLC0    E1    3     9-
     A                                      4FSCPST4    INPUTONLY 0     FSCPST1-
     A                                          INPUTONLY 0     FSCPST3    INPU-
     A                                      TONLY 0     FSCPST2    INPUTONLY 0 -
     A                                          FSCPS3B    INPUTONLY 0     FSCP-
     A                                      S3C    INPUTONLY 0     FSCPS1B    I-
     A                                      NPUTONLY 0     FSCPS1C    INPUTONLY-
     A                                       0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"set off":{"fieldName":"*IN97","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"ove-
     A                                      rlay":"true","error message id":"WC-
     A                                      32374","error message file":"WMESGG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"31",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"13 messages","err-
     A                                      or message id 2":"WC40018","error m-
     A                                      essage file 2":"WMESGG","error mess-
     A                                      age library 2":"*LIBL","error condi-
     A                                      tion 2":{"fieldName":"36","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssage id 3":"WCR0608","error messag-
     A                                      e file 3":"WMESGG","error message l-
     A                                      ibrary 3":"*LIBL","error condition -
     A                                      3":{"fieldName":"72","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                       id 4":"WC31099","error message fil-
     A                                      e 4":"WMESGG","error message librar-
     A                                      y 4":"*LIBL","error condition 4":{"-
     A                                      fieldName":"73","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error message id 5-
     A                                      ":"WC30180","error message file 5":-
     A                                      "WMESGG","error message library 5":-
     A                                      "*LIBL","error condition 5":{"field-
     A                                      Name":"84","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error message id 6":"WC-
     A                                      R0627","error message file 6":"WMES-
     A                                      GG","error message library 6":"*LIB-
     A                                      L","error condition 6":{"fieldName"-
     A                                      :"85","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error message id 7":"WCR1220-
     A                                      ","error message file 7":"WMESGG","-
     A                                      error message library 7":"*LIBL","e-
     A                                      rror condition 7":{"fieldName":"86"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error message id 8":"WCR1150","er-
     A                                      ror message file 8":"WMESGG","error-
     A                                       message library 8":"*LIBL","error -
     A                                      condition 8":{"fieldName":"87","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or message id 9":"WC30177","error m-
     A                                      essage file 9":"WMESGG","error mess-
     A                                      age library 9":"*LIBL","error condi-
     A                                      tion 9":{"fieldName":"88","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssage id 10":"WC30003","error messa-
     A                                      ge file 10":"WMESGG","error message-
     A                                       library 10":"*LIBL","error conditi-
     A                                      on 10":{"fieldName":"89","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sage id 11":"CPD6A81","error messag-
     A                                      e file 11":"QCPFMSG","error message-
     A                                       library 11":"*LIBL","error conditi-
     A                                      on 11":{"fieldName":"92","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sage id 12":"CPD6A7F","error messag-
     A                                      e file 12":"QCPFMSG","error message-
     A                                       library 12":"*LIBL","error conditi-
     A                                      on 12":{"fieldName":"93","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sage id 13":"WCR3342","error messag-
     A                                      e file 13":"WMESGG","error message -
     A                                      library 13":"*LIBL","error conditio-
     A                                      n 13":{"fieldName":"97","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"overlay ra-
     A                                      nge":"1-20"},"items":[{"id":"SCPST5-
     A                                      ","field type":"output field","visi-
     A                                      bility":{"fieldName":"25","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"value":{"fieldName":"SCPST5","de-
     A                                      signValue":"[SCPST5]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "1"},"left":"0px","top":"-30px","cs-
     A                                      s class":"profound-converted"},{"id-
     A                                      ":"SCPST6","field type":"output fie-
     A                                      ld","visibility":{"fieldName":"26",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"value":{"fieldName":"SC-
     A                                      PST6","designValue":"[SCPST6]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"1"},"left":"0px","top":"--
     A                                      30px","css class":"profound-convert-
     A                                      ed"},{"id":"SFLMOD","field type":"o-
     A                                      utput field","visibility":"hidden",-
     A                                      "value":{"fieldName":"SFLMOD","desi-
     A                                      gnValue":"[SFLMOD]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      "},"left":"0px","top":"-30px","css -
     A                                      class":"profound-converted"},{"id":-
     A                                      "SCRRN1","field type":"output field-
     A                                      ","visibility":"hidden","value":{"f-
     A                                      ieldName":"SCRRN1","designValue":"[-
     A                                      SCRRN1]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","dataLength":"4","decPos":"-
     A                                      0"},"left":"0px","top":"-30px","wid-
     A                                      th":"28px","text align":"r')
     A                                  1  4HTML('ight","css class":"profound-c-
     A                                      onverted"},{"id":"SCPST8","field ty-
     A                                      pe":"output field","visibility":{"f-
     A                                      ieldName":"28","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"value":{-
     A                                      "fieldName":"SCPST8","designValue":-
     A                                      "[SCPST8]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"none","dataLength":"1"},"left"-
     A                                      :"0px","top":"-30px","css class":"p-
     A                                      rofound-converted"},{"id":"SCPST9",-
     A                                      "field type":"output field","visibi-
     A                                      lity":{"fieldName":"29","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "value":{"fieldName":"SCPST9","desi-
     A                                      gnValue":"[SCPST9]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      "},"left":"0px","top":"-30px","css -
     A                                      class":"profound-converted"},{"id":-
     A                                      "SCPST7","field type":"output field-
     A                                      ","visibility":{"fieldName":"27","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"value":{"fieldName":"SCPS-
     A                                      T7","designValue":"[SCPST7]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none","dataL-
     A                                      ength":"1"},"left":"0px","top":"-30-
     A                                      px","css class":"profound-converted-
     A                                      "},{"id":"W0070F_SCR01C_avKeys","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"AV_KEYS","dataLength":"-
     A                                      1134","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[AV_KEYS-
     A                                      ]"},"left":"0px","top":"0px","visib-
     A                                      ility":"hidden"},{"id":"W0070F_SCR0-
     A                                      1C_action","field type":"html conta-
     A                                      iner","white space":"normal","left"-
     A                                      :"0px","top":"10px","width":"230px"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","height":"700px","html":"<div cl-
     A                                      ass=\"top\"></div><div class=\"imag-
     A                                      etop\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_top.png\" /></div><d-
     A                                      iv class=\"menulinks\"></div><div c-
     A                                      lass=\"imagebottom\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_bottom-
     A                                      .png\" /></div><div class=\"bottom\-
     A                                      "></div>"},{"field type":"icon menu-
     A                                       button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"32px","z index":"20","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1170px",-
     A                                      "id":"W0070F_SCR01C_BtnIconMenuSyst-
     A                                      emTools","tool tip":"System Tools",-
     A                                      "icon alignment":"middle left","ico-
     A                                      n width":"16px","icon height":"24px-
     A                                      ","icon source":"/profoundui/userda-
     A                                      ta/images/systool/systools.png","da-
     A                                      ta function":"SystemToolbarSystools-
     A                                      ","show down arrow":"Yes"},{"field -
     A                                      type":"panel","panel style":"Transf-
     A                                      ormButtonBar","id":"W0070F_SCR01C_B-
     A                                      uttonBar","top":"35px","left":"1036-
     A                                      px","width":"187px","height":"28px"-
     A                                      ,"css class":"stationary","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1040px","-
     A                                      id":"W0070F_SCR01C_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"W0070F_SCR01C_BtnRefre-
     A                                      sh","tool tip":"Refresh","onclick":-
     A                                      "SystemToolbarRefresh","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/refresh.png'')"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1092px","id":"W0-
     A                                      070F_SCR01C_BtnSearch","tool tip":"-
     A                                      Search","onclick":"SystemToolbarSea-
     A                                      rch","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sea-
     A                                      rch.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility')
     A                                  1  5HTML('":"hidden","locked in place":-
     A                                      "true","left":"1118px","id":"W0070F-
     A                                      _SCR01C_BtnDiaryItems","tool tip":"-
     A                                      Diary/Work Items - IDARTS","onclick-
     A                                      ":"SystemToolbarDiary","background -
     A                                      image":{"fieldName":"DryIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1144px","id":"W0070F_SCR-
     A                                      01C_BtnSystemMessages","tool tip":"-
     A                                      System Messages","onclick":"SystemT-
     A                                      oolbarMessages","background image":-
     A                                      {"fieldName":"MsgIcnURL","dataLengt-
     A                                      h":"128","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none"}},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1196px","id":"W0070F_SCR01C_Btn-
     A                                      Help","tool tip":"Help","onclick":"-
     A                                      SystemToolbarHelp","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/help.png'')"},{"id":"W00-
     A                                      70F_SCR01C_ImgSysToolBottom","field-
     A                                       type":"image","image source":"/pro-
     A                                      foundui/userdata/images/systool/but-
     A                                      barbot.png","left":"1036px","top":"-
     A                                      64px","width":"187px","locked in pl-
     A                                      ace":"true","css class":"stationary-
     A                                      ","visibility":"hidden"},{"id":"W00-
     A                                      70F_SCR01C_MainTabPanel","field typ-
     A                                      e":"tab panel","tab panel style":"T-
     A                                      ransform","tab names":{"fieldName":-
     A                                      "SCPRDS","designValue":"[SCPRDS]","-
     A                                      refField":"NAME","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"active tab-
     A                                      ":"0","left":"250px","top":"70px","-
     A                                      width":"970px","height":"657px","z -
     A                                      index":"8","locked in place":"true"-
     A                                      ,"css class":"tab-panel","css class-
     A                                       2":"stationary"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0070F_SCR01C_BtnHiddenSave",-
     A                                      "value":"btnSave","top":"100px","re-
     A                                      sponse":{"fieldName":"btnSave","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"SCUSER","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCUSER","-
     A                                      designValue":"[SCUSER]","refField":-
     A                                      "USER","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"281px","cursor column-
     A                                      ":"2","top":"110px","cursor row":"1-
     A                                      ","css class 2":"top-line","parent -
     A                                      tab panel":"W0070F_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"SCCON-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"SCCONM","designVa-
     A                                      lue":"[SCCONM]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class 2":"top-line","css class 3":"-
     A                                      HI","parent tab panel":"W0070F_SCR0-
     A                                      1C_MainTabPanel","parent tab":"0","-
     A                                      css class 4":"profound-converted"},-
     A                                      {"id":"constant5","field type":"out-
     A                                      put field","left":"778px","cursor c-
     A                                      olumn":"73","top":"110px","cursor r-
     A                                      ow":"1","css class":"top-line","val-
     A                                      ue":"js: currentDate()","css class -
     A                                      2":"output-field","parent tab panel-
     A                                      ":"W0070F_SCR01C_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"W0070F_SCR01C_-
     A                                      fkeyMenu","field type":"menu","left-
     A                                      ":"10px","top":"120px","height":"35-
     A                                      0px","width":"230px","hover backgro-
     A                                      und color":"#9AAA61","hover text co-
     A                                      lor":"#FFFFFF","border color":"#4C6-
     A                                      106","menu option indent":"10px","b-
     A                                      ackground color":"#758B27","css cla-
     A                                      ss":"action-menu","css class 2":"st-
     A                                      ationary","z index":"101"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0070F_SCR01C_BtnHid-
     A                                      denRefresh","value":"btnRefresh","t-
     A                                      op":"125px","response":{"fieldName"-
     A                                      :"btnRefresh","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"Q1PGM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"Q1PGM","designValu')
     A                                  1  6HTML('e":"[Q1PGM]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"130px","cursor row":"2","error m-
     A                                      essage id":"CPF5203","error message-
     A                                       file":"QCPFMSG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"91","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"2 -
     A                                      messages","error message id 2":"CPF-
     A                                      5204","error message file 2":"QCPFM-
     A                                      SG","error message library 2":"*LIB-
     A                                      L","error condition 2":{"fieldName"-
     A                                      :"94","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"parent tab panel":"W0070F_SC-
     A                                      R01C_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCPRDS","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCP-
     A                                      RDS","designValue":"[SCPRDS]","refF-
     A                                      ield":"NAME","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"414px","cursor -
     A                                      column":"21","top":"130px","cursor -
     A                                      row":"2","css class 2":"HI","parent-
     A                                       tab panel":"W0070F_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","visibility"-
     A                                      :"hidden","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant6","field-
     A                                       type":"output field","value":"SCR0-
     A                                      1","css class":"constant","left":"7-
     A                                      99px","cursor column":"76","top":"1-
     A                                      30px","cursor row":"2","parent tab -
     A                                      panel":"W0070F_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0070F_SCR01C_BtnHiddenSearc-
     A                                      h","value":"btnSearch","top":"150px-
     A                                      ","response":{"fieldName":"btnSearc-
     A                                      h","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"constant7","field type":"-
     A                                      output field","value":"Position to -
     A                                      . . .","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"170px","cursor row":"4","parent t-
     A                                      ab panel":"W0070F_SCR01C_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPST4-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      input only":"true","value":{"fieldN-
     A                                      ame":"SCPST4","designValue":"[SCPST-
     A                                      4]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase","dataLength":"25"},"text t-
     A                                      ransform":"uppercase","visibility":-
     A                                      {"fieldName":"24","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"414px","cursor column":"21","top"-
     A                                      :"170px","cursor row":"4","width":"-
     A                                      176px","set focus":{"fieldName":"N0-
     A                                      6","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"parent tab panel":"W0070-
     A                                      F_SCR01C_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"SCPST1","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","input only":"tru-
     A                                      e","value":{"fieldName":"SCPST1","d-
     A                                      esignValue":"[SCPST1]","refField":"-
     A                                      LSN","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true"},"visibility"-
     A                                      :{"fieldName":"21","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"414px","cursor column":"21","top-
     A                                      ":"170px","cursor row":"4","width":-
     A                                      "211px","set focus":{"fieldName":"N-
     A                                      06","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"parent tab panel":"W007-
     A                                      0F_SCR01C_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"SCPST3","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","input only":"tr-
     A                                      ue","value":{"fieldName":"SCPST3","-
     A                                      designValue":"[SCPST3]","refField":-
     A                                      "DS3","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase","blankFill":"true"}-
     A                                      ,"text transform":"uppercase","visi-
     A                                      bility":{"fieldName":"23","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"414px","cursor column":"2-
     A                                      1","top":"170px","cursor row":"4","-
     A                                      width":"22px","text align":"right",-
     A                                      "set focus":{"fieldName":"N06","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"parent tab panel":"W0070F_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCPST2","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","input only":"true","val-
     A                                      ue":{"fieldName":"SCPST2","designVa-
     A                                      lue":"[SCPST2]","refField":"SS#","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransf')
     A                                  1  7HTML('orm":"uppercase"},"text trans-
     A                                      form":"uppercase","visibility":{"fi-
     A                                      eldName":"22","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"41-
     A                                      4px","cursor column":"21","top":"17-
     A                                      0px","cursor row":"4","width":"64px-
     A                                      ","set focus":{"fieldName":"N06","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"parent tab panel":"W0070F_SCR-
     A                                      01C_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"SCPS3B","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","input only":"true","v-
     A                                      alue":{"fieldName":"SCPS3B","design-
     A                                      Value":"[SCPS3B]","refField":"FYR",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","numBlankFill":"true"},"visibi-
     A                                      lity":{"fieldName":"23","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"449px","cursor column":"26"-
     A                                      ,"top":"170px","cursor row":"4","wi-
     A                                      dth":"22px","text align":"right","p-
     A                                      arent tab panel":"W0070F_SCR01C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "SCPS3C","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","input only":"true","value":{-
     A                                      "fieldName":"SCPS3C","designValue":-
     A                                      "[SCPS3C]","refField":"CASE","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      numBlankFill":"true"},"visibility":-
     A                                      {"fieldName":"23","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"484px","cursor column":"31","top"-
     A                                      :"170px","cursor row":"4","width":"-
     A                                      50px","text align":"right","parent -
     A                                      tab panel":"W0070F_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"SCPS1-
     A                                      B","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "input only":"true","value":{"field-
     A                                      Name":"SCPS1B","designValue":"[SCPS-
     A                                      1B]","refField":"FSN","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue"},"visibility":{"fieldName":"21"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"631px","cursor -
     A                                      column":"52","top":"170px","cursor -
     A                                      row":"4","width":"106px","parent ta-
     A                                      b panel":"W0070F_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCPS1C"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","i-
     A                                      nput only":"true","value":{"fieldNa-
     A                                      me":"SCPS1C","designValue":"[SCPS1C-
     A                                      ]","refField":"MID","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"uppercase"},"tex-
     A                                      t transform":"uppercase","visibilit-
     A                                      y":{"fieldName":"21","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"743px","cursor column":"68","t-
     A                                      op":"170px","cursor row":"4","width-
     A                                      ":"8px","parent tab panel":"W0070F_-
     A                                      SCR01C_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W0070F_S-
     A                                      CR01C_BtnHiddenDiaryItems","value":-
     A                                      "btnDiary","top":"175px","response"-
     A                                      :{"fieldName":"btnDiary","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0070F_SCR01C_BtnHidde-
     A                                      nSystemMessages","value":"btnMessag-
     A                                      e","top":"200px","response":{"field-
     A                                      Name":"btnMessage","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant8-
     A                                      ","field type":"output field","valu-
     A                                      e":"Type options, press Enter.","cs-
     A                                      s class":"constant","left":"281px",-
     A                                      "cursor column":"2","top":"210px","-
     A                                      cursor row":"6","css class 2":"BLU"-
     A                                      ,"parent tab panel":"W0070F_SCR01C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0070F_SCR01C_B-
     A                                      tnHiddenWorkSubmitJob","value":"btn-
     A                                      Wrksbmjob","top":"225px","response"-
     A                                      :{"fieldName":"btnWrkJob","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"SC-
     A                                      OPL1","field type":"output field","-
     A                                      value":{"fieldName":"SCOPL1","desig-
     A                                      nValue":"[SCOPL1]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"none","dataLength":"76-
     A                                      "},"left":"295px","cursor ')
     A                                  1  8HTML('column":"4","top":"230px","cu-
     A                                      rsor row":"7","css class":"BLU","de-
     A                                      scription":"OPTIONS LINE 1","parent-
     A                                       tab panel":"W0070F_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCOP-
     A                                      L2","field type":"output field","va-
     A                                      lue":{"fieldName":"SCOPL2","designV-
     A                                      alue":"[SCOPL2]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none","dataLength":"76"}-
     A                                      ,"left":"295px","cursor column":"4"-
     A                                      ,"top":"250px","cursor row":"8","cs-
     A                                      s class":"BLU","css class 2":"HI","-
     A                                      description":"OPTIONS LINE 2","pare-
     A                                      nt tab panel":"W0070F_SCR01C_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"W0070F_SCR01C_BtnHidd-
     A                                      enWorkPrinterOutput","value":"btnWr-
     A                                      kprtout","top":"250px","response":{-
     A                                      "fieldName":"btnWrkPrnt","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant10","field type":"output field-
     A                                      ","value":"JR","css class":"constan-
     A                                      t","left":"407px","cursor column":"-
     A                                      20","top":"270px","cursor row":"9",-
     A                                      "css class 2":"WHT","visibility":{"-
     A                                      fieldName":"63","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"hidden","customFalse":"visible"},-
     A                                      "parent tab panel":"W0070F_SCR01C_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted","css -
     A                                      class 4":"subfile-heading"},{"id":"-
     A                                      constant9","field type":"output fie-
     A                                      ld","value":"JR","css class":"const-
     A                                      ant","left":"526px","cursor column"-
     A                                      :"37","top":"270px","cursor row":"9-
     A                                      ","css class 2":"WHT","css class 3"-
     A                                      :"HI","visibility":{"fieldName":"67-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"hidden","cus-
     A                                      tomFalse":"visible"},"parent tab pa-
     A                                      nel":"W0070F_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 4":"prof-
     A                                      ound-converted","css class 5":"subf-
     A                                      ile-heading"},{"id":"SCR01S_expande-
     A                                      r","field type":"image","image sour-
     A                                      ce":"/profoundui/proddata/images/ic-
     A                                      ons/collapseall.gif","shortcut key"-
     A                                      :"F15","cursor":"pointer","tool tip-
     A                                      ":"Collapse All","onclick":"getObj(-
     A                                      \"SCR01S\").grid.toggle(this)","z i-
     A                                      ndex":"25","top":"275px","left":"25-
     A                                      5px"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W0070F-
     A                                      _SCR01C_BtnHiddenImageQueue","value-
     A                                      ":"btnImgQue","top":"275px","respon-
     A                                      se":{"fieldName":"btnImgQue","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCHDL1","field type":"output field-
     A                                      ","value":{"fieldName":"SCHDL1","de-
     A                                      signValue":"[SCHDL1]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "80"},"left":"274px","cursor column-
     A                                      ":"1","top":"290px","cursor row":"1-
     A                                      0","css class":"HI","description":"-
     A                                      COLUMN HEADINGS","parent tab panel"-
     A                                      :"W0070F_SCR01C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted","css class 3":"subfile--
     A                                      heading"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W0-
     A                                      070F_SCR01C_BtnHiddenHelp","value":-
     A                                      "btnHelp","top":"300px","response":-
     A                                      {"fieldName":"btnHelp","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCR01-
     A                                      S","field type":"grid","number of c-
     A                                      olumns":"1","record format name":"S-
     A                                      CR01S","subfile next changed":{"fie-
     A                                      ldName":"08","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"display subfil-
     A                                      e":{"fieldName":"04","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"displa-
     A                                      y control record":{"fieldName":"N03-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"clear subfile":{"fieldNam-
     A                                      e":"03","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"subfile size":"6","-
     A                                      expanded":{"fieldName":"N12","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"collapsed":{"fieldName":"12","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"place cursor":"true","header he-
     A                                      ight":"40","row height":"40","css c-
     A                                      lass":"subfilegrid","css class 2":"-
     A                                      profound-converted","parent tab pan-
     A                                      el":"W0070F_SCR01C_MainTabPanel","p-
     A                                      arent tab":"0","subfile end":{"fiel-
     A                                      dName":"95","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"page down respo-
     A                                      nse":{"fieldName":"*IN01","dataType-
     A                                      ":"indicator","formatting"')
     A                                  1  9HTML(':"Indicator","indFormat":"1 /-
     A                                       0"},"page up response":{"fieldName-
     A                                      ":"*IN02","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"show paging controls":"tr-
     A                                      ue","scrollbar":"none","number of r-
     A                                      ows":"6","fold multiple":"2","singl-
     A                                      e row zoom":"true","top":"270px","l-
     A                                      eft":"254px","column widths":"608",-
     A                                      "return mode":{"fieldName":"SFLMOD"-
     A                                      ,"dataLength":"1","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"none"},"subfile record -
     A                                      number":{"fieldName":"SCRRN1","desi-
     A                                      gnValue":"[SCRRN1]","dataType":"zon-
     A                                      ed","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"true","zeroF-
     A                                      ill":"true","curSym":"","units":"",-
     A                                      "negNum":"-999.00","dataLength":"4"-
     A                                      ,"decPos":"0"}},{"id":"btnSubmit","-
     A                                      field type":"button","value":"Enter-
     A                                      ","shortcut key":"Enter","left":"14-
     A                                      px","top":"150px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF03","field type-
     A                                      ":"button","value":"F3","shortcut k-
     A                                      ey":"F3","left":"14px","top":"183px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF05","field type":"button","valu-
     A                                      e":"F5","shortcut key":"F5","left":-
     A                                      "14px","top":"216px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF06","field t-
     A                                      ype":"button","value":"F6","shortcu-
     A                                      t key":"F6","left":"14px","top":"24-
     A                                      9px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF09","field type":"button","v-
     A                                      alue":"F9","shortcut key":"F9","lef-
     A                                      t":"14px","top":"282px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnCF11","fiel-
     A                                      d type":"button","value":"F11","sho-
     A                                      rtcut key":"F11","left":"14px","top-
     A                                      ":"315px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF12","field type":"butto-
     A                                      n","value":"Cancel","shortcut key":-
     A                                      "F12","left":"14px","top":"348px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F15","field type":"button","value":-
     A                                      "F15","shortcut key":"F15","onclick-
     A                                      ":"getObj(\"SCR01S\").grid.toggle(t-
     A                                      his)","left":"14px","top":"381px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F17","field type":"button","value":-
     A                                      "F17","shortcut key":"F17","left":"-
     A                                      14px","top":"414px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF18","field ty-
     A                                      pe":"button","value":"F18","shortcu-
     A                                      t key":"F18","left":"14px","top":"4-
     A                                      47px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF19","field type":"button","-
     A                                      value":"F19","shortcut key":"F19","-
     A                                      left":"14px","top":"480px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF20","f-
     A                                      ield type":"button","value":"F20","-
     A                                      shortcut key":"F20","left":"14px","-
     A                                      top":"513px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF21","field type":"bu-
     A                                      tton","value":"F21","shortcut key":-
     A                                      "F21","left":"14px","top":"546px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F22","field type":"button","value":-
     A                                      "F22","shortcut key":"F22","left":"-
     A                                      14px","top":"579px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF23","field ty-
     A                                      pe":"button","value":"F23","shortcu-
     A                                      t key":"F23","left":"14px","top":"6-
     A                                      12px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF24","field type":"button","-
     A                                      value":"F24","shortcut key":"F24","-
     A                                      left":"14px","top":"645px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"SCMID","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      MID","designValue":"[SCMID]","refFi-
     A                                      eld":"MID","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"none"},"left":"-254px","t-
     A                                      op":"-339px","css class":"profound--
     A                                      converted","grid":"SCR01S","column"-
     A                                      :"0"},{"id":"SCACL#","field type":"-
     A                                      output field","visibility":"hidden"-
     A                                      ,"value":{"fieldName":"SCACL#","des-
     A                                      ignValue":"[SCACL#]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"none","dataLength":"-
     A                                      25"},"left":"-254px","top"')
     A                                  1 10HTML(':"-339px","css class":"profou-
     A                                      nd-converted","grid":"SCR01S","colu-
     A                                      mn":"0"},{"id":"SCAUTH","field type-
     A                                      ":"output field","visibility":"hidd-
     A                                      en","value":{"fieldName":"SCAUTH","-
     A                                      designValue":"[SCAUTH]","refField":-
     A                                      "FLAG","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none"},"left":"-254px","top":-
     A                                      "-339px","css class":"profound-conv-
     A                                      erted","grid":"SCR01S","column":"0"-
     A                                      },{"id":"SCFND","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"SCFND","designVal-
     A                                      ue":"[SCFND]","refField":"FND","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"true","curSym"-
     A                                      :"","units":"","negNum":"-999.00"},-
     A                                      "left":"-254px","top":"-339px","wid-
     A                                      th":"21px","text align":"right","cs-
     A                                      s class":"profound-converted","grid-
     A                                      ":"SCR01S","column":"0"},{"id":"SCF-
     A                                      YR","field type":"output field","vi-
     A                                      sibility":"hidden","value":{"fieldN-
     A                                      ame":"SCFYR","designValue":"[SCFYR]-
     A                                      ","refField":"FYR","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"true","ze-
     A                                      roFill":"true","curSym":"","units":-
     A                                      "","negNum":"-999.00"},"left":"-254-
     A                                      px","top":"-339px","width":"21px","-
     A                                      text align":"right","css class":"pr-
     A                                      ofound-converted","grid":"SCR01S","-
     A                                      column":"0"},{"id":"SCFSN","field t-
     A                                      ype":"output field","visibility":"h-
     A                                      idden","value":{"fieldName":"SCFSN"-
     A                                      ,"designValue":"[SCFSN]","refField"-
     A                                      :"FSN","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none"},"left":"-254px","top":-
     A                                      "-339px","css class":"profound-conv-
     A                                      erted","grid":"SCR01S","column":"0"-
     A                                      },{"id":"SCLSN","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"SCLSN","designVal-
     A                                      ue":"[SCLSN]","refField":"LSN","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      },"left":"-254px","top":"-339px","c-
     A                                      ss class":"profound-converted","gri-
     A                                      d":"SCR01S","column":"0"},{"id":"SC-
     A                                      DBRR","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"SCDBRR","designValue":"[SCD-
     A                                      BRR]","dataType":"zoned","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"true","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","dataLength":"9","decPos":"0"}-
     A                                      ,"left":"-254px","top":"-339px","wi-
     A                                      dth":"63px","text align":"right","c-
     A                                      ss class":"profound-converted","gri-
     A                                      d":"SCR01S","column":"0"},{"id":"SC-
     A                                      CASE","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"SCCASE","designValue":"[SCC-
     A                                      ASE]","refField":"CASE","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"true","curSym":"","un-
     A                                      its":"","negNum":"-999.00"},"left":-
     A                                      "-254px","top":"-339px","width":"49-
     A                                      px","text align":"right","css class-
     A                                      ":"profound-converted","grid":"SCR0-
     A                                      1S","column":"0"},{"id":"SCSTAT","f-
     A                                      ield type":"output field","visibili-
     A                                      ty":"hidden","value":{"fieldName":"-
     A                                      SCSTAT","designValue":"[SCSTAT]","r-
     A                                      efField":"FLAG","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"none"},"left":"-254p-
     A                                      x","top":"-339px","css class":"prof-
     A                                      ound-converted","grid":"SCR01S","co-
     A                                      lumn":"0"},{"id":"SCSS#","field typ-
     A                                      e":"output field","visibility":"hid-
     A                                      den","value":{"fieldName":"SCSS#","-
     A                                      designValue":"[SCSS#]","refField":"-
     A                                      SS#","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"none"},"left":"-254px","top":"--
     A                                      339px","css class":"profound-conver-
     A                                      ted","grid":"SCR01S","column":"0"},-
     A                                      {"id":"SCSEL","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      SEL","designValue":"[SCSEL]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase","-
     A                                      dataLength":"2"},"text transform":"-
     A                                      uppercase","left":"27px","cursor co-
     A                                      lumn":"2","top":"1px","cursor row":-
     A                                      "11","width":"15px","set focus":{"f-
     A                                      ieldName":"07","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 3"-
     A                                      :{"fieldName":"05","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"RI","customFalse":""},"descrip-
     A                                      tion":"Selection Field","css class -
     A                                      4":"profound-converted","grid":"SCR-
     A                                      01S","column":"0"},{"id":"SCDATA","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCDATA","designValue"-
     A                                      :"[SCDATA]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none","dataLength":"76"},"cs-
     A                                      s class":"output-field","left":"48p-
     A                                      x","cursor column":"5","top":"1px",-
     A                                      "cursor row":"11","css class 2":{"f-
     A                                      ieldName":"51","dataType":')
     A                                  1 11HTML('"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"YLW","customFalse":-
     A                                      ""},"css class 3":{"fieldName":"74"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"RI","customFa-
     A                                      lse":""},"css class 4":"profound-co-
     A                                      nverted","grid":"SCR01S","column":"-
     A                                      0"},{"id":"constant1","field type":-
     A                                      "output field","value":"Emp#:","css-
     A                                       class":"constant","left":"62px","c-
     A                                      ursor column":"7","top":"21px","cur-
     A                                      sor row":"12","css class 2":"HI","c-
     A                                      ss class 3":"profound-converted","g-
     A                                      rid":"SCR01S","column":"0"},{"id":"-
     A                                      SCEMP#","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCEMP#","des-
     A                                      ignValue":"[SCEMP#]","refField":"EM-
     A                                      P#","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"104px","cursor column":"13-
     A                                      ","top":"21px","cursor row":"12","w-
     A                                      idth":"63px","text align":"right","-
     A                                      css class 2":"profound-converted","-
     A                                      grid":"SCR01S","column":"0"},{"id":-
     A                                      "constant2","field type":"output fi-
     A                                      eld","value":"Div:","css class":"co-
     A                                      nstant","left":"174px","cursor colu-
     A                                      mn":"23","top":"21px","cursor row":-
     A                                      "12","css class 2":"HI","css class -
     A                                      3":"profound-converted","grid":"SCR-
     A                                      01S","column":"0"},{"id":"SCDIV","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCDIV","designValue":"-
     A                                      [SCDIV]","refField":"DIV","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00"},"css-
     A                                       class":"output-field","left":"209p-
     A                                      x","cursor column":"28","top":"21px-
     A                                      ","cursor row":"12","width":"35px",-
     A                                      "text align":"right","css class 2":-
     A                                      "profound-converted","grid":"SCR01S-
     A                                      ","column":"0"},{"id":"constant3","-
     A                                      field type":"output field","value":-
     A                                      "Adjustor:","css class":"constant",-
     A                                      "left":"258px","cursor column":"35"-
     A                                      ,"top":"21px","cursor row":"12","cs-
     A                                      s class 2":"HI","css class 3":"prof-
     A                                      ound-converted","grid":"SCR01S","co-
     A                                      lumn":"0"},{"id":"SCADJ","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCADJ","designValue":"[SCADJ]"-
     A                                      ,"refField":"STAF","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"328px","c-
     A                                      ursor column":"45","top":"21px","cu-
     A                                      rsor row":"12","css class 2":"profo-
     A                                      und-converted","grid":"SCR01S","col-
     A                                      umn":"0"},{"id":"constant4","field -
     A                                      type":"output field","value":"Body -
     A                                      part:","css class":"constant","left-
     A                                      ":"363px","cursor column":"50","top-
     A                                      ":"21px","cursor row":"12","css cla-
     A                                      ss 2":"HI","css class 3":"profound--
     A                                      converted","grid":"SCR01S","column"-
     A                                      :"0"},{"id":"SCPART","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCPART","designValue":"[SCPART]","-
     A                                      refField":"DS20","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"440px","cur-
     A                                      sor column":"61","top":"21px","curs-
     A                                      or row":"12","css class 2":"profoun-
     A                                      d-converted","grid":"SCR01S","colum-
     A                                      n":"0"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        80A  H
     A            SCOPL1        76A  H
     A            SCOPL2        76A  H
     A            SCPST4        25A  H
     A            SCPST5         1A  H
     A            SCPST6         1A  H
     A            SCPST7         1A  H
     A            SCPST8         1A  H
     A            SCPST9         1A  H
     A            SCRRN1         4S 0H
     A            SFLMOD         1A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPS1B    R        H      REFFLD(FSN)
     A            SCPS1C    R        H      REFFLD(MID)
     A            SCPS3B    R        H      REFFLD(FYR)
     A            SCPS3C    R        H      REFFLD(CASE)
     A            SCPST1    R        H      REFFLD(LSN)
     A            SCPST2    R        H      REFFLD(SS#)
     A            SCPST3    R        H      REFFLD(DS3)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR01
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    22C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","overlay range":"2-
     A                                      2-23"},"items":[{"id":"W0070F_SCR01-
     A                                      _avKeys","field type":"output field-
     A                                      ","value":{"fieldName":"AV_KEYS","d-
     A                                      ataLength":"1134","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[AV_KEYS]"},"left":"0px","top":-
     A                                      "0px","visibility":"hidden"},{"id":-
     A                                      "W0070F_SCR01_action","field type":-
     A                                      "html container","white space":"nor-
     A                                      mal","left":"0px","top":"10px","wid-
     A                                      th":"230px","css class":"action-pan-
     A                                      el-converted","height":"700px","htm-
     A                                      l":"<div class=\"top\"></div><div c-
     A                                      lass=\"imagetop\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_top.png\"-
     A                                       /></div><div class=\"menulinks\"><-
     A                                      /div><div class=\"imagebottom\"><im-
     A                                      g src=\"/profoundui/userdata/images-
     A                                      /bar_bottom.png\" /></div><div clas-
     A                                      s=\"bottom\"></div>"},{"field type"-
     A                                      :"icon menu button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"32px","z index":"20","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1170px","id":"W0070F_SCR01_BtnIc-
     A                                      onMenuSystemTools","tool tip":"Syst-
     A                                      em Tools","icon alignment":"middle -
     A                                      left","icon width":"16px","icon hei-
     A                                      ght":"24px","icon source":"/profoun-
     A                                      dui/userdata/images/systool/systool-
     A                                      s.png","data function":"SystemToolb-
     A                                      arSystools","show down arrow":"Yes"-
     A                                      },{"field type":"panel","panel styl-
     A                                      e":"TransformButtonBar","id":"W0070-
     A                                      F_SCR01_ButtonBar","top":"35px","le-
     A                                      ft":"1036px","width":"187px","heigh-
     A                                      t":"28px","css class":"stationary",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1040px","id":"W0070F_SCR01_BtnSave"-
     A                                      ,"tool tip":"Save","onclick":"Syste-
     A                                      mToolbarSave","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/save.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1066px","id":"W0070F_SCR01_B-
     A                                      tnRefresh","tool tip":"Refresh","on-
     A                                      click":"SystemToolbarRefresh","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/refresh.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1092px","-
     A                                      id":"W0070F_SCR01_BtnSearch","tool -
     A                                      tip":"Search","onclick":"SystemTool-
     A                                      barSearch","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/search.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1118px","id":"W0070F_SCR01_Bt-
     A                                      nDiaryItems","tool tip":"Diary/Work-
     A                                       Items - IDARTS","onclick":"SystemT-
     A                                      oolbarDiary","background image":{"f-
     A                                      ieldName":"DryIcnURL","dataLength":-
     A                                      "128","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"}},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1144px","id":"W0070F_SCR01_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"W0070F_SCR01_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      W0070F_SCR01_ImgSysToolBottom","fie-
     A                                      ld type":"image","image source":"/p-
     A                                      rofoundui/userdata/images/systool/b-
     A                                      utbarbot.png","left":"1036px","top"-
     A                                      :"64px","width":"187px","locked in -
     A                                      place":"true","css class":"stationa-
     A                                      ry","visibility":"hidden"},{"id":"W-
     A                                      0070F_SCR01_MainTabPanel","field ty-
     A                                      pe":"tab panel","tab panel style":"-
     A                                      Transform","tab names":"Tab 1","act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0070F_SCR01_BtnHidden-
     A                                      Save","value":"btnSave","top":"100p-
     A                                      x","response":{"fieldName":"btnSave-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"W0070F_SCR01_fkeyMenu","fi-
     A                                      eld type":"menu","left":"10px","top-
     A                                      ":"120px","height":"350px","width":-
     A                                      "230px","hover background color":"#-
     A                                      9AAA61","hover text color":"#FFFFFF-
     A                                      ","border color":"#4C6106","menu op-
     A                                      tion indent":"10px","background col-
     A                                      or":"#758B27","css class":"action-m-
     A                                      enu","css class 2":"stationary","z -
     A                                      index":"101"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0070F_SCR01_BtnHiddenRefresh","v-
     A                                      alue":"btnRefresh","top":"125px","r-
     A                                      esponse":{"fieldName":"btnRefresh",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0070F_SCR01-
     A                                      _BtnHiddenSearch","value":"btnSearc-
     A                                      h","top":"150px","response":{"field-
     A                                      Name":"btnSearch","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0070F_SCR01_BtnHiddenDiaryIt-
     A                                      ems","value":"btnDiary","top":"175p-
     A                                      x","response":{"fieldName":"btnDiar-
     A                                      y","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W0070F_SC-
     A                                      R01_BtnHiddenSystemMessages","value-
     A                                      ":"btnMessage","top":"200px","respo-
     A                                      nse":{"fieldName":"btnMessage","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W0070F_SCR01_Btn-
     A                                      HiddenWorkSubmitJob","value":"btnWr-
     A                                      ksbmjob","top":"225px","response":{-
     A                                      "fieldName":"btnWrkJob","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W0070F_SCR01_BtnHiddenW-
     A                                      orkPrinterOutput","value":"btnWrkpr-
     A                                      tout","top":"250px","response":{"fi-
     A                                      eldName":"btnWrkPrnt","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0070F_SCR01_BtnHiddenIma-
     A                                      geQueue","value":"btnImgQue","top":-
     A                                      "275px","response":{"fieldName":"bt-
     A                                      nImgQue","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W00-
     A                                      70F_SCR01_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCFKL1"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCFKL1","d')
     A                                  1  5HTML('esignValue":"[SCFKL1]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none","dataL-
     A                                      ength":"78"},"left":"281px","cursor-
     A                                       column":"2","top":"530px","cursor -
     A                                      row":"22","css class":"BLU","descri-
     A                                      ption":"FUNCTION KEYS - LINE 1","pa-
     A                                      rent tab panel":"W0070F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","visibili-
     A                                      ty":"hidden","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCFKL2","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCFKL2","designValue":"[SC-
     A                                      FKL2]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none","dataLength":"78"},"left":"2-
     A                                      81px","cursor column":"2","top":"55-
     A                                      0px","cursor row":"23","css class":-
     A                                      "BLU","description":"FUNCTION KEYS -
     A                                      - LINE 2","parent tab panel":"W0070-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","visibility":"hidden","css clas-
     A                                      s 2":"profound-converted"},{"id":"b-
     A                                      tnSubmit","field type":"button","va-
     A                                      lue":"Enter","shortcut key":"Enter"-
     A                                      ,"left":"14px","top":"150px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnPAGEDO-
     A                                      WN","field type":"button","value":"-
     A                                      Page Down","shortcut key":"PageDown-
     A                                      ","response":{"fieldName":"*IN01","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"l-
     A                                      eft":"14px","top":"183px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnPAGEUP","-
     A                                      field type":"button","value":"Page -
     A                                      Up","shortcut key":"PageUp","respon-
     A                                      se":{"fieldName":"*IN02","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"left":"14p-
     A                                      x","top":"216px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFKL1        78A  H
     A            SCFKL2        78A  H
     A          R SCR02S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A  74        QPUI000001     1A  O  2  2
     A            SCDATA        76A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCSF1R         4S 0H
     A          R QSFLCTL002                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  01 02 13
     A  14 15                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR02S    5    RS-
     A                                      FLDSP    0    E1    3     14RSFLDSP-
     A                                      CTL 0    E1    3    N13RSFLCLR    0-
     A                                          E1    3     13RSFLPAG    1    C-
     A                                      2    10 RSFLSIZ    1    C2    11 1 -
     A                                         RSFLNXTCHG 0     2    ROVERLAY  -
     A                                       0     RROWS      2    C1    1C2   -
     A                                       18 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","overlay range":"-
     A                                      1-18"},"items":[{"id":"SCRRN2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      RRN2","designValue":"[SCRRN2]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"4","decPos":"0"},"left":"0-
     A                                      px","top":"-30px","width":"28px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted"},{"id":"W0070F_SCR-
     A                                      02C_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"W0070F_SCR02C_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"W0070F_SCR02C_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon alignment":"mi-
     A                                      ddle left","icon width":"16px","ico-
     A                                      n height":"24px","icon source":"/pr-
     A                                      ofoundui/userdata/images/systool/sy-
     A                                      stools.png","data function":"System-
     A                                      ToolbarSystools","show down arrow":-
     A                                      "Yes"},{"field type":"panel","panel-
     A                                       style":"TransformButtonBar","id":"-
     A                                      W0070F_SCR02C_ButtonBar","top":"35p-
     A                                      x","left":"1036px","width":"187px",-
     A                                      "height":"28px","css class":"statio-
     A                                      nary","visibility":"hidden","locked-
     A                                       in place":"true"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1040px","id":"W0070F_SCR02C_B-
     A                                      tnSave","tool tip":"Save","onclick"-
     A                                      :"SystemToolbarSave","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/save.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1066px","id":"W0070F_-
     A                                      SCR02C_BtnRefresh","tool tip":"Refr-
     A                                      esh","onclick":"SystemToolbarRefres-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/refre-
     A                                      sh.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      092px","id":"W0070F_SCR02C_BtnSearc-
     A                                      h","tool tip":"Search","onclick":"S-
     A                                      ystemToolbarSearch","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/search.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1118px","id":"W0070F-
     A                                      _SCR02C_BtnDiaryItems","tool tip":"-
     A                                      Diary/Work Items - IDARTS","onclick-
     A                                      ":"SystemToolbarDiary","background -
     A                                      image":{"fieldName":"DryIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","bord')
     A                                  1  4HTML('er bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1144px","-
     A                                      id":"W0070F_SCR02C_BtnSystemMessage-
     A                                      s","tool tip":"System Messages","on-
     A                                      click":"SystemToolbarMessages","bac-
     A                                      kground image":{"fieldName":"MsgIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1196px","id":"W0-
     A                                      070F_SCR02C_BtnHelp","tool tip":"He-
     A                                      lp","onclick":"SystemToolbarHelp","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/help.png'-
     A                                      ')"},{"id":"W0070F_SCR02C_ImgSysToo-
     A                                      lBottom","field type":"image","imag-
     A                                      e source":"/profoundui/userdata/ima-
     A                                      ges/systool/butbarbot.png","left":"-
     A                                      1036px","top":"64px","width":"187px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en"},{"id":"W0070F_SCR02C_MainTabPa-
     A                                      nel","field type":"tab panel","tab -
     A                                      panel style":"Transform","tab names-
     A                                      ":{"fieldName":"SCPRD2","designValu-
     A                                      e":"[SCPRD2]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"active tab":"0","left":"250px"-
     A                                      ,"top":"70px","width":"970px","heig-
     A                                      ht":"657px","z index":"8","locked i-
     A                                      n place":"true","css class":"tab-pa-
     A                                      nel","css class 2":"stationary"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0070F_SCR02C_-
     A                                      BtnHiddenSave","value":"btnSave","t-
     A                                      op":"100px","response":{"fieldName"-
     A                                      :"btnSave","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"SCR02C_SCUSER","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCUSER","designValue":-
     A                                      "[SCUSER]","refField":"USER","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      110px","cursor row":"1","css class -
     A                                      2":"top-line","parent tab panel":"W-
     A                                      0070F_SCR02C_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCR02C_SCCONM","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCCONM","designValue":"-
     A                                      [SCCONM]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      414px","cursor column":"21","top":"-
     A                                      110px","cursor row":"1","css class -
     A                                      2":"top-line","css class 3":"HI","p-
     A                                      arent tab panel":"W0070F_SCR02C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 4":"profound-converted"},{"id":-
     A                                      "constant11","field type":"output f-
     A                                      ield","left":"778px","cursor column-
     A                                      ":"73","top":"110px","cursor row":"-
     A                                      1","css class":"top-line","value":"-
     A                                      js: currentDate()","css class 2":"o-
     A                                      utput-field","parent tab panel":"W0-
     A                                      070F_SCR02C_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"W0070F_SCR02C_fkeyM-
     A                                      enu","field type":"menu","left":"10-
     A                                      px","top":"120px","height":"350px",-
     A                                      "width":"230px","hover background c-
     A                                      olor":"#9AAA61","hover text color":-
     A                                      "#FFFFFF","border color":"#4C6106",-
     A                                      "menu option indent":"10px","backgr-
     A                                      ound color":"#758B27","css class":"-
     A                                      action-menu","css class 2":"station-
     A                                      ary","z index":"101"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0070F_SCR02C_BtnHiddenRe-
     A                                      fresh","value":"btnRefresh","top":"-
     A                                      125px","response":{"fieldName":"btn-
     A                                      Refresh","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"SCR02C_Q1PGM","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"Q1PGM","designValue":"[Q1-
     A                                      PGM]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none","dataLength":"10"},"css clas-
     A                                      s":"output-field","left":"281px","c-
     A                                      ursor column":"2","top":"130px","cu-
     A                                      rsor row":"2","parent tab panel":"W-
     A                                      0070F_SCR02C_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCPRD2","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCPRD2","designValue":"[SCPRD2-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"')
     A                                  1  5HTML('},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"130px","cursor row":"2","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "W0070F_SCR02C_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant12","fie-
     A                                      ld type":"output field","value":"SC-
     A                                      R02","css class":"constant","left":-
     A                                      "799px","cursor column":"76","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"W0070F_SCR02C_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t13","field type":"output field","v-
     A                                      alue":"W0070F-SCR02-JWALK TAG","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"150px","c-
     A                                      ursor row":"3","visibility":"hidden-
     A                                      ","parent tab panel":"W0070F_SCR02C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0070F_SCR02C_-
     A                                      BtnHiddenSearch","value":"btnSearch-
     A                                      ","top":"150px","response":{"fieldN-
     A                                      ame":"btnSearch","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant14"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Press Enter to confirm your choi-
     A                                      ces for 4=Delete.","css class":"con-
     A                                      stant","left":"281px","cursor colum-
     A                                      n":"2","top":"170px","cursor row":"-
     A                                      4","css class 2":"BLU","parent tab -
     A                                      panel":"W0070F_SCR02C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0070F_SCR02C_BtnHiddenDiary-
     A                                      Items","value":"btnDiary","top":"17-
     A                                      5px","response":{"fieldName":"btnDi-
     A                                      ary","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"constant15","field type-
     A                                      ":"output field","value":"Press F12-
     A                                       to return to change your choices."-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"190p-
     A                                      x","cursor row":"5","css class 2":"-
     A                                      BLU","parent tab panel":"W0070F_SCR-
     A                                      02C_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0070F_SCR0-
     A                                      2C_BtnHiddenSystemMessages","value"-
     A                                      :"btnMessage","top":"200px","respon-
     A                                      se":{"fieldName":"btnMessage","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W0070F_SCR02C_Btn-
     A                                      HiddenWorkSubmitJob","value":"btnWr-
     A                                      ksbmjob","top":"225px","response":{-
     A                                      "fieldName":"btnWrkJob","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"SCR0-
     A                                      2C_SCHDL1","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCHDL1","-
     A                                      designValue":"[SCHDL1]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"none","dataLength-
     A                                      ":"80"},"left":"274px","cursor colu-
     A                                      mn":"1","top":"250px","cursor row":-
     A                                      "8","css class":"HI","description":-
     A                                      "COLUMN HEADINGS","parent tab panel-
     A                                      ":"W0070F_SCR02C_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted","css class 3":"subfile-
     A                                      -heading"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      0070F_SCR02C_BtnHiddenWorkPrinterOu-
     A                                      tput","value":"btnWrkprtout","top":-
     A                                      "250px","response":{"fieldName":"bt-
     A                                      nWrkPrnt","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"SCR02S","field typ-
     A                                      e":"grid","number of columns":"2","-
     A                                      record format name":"SCR02S","subfi-
     A                                      le next changed":"true","display su-
     A                                      bfile":{"fieldName":"14","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"di-
     A                                      splay control record":{"fieldName":-
     A                                      "N13","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"clear subfile":{"fiel-
     A                                      dName":"13","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"subfile size":"-
     A                                      11","header height":"20","row heigh-
     A                                      t":"20","css class":"subfilegrid","-
     A                                      css class 2":"profound-converted","-
     A                                      parent tab panel":"W0070F_SCR02C_Ma-
     A                                      inTabPanel","parent tab":"0","subfi-
     A                                      le end":{"fieldName":"N15","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      page down response":{"fieldName":"*-
     A                                      IN01","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"page up response":{"fieldName-
     A                                      ":"*IN02","dataType":"indi')
     A                                  1  6HTML('cator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"show pagin-
     A                                      g controls":"true","scrollbar":"non-
     A                                      e","number of rows":"11","top":"250-
     A                                      px","left":"274px","column widths":-
     A                                      "23,565","subfile record number":{"-
     A                                      fieldName":"SCRRN2","designValue":"-
     A                                      [SCRRN2]","dataType":"zoned","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"true","zeroFill":"true-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","dataLength":"4","decPos":-
     A                                      "0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W0070F-
     A                                      _SCR02C_BtnHiddenImageQueue","value-
     A                                      ":"btnImgQue","top":"302px","respon-
     A                                      se":{"fieldName":"btnImgQue","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0070F_SCR02C_BtnH-
     A                                      iddenHelp","value":"btnHelp","top":-
     A                                      "327px","response":{"fieldName":"bt-
     A                                      nHelp","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"btnSubmit","field typ-
     A                                      e":"button","value":"Enter","shortc-
     A                                      ut key":"Enter","left":"14px","top"-
     A                                      :"150px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF12","field type":"button-
     A                                      ","value":"Cancel","shortcut key":"-
     A                                      F12","left":"14px","top":"183px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"SCR02-
     A                                      S_SCDBRR","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"SCDBRR","designValue":"-
     A                                      [SCDBRR]","dataType":"zoned","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"true","zeroFill":"true-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","dataLength":"9","decPos":-
     A                                      "0"},"left":"-58px","top":"-299px",-
     A                                      "width":"63px","text align":"right"-
     A                                      ,"css class":"profound-converted","-
     A                                      grid":"SCR02S","column":"0"},{"id":-
     A                                      "SCSF1R","field type":"output field-
     A                                      ","visibility":"hidden","value":{"f-
     A                                      ieldName":"SCSF1R","designValue":"[-
     A                                      SCSF1R]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","dataLength":"4","decPos":"-
     A                                      0"},"left":"-23px","top":"-299px","-
     A                                      width":"28px","text align":"right",-
     A                                      "css class":"profound-converted","g-
     A                                      rid":"SCR02S","column":"0"},{"id":"-
     A                                      SCR02S_SCSEL","field type":"output -
     A                                      field","value":{"fieldName":"SCSEL"-
     A                                      ,"designValue":"[SCSEL]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"2"},"css class":"output-field"-
     A                                      ,"left":"7px","cursor column":"2","-
     A                                      top":"1px","cursor row":"9","descri-
     A                                      ption":"Selection Field","css class-
     A                                       2":"profound-converted","grid":"SC-
     A                                      R02S","column":"0"},{"id":"SCR02S_S-
     A                                      CDATA","field type":"output field",-
     A                                      "value":{"fieldName":"SCDATA","desi-
     A                                      gnValue":"[SCDATA]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none","dataLength":"-
     A                                      76"},"css class":"output-field","le-
     A                                      ft":"5px","cursor column":"5","top"-
     A                                      :"1px","cursor row":"9","css class -
     A                                      2":{"fieldName":"74","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"RI","customFalse":""},"css c-
     A                                      lass 3":"profound-converted","grid"-
     A                                      :"SCR02S","column":"1"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        80A  H
     A            SCRRN2         4S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRD2    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR02
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"23-23"},"items":[{-
     A                                      "id":"W0070F_SCR02_avKeys","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"AV_KEYS","dataLength":"1134"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[AV_KEYS]"},"-
     A                                      left":"0px","top":"0px","visibility-
     A                                      ":"hidden"},{"id":"W0070F_SCR02_act-
     A                                      ion","field type":"html container",-
     A                                      "white space":"normal","left":"0px"-
     A                                      ,"top":"10px","width":"230px","css -
     A                                      class":"action-panel-converted","he-
     A                                      ight":"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_bottom.png\"-
     A                                       /></div><div class=\"bottom\"></di-
     A                                      v>"},{"field type":"icon menu butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"32px-
     A                                      ","z index":"20","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1170px","id":"-
     A                                      W0070F_SCR02_BtnIconMenuSystemTools-
     A                                      ","tool tip":"System Tools","icon a-
     A                                      lignment":"middle left","icon width-
     A                                      ":"16px","icon height":"24px","icon-
     A                                       source":"/profoundui/userdata/imag-
     A                                      es/systool/systools.png","data func-
     A                                      tion":"SystemToolbarSystools","show-
     A                                       down arrow":"Yes"},{"field type":"-
     A                                      panel","panel style":"TransformButt-
     A                                      onBar","id":"W0070F_SCR02_ButtonBar-
     A                                      ","top":"35px","left":"1036px","wid-
     A                                      th":"187px","height":"28px","css cl-
     A                                      ass":"stationary","visibility":"hid-
     A                                      den","locked in place":"true"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1040px","id":"W00-
     A                                      70F_SCR02_BtnSave","tool tip":"Save-
     A                                      ","onclick":"SystemToolbarSave","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/save.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1066px","i-
     A                                      d":"W0070F_SCR02_BtnRefresh","tool -
     A                                      tip":"Refresh","onclick":"SystemToo-
     A                                      lbarRefresh","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/refresh.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1092px","id":"W0070F_SCR02-
     A                                      _BtnSearch","tool tip":"Search","on-
     A                                      click":"SystemToolbarSearch","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/search.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1118px","id-
     A                                      ":"W0070F_SCR02_BtnDiaryItems","too-
     A                                      l tip":"Diary/Work Items - IDARTS",-
     A                                      "onclick":"SystemToolbarDiary","bac-
     A                                      kground image":{"fieldName":"DryIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1144px","id":"W0-
     A                                      070F_SCR02_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting"')
     A                                  1  4HTML(':"Text","textTransform":"none-
     A                                      "}},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1196px","-
     A                                      id":"W0070F_SCR02_BtnHelp","tool ti-
     A                                      p":"Help","onclick":"SystemToolbarH-
     A                                      elp","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/hel-
     A                                      p.png'')"},{"id":"W0070F_SCR02_ImgS-
     A                                      ysToolBottom","field type":"image",-
     A                                      "image source":"/profoundui/userdat-
     A                                      a/images/systool/butbarbot.png","le-
     A                                      ft":"1036px","top":"64px","width":"-
     A                                      187px","locked in place":"true","cs-
     A                                      s class":"stationary","visibility":-
     A                                      "hidden"},{"id":"W0070F_SCR02_MainT-
     A                                      abPanel","field type":"tab panel","-
     A                                      tab panel style":"Transform","tab n-
     A                                      ames":"Tab 1","active tab":"0","lef-
     A                                      t":"250px","top":"70px","width":"97-
     A                                      0px","height":"657px","z index":"8"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"tab-panel","css class 2":"stati-
     A                                      onary"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W007-
     A                                      0F_SCR02_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"W0070F_S-
     A                                      CR02_fkeyMenu","field type":"menu",-
     A                                      "left":"10px","top":"120px","height-
     A                                      ":"350px","width":"230px","hover ba-
     A                                      ckground color":"#9AAA61","hover te-
     A                                      xt color":"#FFFFFF","border color":-
     A                                      "#4C6106","menu option indent":"10p-
     A                                      x","background color":"#758B27","cs-
     A                                      s class":"action-menu","css class 2-
     A                                      ":"stationary","z index":"101"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0070F_SCR02_Bt-
     A                                      nHiddenRefresh","value":"btnRefresh-
     A                                      ","top":"125px","response":{"fieldN-
     A                                      ame":"btnRefresh","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0070F_SCR02_BtnHiddenSearch"-
     A                                      ,"value":"btnSearch","top":"150px",-
     A                                      "response":{"fieldName":"btnSearch"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0070F_SCR0-
     A                                      2_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0070F_SCR02_BtnHiddenSyst-
     A                                      emMessages","value":"btnMessage","t-
     A                                      op":"200px","response":{"fieldName"-
     A                                      :"btnMessage","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0070F_SCR02_BtnHiddenWorkSubmitJ-
     A                                      ob","value":"btnWrksbmjob","top":"2-
     A                                      25px","response":{"fieldName":"btnW-
     A                                      rkJob","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0070-
     A                                      F_SCR02_BtnHiddenWorkPrinterOutput"-
     A                                      ,"value":"btnWrkprtout","top":"250p-
     A                                      x","response":{"fieldName":"btnWrkP-
     A                                      rnt","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W0070F_-
     A                                      SCR02_BtnHiddenImageQueue","value":-
     A                                      "btnImgQue","top":"275px","response-
     A                                      ":{"fieldName":"btnImgQue","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0070F_SCR02_BtnHidd-
     A                                      enHelp","value":"btnHelp","top":"30-
     A                                      0px","response":{"fieldName":"btnHe-
     A                                      lp","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px"')
     A                                  1  5HTML(',"top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnPAGEDOWN","fie-
     A                                      ld type":"button","value":"Page Dow-
     A                                      n","shortcut key":"PageDown","respo-
     A                                      nse":{"fieldName":"*IN01","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"left":"14-
     A                                      px","top":"183px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnPAGEUP","field ty-
     A                                      pe":"button","value":"Page Up","sho-
     A                                      rtcut key":"PageUp","response":{"fi-
     A                                      eldName":"*IN02","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"left":"14px","top"-
     A                                      :"216px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"}]}-
     A                                      ')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR03
     A  01 02 71
     A  75 33 34
     A  35 76 77                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                      SETOF(71 'Response Indicator *IN71')
     A                                      SETOF(75 'Response Indicator *IN75')
     A                                  1  2HTML('QPUIREC6    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    15 RER-
     A                                      RMSGID  5    C6    SSACDTC7    WCR0-
     A                                      500C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     71RERRMSGID  5    C6    SS-
     A                                      STATC7    WCR0715C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     75RERRMSGID -
     A                                       5    C6    SSSTAFC7    WCR0892C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        76RERRMSGID  5    C6    SSLTFLC7 -
     A                                         WCR0936C6    WMESGGC5    *LIBLC0-
     A                                          E1    3     77')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN71","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN75","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"return -
     A                                      cursor record":{"fieldName":"HREC",-
     A                                      "dataLength":"10","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"none"},"return cursor f-
     A                                      ield":{"fieldName":"HFLD","dataLeng-
     A                                      th":"10","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"none"},"show as window":"true","-
     A                                      window top":"3","window left":"4","-
     A                                      overlay range":"1-15"},"items":[{"i-
     A                                      d":"HFLD","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"HFLD","designValue":"[H-
     A                                      FLD]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none","dataLength":"10"},"left":"0p-
     A                                      x","top":"-30px","css class":"profo-
     A                                      und-converted"},{"id":"HREC","field-
     A                                       type":"output field","visibility":-
     A                                      "hidden","value":{"fieldName":"HREC-
     A                                      ","designValue":"[HREC]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"10"},"left":"0px","top":"-30px"-
     A                                      ,"css class":"profound-converted"},-
     A                                      {"id":"SCR03","field type":"panel",-
     A                                      "panel style":"Transform Dialog","t-
     A                                      ext align":"center","left":"5px","t-
     A                                      op":"5px","height":"450px","width":-
     A                                      "534px","z index":"8","locked in pl-
     A                                      ace":"true"},{"id":"SCR03_SCUSER","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCUSER","designValue"-
     A                                      :"[SCUSER]","refField":"USER","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"29px","cursor column":"2","top":"-
     A                                      65px","cursor row":"1","css class 2-
     A                                      ":"profound-converted"},{"id":"SCPR-
     A                                      D3","field type":"output field","va-
     A                                      lue":{"fieldName":"SCPRD3","designV-
     A                                      alue":"[SCPRD3]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"127px","cursor column":"16",-
     A                                      "top":"65px","cursor row":"1","css -
     A                                      class 2":"HI","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant16","-
     A                                      field type":"output field","value":-
     A                                      "SCR03","css class":"constant","lef-
     A                                      t":"477px","cursor column":"66","to-
     A                                      p":"65px","cursor row":"1","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant17","field type":"output fi-
     A                                      eld","value":"Type choices, press E-
     A                                      nter.","css class":"constant","left-
     A                                      ":"29px","cursor column":"2","top":-
     A                                      "105px","cursor row":"3","css class-
     A                                       2":"BLU","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant18","fiel-
     A                                      d type":"output field","value":"Gro-
     A                                      up #                 :","css class"-
     A                                      :"constant","left":"43px","cursor c-
     A                                      olumn":"4","top":"145px","cursor ro-
     A                                      w":"5","css class 2":"profound-conv-
     A                                      erted"},{"id":"SSFND","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SSFND","designValue":"[SSFND]-
     A                                      ","refField":"FND","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00","numBlankFil-
     A                                      l":"true"},"left":"232px","cursor c-
     A                                      olumn":"31","top":"145px","cursor r-
     A                                      ow":"5","width":"22px","text align"-
     A                                      :"right","read only":{"fieldName":"-
     A                                      33","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 3":{"fieldNam-
     A                                      e":"33","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N33","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"css class 5"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant19","field type":"output field",-
     A                                      "value":"Year                    :"-
     A                                      ,"css class":"constant","left":"43p-
     A                                      x","cursor column":"4","top":"165px-
     A                                      ","cursor row":"6","css class 2":"p-
     A                                      rofound-converted"},{"id":"SSYEAR",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SSYEAR","designV-
     A                                      alue":"[SSYEAR]","refField":"FYR","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"999.0-
     A                                      0","numBlankFill":"true"},"left":"2-
     A                                      32px","cursor column":"31","top":"1-
     A                                      65px","cursor row":"6","width":"22p-
     A                                      x","text align":"right","css class -
     A                                      3":"profound-converted"},{')
     A                                  1  4HTML('"id":"constant20","field type-
     A                                      ":"output field","value":"Accident -
     A                                      date           :","css class":"cons-
     A                                      tant","left":"43px","cursor column"-
     A                                      :"4","top":"185px","cursor row":"7"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SSACDT","field type":"date-
     A                                       field","css class":"input","css cl-
     A                                      ass 2":"date-field","value":{"field-
     A                                      Name":"SSACDT","designValue":"[SSAC-
     A                                      DT]","refField":"DT8","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"-999.00","numBlan-
     A                                      kFill":"true","edtWrd":"''  /  /   -
     A                                       ''","dateFormat":"m/d/Y"},"left":"-
     A                                      232px","cursor column":"31","top":"-
     A                                      185px","cursor row":"7","width":"71-
     A                                      px","text align":"right","error mes-
     A                                      sage id":"WCR0500","error message f-
     A                                      ile":"WMESGG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"71","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"1 mes-
     A                                      sage","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant21","field ty-
     A                                      pe":"output field","value":"Claiman-
     A                                      t name (contains):","css class":"co-
     A                                      nstant","left":"43px","cursor colum-
     A                                      n":"4","top":"205px","cursor row":"-
     A                                      8","css class 2":"profound-converte-
     A                                      d"},{"id":"SSNAME","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SSNAME","designValue":"[SSNAME]"-
     A                                      ,"refField":"DS30","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      },"left":"232px","cursor column":"3-
     A                                      1","top":"205px","cursor row":"8","-
     A                                      width":"211px","css class 3":"profo-
     A                                      und-converted"},{"id":"constant22",-
     A                                      "field type":"output field","value"-
     A                                      :"Employer/Division       :","css c-
     A                                      lass":"constant","left":"43px","cur-
     A                                      sor column":"4","top":"225px","curs-
     A                                      or row":"9","css class 2":"profound-
     A                                      -converted"},{"id":"SSEMP#","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SSEMP#","designValue":"-
     A                                      [SSEMP#]","refField":"EMP#","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00","nu-
     A                                      mBlankFill":"true"},"left":"232px",-
     A                                      "cursor column":"31","top":"225px",-
     A                                      "cursor row":"9","width":"64px","te-
     A                                      xt align":"right","read only":{"fie-
     A                                      ldName":"34","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 3":{-
     A                                      "fieldName":"34","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"css class-
     A                                       4":{"fieldName":"N34","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"css-
     A                                       class 5":"profound-converted"},{"i-
     A                                      d":"SSDIV","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SSDIV-
     A                                      ","designValue":"[SSDIV]","dataType-
     A                                      ":"char","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","dataLeng-
     A                                      th":"5","numBlankFill":"true"},"lef-
     A                                      t":"302px","cursor column":"41","to-
     A                                      p":"225px","cursor row":"9","width"-
     A                                      :"36px","text align":"right","read -
     A                                      only":{"fieldName":"35","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 3":{"fieldName":"35","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 4":{"fieldName":"N35","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"description":"DIV","css cla-
     A                                      ss 5":"profound-converted"},{"id":"-
     A                                      constant23","field type":"output fi-
     A                                      eld","value":"Location             -
     A                                       :","css class":"constant","left":"-
     A                                      57px","cursor column":"6","top":"24-
     A                                      5px","cursor row":"10","css class 2-
     A                                      ":"profound-converted"},{"id":"SSCT-
     A                                      G1","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SSCTG1","des-
     A                                      ignValue":"[SSCTG1]","refField":"CT-
     A                                      GY","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase"},"text transform":"up-
     A                                      percase","left":"232px","cursor col-
     A                                      umn":"31","top":"245px","cursor row-
     A                                      ":"10","width":"71px","description"-
     A                                      :"Location","css class 3":"profound-
     A                                      -converted"},{"id":"constant24","fi-
     A                                      eld type":"output field","value":"C-
     A                                      laim status            :","css clas-
     A                                      s":"constant","left":"43px","cursor-
     A                                       column":"4","top":"265px","cursor -
     A                                      row":"11","css class 2":"profound-c-
     A                                      onverted"},{"id":"SSSTAT","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SSSTAT","designValue":"[S-
     A                                      SSTAT]","refField":"STAT","dataType-
     A                                      ":"reference","formatting"')
     A                                  1  5HTML(':"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","left":"232px","cursor c-
     A                                      olumn":"31","top":"265px","cursor r-
     A                                      ow":"11","width":"8px","error messa-
     A                                      ge id":"WCR0715","error message fil-
     A                                      e":"WMESGG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"75","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"1 messa-
     A                                      ge","css class 3":"profound-convert-
     A                                      ed"},{"id":"constant25","field type-
     A                                      ":"output field","value":"User staf-
     A                                      f code         :","css class":"cons-
     A                                      tant","left":"43px","cursor column"-
     A                                      :"4","top":"285px","cursor row":"12-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SSSTAF","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SSSTAF","designValue":"[SSSTAF]",-
     A                                      "refField":"STAF","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase"},"text -
     A                                      transform":"uppercase","left":"232p-
     A                                      x","cursor column":"31","top":"285p-
     A                                      x","cursor row":"12","width":"22px"-
     A                                      ,"error message id":"WCR0892","erro-
     A                                      r message file":"WMESGG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"76","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"1 message","css class 3":"pro-
     A                                      found-converted"},{"id":"constant26-
     A                                      ","field type":"output field","valu-
     A                                      e":"Lost time flag          :","css-
     A                                       class":"constant","left":"43px","c-
     A                                      ursor column":"4","top":"305px","cu-
     A                                      rsor row":"13","css class 2":"profo-
     A                                      und-converted"},{"id":"SSLTFL","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SSLTFL","designValue-
     A                                      ":"[SSLTFL]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase","dataLength":"1"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"232px","cursor column":"31","top-
     A                                      ":"305px","cursor row":"13","width"-
     A                                      :"8px","error message id":"WCR0936"-
     A                                      ,"error message file":"WMESGG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"77","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"1 message","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant27","field type":"output field"-
     A                                      ,"value":"Jurisdiction State      :-
     A                                      ","css class":"constant","left":"43-
     A                                      px","cursor column":"4","top":"325p-
     A                                      x","cursor row":"14","css class 2":-
     A                                      "profound-converted"},{"id":"SJRST"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SJRST","designV-
     A                                      alue":"[SJRST]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase","dataLength":"-
     A                                      2"},"text transform":"uppercase","l-
     A                                      eft":"232px","cursor column":"31","-
     A                                      top":"325px","cursor row":"14","wid-
     A                                      th":"15px","css class 3":"profound--
     A                                      converted"},{"id":"btnSubmit","fiel-
     A                                      d type":"button","value":"Enter","s-
     A                                      hortcut key":"Enter","left":"14px",-
     A                                      "top":"410px","width":"80px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF10","field type":"bu-
     A                                      tton","value":"Search","shortcut ke-
     A                                      y":"F10","left":"104px","top":"410p-
     A                                      x","width":"80px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF12","field type":"button","valu-
     A                                      e":"Cancel","shortcut key":"F12","l-
     A                                      eft":"194px","top":"410px","width":-
     A                                      "80px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnPAGEDOWN"-
     A                                      ,"field type":"button","value":"Pag-
     A                                      e Down","shortcut key":"PageDown","-
     A                                      response":{"fieldName":"*IN01","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"left-
     A                                      ":"284px","top":"410px","width":"80-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","visibi-
     A                                      lity":"hidden","cursor":"default"},-
     A                                      {"id":"btnPAGEUP","field type":"but-
     A                                      ton","value":"Page Up","shortcut ke-
     A                                      y":"PageUp","response":{"fieldName"-
     A                                      :"*IN02","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"left":"374px","top":"410px-
     A                                      ","width":"80px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","visibility":"hidden","cursor-
     A                                      ":"default"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SJRST          2A  H
     A            SSDIV          5A  H
     A            SSLTFL         1A  H
     A            SCPRD3    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A            SSACDT    R        H      REFFLD(DT8)
     A            SSCTG1    R        H      REFFLD(CTGY)
     A            SSEMP#    R        H      REFFLD(EMP#)
     A            SSFND     R        H      REFFLD(FND)
     A            SSNAME    R        H      REFFLD(DS30)
     A            SSSTAF    R        H      REFFLD(STAF)
     A            SSSTAT    R        H      REFFLD(STAT)
     A            SSYEAR    R        H      REFFLD(FYR)
     A          R MSGSFL                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            MSGKEY         4A  H
     A            Q1PGM         10A  H
     A          R QSFLCTL003                SFLCTL(MSGSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLMSGSFLC')
     A          R MSGSFLC
     A  01 02 10                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    MSGSFL    6    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LINZ    0     RSFLPAG    1    C1   -
     A                                       1 RSFLSIZ    1    C1    5 FQ1PGM  -
     A                                         SFLPGMQ   0     2    FMSGKEY    -
     A                                      SFLMSGKEY 0     FQ1PGM     SFLPGMQ -
     A                                        0     1    RROWS      2    C2    -
     A                                      24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"MSGSFLC","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","overlay range":"24-24"},"items":-
     A                                      [{"id":"W0070F_MSGSFLC_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"W0070F_MSGSF-
     A                                      LC_action","field type":"html conta-
     A                                      iner","white space":"normal","left"-
     A                                      :"0px","top":"10px","width":"230px"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","height":"700px","html":"<div cl-
     A                                      ass=\"top\"></div><div class=\"imag-
     A                                      etop\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_top.png\" /></div><d-
     A                                      iv class=\"menulinks\"></div><div c-
     A                                      lass=\"imagebottom\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_bottom-
     A                                      .png\" /></div><div class=\"bottom\-
     A                                      "></div>"},{"field type":"icon menu-
     A                                       button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"32px","z index":"20","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1170px",-
     A                                      "id":"W0070F_MSGSFLC_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon alignment":"middle left","ic-
     A                                      on width":"16px","icon height":"24p-
     A                                      x","icon source":"/profoundui/userd-
     A                                      ata/images/systool/systools.png","d-
     A                                      ata function":"SystemToolbarSystool-
     A                                      s","show down arrow":"Yes"},{"field-
     A                                       type":"panel","panel style":"Trans-
     A                                      formButtonBar","id":"W0070F_MSGSFLC-
     A                                      _ButtonBar","top":"35px","left":"10-
     A                                      36px","width":"187px","height":"28p-
     A                                      x","css class":"stationary","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1040px"-
     A                                      ,"id":"W0070F_MSGSFLC_BtnSave","too-
     A                                      l tip":"Save","onclick":"SystemTool-
     A                                      barSave","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /save.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1066px","id":"W0070F_MSGSFLC_BtnR-
     A                                      efresh","tool tip":"Refresh","oncli-
     A                                      ck":"SystemToolbarRefresh","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/refresh.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1092px","id"-
     A                                      :"W0070F_MSGSFLC_BtnSearch","tool t-
     A                                      ip":"Search","onclick":"SystemToolb-
     A                                      arSearch","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/search.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1118px","id":"W0070F_MSGSFLC_B-
     A                                      tnDiaryItems","tool tip":"Diary/Wor-
     A                                      k Items - IDARTS","onclick":"System-
     A                                      ToolbarDiary","background image":{"-
     A                                      fieldName":"DryIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1144px","id":"W0070F_MSGSFLC_BtnS-
     A                                      ystemMessages","tool tip":"System M-
     A                                      essages","onclick":"SystemToolbarMe-
     A                                      ssages","background image":{"fieldN-
     A                                      ame":"MsgIcnURL","dataLength":"128"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType"')
     A                                  1  4HTML(':"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"W0070F_MSG-
     A                                      SFLC_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"W0070F_MSGSFLC_ImgSysToolBotto-
     A                                      m","field type":"image","image sour-
     A                                      ce":"/profoundui/userdata/images/sy-
     A                                      stool/butbarbot.png","left":"1036px-
     A                                      ","top":"64px","width":"187px","loc-
     A                                      ked in place":"true","css class":"s-
     A                                      tationary","visibility":"hidden"},{-
     A                                      "id":"W0070F_MSGSFLC_MainTabPanel",-
     A                                      "field type":"tab panel","tab panel-
     A                                       style":"Transform","tab names":"Ta-
     A                                      b 1","active tab":"0","left":"250px-
     A                                      ","top":"70px","width":"970px","hei-
     A                                      ght":"657px","z index":"8","locked -
     A                                      in place":"true","css class":"tab-p-
     A                                      anel","css class 2":"stationary"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W0070F_MSGSFL-
     A                                      C_BtnHiddenSave","value":"btnSave",-
     A                                      "top":"100px","response":{"fieldNam-
     A                                      e":"btnSave","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"W0070F_MSGSFLC_-
     A                                      fkeyMenu","field type":"menu","left-
     A                                      ":"10px","top":"120px","height":"35-
     A                                      0px","width":"230px","hover backgro-
     A                                      und color":"#9AAA61","hover text co-
     A                                      lor":"#FFFFFF","border color":"#4C6-
     A                                      106","menu option indent":"10px","b-
     A                                      ackground color":"#758B27","css cla-
     A                                      ss":"action-menu","css class 2":"st-
     A                                      ationary","z index":"101"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0070F_MSGSFLC_BtnHi-
     A                                      ddenRefresh","value":"btnRefresh","-
     A                                      top":"125px","response":{"fieldName-
     A                                      ":"btnRefresh","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0070F_MSGSFLC_BtnHiddenSearch",-
     A                                      "value":"btnSearch","top":"150px","-
     A                                      response":{"fieldName":"btnSearch",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0070F_MSGSF-
     A                                      LC_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0070F_MSGSFLC_BtnHiddenS-
     A                                      ystemMessages","value":"btnMessage"-
     A                                      ,"top":"200px","response":{"fieldNa-
     A                                      me":"btnMessage","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0070F_MSGSFLC_BtnHiddenWorkSu-
     A                                      bmitJob","value":"btnWrksbmjob","to-
     A                                      p":"225px","response":{"fieldName":-
     A                                      "btnWrkJob","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0070F_MSGSFLC_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0070F_MSGSFLC_BtnHiddenImageQueue"-
     A                                      ,"value":"btnImgQue","top":"275px",-
     A                                      "response":{"fieldName":"btnImgQue"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0070F_MSGS-
     A                                      FLC_BtnHiddenHelp","value":"btnHelp-
     A                                      ","top":"300px","response":{"fieldN-
     A                                      ame":"btnHelp","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"MSGSFL","fiel-
     A                                      d type":"grid","number of ')
     A                                  1  5HTML('columns":"1","record format n-
     A                                      ame":"MSGSFL","display subfile":"tr-
     A                                      ue","display control record":"true"-
     A                                      ,"subfile size":"5","initialize sub-
     A                                      file":"true","row height":"20","css-
     A                                       class":"subfilegrid","css class 2"-
     A                                      :"profound-converted","parent tab p-
     A                                      anel":"W0070F_MSGSFLC_MainTabPanel"-
     A                                      ,"parent tab":"0","subfile end":{"f-
     A                                      ieldName":"N10","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"number of r-
     A                                      ows":"1","has header":"false","subf-
     A                                      ile program message queue":{"fieldN-
     A                                      ame":"Q1PGM","dataLength":"10","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"},"su-
     A                                      bfile control program message queue-
     A                                      ":{"fieldName":"Q1PGM","dataLength"-
     A                                      :"10","trimLeading":"false","trimTr-
     A                                      ailing":"true","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"},"subfile message key":{"fiel-
     A                                      dName":"MSGKEY","dataLength":"4","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"},"-
     A                                      top":"570px","left":"269px","column-
     A                                       widths":"595"},{"id":"btnSubmit","-
     A                                      field type":"button","value":"Enter-
     A                                      ","shortcut key":"Enter","left":"14-
     A                                      px","top":"150px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnPAGEDOWN","field -
     A                                      type":"button","value":"Page Down",-
     A                                      "shortcut key":"PageDown","response-
     A                                      ":{"fieldName":"*IN01","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"left":"14px"-
     A                                      ,"top":"183px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnPAGEUP","field type"-
     A                                      :"button","value":"Page Up","shortc-
     A                                      ut key":"PageUp","response":{"field-
     A                                      Name":"*IN02","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"left":"14px","top":"2-
     A                                      16px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A          R WDWMSG
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC3    ROVERLAY   0     -
     A                                      RWINDOW    0     RROWS      2    C1-
     A                                          1C2    11 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"WDWMSG","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","show as window":-
     A                                      "true","window top":"9","window lef-
     A                                      t":"12","overlay range":"1-11"},"it-
     A                                      ems":[{"id":"WDWMSG","field type":"-
     A                                      panel","panel style":"Transform Dia-
     A                                      log","text align":"center","left":"-
     A                                      5px","top":"5px","height":"370px","-
     A                                      width":"492px","z index":"8","locke-
     A                                      d in place":"true"},{"id":"WDWMSG_Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"22px","cursor column":"1","top":"-
     A                                      65px","cursor row":"1","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant28","field type":"output field"-
     A                                      ,"value":"**********  ERROR  ******-
     A                                      ****","css class":"constant","left"-
     A                                      :"148px","cursor column":"19","top"-
     A                                      :"65px","cursor row":"1","css class-
     A                                       2":"HI","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant29","field-
     A                                       type":"output field","value":"WDWM-
     A                                      SG","css class":"constant","left":"-
     A                                      421px","cursor column":"58","top":"-
     A                                      65px","cursor row":"1","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant30","field type":"output field"-
     A                                      ,"value":"This claim should not be -
     A                                      deleted because","css class":"const-
     A                                      ant","left":"64px","cursor column":-
     A                                      "7","top":"105px","cursor row":"3",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"constant31","field type":"o-
     A                                      utput field","value":"active DARTS -
     A                                      diaries exist for this claim.","css-
     A                                       class":"constant","left":"64px","c-
     A                                      ursor column":"7","top":"125px","cu-
     A                                      rsor row":"4","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant32","-
     A                                      field type":"output field","value":-
     A                                      "These diaries should be reviewed a-
     A                                      nd","css class":"constant","left":"-
     A                                      64px","cursor column":"7","top":"14-
     A                                      5px","cursor row":"5","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant33","field type":"output field",-
     A                                      "value":"completed before this clai-
     A                                      m is deleted.","css class":"constan-
     A                                      t","left":"64px","cursor column":"7-
     A                                      ","top":"165px","cursor row":"6","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant34","field type":"out-
     A                                      put field","value":"Override error -
     A                                      message      :","css class":"consta-
     A                                      nt","left":"85px","cursor column":"-
     A                                      10","top":"205px","cursor row":"8",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCOVR","field type":"checkb-
     A                                      ox","css class":"input","css class -
     A                                      2":"checkbox","value":{"fieldName":-
     A                                      "SCOVR","designValue":"[SCOVR]","re-
     A                                      fField":"FLAG","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase"},"text tra-
     A                                      nsform":"uppercase","left":"302px",-
     A                                      "top":"205px","width":"8px","css cl-
     A                                      ass 3":"HI","css class 4":"profound-
     A                                      -converted","checked value":"Y","un-
     A                                      checked value":"N"},{"id":"constant-
     A                                      35","field type":"output field","va-
     A                                      lue":"Press Enter to continue","css-
     A                                       class":"constant","left":"29px","c-
     A                                      ursor column":"2","top":"265px","cu-
     A                                      rsor row":"11","css class 2":"BLU",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"btnSubmit","field type":"bu-
     A                                      tton","value":"Enter","shortcut key-
     A                                      ":"Enter","left":"14px","top":"330p-
     A                                      x","width":"80px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnPAGEDOWN","field type":"button","-
     A                                      value":"Page Down","shortcut key":"-
     A                                      PageDown","response":{"fieldName":"-
     A                                      *IN01","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"left":"104px","top":"330px",-
     A                                      "width":"80px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","visibility":"hidden","cursor":-
     A                                      "default"},{"id":"btnPAGEUP","field-
     A                                       type":"button","value":"Page Up","-
     A                                      shortcut key":"PageUp","response":{-
     A                                      "fieldName":"*IN02","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"left":"194px","-
     A                                      top":"330px","width":"80px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","visibility":"hidd-
     A                                      en","cursor":"default"}]}')
     A            Q1PGM         10A  H
     A            SCOVR     R        H      REFFLD(FLAG)
     A          R WDWNOI
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC3    ROVERLAY   0     -
     A                                      RWINDOW    0     RROWS      2    C1-
     A                                          1C1    6 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"WDWNOI","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","show as window":-
     A                                      "true","window top":"9","window lef-
     A                                      t":"12","overlay range":"1-6"},"ite-
     A                                      ms":[{"id":"WDWNOI","field type":"p-
     A                                      anel","panel style":"Transform Dial-
     A                                      og","text align":"center","left":"5-
     A                                      px","top":"5px","height":"270px","w-
     A                                      idth":"394px","z index":"8","locked-
     A                                       in place":"true"},{"id":"WDWNOI_Q1-
     A                                      PGM","field type":"output field","v-
     A                                      alue":{"fieldName":"Q1PGM","designV-
     A                                      alue":"[Q1PGM]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none","dataLength":"10"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "22px","cursor column":"1","top":"6-
     A                                      5px","cursor row":"1","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant36","field type":"output field",-
     A                                      "value":"******  ERROR  ******","cs-
     A                                      s class":"constant","left":"127px",-
     A                                      "cursor column":"16","top":"65px","-
     A                                      cursor row":"1","css class 2":"HI",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant37","field type":"o-
     A                                      utput field","value":"WDWNOI","css -
     A                                      class":"constant","left":"323px","c-
     A                                      ursor column":"44","top":"65px","cu-
     A                                      rsor row":"1","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant38","-
     A                                      field type":"output field","value":-
     A                                      "The Notice of Injury (NOI) can not-
     A                                       be","css class":"constant","left":-
     A                                      "64px","cursor column":"7","top":"1-
     A                                      05px","cursor row":"3","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant39","field type":"output field"-
     A                                      ,"value":"reprinted for the selecte-
     A                                      d claim.","css class":"constant","l-
     A                                      eft":"64px","cursor column":"7","to-
     A                                      p":"125px","cursor row":"4","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant40","field type":"output f-
     A                                      ield","value":"Press Enter to conti-
     A                                      nue","css class":"constant","left":-
     A                                      "29px","cursor column":"2","top":"1-
     A                                      65px","cursor row":"6","css class 2-
     A                                      ":"BLU","css class 3":"profound-con-
     A                                      verted"},{"id":"btnSubmit","field t-
     A                                      ype":"button","value":"Enter","shor-
     A                                      tcut key":"Enter","left":"14px","to-
     A                                      p":"230px","width":"80px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnPAGEDOWN","field type":"b-
     A                                      utton","value":"Page Down","shortcu-
     A                                      t key":"PageDown","response":{"fiel-
     A                                      dName":"*IN01","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"left":"104px","top":-
     A                                      "230px","width":"80px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","visibility":"hidden","-
     A                                      cursor":"default"},{"id":"btnPAGEUP-
     A                                      ","field type":"button","value":"Pa-
     A                                      ge Up","shortcut key":"PageUp","res-
     A                                      ponse":{"fieldName":"*IN02","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"left":"-
     A                                      194px","top":"230px","width":"80px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","visibilit-
     A                                      y":"hidden","cursor":"default"}]}')
     A            Q1PGM         10A  H
