     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 09
     A  46 19 20
     A  64 69 73                            CA01(10 'Response Indicator *IN10')
     A  74 82 40
     A  63 70                               CA02(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC13   RROWS      2    C-
     A                                      1    1C2    24 RERRMSGID  5    C6  -
     A                                        SCMODEC7    WCR1058C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     20RERRMS-
     A                                      GID  5    C6    SCHOSFC7    WCR1322-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     73RERRMSGID  5    C6    SCHOS-
     A                                      FC7    WCR2370C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     74RERRMSGID  5 -
     A                                         C6    SCHOSFC7    WCR0690C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     8-
     A                                      2RERRMSGID  5    C6    SCHOSMC7    -
     A                                      WCR1322C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     73RERRMSGID  5    C6  -
     A                                        SCHOSMC7    WCR2370C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     74RERRMS-
     A                                      GID  5    C6    SCHOSNC7    WCR2370-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     74RERRMSGID  5    C6    SCHOS-
     A                                      AC7    WCR2370C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     74RERRMSGID  5 -
     A                                         C6    SCHOSCC7    WCR2370C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     7-
     A                                      4RERRMSGID  5    C6    SCHOSSC7    -
     A                                      WCR2370C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     74RERRMSGID  5    C6  -
     A                                        SCHZP1C7    WCR2370C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     74RERRMS-
     A                                      GID  5    C6    SCHZP2C7    WCR2370-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     74')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "return cursor record":{"fieldName"-
     A                                      :"HREC","dataLength":"10","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none"},"return -
     A                                      cursor field":{"fieldName":"HFLD","-
     A                                      dataLength":"10","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none"},"valid command ke-
     A                                      y":{"fieldName":"*IN11","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"overlay ran-
     A                                      ge":"1-24"},"items":[{"id":"HREC","-
     A                                      field type":"output field","visibil-
     A                                      ity":"hidden","value":{"fieldName":-
     A                                      "HREC","designValue":"[HREC]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none","data-
     A                                      Length":"10"},"left":"0px","top":"--
     A                                      30px","css class":"profound-convert-
     A                                      ed"},{"id":"HFLD","field type":"out-
     A                                      put field","visibility":"hidden","v-
     A                                      alue":{"fieldName":"HFLD","designVa-
     A                                      lue":"[HFLD]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"none","dataLength":"10"},"l-
     A                                      eft":"0px","top":"-30px","css class-
     A                                      ":"profound-converted"},{"id":"W007-
     A                                      0F10_SCR01_avKeys","field type":"ou-
     A                                      tput field","value":{"fieldName":"A-
     A                                      V_KEYS","dataLength":"1134","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[AV_KEYS]"},"left":"0-
     A                                      px","top":"0px","visibility":"hidde-
     A                                      n"},{"id":"W0070F10_SCR01_action","-
     A                                      field type":"html container","white-
     A                                       space":"normal","left":"0px","top"-
     A                                      :"10px","width":"230px","css class"-
     A                                      :"action-panel-converted","height":-
     A                                      "700px","html":"<div class=\"top\">-
     A                                      </div><div class=\"imagetop\"><img -
     A                                      src=\"/profoundui/userdata/images/b-
     A                                      ar_top.png\" /></div><div class=\"m-
     A                                      enulinks\"></div><div class=\"image-
     A                                      bottom\"><img src=\"/profoundui/use-
     A                                      rdata/images/bar_bottom.png\" /></d-
     A                                      iv><div class=\"bottom\"></div>"},{-
     A                                      "field type":"icon menu button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"32px","z i-
     A                                      ndex":"20","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1170px","id":"W0070F-
     A                                      10_SCR01_BtnIconMenuSystemTools","t-
     A                                      ool tip":"System Tools","icon align-
     A                                      ment":"middle left","icon width":"1-
     A                                      6px","icon height":"24px","icon sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/systools.png","data function-
     A                                      ":"SystemToolbarSystools","show dow-
     A                                      n arrow":"Yes"},{"field type":"pane-
     A                                      l","panel style":"TransformButtonBa-
     A                                      r","id":"W0070F10_SCR01_ButtonBar",-
     A                                      "top":"35px","left":"1036px","width-
     A                                      ":"187px","height":"28px","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n","locked in place":"true"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1040px","id":"W0070-
     A                                      F10_SCR01_BtnSave","tool tip":"Save-
     A                                      ","onclick":"SystemToolbarSave","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/save.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1066px","i-
     A                                      d":"W0070F10_SCR01_BtnRefresh","too-
     A                                      l tip":"Refresh","onclick":"SystemT-
     A                                      oolbarRefresh","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/refresh.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1092px","id":"W0070F10_S-
     A                                      CR01_BtnSearch","tool tip":"Search"-
     A                                      ,"onclick":"SystemToolbarSearch","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/search.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"')
     A                                  1  4HTML('none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1118px","id":"W0070F10_SCR0-
     A                                      1_BtnDiaryItems","tool tip":"Diary/-
     A                                      Work Items - IDARTS","onclick":"Sys-
     A                                      temToolbarDiary","background image"-
     A                                      :{"fieldName":"DryIcnURL","dataLeng-
     A                                      th":"128","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none"}},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1144px","id":"W0070F10_SCR01_B-
     A                                      tnSystemMessages","tool tip":"Syste-
     A                                      m Messages","onclick":"SystemToolba-
     A                                      rMessages","background image":{"fie-
     A                                      ldName":"MsgIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      196px","id":"W0070F10_SCR01_BtnHelp-
     A                                      ","tool tip":"Help","onclick":"Syst-
     A                                      emToolbarHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"W0070F1-
     A                                      0_SCR01_ImgSysToolBottom","field ty-
     A                                      pe":"image","image source":"/profou-
     A                                      ndui/userdata/images/systool/butbar-
     A                                      bot.png","left":"1036px","top":"64p-
     A                                      x","width":"187px","locked in place-
     A                                      ":"true","css class":"stationary","-
     A                                      visibility":"hidden"},{"id":"W0070F-
     A                                      10_SCR01_MainTabPanel","field type"-
     A                                      :"tab panel","tab panel style":"Tra-
     A                                      nsform","tab names":{"fieldName":"S-
     A                                      CPRDS","designValue":"[SCPRDS]","re-
     A                                      fField":"NAME","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"active tab":-
     A                                      "0","left":"250px","top":"70px","wi-
     A                                      dth":"970px","height":"657px","z in-
     A                                      dex":"8","locked in place":"true","-
     A                                      css class":"tab-panel","css class 2-
     A                                      ":"stationary"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W0070F10_SCR01_BtnHiddenSave","-
     A                                      value":"btnSave","top":"100px","res-
     A                                      ponse":{"fieldName":"btnSave","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"SCUSER","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCUSER","d-
     A                                      esignValue":"[SCUSER]","refField":"-
     A                                      USER","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"281px","cursor column"-
     A                                      :"2","top":"110px","cursor row":"1"-
     A                                      ,"css class 2":"top-line","parent t-
     A                                      ab panel":"W0070F10_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"SCCON-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"SCCONM","designVa-
     A                                      lue":"[SCCONM]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class 2":"top-line","css class 3":"-
     A                                      HI","description":"COMPANY NAME","p-
     A                                      arent tab panel":"W0070F10_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 4":"profound-converted"},{"id"-
     A                                      :"constant1","field type":"output f-
     A                                      ield","left":"778px","cursor column-
     A                                      ":"73","top":"110px","cursor row":"-
     A                                      1","css class":"top-line","value":"-
     A                                      js: currentDate()","css class 2":"o-
     A                                      utput-field","parent tab panel":"W0-
     A                                      070F10_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"W0070F10_SCR01_fke-
     A                                      yMenu","field type":"menu","left":"-
     A                                      10px","top":"120px","height":"350px-
     A                                      ","width":"230px","hover background-
     A                                       color":"#9AAA61","hover text color-
     A                                      ":"#FFFFFF","border color":"#4C6106-
     A                                      ","menu option indent":"10px","back-
     A                                      ground color":"#758B27","css class"-
     A                                      :"action-menu","css class 2":"stati-
     A                                      onary","z index":"101"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W0070F10_SCR01_BtnHidde-
     A                                      nRefresh","value":"btnRefresh","top-
     A                                      ":"125px","response":{"fieldName":"-
     A                                      btnRefresh","dataType":"indicator",-
     A                                      "formatting":"Indicator","')
     A                                  1  5HTML('indFormat":"1 / 0"}},{"id":"Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"W0070F10_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPRDS-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCPRDS","designVal-
     A                                      ue":"[SCPRDS]","refField":"NAME","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"414px","cursor column":"21","t-
     A                                      op":"130px","cursor row":"2","css c-
     A                                      lass 2":"HI","description":"PROGRAM-
     A                                       NAME","parent tab panel":"W0070F10-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","visibility":"hidden","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant2","field type":"output field-
     A                                      ","value":"SCR01","css class":"cons-
     A                                      tant","left":"799px","cursor column-
     A                                      ":"76","top":"130px","cursor row":"-
     A                                      2","parent tab panel":"W0070F10_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCMSG1","field type":"output-
     A                                       field","value":{"fieldName":"SCMSG-
     A                                      1","designValue":"[SCMSG1]","refFie-
     A                                      ld":"DS10","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"281px","cursor co-
     A                                      lumn":"2","top":"150px","cursor row-
     A                                      ":"3","css class 2":{"fieldName":"6-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"RI","custom-
     A                                      False":""},"description":"EXCESS RE-
     A                                      IN","parent tab panel":"W0070F10_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"SCMSG2","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCMS-
     A                                      G2","designValue":"[SCMSG2]","refFi-
     A                                      eld":"NM50","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"407px","cursor c-
     A                                      olumn":"20","top":"150px","cursor r-
     A                                      ow":"3","css class 2":"HI","visibil-
     A                                      ity":{"fieldName":"N70","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"hidden","customFalse":"vi-
     A                                      sible"},"description":"BARCODE FILE-
     A                                       IN/OUT STATUS","parent tab panel":-
     A                                      "W0070F10_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"SCMODE","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCMODE","designValue":"[SCM-
     A                                      ODE]","refField":"NM10","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"764p-
     A                                      x","cursor column":"71","top":"150p-
     A                                      x","cursor row":"3","css class 2":"-
     A                                      HI","error message id":"WCR1058","e-
     A                                      rror message file":"WMESGG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"20","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"1 message","description":"-
     A                                      ADD/UPDATE MODE","parent tab panel"-
     A                                      :"W0070F10_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0070F10_SCR01_BtnHiddenSearch","-
     A                                      value":"btnSearch","top":"150px","r-
     A                                      esponse":{"fieldName":"btnSearch","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant3","field type":"outp-
     A                                      ut field","value":"Group:","css cla-
     A                                      ss":"constant","left":"281px","curs-
     A                                      or column":"2","top":"170px","curso-
     A                                      r row":"4","parent tab panel":"W007-
     A                                      0F10_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCFND","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCFND","designValue":"[SCFND]","r-
     A                                      efField":"FND","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"999.00"},"css class":"ou-
     A                                      tput-field","left":"330px","cursor -
     A                                      column":"9","top":"170px","cursor r-
     A                                      ow":"4","width":"21px","text align"-
     A                                      :"right","parent tab panel":"W0070F-
     A                                      10_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCFNAM","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCFNAM","designValue":"[SCFNAM]","-
     A                                      refField":"NM20","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"358px","cur-
     A                                      sor column":"13","top":"17')
     A                                  1  6HTML('0px","cursor row":"4","descri-
     A                                      ption":"FUND NAME","parent tab pane-
     A                                      l":"W0070F10_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"constant4","-
     A                                      field type":"output field","value":-
     A                                      "SS# :","css class":"constant","lef-
     A                                      t":"505px","cursor column":"34","to-
     A                                      p":"170px","cursor row":"4","parent-
     A                                       tab panel":"W0070F10_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCS-
     A                                      S#","field type":"output field","va-
     A                                      lue":{"fieldName":"SCSS#","designVa-
     A                                      lue":"[SCSS#]","refField":"SS# 11",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"547px","cursor column":"40",-
     A                                      "top":"170px","cursor row":"4","par-
     A                                      ent tab panel":"W0070F10_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCCNAM","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCCNAM","des-
     A                                      ignValue":"[SCCNAM]","refField":"NM-
     A                                      20","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"631px","cursor column":"-
     A                                      52","top":"170px","cursor row":"4",-
     A                                      "parent tab panel":"W0070F10_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0070F10_SCR01_-
     A                                      BtnHiddenDiaryItems","value":"btnDi-
     A                                      ary","top":"175px","response":{"fie-
     A                                      ldName":"btnDiary","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant5-
     A                                      ","field type":"output field","valu-
     A                                      e":"Emp# :","css class":"constant",-
     A                                      "left":"281px","cursor column":"2",-
     A                                      "top":"190px","cursor row":"5","par-
     A                                      ent tab panel":"W0070F10_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCEDN","field type":"output field",-
     A                                      "value":{"fieldName":"SCEDN","desig-
     A                                      nValue":"[SCEDN]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none","dataLength":"34-
     A                                      "},"css class":"output-field","left-
     A                                      ":"330px","cursor column":"9","top"-
     A                                      :"190px","cursor row":"5","descript-
     A                                      ion":"Emp#, DIV, & NAME","parent ta-
     A                                      b panel":"W0070F10_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt6","field type":"output field","v-
     A                                      alue":"Prior Grp/Emp #:","css class-
     A                                      ":"constant","visibility":{"fieldNa-
     A                                      me":"N63","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"575px"-
     A                                      ,"cursor column":"44","top":"190px"-
     A                                      ,"cursor row":"5","parent tab panel-
     A                                      ":"W0070F10_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCOFND","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCOFND","designValue":"[S-
     A                                      COFND]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"true",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","dataLength":"3","decPos":"0-
     A                                      "},"css class":"output-field","visi-
     A                                      bility":{"fieldName":"N63","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"694px","cursor column":"-
     A                                      61","top":"190px","cursor row":"5",-
     A                                      "width":"21px","text align":"right"-
     A                                      ,"css class 2":{"fieldName":"N63","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"RI","customFals-
     A                                      e":""},"description":"Old Fund Numb-
     A                                      er","parent tab panel":"W0070F10_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"SCOEMP","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCOE-
     A                                      MP","designValue":"[SCOEMP]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00","dataL-
     A                                      ength":"9","decPos":"0"},"css class-
     A                                      ":"output-field","visibility":{"fie-
     A                                      ldName":"N63","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"72-
     A                                      2px","cursor column":"65","top":"19-
     A                                      0px","cursor row":"5","width":"63px-
     A                                      ","text align":"right","css class 2-
     A                                      ":{"fieldName":"N63","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"RI","customFalse":""},"descr-
     A                                      iption":"Old Employer Number","pare-
     A                                      nt tab panel":"W0070F10_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CODIV","field type":"output field",-
     A                                      "value":{"fieldName":"SCODIV","desi-
     A                                      gnValue":"[SCODIV]","dataType":"zon-
     A                                      ed","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"999.00","dataL')
     A                                  1  7HTML('ength":"5","decPos":"0"},"css-
     A                                       class":"output-field","visibility"-
     A                                      :{"fieldName":"N63","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"792px","cursor column":"75","to-
     A                                      p":"190px","cursor row":"5","width"-
     A                                      :"35px","text align":"right","css c-
     A                                      lass 2":{"fieldName":"N63","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"RI","customFalse":""},-
     A                                      "description":"Old division","paren-
     A                                      t tab panel":"W0070F10_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"W0070F10_SCR01_BtnHid-
     A                                      denSystemMessages","value":"btnMess-
     A                                      age","top":"200px","response":{"fie-
     A                                      ldName":"btnMessage","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t7","field type":"output field","va-
     A                                      lue":"Case#:","css class":"constant-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"210px","cursor row":"6","p-
     A                                      arent tab panel":"W0070F10_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCYRCS","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCYRCS","d-
     A                                      esignValue":"[SCYRCS]","refField":"-
     A                                      SS# 11","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"330px","cursor colum-
     A                                      n":"9","top":"210px","cursor row":"-
     A                                      6","description":"FYR-CASE","parent-
     A                                       tab panel":"W0070F10_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant8","field type":"output field"-
     A                                      ,"value":"SCL#:","css class":"const-
     A                                      ant","left":"421px","cursor column"-
     A                                      :"22","top":"210px","cursor row":"6-
     A                                      ","parent tab panel":"W0070F10_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCSCL#","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      SCL#","designValue":"[SCSCL#]","ref-
     A                                      Field":"DS30 25","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"463px-
     A                                      ","cursor column":"28","top":"210px-
     A                                      ","cursor row":"6","width":"176px",-
     A                                      "css class 3":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"read only":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 4":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"PR","cust-
     A                                      omFalse":""},"description":"Ageny C-
     A                                      laim#","parent tab panel":"W0070F10-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 5":"profound-converte-
     A                                      d"},{"id":"constant9","field type":-
     A                                      "output field","value":"DOI :","css-
     A                                       class":"constant","left":"645px","-
     A                                      cursor column":"54","top":"210px","-
     A                                      cursor row":"6","parent tab panel":-
     A                                      "W0070F10_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCACDT","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCACDT","designValue":"[SCA-
     A                                      CDT]","refField":"DT8","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","edtWrd":-
     A                                      "''  /  /    ''"},"css class":"outp-
     A                                      ut-field","left":"687px","cursor co-
     A                                      lumn":"60","top":"210px","cursor ro-
     A                                      w":"6","width":"70px","text align":-
     A                                      "right","description":"Accident DAT-
     A                                      E","parent tab panel":"W0070F10_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0070F10_SCR-
     A                                      01_BtnHiddenWorkSubmitJob","value":-
     A                                      "btnWrksbmjob","top":"225px","respo-
     A                                      nse":{"fieldName":"btnWrkJob","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant10","field type":"output -
     A                                      field","value":"CVT#:","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"64","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"645px","c-
     A                                      ursor column":"54","top":"230px","c-
     A                                      ursor row":"7","parent tab panel":"-
     A                                      W0070F10_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCCVT","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCCVT","designValue":"[SCCVT]-
     A                                      ","refField":"DS10","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"}')
     A                                  1  8HTML(',"css class":"output-field","-
     A                                      visibility":{"fieldName":"64","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"687px","cursor column-
     A                                      ":"60","top":"230px","cursor row":"-
     A                                      7","description":"PREVIOUS CLAIM #"-
     A                                      ,"parent tab panel":"W0070F10_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0070F10_SCR01-
     A                                      _BtnHiddenWorkPrinterOutput","value-
     A                                      ":"btnWrkprtout","top":"250px","res-
     A                                      ponse":{"fieldName":"btnWrkPrnt","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant11","field type":"outp-
     A                                      ut field","value":"Current Attendin-
     A                                      g/Treating Physician               -
     A                                                               ","css cla-
     A                                      ss":"constant","left":"281px","curs-
     A                                      or column":"2","top":"270px","curso-
     A                                      r row":"9","css class 2":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"css class 3":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"parent tab p-
     A                                      anel":"W0070F10_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 4":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0070F10_SCR01_BtnHiddenImag-
     A                                      eQueue","value":"btnImgQue","top":"-
     A                                      275px","response":{"fieldName":"btn-
     A                                      ImgQue","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant12","field t-
     A                                      ype":"output field","value":"FEIN/M-
     A                                      OD:","css class":"constant","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      290px","cursor row":"10","parent ta-
     A                                      b panel":"W0070F10_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPHYF-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCPHYF","designVal-
     A                                      ue":"[SCPHYF]","refField":"FEIN","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"false","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"999.00-
     A                                      "},"css class":"output-field","left-
     A                                      ":"351px","cursor column":"12","top-
     A                                      ":"290px","cursor row":"10","width"-
     A                                      :"63px","text align":"right","css c-
     A                                      lass 2":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      parent tab panel":"W0070F10_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"SCPHYM","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCPHYM","-
     A                                      designValue":"[SCPHYM]","refField":-
     A                                      "MOD","dataType":"reference","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"false","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"999.00"},"css class":"output-fiel-
     A                                      d","left":"421px","cursor column":"-
     A                                      22","top":"290px","cursor row":"10"-
     A                                      ,"width":"21px","text align":"right-
     A                                      ","css class 2":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"parent tab panel":"W0070F10-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant13","field type"-
     A                                      :"output field","value":"-or-","css-
     A                                       class":"constant","left":"456px","-
     A                                      cursor column":"27","top":"290px","-
     A                                      cursor row":"10","parent tab panel"-
     A                                      :"W0070F10_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant14","f-
     A                                      ield type":"output field","value":"-
     A                                      Name:","css class":"constant","left-
     A                                      ":"491px","cursor column":"32","top-
     A                                      ":"290px","cursor row":"10","parent-
     A                                       tab panel":"W0070F10_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCP-
     A                                      HYN","field type":"output field","v-
     A                                      alue":{"fieldName":"SCPHYN","design-
     A                                      Value":"[SCPHYN]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"533px","cursor column":"38"-
     A                                      ,"top":"290px","cursor row":"10","c-
     A                                      ss class 2":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"HI","customFalse":"-
     A                                      "},"parent tab panel":"W0070F10_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0070F10_SCR-
     A                                      01_BtnHiddenHelp","value":"btnHelp"-
     A                                      ,"top":"300px","response":')
     A                                  1  9HTML('{"fieldName":"btnHelp","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "constant15","field type":"output f-
     A                                      ield","value":"Addr:","css class":"-
     A                                      constant","left":"491px","cursor co-
     A                                      lumn":"32","top":"310px","cursor ro-
     A                                      w":"11","parent tab panel":"W0070F1-
     A                                      0_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCPHYA","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCPHYA","designValue":"[SCPHYA]","r-
     A                                      efField":"ADR1","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"533px","curs-
     A                                      or column":"38","top":"310px","curs-
     A                                      or row":"11","css class 2":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"HI",-
     A                                      "customFalse":""},"parent tab panel-
     A                                      ":"W0070F10_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCPHYC","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCPHYC","designValue":"[S-
     A                                      CPHYC]","refField":"CTY","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"533-
     A                                      px","cursor column":"38","top":"330-
     A                                      px","cursor row":"12","css class 2"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"parent -
     A                                      tab panel":"W0070F10_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"SCPH-
     A                                      YS","field type":"output field","va-
     A                                      lue":{"fieldName":"SCPHYS","designV-
     A                                      alue":"[SCPHYS]","refField":"ST","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"715px","cursor column":"64","t-
     A                                      op":"330px","cursor row":"12","css -
     A                                      class 2":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"HI","customFalse":""},-
     A                                      "parent tab panel":"W0070F10_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"SCPZP1","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCPZP1",-
     A                                      "designValue":"[SCPZP1]","refField"-
     A                                      :"ZIP1","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00","edtWrd":"''0     ''"},"-
     A                                      css class":"output-field","left":"7-
     A                                      36px","cursor column":"67","top":"3-
     A                                      30px","cursor row":"12","width":"35-
     A                                      px","text align":"right","css class-
     A                                       2":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"pare-
     A                                      nt tab panel":"W0070F10_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant16","field type":"output fie-
     A                                      ld","value":"-","css class":"consta-
     A                                      nt","left":"778px","cursor column":-
     A                                      "73","top":"330px","cursor row":"12-
     A                                      ","parent tab panel":"W0070F10_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCPZP2","field type":"output -
     A                                      field","value":{"fieldName":"SCPZP2-
     A                                      ","designValue":"[SCPZP2]","refFiel-
     A                                      d":"ZIP2","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      true","curSym":"","units":"","negNu-
     A                                      m":"-999.00","edtWrd":"''0    ''"},-
     A                                      "css class":"output-field","left":"-
     A                                      792px","cursor column":"75","top":"-
     A                                      330px","cursor row":"12","width":"2-
     A                                      8px","text align":"right","css clas-
     A                                      s 2":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"des-
     A                                      cription":"ZIP 2","parent tab panel-
     A                                      ":"W0070F10_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant38","-
     A                                      field type":"output field","value":-
     A                                      "Phn#","css class":"constant","left-
     A                                      ":"491px","cursor column":"32","top-
     A                                      ":"350px","cursor row":"13","parent-
     A                                       tab panel":"W0070F10_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant17","field type":"output field-
     A                                      ","value":"(","css class":"constant-
     A                                      ","left":"533px","cursor column":"3-
     A                                      8","top":"350px","cursor row":"13",-
     A                                      "parent tab panel":"W0070F10_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCPHYR","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCPHYR",-
     A                                      "designValue":"[SCPHYR]","refField"-
     A                                      :"AREA","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00","edtWrd":"''0   ''"},"cs-
     A                                      s class":"output-field","left":"547-
     A                                      px","cursor column":"40","')
     A                                  1 10HTML('top":"350px","cursor row":"13-
     A                                      ","width":"21px","text align":"righ-
     A                                      t","css class 2":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"HI","customFal-
     A                                      se":""},"parent tab panel":"W0070F1-
     A                                      0_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"constant18","field type-
     A                                      ":"output field","value":")","css c-
     A                                      lass":"constant","left":"575px","cu-
     A                                      rsor column":"44","top":"350px","cu-
     A                                      rsor row":"13","parent tab panel":"-
     A                                      W0070F10_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCPPN1","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCPPN1","designValue":"[SCPP-
     A                                      N1]","refField":"PHN1","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","edtWrd":-
     A                                      "''0   ''"},"css class":"output-fie-
     A                                      ld","left":"589px","cursor column":-
     A                                      "46","top":"350px","cursor row":"13-
     A                                      ","width":"21px","text align":"righ-
     A                                      t","css class 2":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"HI","customFal-
     A                                      se":""},"parent tab panel":"W0070F1-
     A                                      0_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"constant19","field type-
     A                                      ":"output field","value":"-","css c-
     A                                      lass":"constant","left":"617px","cu-
     A                                      rsor column":"50","top":"350px","cu-
     A                                      rsor row":"13","parent tab panel":"-
     A                                      W0070F10_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCPPN2","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCPPN2","designValue":"[SCPP-
     A                                      N2]","refField":"PHN2","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","edtWrd":-
     A                                      "''0    ''"},"css class":"output-fi-
     A                                      eld","left":"631px","cursor column"-
     A                                      :"52","top":"350px","cursor row":"1-
     A                                      3","width":"28px","text align":"rig-
     A                                      ht","css class 2":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"parent tab panel":"W0070F-
     A                                      10_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant20","field typ-
     A                                      e":"output field","value":"FAX#:","-
     A                                      css class":"constant","left":"491px-
     A                                      ","cursor column":"32","top":"370px-
     A                                      ","cursor row":"14","parent tab pan-
     A                                      el":"W0070F10_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"constant21"-
     A                                      ,"field type":"output field","value-
     A                                      ":"(","css class":"constant","left"-
     A                                      :"533px","cursor column":"38","top"-
     A                                      :"370px","cursor row":"14","parent -
     A                                      tab panel":"W0070F10_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCFX-
     A                                      AR","field type":"output field","va-
     A                                      lue":{"fieldName":"SCFXAR","designV-
     A                                      alue":"[SCFXAR]","refField":"AREA",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"true","zeroFill":"true","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0","edtWrd":"''0   ''"},"css class"-
     A                                      :"output-field","left":"547px","cur-
     A                                      sor column":"40","top":"370px","cur-
     A                                      sor row":"14","width":"21px","text -
     A                                      align":"right","css class 2":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"description":"-
     A                                      FAX AREA CODE","parent tab panel":"-
     A                                      W0070F10_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant22","fie-
     A                                      ld type":"output field","value":")"-
     A                                      ,"css class":"constant","left":"575-
     A                                      px","cursor column":"44","top":"370-
     A                                      px","cursor row":"14","parent tab p-
     A                                      anel":"W0070F10_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCFAX1","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCFAX1","designValue"-
     A                                      :"[SCFAX1]","refField":"PHN1","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"true","zeroFill":"true","curSym":-
     A                                      "","units":"","negNum":"-999.00","e-
     A                                      dtWrd":"''0   ''"},"css class":"out-
     A                                      put-field","left":"589px","cursor c-
     A                                      olumn":"46","top":"370px","cursor r-
     A                                      ow":"14","width":"21px","text align-
     A                                      ":"right","css class 2":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"parent tab panel":"-
     A                                      W0070F10_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant23","fie-
     A                                      ld type":"output field","value":"-"-
     A                                      ,"css class":"constant","left":"617-
     A                                      px","cursor column":"50","top":"370-
     A                                      px","cursor row":"14","parent tab p-
     A                                      anel":"W0070F10_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"')
     A                                  1 11HTML('SCFAX2","field type":"output -
     A                                      field","value":{"fieldName":"SCFAX2-
     A                                      ","designValue":"[SCFAX2]","refFiel-
     A                                      d":"PHN2","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      true","curSym":"","units":"","negNu-
     A                                      m":"-999.00","edtWrd":"''0    ''"},-
     A                                      "css class":"output-field","left":"-
     A                                      631px","cursor column":"52","top":"-
     A                                      370px","cursor row":"14","width":"2-
     A                                      8px","text align":"right","css clas-
     A                                      s 2":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"par-
     A                                      ent tab panel":"W0070F10_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      constant24","field type":"output fi-
     A                                      eld","value":"Hospital             -
     A                                                                         -
     A                                                          ","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"410px","cursor row-
     A                                      ":"16","css class 2":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"css class 3":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"HI",-
     A                                      "customFalse":""},"parent tab panel-
     A                                      ":"W0070F10_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 4":"profou-
     A                                      nd-converted"},{"id":"constant25","-
     A                                      field type":"output field","value":-
     A                                      "FEIN/MOD:","css class":"constant",-
     A                                      "left":"281px","cursor column":"2",-
     A                                      "top":"430px","cursor row":"17","pa-
     A                                      rent tab panel":"W0070F10_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCHOSF","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCHOSF"-
     A                                      ,"designValue":"[SCHOSF]","refField-
     A                                      ":"FEIN","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00"},"left":"351px","curso-
     A                                      r column":"12","top":"430px","curso-
     A                                      r row":"17","width":"64px","css cla-
     A                                      ss 3":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"cs-
     A                                      s class 4":{"fieldName":"N09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"read only":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"css class 5":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"set focus":{"fieldName":-
     A                                      "19","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"WCR-
     A                                      1322","error message file":"WMESGG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"73","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"3 messages","error-
     A                                       message id 2":"WCR2370","error mes-
     A                                      sage file 2":"WMESGG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"74","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      age id 3":"WCR0690","error message -
     A                                      file 3":"WMESGG","error message lib-
     A                                      rary 3":"*LIBL","error condition 3"-
     A                                      :{"fieldName":"82","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"parent tab pane-
     A                                      l":"W0070F10_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"SCHOSM","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCHOSM","designValue-
     A                                      ":"[SCHOSM]","refField":"MOD","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"999.00"},-
     A                                      "left":"421px","cursor column":"22"-
     A                                      ,"top":"430px","cursor row":"17","w-
     A                                      idth":"22px","css class 3":{"fieldN-
     A                                      ame":"N09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 4":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"PR","customFalse":""},"css clas-
     A                                      s 5":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"err-
     A                                      or message id":"WCR1322","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"73","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "2 messages","error message id 2":"-
     A                                      WCR2370","error message fi')
     A                                  1 12HTML('le 2":"WMESGG","error message-
     A                                       library 2":"*LIBL","error conditio-
     A                                      n 2":{"fieldName":"74","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"parent tab -
     A                                      panel":"W0070F10_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      26","field type":"output field","va-
     A                                      lue":"-or-","css class":"constant",-
     A                                      "left":"456px","cursor column":"27"-
     A                                      ,"top":"430px","cursor row":"17","p-
     A                                      arent tab panel":"W0070F10_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant27","field type":"output -
     A                                      field","value":"Name:","css class":-
     A                                      "constant","left":"491px","cursor c-
     A                                      olumn":"32","top":"430px","cursor r-
     A                                      ow":"17","parent tab panel":"W0070F-
     A                                      10_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCHOSN","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCHOSN","designValue":"[SCHOSN-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e"},"left":"533px","cursor column":-
     A                                      "38","top":"430px","cursor row":"17-
     A                                      ","width":"281px","css class 3":{"f-
     A                                      ieldName":"N09 and N46","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"re-
     A                                      ad only":{"fieldName":"09 or 46","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"css class 4":{"fieldName":"09-
     A                                       or 46","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"css class 5":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"error message-
     A                                       id":"WCR2370","error message file"-
     A                                      :"WMESGG","error message library":"-
     A                                      *LIBL","error condition":{"fieldNam-
     A                                      e":"74","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error messages":"1 message-
     A                                      ","parent tab panel":"W0070F10_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "id":"constant28","field type":"out-
     A                                      put field","value":"Addr:","css cla-
     A                                      ss":"constant","left":"491px","curs-
     A                                      or column":"32","top":"450px","curs-
     A                                      or row":"18","parent tab panel":"W0-
     A                                      070F10_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCHOSA","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCHOSA","designValue":"[SC-
     A                                      HOSA]","refField":"ADR1","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true"},"left":"533px","cursor colu-
     A                                      mn":"38","top":"450px","cursor row"-
     A                                      :"18","width":"281px","css class 3"-
     A                                      :{"fieldName":"N09 and N46","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09 or 46-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 4":{"fieldName"-
     A                                      :"09 or 46","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"css class 5":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"error mes-
     A                                      sage id":"WCR2370","error message f-
     A                                      ile":"WMESGG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"74","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"1 mes-
     A                                      sage","parent tab panel":"W0070F10_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"SCHOSC","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCHOSC","designValue":"[SCHOSC]",-
     A                                      "refField":"CTY","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true"},-
     A                                      "left":"533px","cursor column":"38"-
     A                                      ,"top":"470px","cursor row":"19","w-
     A                                      idth":"176px","css class 3":{"field-
     A                                      Name":"N09 and N46","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09 or 46","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 4":{"fieldName":"09 or -
     A                                      46","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"css class 5":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"error message id"-
     A                                      :"WCR2370","error message file":"WM-
     A                                      ESGG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      74","dataType":"expression')
     A                                  1 13HTML('","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"1 message","parent tab panel":"W0-
     A                                      070F10_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"id":"SCHOSS","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCHOSS","designValue":"[SC-
     A                                      HOSS]","refField":"ST","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "715px","cursor column":"64","top":-
     A                                      "470px","cursor row":"19","width":"-
     A                                      15px","css class 3":{"fieldName":"N-
     A                                      09 and N46","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"read only":{"f-
     A                                      ieldName":"09 or 46","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 4":{"fieldName":"09 or 46","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"css class 5":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"error message id":"WCR237-
     A                                      0","error message file":"WMESGG","e-
     A                                      rror message library":"*LIBL","erro-
     A                                      r condition":{"fieldName":"74","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"1 message","parent ta-
     A                                      b panel":"W0070F10_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"SCHZP1-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCHZP1","desig-
     A                                      nValue":"[SCHZP1]","refField":"ZIP1-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","numBlankFill":"true"},"left-
     A                                      ":"736px","cursor column":"67","top-
     A                                      ":"470px","cursor row":"19","width"-
     A                                      :"36px","text align":"right","css c-
     A                                      lass 3":{"fieldName":"N09 and N46",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9 or 46","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 4":{"fie-
     A                                      ldName":"09 or 46","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"PR","customFalse":""},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"er-
     A                                      ror message id":"WCR2370","error me-
     A                                      ssage file":"WMESGG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"74","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"1 message","parent tab panel":"W0-
     A                                      070F10_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"id":"constant29","field-
     A                                       type":"output field","value":"-","-
     A                                      css class":"constant","left":"778px-
     A                                      ","cursor column":"73","top":"470px-
     A                                      ","cursor row":"19","parent tab pan-
     A                                      el":"W0070F10_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCHZP2","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCHZP2","designValu-
     A                                      e":"[SCHZP2]","refField":"ZIP2","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"-999.00-
     A                                      ","numBlankFill":"true","edtWrd":"'-
     A                                      '0    ''"},"left":"792px","cursor c-
     A                                      olumn":"75","top":"470px","cursor r-
     A                                      ow":"19","width":"29px","text align-
     A                                      ":"right","css class 3":{"fieldName-
     A                                      ":"N09 and N46","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"read only"-
     A                                      :{"fieldName":"09 or 46","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 4":{"fieldName":"09 or 46",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"css class 5":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"error message id":"WC-
     A                                      R2370","error message file":"WMESGG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"74",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"1 message","descr-
     A                                      iption":"ZIP 2","parent tab panel":-
     A                                      "W0070F10_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 6":"profound-
     A                                      -converted"},{"id":"constant39","fi-
     A                                      eld type":"output field","value":"P-
     A                                      hn#","css class":"constant","left":-
     A                                      "491px","cursor column":"3')
     A                                  1 14HTML('2","top":"490px","cursor row"-
     A                                      :"20","parent tab panel":"W0070F10_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant30","field type":-
     A                                      "output field","value":"(","css cla-
     A                                      ss":"constant","left":"533px","curs-
     A                                      or column":"38","top":"490px","curs-
     A                                      or row":"20","parent tab panel":"W0-
     A                                      070F10_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCHOSR","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCHOSR","designValue":"[SC-
     A                                      HOSR]","refField":"AREA","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00","numB-
     A                                      lankFill":"true","edtWrd":"''0   ''-
     A                                      "},"left":"547px","cursor column":"-
     A                                      40","top":"490px","cursor row":"20"-
     A                                      ,"width":"22px","text align":"right-
     A                                      ","css class 3":{"fieldName":"N09 a-
     A                                      nd N46","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"read only":{"field-
     A                                      Name":"09 or 46","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      4":{"fieldName":"09 or 46","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "css class 5":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"parent tab panel":"W0070F10_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"constant31","field type":"-
     A                                      output field","value":")","css clas-
     A                                      s":"constant","left":"575px","curso-
     A                                      r column":"44","top":"490px","curso-
     A                                      r row":"20","parent tab panel":"W00-
     A                                      70F10_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCHPN1","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCHPN1","designValue":"[SCH-
     A                                      PN1]","refField":"PHN1","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00","numBl-
     A                                      ankFill":"true","edtWrd":"''0   ''"-
     A                                      },"left":"589px","cursor column":"4-
     A                                      6","top":"490px","cursor row":"20",-
     A                                      "width":"22px","text align":"right"-
     A                                      ,"css class 3":{"fieldName":"N09 an-
     A                                      d N46","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09 or 46","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 4-
     A                                      ":{"fieldName":"09 or 46","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      css class 5":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"parent tab panel":"W0070F10_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 6":"profound-converted"}-
     A                                      ,{"id":"constant32","field type":"o-
     A                                      utput field","value":"-","css class-
     A                                      ":"constant","left":"617px","cursor-
     A                                       column":"50","top":"490px","cursor-
     A                                       row":"20","parent tab panel":"W007-
     A                                      0F10_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCHPN2","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCHPN2","designValue":"[SCHP-
     A                                      N2]","refField":"PHN2","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","numBla-
     A                                      nkFill":"true","edtWrd":"''0    ''"-
     A                                      },"left":"631px","cursor column":"5-
     A                                      2","top":"490px","cursor row":"20",-
     A                                      "width":"29px","text align":"right"-
     A                                      ,"css class 3":{"fieldName":"N09 an-
     A                                      d N46","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09 or 46","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 4-
     A                                      ":{"fieldName":"09 or 46","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      css class 5":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"parent tab panel":"W0070F10_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 6":"profound-converted"}-
     A                                      ,{"id":"constant33","field type":"o-
     A                                      utput field","value":" ","css class-
     A                                      ":"constant","visibility":{"fieldNa-
     A                                      me":"N40","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"281px"-
     A                                      ,"cursor column":"2","top":"550px",-
     A                                      "cursor row":"23","css cla')
     A                                  1 15HTML('ss 2":"BLU","parent tab panel-
     A                                      ":"W0070F10_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant34","-
     A                                      field type":"output field","value":-
     A                                      " ","css class":"constant","visibil-
     A                                      ity":{"fieldName":"N09 and N40","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"372px","cursor colu-
     A                                      mn":"15","top":"550px","cursor row"-
     A                                      :"23","css class 2":"BLU","parent t-
     A                                      ab panel":"W0070F10_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant35","field type":"output field",-
     A                                      "value":" ","css class":"constant",-
     A                                      "visibility":{"fieldName":"N40","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"463px","cursor colu-
     A                                      mn":"28","top":"550px","cursor row"-
     A                                      :"23","css class 2":{"fieldName":"N-
     A                                      40","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"BLU","cust-
     A                                      omFalse":""},"parent tab panel":"W0-
     A                                      070F10_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant36","field-
     A                                       type":"output field","value":" ","-
     A                                      css class":"constant","visibility":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"570px","cursor row":"24","css cla-
     A                                      ss 2":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"BLU","customFalse":""},"-
     A                                      parent tab panel":"W0070F10_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant37","field type":"output-
     A                                       field","value":" ","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      N40","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"463px","cur-
     A                                      sor column":"28","top":"570px","cur-
     A                                      sor row":"24","css class 2":{"field-
     A                                      Name":"N40","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"BL-
     A                                      U","customFalse":""},"parent tab pa-
     A                                      nel":"W0070F10_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"btnSubmit"-
     A                                      ,"field type":"button","value":"Ent-
     A                                      er","shortcut key":"Enter","left":"-
     A                                      14px","top":"150px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF03","field ty-
     A                                      pe":"button","visibility":{"fieldNa-
     A                                      me":"N40","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"value":"Exit"-
     A                                      ,"shortcut key":"F3","left":"14px",-
     A                                      "top":"183px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF05","field type":"b-
     A                                      utton","visibility":{"fieldName":"N-
     A                                      09 and N40","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"value":"Ref-
     A                                      resh","shortcut key":"F5","left":"1-
     A                                      4px","top":"216px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF07","field typ-
     A                                      e":"button","visibility":{"fieldNam-
     A                                      e":"N40","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"value":"Financ-
     A                                      ial summary","shortcut key":"F7","l-
     A                                      eft":"14px","top":"249px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF08","fi-
     A                                      eld type":"button","value":"Body pa-
     A                                      rt impairment","shortcut key":"F8",-
     A                                      "left":"14px","top":"282px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF10","-
     A                                      field type":"button","visibility":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"value-
     A                                      ":"Search","shortcut key":"F10","le-
     A                                      ft":"14px","top":"315px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF12","fie-
     A                                      ld type":"button","value":"Cancel",-
     A                                      "shortcut key":"F12","left":"14px",-
     A                                      "top":"348px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF14","field type":"b-
     A                                      utton","visibility":{"fieldName":"N-
     A                                      40","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"value":"DARTS","sho-
     A                                      rtcut key":"F14","left":"14px","top-
     A                                      ":"381px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF19","field type":"butto-
     A                                      n","value":"Treating physician","sh-
     A                                      ortcut key":"F19","left":"14px","to-
     A                                      p":"414px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnHELP","field type":"butt-
     A                                      on","shortcut key":"Alt-F1')
     A                                  1 16HTML('","bypass validation":"true",-
     A                                      "value":"HELP","response":{"fieldNa-
     A                                      me":"*IN10","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"left":"14px","top":"447-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEDN         34A  H
     A            SCODIV         5S 0H
     A            SCOEMP         9S 0H
     A            SCOFND         3S 0H
     A            SCACDT    R        H      REFFLD(DT8)
     A            SCCNAM    R        H      REFFLD(NM20)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCVT     R        H      REFFLD(DS10)
     A            SCFAX1    R        H      REFFLD(PHN1)
     A            SCFAX2    R        H      REFFLD(PHN2)
     A            SCFNAM    R        H      REFFLD(NM20)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFXAR    R        H      REFFLD(AREA)
     A            SCHOSA    R        H      REFFLD(ADR1)
     A            SCHOSC    R        H      REFFLD(CTY)
     A            SCHOSF    R        H      REFFLD(FEIN)
     A            SCHOSM    R        H      REFFLD(MOD)
     A            SCHOSN    R        H      REFFLD(NAME)
     A            SCHOSR    R        H      REFFLD(AREA)
     A            SCHOSS    R        H      REFFLD(ST)
     A            SCHPN1    R        H      REFFLD(PHN1)
     A            SCHPN2    R        H      REFFLD(PHN2)
     A            SCHZP1    R        H      REFFLD(ZIP1)
     A            SCHZP2    R        H      REFFLD(ZIP2)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCMSG1    R        H      REFFLD(DS10)
     A            SCMSG2    R        H      REFFLD(NM50)
     A            SCPHYA    R        H      REFFLD(ADR1)
     A            SCPHYC    R        H      REFFLD(CTY)
     A            SCPHYF    R        H      REFFLD(FEIN)
     A            SCPHYM    R        H      REFFLD(MOD)
     A            SCPHYN    R        H      REFFLD(NAME)
     A            SCPHYR    R        H      REFFLD(AREA)
     A            SCPHYS    R        H      REFFLD(ST)
     A            SCPPN1    R        H      REFFLD(PHN1)
     A            SCPPN2    R        H      REFFLD(PHN2)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPZP1    R        H      REFFLD(ZIP1)
     A            SCPZP2    R        H      REFFLD(ZIP2)
     A            SCSCL#    R   25   H      REFFLD(DS30)
     A            SCSS#     R   11   H      REFFLD(SS#)
     A            SCUSER    R        H      REFFLD(USER)
     A            SCYRCS    R   11   H      REFFLD(SS#)
     A          R SCR02
     A  10 11 31
     A  32 33 34
     A  35 36 37                            CA01(10 'Response Indicator *IN10')
     A  38 39 43
     A  44 45 47
     A  48 51 09                            CA02(11 'Response Indicator *IN11')
     A  19 20 25
     A  26 27 28
     A  29 30 41                            CA03(31 'Response Indicator *IN31')
     A  42 55 64
     A  69 71 72
     A  73 74 75                            CA04(32 'Response Indicator *IN32')
     A  76 77 78
     A  79 80 81
     A  82 83 84                            CA05(33 'Response Indicator *IN33')
     A  85 86 95
     A  98 40 63
     A  70                                  CA06(34 'Response Indicator *IN34')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(36 'Response Indicator *IN36')
     A                                      SETOF(37 'Response Indicator *IN37')
     A                                      SETOF(38 'Response Indicator *IN38')
     A                                      SETOF(39 'Response Indicator *IN39')
     A                                      SETOF(43 'Response Indicator *IN43')
     A                                      SETOF(44 'Response Indicator *IN44')
     A                                      SETOF(45 'Response Indicator *IN45')
     A                                      SETOF(47 'Response Indicator *IN47')
     A                                      SETOF(48 'Response Indicator *IN48')
     A                                      SETOF(51 'Response Indicator *IN51')
     A                                  1  2HTML('QPUIREC38   RROWS      2    C-
     A                                      1    1C2    24 RERRMSGID  5    C12 -
     A                                        SCR02_SCMODEC7    WCR1058C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     20-
     A                                      RERRMSGID  5    C6    SCPREXC7    W-
     A                                      CR0501C6    WMESGGC5    *LIBLC0    -
     A                                      E1    3     71RERRMSGID  5    C6   -
     A                                       SCITRTC7    WCR0513C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     72RERRMSG-
     A                                      ID  5    C6    SCITRTC7    WCR0503C-
     A                                      6    WMESGGC5    *LIBLC0    E1    3-
     A                                           95RERRMSGID  5    C6    SCSGDT-
     A                                      C7    WCR0572C6    WMESGGC5    *LIB-
     A                                      LC0    E1    3     73RERRMSGID  5  -
     A                                        C6    SCSGDTC7    WCR0500C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     26-
     A                                      RERRMSGID  5    C6    SCCMDIC7    W-
     A                                      CR0500C6    WMESGGC5    *LIBLC0    -
     A                                      E1    6     33 39RERRMSGID  5    C6-
     A                                          SCCMDIC7    WCR0572C6    WMESGG-
     A                                      C5    *LIBLC0    E1    6     33 47R-
     A                                      ERRMSGID  5    C6    SCCMDIC7    WC-
     A                                      R0606C6    WMESGGC5    *LIBLC0    E-
     A                                      1    6     33 48RERRMSGID  5    C6 -
     A                                         SCDTREC7    WCR0572C6    WMESGGC-
     A                                      5    *LIBLC0    E1    3     74RERRM-
     A                                      SGID  5    C6    SCDTREC7    WCR050-
     A                                      0C6    WMESGGC5    *LIBLC0    E1   -
     A                                       3     27RERRMSGID  5    C5    SCRL-
     A                                      WC7    WCR0572C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     81RERRMSGID  5 -
     A                                         C5    SCRLWC7    WCR0500C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     28-
     A                                      RERRMSGID  5    C6    SCAINJC7    W-
     A                                      CR0513C6    WMESGGC5    *LIBLC0    -
     A                                      E1    3     45RERRMSGID  5    C6   -
     A                                       SCAMMIC7    WCR0572C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     32RERRMSG-
     A                                      ID  5    C6    SCAMMIC7    WCR0500C-
     A                                      6    WMESGGC5    *LIBLC0    E1    3-
     A                                           31RERRMSGID  5    C5    SCMMIC-
     A                                      7    WCR0572C6    WMESGGC5    *LIBL-
     A                                      C0    E1    3     76RERRMSGID  5   -
     A                                       C5    SCMMIC7    WCR0500C6    WMES-
     A                                      GGC5    *LIBLC0    E1    3     29RE-
     A                                      RRMSGID  5    C6    SCODISC7    WCR-
     A                                      0501C6    WMESGGC5    *LIBLC0    E1-
     A                                          3     77RERRMSGID  5    C5    S-
     A                                      CDFEC7    WCR0500C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     35RERRMSGID -
     A                                       5    C6    SCYRLXC7    WCR0500C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        82RERRMSGID  5    C5    SCDFIC7  -
     A                                        WCR0500C6    WMESGGC5    *LIBLC0 -
     A                                         E1    3     36RERRMSGID  5    C5-
     A                                          SCIMPC7    WCR0571C6    WMESGGC-
     A                                      5    *LIBLC0    E1    3     83RERRM-
     A                                      SGID  5    C5    SCIMPC7    WCR1087-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     84RERRMSGID  5    C6    SCDTI-
     A                                      MC7    WCR0500C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     34RERRMSGID  5 -
     A                                         C6    SCPIMPC7    WCR1241C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     5-
     A                                      1RERRMSGID  5    C6    SCHCAPC7    -
     A                                      WCR0501C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     78RERRMSGID  5    C5  -
     A                                        SCORMC7    WCR0501C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     37RERRMSG-
     A                                      ID  5    C5    SCDTHC7    WCR0501C6-
     A                                          WMESGGC5    *LIBLC0    E1    3 -
     A                                          79RERRMSGID  5    C6    SCORMDC-
     A                                      7    WCR0500C6    WMESGGC5    *LIBL-
     A                                      C0    E1    6     38 39RERRMSGID  5-
     A                                          C6    SCORMDC7    WCR0572C6    -
     A                                      WMESGGC5    *LIBLC0    E1    6     -
     A                                      38 47RERRMSGID  5    C6    SCORMDC7-
     A                                          WCR0606C6    WMESGGC5    *LIBLC-
     A                                      0    E1    6     38 48RERRMSGID  5 -
     A                                         C5    SCDODC7    WCR0572C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     80-
     A                                      RERRMSGID  5    C5    SCDODC7    WC-
     A                                      R0606C6    WMESGGC5    *LIBLC0    E-
     A                                      1    3     75RERRMSGID  5    C5    -
     A                                      SCDODC7    WCR0500C6    WMESGGC5   -
     A                                       *LIBLC0    E1    3     30RERRMSGID-
     A                                        5    C6    SCRXELC7    WCR3401C6 -
     A                                         WMESGGC5    *LIBLC0    E1    6  -
     A                                         85 86RERRMSGID  5    C6    SCIDT-
     A                                      HC7    WCR0501C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     55')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN31","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN32","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN33","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN34","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN35","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN36","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN37","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN38","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN39","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N47","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN4-
     A                                      8","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN51"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN43","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN44","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN45","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"retur-
     A                                      n cursor record":{"fieldName":"HREC-
     A                                      ","dataLength":"10","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none"},"return cursor-
     A                                       field":{"fieldName":"HFLD","dataLe-
     A                                      ngth":"10","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"none"},"valid command key":{"f-
     A                                      ieldName":"*IN11","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"overlay range":"1-
     A                                      -24"},"items":[{"id":"SCR02_HFLD","-
     A                                      field type":"output field","visibil-
     A                                      ity":"hidden","value":{"fieldName":-
     A                                      "HFLD","designValue":"[HFLD]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none","data-
     A                                      Length":"10"},"left":"0px","top":"--
     A                                      30px","css class":"profound-convert-
     A                                      ed"},{"id":"SCR02_HREC","field type-
     A                                      ":"output field","visibility":"hidd-
     A                                      en","value":{"fieldName":"HREC","de-
     A                                      signValue":"[HREC]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"left":"0px","top":"-30px","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"W0070F10_SCR02_avKeys","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"AV_KEYS","dataLength":"1134","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[AV_KEYS]"},"le-
     A                                      ft":"0px","top":"0px","visibility":-
     A                                      "hidden"},{"id":"W0070F10_SCR02_act-
     A                                      ion","field type":"html container",-
     A                                      "white space":"normal","left":"0px"-
     A                                      ,"top":"10px","width":"230px","css -
     A                                      class":"action-panel-converted","he-
     A                                      ight":"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_bottom.png\"-
     A                                       /></div><div class=\"bottom\"></di-
     A                                      v>"},{"field type":"icon menu butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"32px-
     A                                      ","z index":"20","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1170px","id":"-
     A                                      W0070F10_SCR02_BtnIconMenuSystemToo-
     A                                      ls","tool tip":"System Tools","icon-
     A                                       alignment":"middle left","icon wid-
     A                                      th":"16px","icon height":"24px","ic-
     A                                      on source":"/profoundui/userdata/im-
     A                                      ages/systool/systools.png","data fu-
     A                                      nction":"SystemToolbarSystools","sh-
     A                                      ow down arrow":"Yes"},{"field type"-
     A                                      :"panel","panel style":"TransformBu-
     A                                      ttonBar","id":"W0070F10_SCR02_Butto-
     A                                      nBar","top":"35px","left":"1036px",-
     A                                      "width":"187px","height":"28px","cs-
     A                                      s class":"stationary","visibility":-
     A                                      "hidden","locked in place":"true"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"')
     A                                  1  4HTML('none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1040px","id":"W0070F10_SCR02_BtnS-
     A                                      ave","tool tip":"Save","onclick":"S-
     A                                      ystemToolbarSave","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/save.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1066px","id":"W0070F10_S-
     A                                      CR02_BtnRefresh","tool tip":"Refres-
     A                                      h","onclick":"SystemToolbarRefresh"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/refresh-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"109-
     A                                      2px","id":"W0070F10_SCR02_BtnSearch-
     A                                      ","tool tip":"Search","onclick":"Sy-
     A                                      stemToolbarSearch","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/search.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1118px","id":"W0070F1-
     A                                      0_SCR02_BtnDiaryItems","tool tip":"-
     A                                      Diary/Work Items - IDARTS","onclick-
     A                                      ":"SystemToolbarDiary","background -
     A                                      image":{"fieldName":"DryIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1144px","id":"W0070F10_S-
     A                                      CR02_BtnSystemMessages","tool tip":-
     A                                      "System Messages","onclick":"System-
     A                                      ToolbarMessages","background image"-
     A                                      :{"fieldName":"MsgIcnURL","dataLeng-
     A                                      th":"128","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none"}},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1196px","id":"W0070F10_SCR02_B-
     A                                      tnHelp","tool tip":"Help","onclick"-
     A                                      :"SystemToolbarHelp","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/help.png'')"},{"id":"W-
     A                                      0070F10_SCR02_ImgSysToolBottom","fi-
     A                                      eld type":"image","image source":"/-
     A                                      profoundui/userdata/images/systool/-
     A                                      butbarbot.png","left":"1036px","top-
     A                                      ":"64px","width":"187px","locked in-
     A                                       place":"true","css class":"station-
     A                                      ary","visibility":"hidden"},{"id":"-
     A                                      W0070F10_SCR02_MainTabPanel","field-
     A                                       type":"tab panel","tab panel style-
     A                                      ":"Transform","tab names":{"fieldNa-
     A                                      me":"SCPRDS","designValue":"[SCPRDS-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"active-
     A                                       tab":"0","left":"250px","top":"70p-
     A                                      x","width":"970px","height":"657px"-
     A                                      ,"z index":"8","locked in place":"t-
     A                                      rue","css class":"tab-panel","css c-
     A                                      lass 2":"stationary"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0070F10_SCR02_BtnHiddenS-
     A                                      ave","value":"btnSave","top":"100px-
     A                                      ","response":{"fieldName":"btnSave"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"SCR02_SCUSER","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCUSER","designValue":"[SCUSER]",-
     A                                      "refField":"USER","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"281px","cu-
     A                                      rsor column":"2","top":"110px","cur-
     A                                      sor row":"1","css class 2"')
     A                                  1  5HTML(':"top-line","parent tab panel-
     A                                      ":"W0070F10_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCR02_SCCONM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCCONM","designValu-
     A                                      e":"[SCCONM]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"414px","cursor column":"21","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass 2":"top-line","css class 3":"HI-
     A                                      ","description":"COMPANY NAME","par-
     A                                      ent tab panel":"W0070F10_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 4":"profound-converted"},{"id":"-
     A                                      constant40","field type":"output fi-
     A                                      eld","left":"778px","cursor column"-
     A                                      :"73","top":"110px","cursor row":"1-
     A                                      ","css class":"top-line","value":"j-
     A                                      s: currentDate()","css class 2":"ou-
     A                                      tput-field","parent tab panel":"W00-
     A                                      70F10_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"W0070F10_SCR02_fkey-
     A                                      Menu","field type":"menu","left":"1-
     A                                      0px","top":"120px","height":"350px"-
     A                                      ,"width":"230px","hover background -
     A                                      color":"#9AAA61","hover text color"-
     A                                      :"#FFFFFF","border color":"#4C6106"-
     A                                      ,"menu option indent":"10px","backg-
     A                                      round color":"#758B27","css class":-
     A                                      "action-menu","css class 2":"statio-
     A                                      nary","z index":"101"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0070F10_SCR02_BtnHidden-
     A                                      Refresh","value":"btnRefresh","top"-
     A                                      :"125px","response":{"fieldName":"b-
     A                                      tnRefresh","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"SCR02_Q1PGM","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"Q1PGM","designValue":"[Q-
     A                                      1PGM]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none","dataLength":"10"},"css cla-
     A                                      ss":"output-field","left":"281px","-
     A                                      cursor column":"2","top":"130px","c-
     A                                      ursor row":"2","parent tab panel":"-
     A                                      W0070F10_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCR02_SCPRDS","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCPRDS","designValue":-
     A                                      "[SCPRDS]","refField":"NAME","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "414px","cursor column":"21","top":-
     A                                      "130px","cursor row":"2","css class-
     A                                       2":"HI","description":"PROGRAM NAM-
     A                                      E","parent tab panel":"W0070F10_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      visibility":"hidden","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt41","field type":"output field","-
     A                                      value":"SCR02","css class":"constan-
     A                                      t","left":"799px","cursor column":"-
     A                                      76","top":"130px","cursor row":"2",-
     A                                      "parent tab panel":"W0070F10_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCR02_SCMSG1","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      MSG1","designValue":"[SCMSG1]","ref-
     A                                      Field":"DS10","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"281px","cursor-
     A                                       column":"2","top":"150px","cursor -
     A                                      row":"3","css class 2":{"fieldName"-
     A                                      :"69","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"RI","cus-
     A                                      tomFalse":""},"description":"EXCESS-
     A                                       REIN","parent tab panel":"W0070F10-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCR02_SCMSG2","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCMSG2","designValue":"[SCMSG2-
     A                                      ]","refField":"NM50","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"407px",-
     A                                      "cursor column":"20","top":"150px",-
     A                                      "cursor row":"3","css class 2":"HI"-
     A                                      ,"visibility":{"fieldName":"N70","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"hidden","customF-
     A                                      alse":"visible"},"description":"BAR-
     A                                      CODE FILE IN/OUT STATUS","parent ta-
     A                                      b panel":"W0070F10_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCR02_-
     A                                      SCMODE","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCMODE","des-
     A                                      ignValue":"[SCMODE]","refField":"NM-
     A                                      10","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"764px","cursor column":"-
     A                                      71","top":"150px","cursor row":"3",-
     A                                      "css class 2":"HI","error message i-
     A                                      d":"WCR1058","error message file":"-
     A                                      WMESGG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"20","dataType":"expressi')
     A                                  1  6HTML('on","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"1 message","description":"ADD/U-
     A                                      PDATE MODE","parent tab panel":"W00-
     A                                      70F10_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W00-
     A                                      70F10_SCR02_BtnHiddenSearch","value-
     A                                      ":"btnSearch","top":"150px","respon-
     A                                      se":{"fieldName":"btnSearch","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "constant42","field type":"output f-
     A                                      ield","value":"Group:","css class":-
     A                                      "constant","left":"281px","cursor c-
     A                                      olumn":"2","top":"170px","cursor ro-
     A                                      w":"4","parent tab panel":"W0070F10-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCR02_SCFND","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCFND","designValue":"[SCFND]",-
     A                                      "refField":"FND","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00"},"css class":"-
     A                                      output-field","left":"330px","curso-
     A                                      r column":"9","top":"170px","cursor-
     A                                       row":"4","width":"21px","text alig-
     A                                      n":"right","parent tab panel":"W007-
     A                                      0F10_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCR02_SCFNAM","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCFNAM","designValue":"[SC-
     A                                      FNAM]","refField":"NM20","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"358-
     A                                      px","cursor column":"13","top":"170-
     A                                      px","cursor row":"4","description":-
     A                                      "FUND NAME","parent tab panel":"W00-
     A                                      70F10_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"constant43","field -
     A                                      type":"output field","value":"SS# :-
     A                                      ","css class":"constant","left":"50-
     A                                      5px","cursor column":"34","top":"17-
     A                                      0px","cursor row":"4","parent tab p-
     A                                      anel":"W0070F10_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCR02_SCS-
     A                                      S#","field type":"output field","va-
     A                                      lue":{"fieldName":"SCSS#","designVa-
     A                                      lue":"[SCSS#]","refField":"SS# 11",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"547px","cursor column":"40",-
     A                                      "top":"170px","cursor row":"4","par-
     A                                      ent tab panel":"W0070F10_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCR02_SCCNAM","field type":"output -
     A                                      field","value":{"fieldName":"SCCNAM-
     A                                      ","designValue":"[SCCNAM]","refFiel-
     A                                      d":"NM20","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"631px","cursor col-
     A                                      umn":"52","top":"170px","cursor row-
     A                                      ":"4","parent tab panel":"W0070F10_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W0070F10_-
     A                                      SCR02_BtnHiddenDiaryItems","value":-
     A                                      "btnDiary","top":"175px","response"-
     A                                      :{"fieldName":"btnDiary","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant44","field type":"output field-
     A                                      ","value":"Emp# :","css class":"con-
     A                                      stant","left":"281px","cursor colum-
     A                                      n":"2","top":"190px","cursor row":"-
     A                                      5","parent tab panel":"W0070F10_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCR02_SCEDN","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCEDN","designValue":"[SCEDN]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none","da-
     A                                      taLength":"34"},"css class":"output-
     A                                      -field","left":"330px","cursor colu-
     A                                      mn":"9","top":"190px","cursor row":-
     A                                      "5","description":"Emp#, DIV, & NAM-
     A                                      E","parent tab panel":"W0070F10_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"constant45","field type":"ou-
     A                                      tput field","value":"Prior Grp/Emp -
     A                                      #:","css class":"constant","visibil-
     A                                      ity":{"fieldName":"N63","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"575px","cursor column":"44"-
     A                                      ,"top":"190px","cursor row":"5","pa-
     A                                      rent tab panel":"W0070F10_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCR02_SCOFND","field type":"output-
     A                                       field","value":{"fieldName":"SCOFN-
     A                                      D","designValue":"[SCOFND]","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"true","curSy')
     A                                  1  7HTML('m":"","units":"","negNum":"-9-
     A                                      99.00","dataLength":"3","decPos":"0-
     A                                      "},"css class":"output-field","visi-
     A                                      bility":{"fieldName":"N63","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"694px","cursor column":"-
     A                                      61","top":"190px","cursor row":"5",-
     A                                      "width":"21px","text align":"right"-
     A                                      ,"css class 2":{"fieldName":"N63","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"RI","customFals-
     A                                      e":""},"description":"Old Fund Numb-
     A                                      er","parent tab panel":"W0070F10_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"SCR02_SCOEMP","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCOEMP","designValue":"[SCOEMP]",-
     A                                      "dataType":"zoned","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"false","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"999.00",-
     A                                      "dataLength":"9","decPos":"0"},"css-
     A                                       class":"output-field","visibility"-
     A                                      :{"fieldName":"N63","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"722px","cursor column":"65","to-
     A                                      p":"190px","cursor row":"5","width"-
     A                                      :"63px","text align":"right","css c-
     A                                      lass 2":{"fieldName":"N63","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"RI","customFalse":""},-
     A                                      "description":"Old Employer Number"-
     A                                      ,"parent tab panel":"W0070F10_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"SCR02_SCODIV","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CODIV","designValue":"[SCODIV]","da-
     A                                      taType":"zoned","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00","da-
     A                                      taLength":"5","decPos":"0"},"css cl-
     A                                      ass":"output-field","visibility":{"-
     A                                      fieldName":"N63","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "792px","cursor column":"75","top":-
     A                                      "190px","cursor row":"5","width":"3-
     A                                      5px","text align":"right","css clas-
     A                                      s 2":{"fieldName":"N63","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"RI","customFalse":""},"de-
     A                                      scription":"Old division","parent t-
     A                                      ab panel":"W0070F10_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0070F10_SCR02_BtnHidden-
     A                                      SystemMessages","value":"btnMessage-
     A                                      ","top":"200px","response":{"fieldN-
     A                                      ame":"btnMessage","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"constant46-
     A                                      ","field type":"output field","valu-
     A                                      e":"Case#:","css class":"constant",-
     A                                      "left":"281px","cursor column":"2",-
     A                                      "top":"210px","cursor row":"6","par-
     A                                      ent tab panel":"W0070F10_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCR02_SCYRCS","field type":"output -
     A                                      field","value":{"fieldName":"SCYRCS-
     A                                      ","designValue":"[SCYRCS]","refFiel-
     A                                      d":"SS# 11","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"330px","cursor c-
     A                                      olumn":"9","top":"210px","cursor ro-
     A                                      w":"6","description":"FYR-CASE","pa-
     A                                      rent tab panel":"W0070F10_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant47","field type":"output f-
     A                                      ield","value":"SCL#:","css class":"-
     A                                      constant","left":"421px","cursor co-
     A                                      lumn":"22","top":"210px","cursor ro-
     A                                      w":"6","parent tab panel":"W0070F10-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCR02_SCSCL#","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCSCL#","designValue":"[SC-
     A                                      SCL#]","refField":"DS30 25","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e"},"text transform":"uppercase","l-
     A                                      eft":"463px","cursor column":"28","-
     A                                      top":"210px","cursor row":"6","widt-
     A                                      h":"176px","css class 3":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 4":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"descriptio-
     A                                      n":"Ageny Claim#","parent tab panel-
     A                                      ":"W0070F10_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 5":"profou-
     A                                      nd-converted"},{"id":"constant48","-
     A                                      field type":"output field","value":-
     A                                      "DOI:","css class":"consta')
     A                                  1  8HTML('nt","left":"645px","cursor co-
     A                                      lumn":"54","top":"210px","cursor ro-
     A                                      w":"6","parent tab panel":"W0070F10-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCR02_SCACDT","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCACDT","designValue":"[SCACDT-
     A                                      ]","refField":"DT8","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"true","curSym":"","units"-
     A                                      :"","negNum":"-999.00","edtWrd":"''-
     A                                        /  /    ''"},"css class":"output--
     A                                      field","left":"687px","cursor colum-
     A                                      n":"60","top":"210px","cursor row":-
     A                                      "6","width":"70px","text align":"ri-
     A                                      ght","description":"Accident DATE",-
     A                                      "parent tab panel":"W0070F10_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0070F10_SCR02_-
     A                                      BtnHiddenWorkSubmitJob","value":"bt-
     A                                      nWrksbmjob","top":"225px","response-
     A                                      ":{"fieldName":"btnWrkJob","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant49","field type":"output fie-
     A                                      ld","value":"CVT#:","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      64","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"645px","curs-
     A                                      or column":"54","top":"230px","curs-
     A                                      or row":"7","parent tab panel":"W00-
     A                                      70F10_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCR02_SCCVT","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCCVT","designValue":"[SCC-
     A                                      VT]","refField":"DS10","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","visibility":-
     A                                      {"fieldName":"64","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"687px","cursor column":"60","top"-
     A                                      :"230px","cursor row":"7","descript-
     A                                      ion":"PREVIOUS CLAIM #","parent tab-
     A                                       panel":"W0070F10_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t50","field type":"output field","v-
     A                                      alue":"Pre-Existing disability    :-
     A                                      ","css class":"constant","left":"28-
     A                                      1px","cursor column":"2","top":"250-
     A                                      px","cursor row":"8","parent tab pa-
     A                                      nel":"W0070F10_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCPREX","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCPREX","designVal-
     A                                      ue":"[SCPREX]","refField":"FLAG","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase"},"text transform":"uppercas-
     A                                      e","left":"491px","cursor column":"-
     A                                      32","top":"250px","cursor row":"8",-
     A                                      "width":"8px","css class 3":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"css class 4":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"se-
     A                                      t focus":{"fieldName":"19","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      error message id":"WCR0501","error -
     A                                      message file":"WMESGG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"71","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"1 message","parent tab panel":"-
     A                                      W0070F10_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"constant51","fie-
     A                                      ld type":"output field","value":"HI-
     A                                      CN#                :","css class":"-
     A                                      constant","left":"575px","cursor co-
     A                                      lumn":"44","top":"250px","cursor ro-
     A                                      w":"8","parent tab panel":"W0070F10-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCHIC#","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CHIC#","designValue":"[SCHIC#]","re-
     A                                      fField":"CDHICN *LIBL/WMCDP","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "743px","cursor column":"68","top":-
     A                                      "250px","cursor row":"8","css class-
     A                                       2":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"pare-
     A                                      nt tab panel":"W0070F10_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"}')
     A                                  1  9HTML(',{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0070-
     A                                      F10_SCR02_BtnHiddenWorkPrinterOutpu-
     A                                      t","value":"btnWrkprtout","top":"25-
     A                                      0px","response":{"fieldName":"btnWr-
     A                                      kPrnt","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant52","field ty-
     A                                      pe":"output field","value":"Initial-
     A                                       treatment          :","css class":-
     A                                      "constant","left":"281px","cursor c-
     A                                      olumn":"2","top":"270px","cursor ro-
     A                                      w":"9","parent tab panel":"W0070F10-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCITRT","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCITRT","designValue":"[SCITRT]"-
     A                                      ,"refField":"CODE","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase"},"text-
     A                                       transform":"uppercase","left":"491-
     A                                      px","cursor column":"32","top":"270-
     A                                      px","cursor row":"9","width":"15px"-
     A                                      ,"css class 3":{"fieldName":"98","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"css class 4":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 5":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR"-
     A                                      ,"customFalse":""},"set focus":{"fi-
     A                                      eldName":"41","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"error message-
     A                                       id":"WCR0513","error message file"-
     A                                      :"WMESGG","error message library":"-
     A                                      *LIBL","error condition":{"fieldNam-
     A                                      e":"72","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error messages":"2 message-
     A                                      s","error message id 2":"WCR0503","-
     A                                      error message file 2":"WMESGG","err-
     A                                      or message library 2":"*LIBL","erro-
     A                                      r condition 2":{"fieldName":"95","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"p-
     A                                      arent tab panel":"W0070F10_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"id"-
     A                                      :"SCITDE","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCITDE","d-
     A                                      esignValue":"[SCITDE]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"512px","cursor column"-
     A                                      :"35","top":"270px","cursor row":"9-
     A                                      ","css class 2":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"parent tab panel":"W0070F10-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W0070F10-
     A                                      _SCR02_BtnHiddenImageQueue","value"-
     A                                      :"btnImgQue","top":"275px","respons-
     A                                      e":{"fieldName":"btnImgQue","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant53","field type":"output fi-
     A                                      eld","value":"Surgery date         -
     A                                            :","css class":"constant","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"290px","cursor row":"10","paren-
     A                                      t tab panel":"W0070F10_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      SGDT","field type":"date field","cs-
     A                                      s class":"input","css class 2":"dat-
     A                                      e-field","value":{"fieldName":"SCSG-
     A                                      DT","designValue":"[SCSGDT]","refFi-
     A                                      eld":"DT8","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"-999.00","numBlankFill":"tru-
     A                                      e","edtWrd":"''  /  /    ''","dateF-
     A                                      ormat":"m/d/Y"},"left":"491px","cur-
     A                                      sor column":"32","top":"290px","cur-
     A                                      sor row":"10","width":"71px","text -
     A                                      align":"right","css class 3":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"css class 4":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"s-
     A                                      et focus":{"fieldName":"42","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true /')
     A                                  1 10HTML(' false"},"error message id":"-
     A                                      WCR0572","error message file":"WMES-
     A                                      GG","error message library":"*LIBL"-
     A                                      ,"error condition":{"fieldName":"73-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"2 messages","er-
     A                                      ror message id 2":"WCR0500","error -
     A                                      message file 2":"WMESGG","error mes-
     A                                      sage library 2":"*LIBL","error cond-
     A                                      ition 2":{"fieldName":"26","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"parent -
     A                                      tab panel":"W0070F10_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 6-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant54","field type":"output field"-
     A                                      ,"value":"CMS date of incident :","-
     A                                      css class":"constant","left":"575px-
     A                                      ","cursor column":"44","top":"290px-
     A                                      ","cursor row":"10","parent tab pan-
     A                                      el":"W0070F10_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCCMDI","fi-
     A                                      eld type":"date field","css class":-
     A                                      "input","css class 2":"date-field",-
     A                                      "value":{"fieldName":"SCCMDI","desi-
     A                                      gnValue":"[SCCMDI]","refField":"DT8-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","numBlankFill":"true","edtWr-
     A                                      d":"''  /  /    ''","dateFormat":"m-
     A                                      /d/Y"},"left":"765px","cursor colum-
     A                                      n":"68","top":"290px","cursor row":-
     A                                      "10","width":"71px","text align":"r-
     A                                      ight","css class 3":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"css class 4":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"error mess-
     A                                      age id":"WCR0500","error message fi-
     A                                      le":"WMESGG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"33 and 39","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "3 messages","error message id 2":"-
     A                                      WCR0572","error message file 2":"WM-
     A                                      ESGG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"33 and 47","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error message id 3"-
     A                                      :"WCR0606","error message file 3":"-
     A                                      WMESGG","error message library 3":"-
     A                                      *LIBL","error condition 3":{"fieldN-
     A                                      ame":"33 and 48","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"parent tab panel"-
     A                                      :"W0070F10_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0070F10_SCR02_BtnHiddenHelp","va-
     A                                      lue":"btnHelp","top":"300px","respo-
     A                                      nse":{"fieldName":"btnHelp","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant55","field type":"output fi-
     A                                      eld","value":"Date rehab assigned  -
     A                                            :","css class":"constant","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"310px","cursor row":"11","paren-
     A                                      t tab panel":"W0070F10_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      DTRE","field type":"date field","cs-
     A                                      s class":"input","css class 2":"dat-
     A                                      e-field","value":{"fieldName":"SCDT-
     A                                      RE","designValue":"[SCDTRE]","refFi-
     A                                      eld":"DT8","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"-999.00","numBlankFill":"tru-
     A                                      e","edtWrd":"''  /  /    ''","dateF-
     A                                      ormat":"m/d/Y"},"left":"491px","cur-
     A                                      sor column":"32","top":"310px","cur-
     A                                      sor row":"11","width":"71px","text -
     A                                      align":"right","css class 3":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"css class 4":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"e-
     A                                      rror message id":"WCR0572","error m-
     A                                      essage file":"WMESGG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"74","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"WCR0500","error message ')
     A                                  1 11HTML('file 2":"WMESGG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"27","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"parent ta-
     A                                      b panel":"W0070F10_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt56","field type":"output field","-
     A                                      value":"CMS alleged cause of  ","cs-
     A                                      s class":"constant","left":"575px",-
     A                                      "cursor column":"44","top":"310px",-
     A                                      "cursor row":"11","parent tab panel-
     A                                      ":"W0070F10_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant58","-
     A                                      field type":"output field","value":-
     A                                      "Release to work date       :","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"330px","c-
     A                                      ursor row":"12","parent tab panel":-
     A                                      "W0070F10_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCRLW","field t-
     A                                      ype":"date field","css class":"inpu-
     A                                      t","css class 2":"date-field","valu-
     A                                      e":{"fieldName":"SCRLW","designValu-
     A                                      e":"[SCRLW]","refField":"DT8","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"-999.00",-
     A                                      "numBlankFill":"true","edtWrd":"'' -
     A                                       /  /    ''","dateFormat":"m/d/Y"},-
     A                                      "left":"491px","cursor column":"32"-
     A                                      ,"top":"330px","cursor row":"12","w-
     A                                      idth":"71px","text align":"right","-
     A                                      css class 3":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"css class 4":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 5":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"error message id"-
     A                                      :"WCR0572","error message file":"WM-
     A                                      ESGG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      81","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"2 messages","-
     A                                      error message id 2":"WCR0500","erro-
     A                                      r message file 2":"WMESGG","error m-
     A                                      essage library 2":"*LIBL","error co-
     A                                      ndition 2":{"fieldName":"28","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"paren-
     A                                      t tab panel":"W0070F10_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"co-
     A                                      nstant57","field type":"output fiel-
     A                                      d","value":"injury               :"-
     A                                      ,"css class":"constant","left":"575-
     A                                      px","cursor column":"44","top":"330-
     A                                      px","cursor row":"12","parent tab p-
     A                                      anel":"W0070F10_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCAINJ","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCAINJ","designVa-
     A                                      lue":"[SCAINJ]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase","dataLength":"-
     A                                      5"},"text transform":"uppercase","l-
     A                                      eft":"743px","cursor column":"68","-
     A                                      top":"330px","cursor row":"12","wid-
     A                                      th":"36px","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"43","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"err-
     A                                      or message id":"WCR0513","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"45","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","parent tab panel":"W00-
     A                                      70F10_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted"},{"id":"constant59","field -
     A                                      type":"output field","value":"Antic-
     A                                      ipated MMI date       :","css class-
     A                                      ":"constant","left":"281px","cursor-
     A                                       column":"2","top":"350px","cursor -
     A                                      row":"13","parent tab panel":"W0070-
     A                                      F10_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCAMMI","field type":-
     A                                      "date field","css class":"input","c-
     A                                      ss class 2":"date-field","value":{"-
     A                                      fieldName":"SCAMMI","designValue":"-
     A                                      [SCAMMI]","refField":"DT8","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBa')
     A                                  1 12HTML('lance":"false","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"-999.00","numBlankFill":"true","-
     A                                      edtWrd":"''  /  /    ''","dateForma-
     A                                      t":"m/d/Y"},"left":"491px","cursor -
     A                                      column":"32","top":"350px","cursor -
     A                                      row":"13","width":"71px","text alig-
     A                                      n":"right","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"44","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"err-
     A                                      or message id":"WCR0572","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"32","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "2 messages","error message id 2":"-
     A                                      WCR0500","error message file 2":"WM-
     A                                      ESGG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"31","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"parent tab panel":"W0070F1-
     A                                      0_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed"},{"id":"constant60","field type-
     A                                      ":"output field","value":"Final MMI-
     A                                       date             :","css class":"c-
     A                                      onstant","left":"281px","cursor col-
     A                                      umn":"2","top":"370px","cursor row"-
     A                                      :"14","parent tab panel":"W0070F10_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCMMI","field type":"date-
     A                                       field","css class":"input","css cl-
     A                                      ass 2":"date-field","value":{"field-
     A                                      Name":"SCMMI","designValue":"[SCMMI-
     A                                      ]","refField":"DT8","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","numBlankF-
     A                                      ill":"true","edtWrd":"''  /  /    '-
     A                                      '","dateFormat":"m/d/Y"},"left":"49-
     A                                      1px","cursor column":"32","top":"37-
     A                                      0px","cursor row":"14","width":"71p-
     A                                      x","text align":"right","css class -
     A                                      3":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"css c-
     A                                      lass 4":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 5":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"error message id":"WCR0572"-
     A                                      ,"error message file":"WMESGG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"76","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"2 messages","error mess-
     A                                      age id 2":"WCR0500","error message -
     A                                      file 2":"WMESGG","error message lib-
     A                                      rary 2":"*LIBL","error condition 2"-
     A                                      :{"fieldName":"29","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"parent tab pane-
     A                                      l":"W0070F10_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant61",-
     A                                      "field type":"output field","value"-
     A                                      :"Occ disease                :","cs-
     A                                      s class":"constant","left":"281px",-
     A                                      "cursor column":"2","top":"390px","-
     A                                      cursor row":"15","parent tab panel"-
     A                                      :"W0070F10_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCODIS","field-
     A                                       type":"checkbox","css class":"inpu-
     A                                      t","css class 2":"checkbox","value"-
     A                                      :{"fieldName":"SCODIS","designValue-
     A                                      ":"[SCODIS]","refField":"FLAG","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"491px","top":"390px","widt-
     A                                      h":"8px","css class 3":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"css class 4":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"read only":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 5"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"PR","customFalse":""},"error m-
     A                                      essage id":"WCR0501","error message-
     A                                       file":"WMESGG","error mes')
     A                                  1 13HTML('sage library":"*LIBL","error -
     A                                      condition":{"fieldName":"77","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"1 message","parent tab -
     A                                      panel":"W0070F10_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted","checked value":-
     A                                      "Y","unchecked value":"N"},{"id":"c-
     A                                      onstant62","field type":"output fie-
     A                                      ld","value":"Date of 1st exposure :-
     A                                      ","css class":"constant","left":"57-
     A                                      5px","cursor column":"44","top":"39-
     A                                      0px","cursor row":"15","parent tab -
     A                                      panel":"W0070F10_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCDFE","-
     A                                      field type":"date field","css class-
     A                                      ":"input","css class 2":"date-field-
     A                                      ","value":{"fieldName":"SCDFE","des-
     A                                      ignValue":"[SCDFE]","refField":"DT8-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","numBlankFill":"true","edtWr-
     A                                      d":"''  /  /    ''","dateFormat":"m-
     A                                      /d/Y"},"left":"743px","cursor colum-
     A                                      n":"68","top":"390px","cursor row":-
     A                                      "15","width":"71px","text align":"r-
     A                                      ight","css class 3":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"css class 4":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"error mess-
     A                                      age id":"WCR0500","error message fi-
     A                                      le":"WMESGG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"35","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"1 mess-
     A                                      age","parent tab panel":"W0070F10_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"constant63","field type":"-
     A                                      output field","value":"Year last ex-
     A                                      posed        :","css class":"consta-
     A                                      nt","left":"295px","cursor column":-
     A                                      "4","top":"410px","cursor row":"16"-
     A                                      ,"parent tab panel":"W0070F10_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCYRLX","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCY-
     A                                      RLX","designValue":"[SCYRLX]","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","data-
     A                                      Length":"4","decPos":"0","numBlankF-
     A                                      ill":"true"},"left":"491px","cursor-
     A                                       column":"32","top":"410px","cursor-
     A                                       row":"16","width":"29px","text ali-
     A                                      gn":"right","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"read only":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       5":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"erro-
     A                                      r message id":"WCR0500","error mess-
     A                                      age file":"WMESGG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"82","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      1 message","parent tab panel":"W007-
     A                                      0F10_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted"},{"id":"constant64","field t-
     A                                      ype":"output field","value":"Date o-
     A                                      f 1st ingestion:","css class":"cons-
     A                                      tant","left":"575px","cursor column-
     A                                      ":"44","top":"410px","cursor row":"-
     A                                      16","parent tab panel":"W0070F10_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCDFI","field type":"date f-
     A                                      ield","css class":"input","css clas-
     A                                      s 2":"date-field","value":{"fieldNa-
     A                                      me":"SCDFI","designValue":"[SCDFI]"-
     A                                      ,"refField":"DT8","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"false","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"-999.00","numBlankFil-
     A                                      l":"true","edtWrd":"''  /  /    ''"-
     A                                      ,"dateFormat":"m/d/Y"},"left":"743p-
     A                                      x","cursor column":"68","top":"410p-
     A                                      x","cursor row":"16","width":"71px"-
     A                                      ,"text align":"right","css class 3"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"css cla-
     A                                      ss 4":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Va')
     A                                  1 14HTML('lues","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 5":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"error message -
     A                                      id":"WCR0500","error message file":-
     A                                      "WMESGG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"36","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error messages":"1 message"-
     A                                      ,"parent tab panel":"W0070F10_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 6":"profound-converted"},{"-
     A                                      id":"constant65","field type":"outp-
     A                                      ut field","value":"Impairment deter-
     A                                      mined      :","css class":"constant-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"430px","cursor row":"17","-
     A                                      parent tab panel":"W0070F10_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCIMP","field type":"checkbox","-
     A                                      css class":"input","css class 2":"c-
     A                                      heckbox","value":{"fieldName":"SCIM-
     A                                      P","designValue":"[SCIMP]","refFiel-
     A                                      d":"FLAG","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"491px","top"-
     A                                      :"430px","width":"8px","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"css cl-
     A                                      ass 4":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"error message id":"WCR0571",-
     A                                      "error message file":"WMESGG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"83","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"2 messages","error messa-
     A                                      ge id 2":"WCR1087","error message f-
     A                                      ile 2":"WMESGG","error message libr-
     A                                      ary 2":"*LIBL","error condition 2":-
     A                                      {"fieldName":"84","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"parent tab panel-
     A                                      ":"W0070F10_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 6":"profou-
     A                                      nd-converted","checked value":"Y","-
     A                                      unchecked value":" "},{"id":"consta-
     A                                      nt66","field type":"output field","-
     A                                      value":"Date of implant      :","cs-
     A                                      s class":"constant","left":"575px",-
     A                                      "cursor column":"44","top":"430px",-
     A                                      "cursor row":"17","parent tab panel-
     A                                      ":"W0070F10_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCDTIM","fiel-
     A                                      d type":"date field","css class":"i-
     A                                      nput","css class 2":"date-field","v-
     A                                      alue":{"fieldName":"SCDTIM","design-
     A                                      Value":"[SCDTIM]","refField":"DT8",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","numBlankFill":"true","edtWrd"-
     A                                      :"''  /  /    ''","dateFormat":"m/d-
     A                                      /Y"},"left":"743px","cursor column"-
     A                                      :"68","top":"430px","cursor row":"1-
     A                                      7","width":"71px","text align":"rig-
     A                                      ht","css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"error messag-
     A                                      e id":"WCR0500","error message file-
     A                                      ":"WMESGG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"34","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"1 messag-
     A                                      e","parent tab panel":"W0070F10_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted"},-
     A                                      {"id":"constant67","field type":"ou-
     A                                      tput field","value":"% Impairment  -
     A                                                 :","css class":"constant-
     A                                      ","left":"295px","cursor column":"4-
     A                                      ","top":"450px","cursor row":"18","-
     A                                      parent tab panel":"W0070F10_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCIPCT","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCIPC-
     A                                      T","designValue":"[SCIPCT]","refFie-
     A                                      ld":"PC52","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","')
     A                                  1 15HTML('zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","numB-
     A                                      lankFill":"true"},"left":"491px","c-
     A                                      ursor column":"32","top":"450px","c-
     A                                      ursor row":"18","width":"43px","tex-
     A                                      t align":"right","css class 3":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"css class 4"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 5":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "range low":".00","range high":"100-
     A                                      .00","description":"% impair","pare-
     A                                      nt tab panel":"W0070F10_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"id":"c-
     A                                      onstant68","field type":"output fie-
     A                                      ld","value":"Perm impair min pymt  -
     A                                         :","css class":"constant","visib-
     A                                      ility":{"fieldName":"25","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"575px","cursor column":"44-
     A                                      ","top":"450px","cursor row":"18","-
     A                                      parent tab panel":"W0070F10_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCPIMP","field type":"checkbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      checkbox","value":{"fieldName":"SCP-
     A                                      IMP","designValue":"[SCPIMP]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase",-
     A                                      "dataLength":"1"},"text transform":-
     A                                      "uppercase","visibility":{"fieldNam-
     A                                      e":"25","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"764px","-
     A                                      top":"450px","width":"8px","read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 3":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      css class 4":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"error message id":"WCR1241","-
     A                                      error message file":"WMESGG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"51","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"1 message","parent tab pa-
     A                                      nel":"W0070F10_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 5":"pro-
     A                                      found-converted","checked value":"Y-
     A                                      ","unchecked value":" "},{"id":"con-
     A                                      stant69","field type":"output field-
     A                                      ","value":"Handicap claim          -
     A                                         :","css class":"constant","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "470px","cursor row":"19","parent t-
     A                                      ab panel":"W0070F10_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCHCA-
     A                                      P","field type":"checkbox","css cla-
     A                                      ss":"input","css class 2":"checkbox-
     A                                      ","value":{"fieldName":"SCHCAP","de-
     A                                      signValue":"[SCHCAP]","refField":"F-
     A                                      LAG","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"uppercase"},"text transform":"u-
     A                                      ppercase","left":"491px","top":"470-
     A                                      px","width":"8px","css class 3":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"css class 4-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 5":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"error message id":"WCR0501","erro-
     A                                      r message file":"WMESGG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"78","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"1 message","parent tab panel"-
     A                                      :"W0070F10_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted","checked value":"Y","u-
     A                                      nchecked value":"N"},{"id":"constan-
     A                                      t70","field type":"output field","v-
     A                                      alue":"ORM indicator        :","css-
     A                                       class":"constant","left":"575px","-
     A                                      cursor column":"44","top":"470px","-
     A                                      cursor row":"19","parent tab panel"-
     A                                      :"W0070F10_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCORM","field -
     A                                      type":"checkbox","css class":"input-
     A                                      ","css class 2":"checkbox","value":-
     A                                      {"fieldName":"SCORM","designValue":-
     A                                      "[SCORM]","refField":"FLAG","dataTy-
     A                                      pe":"reference","formattin')
     A                                  1 16HTML('g":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","left":"743px","top":"-
     A                                      470px","width":"8px","css class 3":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"HI","customFalse":""},"css clas-
     A                                      s 4":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"re-
     A                                      ad only":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 5":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"error message id":"WCR0501","e-
     A                                      rror message file":"WMESGG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"37","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"1 message","parent tab pan-
     A                                      el":"W0070F10_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 6":"prof-
     A                                      ound-converted","checked value":"Y"-
     A                                      ,"unchecked value":"N"},{"id":"cons-
     A                                      tant71","field type":"output field"-
     A                                      ,"value":"Death claim              -
     A                                        :","css class":"constant","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      490px","cursor row":"20","parent ta-
     A                                      b panel":"W0070F10_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCDTH"-
     A                                      ,"field type":"checkbox","css class-
     A                                      ":"input","css class 2":"checkbox",-
     A                                      "value":{"fieldName":"SCDTH","desig-
     A                                      nValue":"[SCDTH]","refField":"FLAG"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase"},"text transform":"upper-
     A                                      case","left":"491px","top":"490px",-
     A                                      "width":"8px","css class 3":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"css class 4":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"er-
     A                                      ror message id":"WCR0501","error me-
     A                                      ssage file":"WMESGG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"79","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"1 message","parent tab panel":"W0-
     A                                      070F10_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted","checked value":"Y","unche-
     A                                      cked value":"N"},{"id":"constant72"-
     A                                      ,"field type":"output field","value-
     A                                      ":"ORM term date        :","css cla-
     A                                      ss":"constant","left":"575px","curs-
     A                                      or column":"44","top":"490px","curs-
     A                                      or row":"20","parent tab panel":"W0-
     A                                      070F10_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCORMD","field typ-
     A                                      e":"date field","css class":"input"-
     A                                      ,"css class 2":"date-field","value"-
     A                                      :{"fieldName":"SCORMD","designValue-
     A                                      ":"[SCORMD]","refField":"DT8","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"-999.00",-
     A                                      "numBlankFill":"true","edtWrd":"'' -
     A                                       /  /    ''","dateFormat":"m/d/Y"},-
     A                                      "left":"743px","cursor column":"68"-
     A                                      ,"top":"490px","cursor row":"20","w-
     A                                      idth":"71px","text align":"right","-
     A                                      css class 3":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"css class 4":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 5":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"error message id"-
     A                                      :"WCR0500","error message file":"WM-
     A                                      ESGG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      38 and 39","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"3 mess-
     A                                      ages","error message id 2":"WCR0572-
     A                                      ","error message file 2":"WMESGG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"38 -
     A                                      and 47","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 3":"WCR06-
     A                                      06","error message file 3":"WMESGG"-
     A                                      ,"error message library 3":"*LIBL",-
     A                                      "error condition 3":{"fieldName":"3-
     A                                      8 and 48","dataType":"expr')
     A                                  1 17HTML('ession","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"parent ta-
     A                                      b panel":"W0070F10_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt73","field type":"output field","-
     A                                      value":"Date of death            :"-
     A                                      ,"css class":"constant","left":"295-
     A                                      px","cursor column":"4","top":"510p-
     A                                      x","cursor row":"21","parent tab pa-
     A                                      nel":"W0070F10_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCDOD","fi-
     A                                      eld type":"date field","css class":-
     A                                      "input","css class 2":"date-field",-
     A                                      "value":{"fieldName":"SCDOD","desig-
     A                                      nValue":"[SCDOD]","refField":"DT8",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","numBlankFill":"true","edtWrd"-
     A                                      :"''  /  /    ''","dateFormat":"m/d-
     A                                      /Y"},"left":"491px","cursor column"-
     A                                      :"32","top":"510px","cursor row":"2-
     A                                      1","width":"71px","text align":"rig-
     A                                      ht","css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"error messag-
     A                                      e id":"WCR0572","error message file-
     A                                      ":"WMESGG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"80","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"3 messag-
     A                                      es","error message id 2":"WCR0606",-
     A                                      "error message file 2":"WMESGG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"75","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 3":"WCR0500","erro-
     A                                      r message file 3":"WMESGG","error m-
     A                                      essage library 3":"*LIBL","error co-
     A                                      ndition 3":{"fieldName":"30","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"paren-
     A                                      t tab panel":"W0070F10_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"co-
     A                                      nstant74","field type":"output fiel-
     A                                      d","value":"Rx clm not elig      :"-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"85","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"575px","cursor column":"44","to-
     A                                      p":"510px","cursor row":"21","paren-
     A                                      t tab panel":"W0070F10_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      RXEL","field type":"checkbox","css -
     A                                      class":"input","css class 2":"check-
     A                                      box","value":{"fieldName":"SCRXEL",-
     A                                      "designValue":"[SCRXEL]","refField"-
     A                                      :"FLAG","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","visibility":{"fieldNa-
     A                                      me":"85","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"743px",-
     A                                      "top":"510px","width":"8px","css cl-
     A                                      ass 3":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"c-
     A                                      ss class 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"error message id":"WCR3-
     A                                      401","error message file":"WMESGG",-
     A                                      "error message library":"*LIBL","er-
     A                                      ror condition":{"fieldName":"85 and-
     A                                       86","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"1 message","-
     A                                      parent tab panel":"W0070F10_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted","chec-
     A                                      ked value":"Y","unchecked value":" -
     A                                      "},{"id":"constant75","field type":-
     A                                      "output field","value":"Death resul-
     A                                      t of Injury      :","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      25","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"281px","curs-
     A                                      or column":"2","top":"530px","curso-
     A                                      r row":"22","parent tab panel":"W00-
     A                                      70F10_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCIDTH","field type-
     A                                      ":"checkbox","css class":"input","c-
     A                                      ss class 2":"checkbox","value":{"fi-
     A                                      eldName":"SCIDTH","designValue":"[S-
     A                                      CIDTH]","dataType":"char",')
     A                                  1 18HTML('"formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase","dataLe-
     A                                      ngth":"1"},"text transform":"upperc-
     A                                      ase","visibility":{"fieldName":"25"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"491px","top":"5-
     A                                      30px","width":"8px","read only":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 3"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"PR","customFalse":""},"css cla-
     A                                      ss 4":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"e-
     A                                      rror message id":"WCR0501","error m-
     A                                      essage file":"WMESGG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"55","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"1 message","parent tab panel":"W-
     A                                      0070F10_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 5":"profound-c-
     A                                      onverted","checked value":"Y","unch-
     A                                      ecked value":"N"},{"id":"constant76-
     A                                      ","field type":"output field","valu-
     A                                      e":" ","css class":"constant","visi-
     A                                      bility":{"fieldName":"N40","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"281px","cursor column":"-
     A                                      2","top":"550px","cursor row":"23",-
     A                                      "css class 2":"BLU","parent tab pan-
     A                                      el":"W0070F10_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant77"-
     A                                      ,"field type":"output field","value-
     A                                      ":" ","css class":"constant","visib-
     A                                      ility":{"fieldName":"N09 and N40","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"351px","cursor co-
     A                                      lumn":"12","top":"550px","cursor ro-
     A                                      w":"23","css class 2":"BLU","parent-
     A                                       tab panel":"W0070F10_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant78","field type":"output field-
     A                                      ","value":" ","css class":"constant-
     A                                      ","visibility":{"fieldName":"N40","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"442px","cursor co-
     A                                      lumn":"25","top":"550px","cursor ro-
     A                                      w":"23","css class 2":"BLU","parent-
     A                                       tab panel":"W0070F10_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant79","field type":"output field-
     A                                      ","value":" ","css class":"constant-
     A                                      ","visibility":{"fieldName":"N40","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"281px","cursor co-
     A                                      lumn":"2","top":"570px","cursor row-
     A                                      ":"24","css class 2":"BLU","parent -
     A                                      tab panel":"W0070F10_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant80","field type":"output field"-
     A                                      ,"value":" ","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"left":"442px","cursor col-
     A                                      umn":"25","top":"570px","cursor row-
     A                                      ":"24","css class 2":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"BLU","cus-
     A                                      tomFalse":""},"parent tab panel":"W-
     A                                      0070F10_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"150px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF03","field type":"bu-
     A                                      tton","visibility":{"fieldName":"N4-
     A                                      0","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"value":"Exit","short-
     A                                      cut key":"F3","left":"14px","top":"-
     A                                      183px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF05","field type":"button",-
     A                                      "visibility":{"fieldName":"N09 and -
     A                                      N40","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"value":"Refresh","-
     A                                      shortcut key":"F5","left":"14px","t-
     A                                      op":"216px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF07","field type":"but-
     A                                      ton","visibility":{"fieldName":"N40-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"value":"Financial sum-
     A                                      mary","shortcut key":"F7","left":"1-
     A                                      4px","top":"249px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF08","field typ-
     A                                      e":"button","value":"Body part impa-
     A                                      irment","shortcut key":"F8","left":-
     A                                      "14px","top":"282px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF09"')
     A                                  1 19HTML(',"field type":"button","visib-
     A                                      ility":{"fieldName":"N40","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"value":"Diag info","shortcut key-
     A                                      ":"F9","left":"14px","top":"315px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF10","field type":"button","visibi-
     A                                      lity":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"value":"Search","shortcut key":"F-
     A                                      10","left":"14px","top":"348px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF1-
     A                                      2","field type":"button","value":"C-
     A                                      ancel","shortcut key":"F12","left":-
     A                                      "14px","top":"381px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF14","field t-
     A                                      ype":"button","visibility":{"fieldN-
     A                                      ame":"N40","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"value":"DART-
     A                                      S","shortcut key":"F14","left":"14p-
     A                                      x","top":"414px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnHELP","field type"-
     A                                      :"button","shortcut key":"Alt-F1","-
     A                                      bypass validation":"true","value":"-
     A                                      HELP","response":{"fieldName":"*IN1-
     A                                      0","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"left":"14px","top":"447px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCAINJ         5A  H
     A            SCEDN         34A  H
     A            SCIDTH         1A  H
     A            SCODIV         5S 0H
     A            SCOEMP         9S 0H
     A            SCOFND         3S 0H
     A            SCPIMP         1A  H
     A            SCYRLX         4S 0H
     A            SCACDT    R        H      REFFLD(DT8)
     A            SCAMMI    R        H      REFFLD(DT8)
     A            SCCMDI    R        H      REFFLD(DT8)
     A            SCCNAM    R        H      REFFLD(NM20)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCVT     R        H      REFFLD(DS10)
     A            SCDFE     R        H      REFFLD(DT8)
     A            SCDFI     R        H      REFFLD(DT8)
     A            SCDOD     R        H      REFFLD(DT8)
     A            SCDTH     R        H      REFFLD(FLAG)
     A            SCDTIM    R        H      REFFLD(DT8)
     A            SCDTRE    R        H      REFFLD(DT8)
     A            SCFNAM    R        H      REFFLD(NM20)
     A            SCFND     R        H      REFFLD(FND)
     A            SCHCAP    R        H      REFFLD(FLAG)
     A            SCHIC#    R        H      REFFLD(CDHICN *LIBL/WMCDP)
     A            SCIMP     R        H      REFFLD(FLAG)
     A            SCIPCT    R        H      REFFLD(PC52)
     A            SCITDE    R        H      REFFLD(NAME)
     A            SCITRT    R        H      REFFLD(CODE)
     A            SCMMI     R        H      REFFLD(DT8)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCMSG1    R        H      REFFLD(DS10)
     A            SCMSG2    R        H      REFFLD(NM50)
     A            SCODIS    R        H      REFFLD(FLAG)
     A            SCORM     R        H      REFFLD(FLAG)
     A            SCORMD    R        H      REFFLD(DT8)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPREX    R        H      REFFLD(FLAG)
     A            SCRLW     R        H      REFFLD(DT8)
     A            SCRXEL    R        H      REFFLD(FLAG)
     A            SCSCL#    R   25   H      REFFLD(DS30)
     A            SCSGDT    R        H      REFFLD(DT8)
     A            SCSS#     R   11   H      REFFLD(SS#)
     A            SCUSER    R        H      REFFLD(USER)
     A            SCYRCS    R   11   H      REFFLD(SS#)
     A          R SCR03
     A  10 11 52
     A  53 09 20
     A  25 49 50                            CA01(10 'Response Indicator *IN10')
     A  64 69 40
     A  63 70                               CA02(11 'Response Indicator *IN11')
     A                                      SETOF(52 'Response Indicator *IN52')
     A                                      SETOF(53 'Response Indicator *IN53')
     A                                  1  2HTML('QPUIREC3    RROWS      2    C-
     A                                      1    1C2    24 RERRMSGID  5    C12 -
     A                                        SCR03_SCMODEC7    WCR1058C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     20-
     A                                      RERRMSGID  5    C6    SCAURLC7    W-
     A                                      CR0501C6    WMESGGC5    *LIBLC0    -
     A                                      E1    3     53')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN52","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN53","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"return -
     A                                      cursor record":{"fieldName":"HREC",-
     A                                      "dataLength":"10","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"none"},"return cursor f-
     A                                      ield":{"fieldName":"HFLD","dataLeng-
     A                                      th":"10","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"none"},"valid command key":{"fie-
     A                                      ldName":"*IN11","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"overlay range":"1-2-
     A                                      4"},"items":[{"id":"SCR03_HFLD","fi-
     A                                      eld type":"output field","visibilit-
     A                                      y":"hidden","value":{"fieldName":"H-
     A                                      FLD","designValue":"[HFLD]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"none","dataLe-
     A                                      ngth":"10"},"left":"0px","top":"-30-
     A                                      px","css class":"profound-converted-
     A                                      "},{"id":"SCR03_HREC","field type":-
     A                                      "output field","visibility":"hidden-
     A                                      ","value":{"fieldName":"HREC","desi-
     A                                      gnValue":"[HREC]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"left":"0px","top":"-30px","css c-
     A                                      lass":"profound-converted"},{"id":"-
     A                                      W0070F10_SCR03_avKeys","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"AV_KEYS","dataLength":"1134","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[AV_KEYS]"},"left-
     A                                      ":"0px","top":"0px","visibility":"h-
     A                                      idden"},{"id":"W0070F10_SCR03_actio-
     A                                      n","field type":"html container","w-
     A                                      hite space":"normal","left":"0px","-
     A                                      top":"10px","width":"230px","css cl-
     A                                      ass":"action-panel-converted","heig-
     A                                      ht":"700px","html":"<div class=\"to-
     A                                      p\"></div><div class=\"imagetop\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_top.png\" /></div><div class-
     A                                      =\"menulinks\"></div><div class=\"i-
     A                                      magebottom\"><img src=\"/profoundui-
     A                                      /userdata/images/bar_bottom.png\" /-
     A                                      ></div><div class=\"bottom\"></div>-
     A                                      "},{"field type":"icon menu button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"32px",-
     A                                      "z index":"20","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1170px","id":"W0-
     A                                      070F10_SCR03_BtnIconMenuSystemTools-
     A                                      ","tool tip":"System Tools","icon a-
     A                                      lignment":"middle left","icon width-
     A                                      ":"16px","icon height":"24px","icon-
     A                                       source":"/profoundui/userdata/imag-
     A                                      es/systool/systools.png","data func-
     A                                      tion":"SystemToolbarSystools","show-
     A                                       down arrow":"Yes"},{"field type":"-
     A                                      panel","panel style":"TransformButt-
     A                                      onBar","id":"W0070F10_SCR03_ButtonB-
     A                                      ar","top":"35px","left":"1036px","w-
     A                                      idth":"187px","height":"28px","css -
     A                                      class":"stationary","visibility":"h-
     A                                      idden","locked in place":"true"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1040px","id":"W-
     A                                      0070F10_SCR03_BtnSave","tool tip":"-
     A                                      Save","onclick":"SystemToolbarSave"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/save.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1066px-
     A                                      ","id":"W0070F10_SCR03_BtnRefresh",-
     A                                      "tool tip":"Refresh","onclick":"Sys-
     A                                      temToolbarRefresh","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/refresh.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1092px","id":"W0070F-
     A                                      10_SCR03_BtnSearch","tool tip":"Sea-
     A                                      rch","onclick":"SystemToolbarSearch-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/search-
     A                                      .png'')"},{"field type":"b')
     A                                  1  4HTML('utton","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1118px","id":"W0070F10_-
     A                                      SCR03_BtnDiaryItems","tool tip":"Di-
     A                                      ary/Work Items - IDARTS","onclick":-
     A                                      "SystemToolbarDiary","background im-
     A                                      age":{"fieldName":"DryIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1144px","id":"W0070F10_SCR-
     A                                      03_BtnSystemMessages","tool tip":"S-
     A                                      ystem Messages","onclick":"SystemTo-
     A                                      olbarMessages","background image":{-
     A                                      "fieldName":"MsgIcnURL","dataLength-
     A                                      ":"128","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"}},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1196px","id":"W0070F10_SCR03_Btn-
     A                                      Help","tool tip":"Help","onclick":"-
     A                                      SystemToolbarHelp","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/help.png'')"},{"id":"W00-
     A                                      70F10_SCR03_ImgSysToolBottom","fiel-
     A                                      d type":"image","image source":"/pr-
     A                                      ofoundui/userdata/images/systool/bu-
     A                                      tbarbot.png","left":"1036px","top":-
     A                                      "64px","width":"187px","locked in p-
     A                                      lace":"true","css class":"stationar-
     A                                      y","visibility":"hidden"},{"id":"W0-
     A                                      070F10_SCR03_MainTabPanel","field t-
     A                                      ype":"tab panel","tab panel style":-
     A                                      "Transform","tab names":{"fieldName-
     A                                      ":"SCPRDS","designValue":"[SCPRDS]"-
     A                                      ,"refField":"NAME","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"active t-
     A                                      ab":"0","left":"250px","top":"70px"-
     A                                      ,"width":"970px","height":"657px","-
     A                                      z index":"8","locked in place":"tru-
     A                                      e","css class":"tab-panel","css cla-
     A                                      ss 2":"stationary"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W0070F10_SCR03_BtnHiddenSav-
     A                                      e","value":"btnSave","top":"100px",-
     A                                      "response":{"fieldName":"btnSave","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"SCR03_SCUSER","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCUSER","designValue":"[SCUSER]","r-
     A                                      efField":"USER","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"281px","curs-
     A                                      or column":"2","top":"110px","curso-
     A                                      r row":"1","css class 2":"top-line"-
     A                                      ,"parent tab panel":"W0070F10_SCR03-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"SCR03_SCCONM","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CCONM","designValue":"[SCCONM]","re-
     A                                      fField":"NAME","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"414px","curso-
     A                                      r column":"21","top":"110px","curso-
     A                                      r row":"1","css class 2":"top-line"-
     A                                      ,"css class 3":"HI","description":"-
     A                                      COMPANY NAME","parent tab panel":"W-
     A                                      0070F10_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 4":"profound-c-
     A                                      onverted"},{"id":"constant81","fiel-
     A                                      d type":"output field","left":"778p-
     A                                      x","cursor column":"73","top":"110p-
     A                                      x","cursor row":"1","css class":"to-
     A                                      p-line","value":"js: currentDate()"-
     A                                      ,"css class 2":"output-field","pare-
     A                                      nt tab panel":"W0070F10_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"W-
     A                                      0070F10_SCR03_fkeyMenu","field type-
     A                                      ":"menu","left":"10px","top":"120px-
     A                                      ","height":"350px","width":"230px",-
     A                                      "hover background color":"#9AAA61",-
     A                                      "hover text color":"#FFFFFF","borde-
     A                                      r color":"#4C6106","menu option ind-
     A                                      ent":"10px","background color":"#75-
     A                                      8B27","css class":"action-menu","cs-
     A                                      s class 2":"stationary","z index":"-
     A                                      101"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"t')
     A                                  1  5HTML('rue","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0070F10_SCR03_BtnHiddenRe-
     A                                      fresh","value":"btnRefresh","top":"-
     A                                      125px","response":{"fieldName":"btn-
     A                                      Refresh","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"SCR03_Q1PGM","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"Q1PGM","designValue":"[Q1P-
     A                                      GM]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"10"},"css class-
     A                                      ":"output-field","left":"281px","cu-
     A                                      rsor column":"2","top":"130px","cur-
     A                                      sor row":"2","parent tab panel":"W0-
     A                                      070F10_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCR03_SCPRDS","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCPRDS","designValue":"[-
     A                                      SCPRDS]","refField":"NAME","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"4-
     A                                      14px","cursor column":"21","top":"1-
     A                                      30px","cursor row":"2","css class 2-
     A                                      ":"HI","description":"PROGRAM NAME"-
     A                                      ,"parent tab panel":"W0070F10_SCR03-
     A                                      _MainTabPanel","parent tab":"0","vi-
     A                                      sibility":"hidden","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      82","field type":"output field","va-
     A                                      lue":"SCR03","css class":"constant"-
     A                                      ,"left":"799px","cursor column":"76-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"W0070F10_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR03_SCMSG1","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCMS-
     A                                      G1","designValue":"[SCMSG1]","refFi-
     A                                      eld":"DS10","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"281px","cursor c-
     A                                      olumn":"2","top":"150px","cursor ro-
     A                                      w":"3","css class 2":{"fieldName":"-
     A                                      69","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"RI","custo-
     A                                      mFalse":""},"description":"EXCESS R-
     A                                      EIN","parent tab panel":"W0070F10_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"SCR03_SCMSG2","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCMSG2","designValue":"[SCMSG2]"-
     A                                      ,"refField":"NM50","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"407px","c-
     A                                      ursor column":"20","top":"150px","c-
     A                                      ursor row":"3","css class 2":"HI","-
     A                                      visibility":{"fieldName":"N70","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"hidden","customFal-
     A                                      se":"visible"},"description":"BARCO-
     A                                      DE FILE IN/OUT STATUS","parent tab -
     A                                      panel":"W0070F10_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"SCR03_SC-
     A                                      MODE","field type":"output field","-
     A                                      value":{"fieldName":"SCMODE","desig-
     A                                      nValue":"[SCMODE]","refField":"NM10-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"764px","cursor column":"71-
     A                                      ","top":"150px","cursor row":"3","c-
     A                                      ss class 2":"HI","error message id"-
     A                                      :"WCR1058","error message file":"WM-
     A                                      ESGG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      20","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"1 message","d-
     A                                      escription":"ADD/UPDATE MODE","pare-
     A                                      nt tab panel":"W0070F10_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0070F10_SCR03_BtnHi-
     A                                      ddenSearch","value":"btnSearch","to-
     A                                      p":"150px","response":{"fieldName":-
     A                                      "btnSearch","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant83","fie-
     A                                      ld type":"output field","value":"Gr-
     A                                      oup:","css class":"constant","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "170px","cursor row":"4","parent ta-
     A                                      b panel":"W0070F10_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR03_-
     A                                      SCFND","field type":"output field",-
     A                                      "value":{"fieldName":"SCFND","desig-
     A                                      nValue":"[SCFND]","refField":"FND",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00"},"css class":"output-field","le-
     A                                      ft":"330px","cursor column":"9","to-
     A                                      p":"170px","cursor row":"4","width"-
     A                                      :"21px","text align":"right","paren-
     A                                      t tab panel":"W0070F10_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      R03_SCFNAM","field type":"')
     A                                  1  6HTML('output field","value":{"field-
     A                                      Name":"SCFNAM","designValue":"[SCFN-
     A                                      AM]","refField":"NM20","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"358px-
     A                                      ","cursor column":"13","top":"170px-
     A                                      ","cursor row":"4","description":"F-
     A                                      UND NAME","parent tab panel":"W0070-
     A                                      F10_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"constant84","field ty-
     A                                      pe":"output field","value":"SS# :",-
     A                                      "css class":"constant","left":"505p-
     A                                      x","cursor column":"34","top":"170p-
     A                                      x","cursor row":"4","parent tab pan-
     A                                      el":"W0070F10_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCR03_SCSS#-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCSS#","designValu-
     A                                      e":"[SCSS#]","refField":"SS# 11","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"547px","cursor column":"40","t-
     A                                      op":"170px","cursor row":"4","paren-
     A                                      t tab panel":"W0070F10_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      R03_SCCNAM","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCCNAM",-
     A                                      "designValue":"[SCCNAM]","refField"-
     A                                      :"NM20","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"631px","cursor colum-
     A                                      n":"52","top":"170px","cursor row":-
     A                                      "4","parent tab panel":"W0070F10_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0070F10_SC-
     A                                      R03_BtnHiddenDiaryItems","value":"b-
     A                                      tnDiary","top":"175px","response":{-
     A                                      "fieldName":"btnDiary","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant85","field type":"output field",-
     A                                      "value":"Emp# :","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"190px","cursor row":"5"-
     A                                      ,"parent tab panel":"W0070F10_SCR03-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCR03_SCEDN","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      EDN","designValue":"[SCEDN]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none","data-
     A                                      Length":"34"},"css class":"output-f-
     A                                      ield","left":"330px","cursor column-
     A                                      ":"9","top":"190px","cursor row":"5-
     A                                      ","description":"Emp#, DIV, & NAME"-
     A                                      ,"parent tab panel":"W0070F10_SCR03-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"constant86","field type":"outp-
     A                                      ut field","value":"Prior Grp/Emp #:-
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"N63","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"575px","cursor column":"44","-
     A                                      top":"190px","cursor row":"5","pare-
     A                                      nt tab panel":"W0070F10_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CR03_SCOFND","field type":"output f-
     A                                      ield","value":{"fieldName":"SCOFND"-
     A                                      ,"designValue":"[SCOFND]","dataType-
     A                                      ":"zoned","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"true",-
     A                                      "zeroFill":"true","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","dataLengt-
     A                                      h":"3","decPos":"0"},"css class":"o-
     A                                      utput-field","visibility":{"fieldNa-
     A                                      me":"N63","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"694px"-
     A                                      ,"cursor column":"61","top":"190px"-
     A                                      ,"cursor row":"5","width":"21px","t-
     A                                      ext align":"right","css class 2":{"-
     A                                      fieldName":"N63","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"RI","customFalse":""},"descripti-
     A                                      on":"Old Fund Number","parent tab p-
     A                                      anel":"W0070F10_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR03_SCO-
     A                                      EMP","field type":"output field","v-
     A                                      alue":{"fieldName":"SCOEMP","design-
     A                                      Value":"[SCOEMP]","dataType":"zoned-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"false","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"999.00","dataLength":"9",-
     A                                      "decPos":"0"},"css class":"output-f-
     A                                      ield","visibility":{"fieldName":"N6-
     A                                      3","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"722px","curso-
     A                                      r column":"65","top":"190px","curso-
     A                                      r row":"5","width":"63px","text ali-
     A                                      gn":"right","css class 2":{"fieldNa-
     A                                      me":"N63","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"RI",-
     A                                      "customFalse":""},"description":"Ol-
     A                                      d Employer Number","parent tab pane-
     A                                      l":"W0070F10_SCR03_MainTab')
     A                                  1  7HTML('Panel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"SCR03_SCODIV","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCO-
     A                                      DIV","designValue":"[SCODIV]","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","data-
     A                                      Length":"5","decPos":"0"},"css clas-
     A                                      s":"output-field","visibility":{"fi-
     A                                      eldName":"N63","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"7-
     A                                      92px","cursor column":"75","top":"1-
     A                                      90px","cursor row":"5","width":"35p-
     A                                      x","text align":"right","css class -
     A                                      2":{"fieldName":"N63","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"RI","customFalse":""},"desc-
     A                                      ription":"Old division","parent tab-
     A                                       panel":"W0070F10_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0070F10_SCR03_BtnHiddenSy-
     A                                      stemMessages","value":"btnMessage",-
     A                                      "top":"200px","response":{"fieldNam-
     A                                      e":"btnMessage","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant87",-
     A                                      "field type":"output field","value"-
     A                                      :"Case#:","css class":"constant","l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"210px","cursor row":"6","paren-
     A                                      t tab panel":"W0070F10_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      R03_SCYRCS","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCYRCS",-
     A                                      "designValue":"[SCYRCS]","refField"-
     A                                      :"SS# 11","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"330px","cursor col-
     A                                      umn":"9","top":"210px","cursor row"-
     A                                      :"6","description":"FYR-CASE","pare-
     A                                      nt tab panel":"W0070F10_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"c-
     A                                      onstant88","field type":"output fie-
     A                                      ld","value":"SCL#:","css class":"co-
     A                                      nstant","left":"421px","cursor colu-
     A                                      mn":"22","top":"210px","cursor row"-
     A                                      :"6","parent tab panel":"W0070F10_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR03_SCSCL#","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCSCL#","designValue":"[SCSC-
     A                                      L#]","refField":"DS30 25","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"463px","cursor column":"28","to-
     A                                      p":"210px","cursor row":"6","width"-
     A                                      :"176px","css class 3":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 4":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"description"-
     A                                      :"Ageny Claim#","parent tab panel":-
     A                                      "W0070F10_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 5":"profound-
     A                                      -converted"},{"id":"constant89","fi-
     A                                      eld type":"output field","value":"D-
     A                                      OI:","css class":"constant","left":-
     A                                      "645px","cursor column":"54","top":-
     A                                      "210px","cursor row":"6","parent ta-
     A                                      b panel":"W0070F10_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR03_-
     A                                      SCACDT","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCACDT","des-
     A                                      ignValue":"[SCACDT]","refField":"DT-
     A                                      8","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"true","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00","edtWrd":"''  /  /    ''"},"c-
     A                                      ss class":"output-field","left":"68-
     A                                      7px","cursor column":"60","top":"21-
     A                                      0px","cursor row":"6","width":"70px-
     A                                      ","text align":"right","description-
     A                                      ":"Accident DATE","parent tab panel-
     A                                      ":"W0070F10_SCR03_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0070F10_SCR03_BtnHiddenWorkSubm-
     A                                      itJob","value":"btnWrksbmjob","top"-
     A                                      :"225px","response":{"fieldName":"b-
     A                                      tnWrkJob","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant90","field-
     A                                       type":"output field","value":"CVT#-
     A                                      :","css class":"constant","visibili-
     A                                      ty":{"fieldName":"64","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"645px","cursor column":"54","-
     A                                      top":"230px","cursor row":')
     A                                  1  8HTML('"7","parent tab panel":"W0070-
     A                                      F10_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCR03_SCCVT","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCCVT","designValue":"[SCCVT-
     A                                      ]","refField":"DS10","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","visibility":{"-
     A                                      fieldName":"64","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      687px","cursor column":"60","top":"-
     A                                      230px","cursor row":"7","descriptio-
     A                                      n":"PREVIOUS CLAIM #","parent tab p-
     A                                      anel":"W0070F10_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0070F10_SCR03_BtnHiddenWork-
     A                                      PrinterOutput","value":"btnWrkprtou-
     A                                      t","top":"250px","response":{"field-
     A                                      Name":"btnWrkPrnt","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0070F10_SCR03_BtnHiddenImag-
     A                                      eQueue","value":"btnImgQue","top":"-
     A                                      275px","response":{"fieldName":"btn-
     A                                      ImgQue","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant94","field t-
     A                                      ype":"output field","value":"MCO Na-
     A                                      me                        :","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"25","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"288-
     A                                      px","cursor column":"3","top":"290p-
     A                                      x","cursor row":"10","parent tab pa-
     A                                      nel":"W0070F10_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCMCNM","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCMCNM","designVal-
     A                                      ue":"[SCMCNM]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase","dataLength":"4-
     A                                      0"},"text transform":"uppercase","v-
     A                                      isibility":{"fieldName":"25","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"526px","cursor column"-
     A                                      :"37","top":"290px","cursor row":"1-
     A                                      0","width":"281px","css class 3":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"css class -
     A                                      4":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 5":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"parent tab panel":"W0070F10_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W0070F10_SCR0-
     A                                      3_BtnHiddenHelp","value":"btnHelp",-
     A                                      "top":"300px","response":{"fieldNam-
     A                                      e":"btnHelp","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant95","fi-
     A                                      eld type":"output field","value":"M-
     A                                      CO FEIN                        :","-
     A                                      css class":"constant","visibility":-
     A                                      {"fieldName":"25","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"288px","cursor column":"3","top":-
     A                                      "310px","cursor row":"11","parent t-
     A                                      ab panel":"W0070F10_SCR03_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCMCO-
     A                                      F","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCMCOF","desi-
     A                                      gnValue":"[SCMCOF]","dataType":"zon-
     A                                      ed","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00","dataLength":"-
     A                                      9","decPos":"0"},"visibility":{"fie-
     A                                      ldName":"25","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"526-
     A                                      px","cursor column":"37","top":"310-
     A                                      px","cursor row":"11","width":"64px-
     A                                      ","css class 3":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"css class 4":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","ind')
     A                                  1  9HTML('Format":"true / false"},"css -
     A                                      class 5":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "set focus":{"fieldName":"50","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"parent tab panel":"W0070F10_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "id":"constant96","field type":"out-
     A                                      put field","value":"Release MR auth-
     A                                      orization        :","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      25","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"288px","curs-
     A                                      or column":"3","top":"330px","curso-
     A                                      r row":"12","parent tab panel":"W00-
     A                                      70F10_SCR03_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCAURL","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCAURL","designValue":"[SCA-
     A                                      URL]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase","dataLength":"1"},"text -
     A                                      transform":"uppercase","visibility"-
     A                                      :{"fieldName":"25","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"526px","cursor column":"37","top-
     A                                      ":"330px","cursor row":"12","width"-
     A                                      :"8px","css class 3":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"css class 4":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 5":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"set focus-
     A                                      ":{"fieldName":"52","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"error m-
     A                                      essage id":"WCR0501","error message-
     A                                       file":"WMESGG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"53","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"1 m-
     A                                      essage","parent tab panel":"W0070F1-
     A                                      0_SCR03_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed"},{"id":"constant91","field type-
     A                                      ":"output field","value":"Worker ex-
     A                                      ercised their right to a change of -
     A                                      physician      :","css class":"cons-
     A                                      tant","visibility":{"fieldName":"49-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"288px","cursor-
     A                                       column":"3","top":"390px","cursor -
     A                                      row":"15","parent tab panel":"W0070-
     A                                      F10_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCCGPH","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SCCGPH","designValue":"[SCCGP-
     A                                      H]","dataType":"zoned","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00","dataLength":"2","decPos":"0","-
     A                                      numBlankFill":"true"},"visibility":-
     A                                      {"fieldName":"49","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"715px","cursor column":"64","top"-
     A                                      :"390px","cursor row":"15","width":-
     A                                      "15px","text align":"right","css cl-
     A                                      ass 3":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"c-
     A                                      ss class 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"parent tab panel":"W007-
     A                                      0F10_SCR03_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted"},{"id":"constant92","field t-
     A                                      ype":"output field","value":"Worker-
     A                                       made a written request for a chang-
     A                                      e of physician  . :","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "49","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"288px","cur-
     A                                      sor column":"3","top":"410px","curs-
     A                                      or row":"16","parent tab panel":"W0-
     A                                      070F10_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCWCPH","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCWCPH","designValue":"[SC-
     A                                      WCPH]","dataType":"zoned","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"false","zeroFill')
     A                                  1 10HTML('":"false","curSym":"","units"-
     A                                      :"","negNum":"999.00","dataLength":-
     A                                      "2","decPos":"0","numBlankFill":"tr-
     A                                      ue"},"visibility":{"fieldName":"49"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"715px","cursor -
     A                                      column":"64","top":"410px","cursor -
     A                                      row":"16","width":"15px","text alig-
     A                                      n":"right","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"paren-
     A                                      t tab panel":"W0070F10_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"co-
     A                                      nstant93","field type":"output fiel-
     A                                      d","value":"Worker''s written reque-
     A                                      st for change of physician was deni-
     A                                      ed:","css class":"constant","visibi-
     A                                      lity":{"fieldName":"49","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"288px","cursor column":"3",-
     A                                      "top":"430px","cursor row":"17","pa-
     A                                      rent tab panel":"W0070F10_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCWDPH","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCWDPH"-
     A                                      ,"designValue":"[SCWDPH]","dataType-
     A                                      ":"zoned","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"999.00","dataLeng-
     A                                      th":"2","decPos":"0","numBlankFill"-
     A                                      :"true"},"visibility":{"fieldName":-
     A                                      "49","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"715px","cur-
     A                                      sor column":"64","top":"430px","cur-
     A                                      sor row":"17","width":"15px","text -
     A                                      align":"right","css class 3":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"css class 4":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"p-
     A                                      arent tab panel":"W0070F10_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"id"-
     A                                      :"constant97","field type":"output -
     A                                      field","value":" ","css class":"con-
     A                                      stant","visibility":{"fieldName":"N-
     A                                      40","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"281px","curs-
     A                                      or column":"2","top":"550px","curso-
     A                                      r row":"23","css class 2":"BLU","pa-
     A                                      rent tab panel":"W0070F10_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant98","field type":"output f-
     A                                      ield","value":" ","css class":"cons-
     A                                      tant","visibility":{"fieldName":"N0-
     A                                      9 and N40","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"351px-
     A                                      ","cursor column":"12","top":"550px-
     A                                      ","cursor row":"23","css class 2":"-
     A                                      BLU","parent tab panel":"W0070F10_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant99","field type":"-
     A                                      output field","value":" ","css clas-
     A                                      s":"constant","visibility":{"fieldN-
     A                                      ame":"N40","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"442px-
     A                                      ","cursor column":"25","top":"550px-
     A                                      ","cursor row":"23","css class 2":"-
     A                                      BLU","parent tab panel":"W0070F10_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant100","field type":-
     A                                      "output field","value":" ","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"N40","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"281p-
     A                                      x","cursor column":"2","top":"570px-
     A                                      ","cursor row":"24","css class 2":"-
     A                                      BLU","parent tab panel":"W0070F10_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant101","field type":-
     A                                      "output field","value":" ","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"442p-
     A                                      x","cursor column":"25","top":"570p-
     A                                      x","cursor row":"24","css class 2":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values",')
     A                                  1 11HTML('"customTrue":"BLU","customFal-
     A                                      se":""},"parent tab panel":"W0070F1-
     A                                      0_SCR03_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"btnSubmit","field type"-
     A                                      :"button","value":"Enter","shortcut-
     A                                       key":"Enter","left":"14px","top":"-
     A                                      150px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF03","field type":"button",-
     A                                      "visibility":{"fieldName":"N40","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"value":"Exit","shortcut ke-
     A                                      y":"F3","left":"14px","top":"183px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF05","field type":"button","visib-
     A                                      ility":{"fieldName":"N09 and N40","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"value":"Refresh","shortc-
     A                                      ut key":"F5","left":"14px","top":"2-
     A                                      16px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF07","field type":"button","-
     A                                      visibility":{"fieldName":"N40","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"value":"Financial summary",-
     A                                      "shortcut key":"F7","left":"14px","-
     A                                      top":"249px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF08","field type":"bu-
     A                                      tton","value":"Body part impairment-
     A                                      ","shortcut key":"F8","left":"14px"-
     A                                      ,"top":"282px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnCF09","field type":"-
     A                                      button","visibility":{"fieldName":"-
     A                                      N40","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"value":"Diag info"-
     A                                      ,"shortcut key":"F9","left":"14px",-
     A                                      "top":"315px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF10","field type":"b-
     A                                      utton","visibility":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"value":"Search","sh-
     A                                      ortcut key":"F10","left":"14px","to-
     A                                      p":"348px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF12","field type":"butt-
     A                                      on","value":"Cancel","shortcut key"-
     A                                      :"F12","left":"14px","top":"381px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF14","field type":"button","visibi-
     A                                      lity":{"fieldName":"N40","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"value":"DARTS","shortcut key":"F1-
     A                                      4","left":"14px","top":"414px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnHELP-
     A                                      ","field type":"button","shortcut k-
     A                                      ey":"Alt-F1","bypass validation":"t-
     A                                      rue","value":"HELP","response":{"fi-
     A                                      eldName":"*IN10","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"left":"14px","top"-
     A                                      :"447px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"}]}-
     A                                      ')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCAURL         1A  H
     A            SCCGPH         2S 0H
     A            SCEDN         34A  H
     A            SCMCNM        40A  H
     A            SCMCOF         9S 0H
     A            SCODIV         5S 0H
     A            SCOEMP         9S 0H
     A            SCOFND         3S 0H
     A            SCWCPH         2S 0H
     A            SCWDPH         2S 0H
     A            SCACDT    R        H      REFFLD(DT8)
     A            SCCNAM    R        H      REFFLD(NM20)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCVT     R        H      REFFLD(DS10)
     A            SCFNAM    R        H      REFFLD(NM20)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCMSG1    R        H      REFFLD(DS10)
     A            SCMSG2    R        H      REFFLD(NM50)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSCL#    R   25   H      REFFLD(DS30)
     A            SCSS#     R   11   H      REFFLD(SS#)
     A            SCUSER    R        H      REFFLD(USER)
     A            SCYRCS    R   11   H      REFFLD(SS#)
     A          R WDW01
     A  10 11 09
     A  40                                  CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC3    ROVERLAY   0     -
     A                                      RWINDOW    0     RROWS      2    C1-
     A                                          1C1    8 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"WDW01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"7","window left":"17","overlay":-
     A                                      "true","valid command key":{"fieldN-
     A                                      ame":"*IN11","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"overlay range":"1-8"},-
     A                                      "items":[{"id":"WDW01","field type"-
     A                                      :"panel","panel style":"Transform D-
     A                                      ialog","text align":"center","left"-
     A                                      :"5px","top":"5px","height":"376px"-
     A                                      ,"width":"359px","z index":"8","loc-
     A                                      ked in place":"true"},{"id":"WDW01_-
     A                                      SCUSER","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCUSER","des-
     A                                      ignValue":"[SCUSER]","refField":"US-
     A                                      ER","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"29px","cursor column":"2-
     A                                      ","top":"65px","cursor row":"1","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"constant102","field type":"out-
     A                                      put field","value":"Informational W-
     A                                      indow","css class":"constant","left-
     A                                      ":"113px","cursor column":"14","top-
     A                                      ":"65px","cursor row":"1","css clas-
     A                                      s 2":"HI","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant103","fie-
     A                                      ld type":"output field","value":"WD-
     A                                      W01","css class":"constant","left":-
     A                                      "295px","cursor column":"40","top":-
     A                                      "65px","cursor row":"1","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant104","field type":"output fiel-
     A                                      d","value":"The hospital provider e-
     A                                      ntered is inactive","css class":"co-
     A                                      nstant","left":"43px","cursor colum-
     A                                      n":"4","top":"125px","cursor row":"-
     A                                      4","css class 2":"profound-converte-
     A                                      d"},{"id":"constant105","field type-
     A                                      ":"output field","value":"Press ent-
     A                                      er to continue or F12 to cancel","c-
     A                                      ss class":"constant","left":"43px",-
     A                                      "cursor column":"4","top":"165px","-
     A                                      cursor row":"6","css class 2":"BLU"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"btnSubmit","field type":"b-
     A                                      utton","value":"Enter","shortcut ke-
     A                                      y":"Enter","left":"14px","top":"270-
     A                                      px","width":"80px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF03","field type":"button","vis-
     A                                      ibility":{"fieldName":"N40","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"value":"Exit","shortcut key":"-
     A                                      F3","left":"104px","top":"270px","w-
     A                                      idth":"80px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF0-
     A                                      5","field type":"button","visibilit-
     A                                      y":{"fieldName":"N09 and N40","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"value":"Refresh","shortcut k-
     A                                      ey":"F5","left":"194px","top":"270p-
     A                                      x","width":"80px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF07","field type":"button","visi-
     A                                      bility":{"fieldName":"N40","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"value":"Financial summary","sho-
     A                                      rtcut key":"F7","left":"14px","top"-
     A                                      :"303px","width":"80px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnCF08","field type":"button"-
     A                                      ,"value":"Body part impairment","sh-
     A                                      ortcut key":"F8","left":"104px","to-
     A                                      p":"303px","width":"80px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF10","field type":"butto-
     A                                      n","visibility":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"value":"Search","shortc-
     A                                      ut key":"F10","left":"194px","top":-
     A                                      "303px","width":"80px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF12","field type":"button",-
     A                                      "value":"Cancel","shortcut key":"F1-
     A                                      2","left":"14px","top":"336px","wid-
     A                                      th":"80px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF14"-
     A                                      ,"field type":"button","visibility"-
     A                                      :{"fieldName":"N40","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"val-
     A                                      ue":"DARTS","shortcut key":"F14","l-
     A                                      eft":"104px","top":"336px","width":-
     A                                      "80px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnHELP","fi-
     A                                      eld type":"button","shortcut key":"-
     A                                      Alt-F1","bypass validation":"true",-
     A                                      "value":"HELP","response":{"fieldNa-
     A                                      me":"*IN10","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"left":"194px","top":"33-
     A                                      6px","width":"80px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","visibility":"hidden","cur-
     A                                      sor":"default"}]}')
     A            SCUSER    R        H      REFFLD(USER)
