     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 21
     A  22 23 24
     A  25 26 27                            CA01(10 'Response Indicator *IN10')
     A  50 51 52
     A  53 54 55
     A  56 09 40                            CA02(11 'Response Indicator *IN11')
     A  71 72 73
     A  74 75 76
     A  77 78 79                            CA03(21 'Response Indicator *IN21')
     A  80 81 82
     A  83 93                               CA04(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(50 'Response Indicator *IN50')
     A                                      SETOF(51 'Response Indicator *IN51')
     A                                      SETOF(52 'Response Indicator *IN52')
     A                                      SETOF(53 'Response Indicator *IN53')
     A                                      SETOF(54 'Response Indicator *IN54')
     A                                      SETOF(55 'Response Indicator *IN55')
     A                                      SETOF(56 'Response Indicator *IN56')
     A                                  1  2HTML('QPUIREC15   RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCEMNCC7    WCR0827C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     71RERRMS-
     A                                      GID  5    C6    SCEMNCC7    WC30000-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     93RERRMSGID  5    C6    SCEMM-
     A                                      AC7    WCR0827C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     72RERRMSGID  5 -
     A                                         C6    SCEMPAC7    WCR0827C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     7-
     A                                      3RERRMSGID  5    C6    SCEMFIC7    -
     A                                      WCR0827C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     74RERRMSGID  5    C6  -
     A                                        SCPANCC7    WCR0827C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     75RERRMS-
     A                                      GID  5    C6    SCEMLSC7    WCR0827-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     76RERRMSGID  5    C6    SCDVA-
     A                                      DC7    WCR0827C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     77RERRMSGID  5 -
     A                                         C6    SCDVDLC7    WCR0827C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     7-
     A                                      8RERRMSGID  5    C6    SCPEXMC7    -
     A                                      WCR0827C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     79RERRMSGID  5    C6  -
     A                                        SCPINLC7    WCR0827C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     80RERRMS-
     A                                      GID  5    C6    SCPCROC7    WCR0827-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     81RERRMSGID  5    C6    SCPIA-
     A                                      PC7    WCR0827C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     82RERRMSGID  5 -
     A                                         C6    SCCEXMC7    WCR0827C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     8-
     A                                      3')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "return cursor record":{"fieldName"-
     A                                      :"HREC","dataLength":"10","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none"},"return -
     A                                      cursor field":{"fieldName":"HFLD","-
     A                                      dataLength":"10","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none"},"set off":{"field-
     A                                      Name":"*IN21","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 2":{"fieldNam-
     A                                      e":"*IN22","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"set off 3":{"fieldName":-
     A                                      "*IN23","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"set off 4":{"fieldName":"*I-
     A                                      N24","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 5":{"fieldName":"*IN25-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"set off 6":{"fieldName":"*IN26","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 7":{"fieldName":"*IN27","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 8":{"fieldName":"*IN50","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       9":{"fieldName":"*IN51","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 10-
     A                                      ":{"fieldName":"*IN52","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 11":-
     A                                      {"fieldName":"*IN53","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"set off 12":{"-
     A                                      fieldName":"*IN54","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 13":{"fi-
     A                                      eldName":"*IN55","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"set off 14":{"fiel-
     A                                      dName":"*IN56","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"valid command key":{-
     A                                      "fieldName":"*IN11","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"overlay range":-
     A                                      "1-23"},"items":[{"id":"HREC","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :"hidden","value":{"fieldName":"HRE-
     A                                      C","designValue":"[HREC]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"left":"0px","top":"-30px-
     A                                      ","css class":"profound-converted"}-
     A                                      ,{"id":"HFLD","field type":"output -
     A                                      field","visibility":"hidden","value-
     A                                      ":{"fieldName":"HFLD","designValue"-
     A                                      :"[HFLD]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"none","dataLength":"10"},"left"-
     A                                      :"0px","top":"-30px","css class":"p-
     A                                      rofound-converted"},{"id":"W0089F_S-
     A                                      CR01_avKeys","field type":"output f-
     A                                      ield","value":{"fieldName":"AV_KEYS-
     A                                      ","dataLength":"1134","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[AV_KEYS]"},"left":"0px","t-
     A                                      op":"0px","visibility":"hidden"},{"-
     A                                      id":"W0089F_SCR01_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"W0089F_SCR01_B-
     A                                      tnIconMenuSystemTools","tool tip":"-
     A                                      System Tools","icon alignment":"mid-
     A                                      dle left","icon width":"16px","icon-
     A                                       height":"24px","icon source":"/pro-
     A                                      foundui/userdata/images/systool/sys-
     A                                      tools.png","data function":"SystemT-
     A                                      oolbarSystools","show down arrow":"-
     A                                      Yes"},{"field type":"panel","panel -
     A                                      style":"TransformButtonBar","id":"W-
     A                                      0089F_SCR01_ButtonBar","top":"35px"-
     A                                      ,"left":"1036px","width":"187px","h-
     A                                      eight":"28px","css class":"stationa-
     A                                      ry","visibility":"hidden","locked i-
     A                                      n place":"true"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"t')
     A                                  1  4HTML('rue","left":"1040px","id":"W0-
     A                                      089F_SCR01_BtnSave","tool tip":"Sav-
     A                                      e","onclick":"SystemToolbarSave","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/save.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1066px","-
     A                                      id":"W0089F_SCR01_BtnRefresh","tool-
     A                                       tip":"Refresh","onclick":"SystemTo-
     A                                      olbarRefresh","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/refresh.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1092px","id":"W0089F_SCR0-
     A                                      1_BtnSearch","tool tip":"Search","o-
     A                                      nclick":"SystemToolbarSearch","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/search.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1118px","i-
     A                                      d":"W0089F_SCR01_BtnDiaryItems","to-
     A                                      ol tip":"Diary/Work Items - IDARTS"-
     A                                      ,"onclick":"SystemToolbarDiary","ba-
     A                                      ckground image":{"fieldName":"DryIc-
     A                                      nURL","dataLength":"128","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"}},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1144px","id":"W-
     A                                      0089F_SCR01_BtnSystemMessages","too-
     A                                      l tip":"System Messages","onclick":-
     A                                      "SystemToolbarMessages","background-
     A                                       image":{"fieldName":"MsgIcnURL","d-
     A                                      ataLength":"128","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"}},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1196px","id":"W0089F_SC-
     A                                      R01_BtnHelp","tool tip":"Help","onc-
     A                                      lick":"SystemToolbarHelp","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/help.png'')"},{"i-
     A                                      d":"W0089F_SCR01_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"W0089F_SCR01_MainTabPanel","fiel-
     A                                      d type":"tab panel","tab panel styl-
     A                                      e":"Transform","tab names":{"fieldN-
     A                                      ame":"SCPRDS","designValue":"[SCPRD-
     A                                      S]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0089F_SCR01_BtnHiddenSa-
     A                                      ve","value":"btnSave","top":"100px"-
     A                                      ,"response":{"fieldName":"btnSave",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"SCUSER","field type":"output-
     A                                       field","value":{"fieldName":"SCUSE-
     A                                      R","designValue":"[SCUSER]","refFie-
     A                                      ld":"USER","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"281px","cursor co-
     A                                      lumn":"2","top":"110px","cursor row-
     A                                      ":"1","css class 2":"top-line","par-
     A                                      ent tab panel":"W0089F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"SC-
     A                                      CONM","field type":"output')
     A                                  1  5HTML(' field","value":{"fieldName":-
     A                                      "SCCONM","designValue":"[SCCONM]","-
     A                                      refField":"NAME","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"414px","cur-
     A                                      sor column":"21","top":"110px","cur-
     A                                      sor row":"1","css class 2":"top-lin-
     A                                      e","css class 3":"HI","description"-
     A                                      :"COMPANY NAME","parent tab panel":-
     A                                      "W0089F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 4":"profound-c-
     A                                      onverted"},{"id":"constant1","field-
     A                                       type":"output field","left":"778px-
     A                                      ","cursor column":"73","top":"110px-
     A                                      ","cursor row":"1","css class":"top-
     A                                      -line","value":"js: currentDate()",-
     A                                      "css class 2":"output-field","paren-
     A                                      t tab panel":"W0089F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"W008-
     A                                      9F_SCR01_fkeyMenu","field type":"me-
     A                                      nu","left":"10px","top":"120px","he-
     A                                      ight":"350px","width":"230px","hove-
     A                                      r background color":"#9AAA61","hove-
     A                                      r text color":"#FFFFFF","border col-
     A                                      or":"#4C6106","menu option indent":-
     A                                      "10px","background color":"#758B27"-
     A                                      ,"css class":"action-menu","css cla-
     A                                      ss 2":"stationary","z index":"101"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0089F_SCR0-
     A                                      1_BtnHiddenRefresh","value":"btnRef-
     A                                      resh","top":"125px","response":{"fi-
     A                                      eldName":"btnRefresh","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"Q1PGM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"Q1PGM","designValue-
     A                                      ":"[Q1PGM]","refField":"DS10","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"W0089F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCPRDS",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCPRDS","designValue-
     A                                      ":"[SCPRDS]","refField":"NAME","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"414px","cursor column":"21","top-
     A                                      ":"130px","cursor row":"2","css cla-
     A                                      ss 2":"HI","description":"PROGRAM N-
     A                                      AME","parent tab panel":"W0089F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      visibility":"hidden","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt2","field type":"output field","v-
     A                                      alue":"SCR01","css class":"constant-
     A                                      ","left":"799px","cursor column":"7-
     A                                      6","top":"130px","cursor row":"2","-
     A                                      parent tab panel":"W0089F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant3","field type":"output fi-
     A                                      eld","value":"Group:","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"150px","cursor row-
     A                                      ":"3","parent tab panel":"W0089F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCFND","field type":"output-
     A                                       field","value":{"fieldName":"SCFND-
     A                                      ","designValue":"[SCFND]","refField-
     A                                      ":"FND","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"false","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"999.00"},"css class":"output-fi-
     A                                      eld","left":"337px","cursor column"-
     A                                      :"10","top":"150px","cursor row":"3-
     A                                      ","width":"21px","text align":"righ-
     A                                      t","parent tab panel":"W0089F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCNAME","field type":"output f-
     A                                      ield","value":{"fieldName":"SCNAME"-
     A                                      ,"designValue":"[SCNAME]","refField-
     A                                      ":"NM50","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"372px","cursor colu-
     A                                      mn":"15","top":"150px","cursor row"-
     A                                      :"3","parent tab panel":"W0089F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCMODE","field type":"output-
     A                                       field","value":{"fieldName":"SCMOD-
     A                                      E","designValue":"[SCMODE]","refFie-
     A                                      ld":"NM10","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","visibility":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"764px","c-
     A                                      ursor column":"71","top":"150px","c-
     A                                      ursor row":"3","css class 2":"HI","-
     A                                      description":"ADD/UPDATE MODE","par-
     A                                      ent tab panel":"W0089F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"W0089F_SCR01')
     A                                  1  6HTML('_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W0089F_SCR01_BtnHiddenD-
     A                                      iaryItems","value":"btnDiary","top"-
     A                                      :"175px","response":{"fieldName":"b-
     A                                      tnDiary","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"constant4","field t-
     A                                      ype":"output field","value":"Type i-
     A                                      nformation, press Enter.","css clas-
     A                                      s":"constant","visibility":{"fieldN-
     A                                      ame":"N09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"281px-
     A                                      ","cursor column":"2","top":"190px"-
     A                                      ,"cursor row":"5","css class 2":"BL-
     A                                      U","parent tab panel":"W0089F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0089F_SCR01_B-
     A                                      tnHiddenSystemMessages","value":"bt-
     A                                      nMessage","top":"200px","response":-
     A                                      {"fieldName":"btnMessage","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant5","field type":"output field-
     A                                      ","value":"Employer Change Comment -
     A                                      Codes","css class":"constant","left-
     A                                      ":"295px","cursor column":"4","top"-
     A                                      :"210px","cursor row":"6","parent t-
     A                                      ab panel":"W0089F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0089F_SCR01_BtnHiddenWork-
     A                                      SubmitJob","value":"btnWrksbmjob","-
     A                                      top":"225px","response":{"fieldName-
     A                                      ":"btnWrkJob","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant6","fi-
     A                                      eld type":"output field","value":"E-
     A                                      mployer Name Change            :","-
     A                                      css class":"constant","left":"309px-
     A                                      ","cursor column":"6","top":"230px"-
     A                                      ,"cursor row":"7","parent tab panel-
     A                                      ":"W0089F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCEMNC","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCEMNC","designValue":"-
     A                                      [SCEMNC]","refField":"RMCD","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e"},"text transform":"uppercase","l-
     A                                      eft":"554px","cursor column":"41","-
     A                                      top":"230px","cursor row":"7","widt-
     A                                      h":"36px","css class 3":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"css class 4":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"set fo-
     A                                      cus":{"fieldName":"27","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"erro-
     A                                      r message id":"WCR0827","error mess-
     A                                      age file":"WMESGG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"71","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      2 messages","error message id 2":"W-
     A                                      C30000","error message file 2":"WME-
     A                                      SGG","error message library 2":"*LI-
     A                                      BL","error condition 2":{"fieldName-
     A                                      ":"93","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"parent tab panel":"W0089F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"constant7","field type":"o-
     A                                      utput field","value":"Employer Mail-
     A                                      ing Addr Change    :","css class":"-
     A                                      constant","left":"309px","cursor co-
     A                                      lumn":"6","top":"250px","cursor row-
     A                                      ":"8","parent tab panel":"W0089F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCEMMA","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCEMMA","designValue":"[SCEMMA]","r-
     A                                      efField":"RMCD","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","left":"554px"-
     A                                      ,"cursor column":"41","top":"250px"-
     A                                      ,"cursor row":"8","width":"36px","c-
     A                                      ss class 3":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"HI","custo')
     A                                  1  7HTML('mFalse":""},"css class 4":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 5":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"set-
     A                                       focus":{"fieldName":"50","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"e-
     A                                      rror message id":"WCR0827","error m-
     A                                      essage file":"WMESGG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"72","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"1 message","parent tab panel":"W-
     A                                      0089F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W00-
     A                                      89F_SCR01_BtnHiddenWorkPrinterOutpu-
     A                                      t","value":"btnWrkprtout","top":"25-
     A                                      0px","response":{"fieldName":"btnWr-
     A                                      kPrnt","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant8","field typ-
     A                                      e":"output field","value":"Employer-
     A                                       Physical Addr Change   :","css cla-
     A                                      ss":"constant","left":"309px","curs-
     A                                      or column":"6","top":"270px","curso-
     A                                      r row":"9","parent tab panel":"W008-
     A                                      9F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCEMPA","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCEMPA","designValue":"[SCEMPA-
     A                                      ]","refField":"RMCD","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"5-
     A                                      54px","cursor column":"41","top":"2-
     A                                      70px","cursor row":"9","width":"36p-
     A                                      x","css class 3":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"HI","customFal-
     A                                      se":""},"css class 4":{"fieldName":-
     A                                      "N09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 5":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"set focus":{"-
     A                                      fieldName":"51","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"error messa-
     A                                      ge id":"WCR0827","error message fil-
     A                                      e":"WMESGG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"73","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"1 messa-
     A                                      ge","parent tab panel":"W0089F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W0089F_SCR01_-
     A                                      BtnHiddenImageQueue","value":"btnIm-
     A                                      gQue","top":"275px","response":{"fi-
     A                                      eldName":"btnImgQue","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t9","field type":"output field","va-
     A                                      lue":"Federal ID Change            -
     A                                         :","css class":"constant","left"-
     A                                      :"309px","cursor column":"6","top":-
     A                                      "290px","cursor row":"10","parent t-
     A                                      ab panel":"W0089F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCEMFI"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCEMFI","design-
     A                                      Value":"[SCEMFI]","refField":"RMCD"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase"},"text transform":"upper-
     A                                      case","left":"554px","cursor column-
     A                                      ":"41","top":"290px","cursor row":"-
     A                                      10","width":"36px","css class 3":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"css class -
     A                                      4":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 5":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"set focus":{"fieldName":"52","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"error message id":"WC')
     A                                  1  8HTML('R0827","error message file":"-
     A                                      WMESGG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"74","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"1 message",-
     A                                      "parent tab panel":"W0089F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W0089F_SCR01_BtnH-
     A                                      iddenHelp","value":"btnHelp","top":-
     A                                      "300px","response":{"fieldName":"bt-
     A                                      nHelp","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant10","field ty-
     A                                      pe":"output field","value":"Produce-
     A                                      r (Agent) Name Change    :","css cl-
     A                                      ass":"constant","left":"309px","cur-
     A                                      sor column":"6","top":"310px","curs-
     A                                      or row":"11","parent tab panel":"W0-
     A                                      089F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCPANC","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCPANC","designValue":"[SCPA-
     A                                      NC]","refField":"RMCD","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "554px","cursor column":"41","top":-
     A                                      "310px","cursor row":"11","width":"-
     A                                      36px","css class 3":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"css class 4":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"set focus"-
     A                                      :{"fieldName":"53","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"error me-
     A                                      ssage id":"WCR0827","error message -
     A                                      file":"WMESGG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"75","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"1 me-
     A                                      ssage","parent tab panel":"W0089F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"constant11","field type":"-
     A                                      output field","value":"Legal Status-
     A                                       Change             :","css class":-
     A                                      "constant","left":"309px","cursor c-
     A                                      olumn":"6","top":"330px","cursor ro-
     A                                      w":"12","parent tab panel":"W0089F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCEMLS","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCEMLS","designValue":"[SCEMLS]",-
     A                                      "refField":"RMCD","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase"},"text -
     A                                      transform":"uppercase","left":"554p-
     A                                      x","cursor column":"41","top":"330p-
     A                                      x","cursor row":"12","width":"36px"-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"css class 4":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 5":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR"-
     A                                      ,"customFalse":""},"set focus":{"fi-
     A                                      eldName":"54","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"error message-
     A                                       id":"WCR0827","error message file"-
     A                                      :"WMESGG","error message library":"-
     A                                      *LIBL","error condition":{"fieldNam-
     A                                      e":"76","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error messages":"1 message-
     A                                      ","parent tab panel":"W0089F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted"},{"i-
     A                                      d":"constant12","field type":"outpu-
     A                                      t field","value":"Addition of Divis-
     A                                      ion            :","css class":"cons-
     A                                      tant","left":"309px","cursor column-
     A                                      ":"6","top":"350px","cursor row":"1-
     A                                      3","parent tab panel":"W0089F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCDVAD","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCD-
     A                                      VAD","designValue":"[SCDVAD]","refF-
     A                                      ield":"RMCD","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase"},"text trans-
     A                                      form":"uppercase","left":"')
     A                                  1  9HTML('554px","cursor column":"41","-
     A                                      top":"350px","cursor row":"13","wid-
     A                                      th":"36px","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"55","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"err-
     A                                      or message id":"WCR0827","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"77","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","parent tab panel":"W00-
     A                                      89F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"constant13","field ty-
     A                                      pe":"output field","value":"Deletio-
     A                                      n of Division            :","css cl-
     A                                      ass":"constant","left":"309px","cur-
     A                                      sor column":"6","top":"370px","curs-
     A                                      or row":"14","parent tab panel":"W0-
     A                                      089F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCDVDL","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCDVDL","designValue":"[SCDV-
     A                                      DL]","refField":"RMCD","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "554px","cursor column":"41","top":-
     A                                      "370px","cursor row":"14","width":"-
     A                                      36px","css class 3":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"css class 4":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"set focus"-
     A                                      :{"fieldName":"56","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"error me-
     A                                      ssage id":"WCR0827","error message -
     A                                      file":"WMESGG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"78","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"1 me-
     A                                      ssage","parent tab panel":"W0089F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"constant14","field type":"-
     A                                      output field","value":"Premium Chan-
     A                                      ge Comment Codes","css class":"cons-
     A                                      tant","left":"295px","cursor column-
     A                                      ":"4","top":"410px","cursor row":"1-
     A                                      6","parent tab panel":"W0089F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"constant15","field type":"outp-
     A                                      ut field","value":"Experience Modif-
     A                                      ier Change      :","css class":"con-
     A                                      stant","left":"309px","cursor colum-
     A                                      n":"6","top":"430px","cursor row":"-
     A                                      17","parent tab panel":"W0089F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCPEXM","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      PEXM","designValue":"[SCPEXM]","ref-
     A                                      Field":"RMCD","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","left":"554px","-
     A                                      cursor column":"41","top":"430px","-
     A                                      cursor row":"17","width":"36px","cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"set focus":{"fieldN-
     A                                      ame":"22","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"error message id"-
     A                                      :"WCR0827","error message file":"WM-
     A                                      ESGG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      79","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"1 me')
     A                                  1 10HTML('ssage","parent tab panel":"W0-
     A                                      089F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted"},{"id":"constant16","field t-
     A                                      ype":"output field","value":"Increa-
     A                                      sed Limits Change         :","css c-
     A                                      lass":"constant","left":"309px","cu-
     A                                      rsor column":"6","top":"450px","cur-
     A                                      sor row":"18","parent tab panel":"W-
     A                                      0089F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCPINL","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCPINL","designValue":"[SCP-
     A                                      INL]","refField":"RMCD","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"554px","cursor column":"41","top"-
     A                                      :"450px","cursor row":"18","width":-
     A                                      "36px","css class 3":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"css class 4":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 5":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"set focus-
     A                                      ":{"fieldName":"23","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"error m-
     A                                      essage id":"WCR0827","error message-
     A                                       file":"WMESGG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"80","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"1 m-
     A                                      essage","parent tab panel":"W0089F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"constant17","field type":-
     A                                      "output field","value":"Class Rate -
     A                                      / Other Change       :","css class"-
     A                                      :"constant","left":"309px","cursor -
     A                                      column":"6","top":"470px","cursor r-
     A                                      ow":"19","parent tab panel":"W0089F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCPCRO","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCPCRO","designValue":"[SCPCRO]"-
     A                                      ,"refField":"RMCD","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase"},"text-
     A                                       transform":"uppercase","left":"554-
     A                                      px","cursor column":"41","top":"470-
     A                                      px","cursor row":"19","width":"36px-
     A                                      ","css class 3":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"css class 4":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 5":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"set focus":{"f-
     A                                      ieldName":"24","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"error messag-
     A                                      e id":"WCR0827","error message file-
     A                                      ":"WMESGG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"81","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"1 messag-
     A                                      e","parent tab panel":"W0089F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 6":"profound-converted"},{"-
     A                                      id":"constant18","field type":"outp-
     A                                      ut field","value":"Interim Adjust O-
     A                                      f Premium       :","css class":"con-
     A                                      stant","left":"309px","cursor colum-
     A                                      n":"6","top":"490px","cursor row":"-
     A                                      20","parent tab panel":"W0089F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCPIAP","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      PIAP","designValue":"[SCPIAP]","ref-
     A                                      Field":"RMCD","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","left":"554px","-
     A                                      cursor column":"41","top":"490px","-
     A                                      cursor row":"20","width":"36px","cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"express')
     A                                  1 11HTML('ion","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"set -
     A                                      focus":{"fieldName":"25","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"WCR0827","error me-
     A                                      ssage file":"WMESGG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"82","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"1 message","parent tab panel":"W0-
     A                                      089F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted"},{"id":"constant19","field t-
     A                                      ype":"output field","value":"Contin-
     A                                      gent Modifier Change      :","css c-
     A                                      lass":"constant","left":"309px","cu-
     A                                      rsor column":"6","top":"510px","cur-
     A                                      sor row":"21","parent tab panel":"W-
     A                                      0089F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCCEXM","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCCEXM","designValue":"[SCC-
     A                                      EXM]","refField":"RMCD","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"554px","cursor column":"41","top"-
     A                                      :"510px","cursor row":"21","width":-
     A                                      "36px","css class 3":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"css class 4":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 5":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"set focus-
     A                                      ":{"fieldName":"26","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"error m-
     A                                      essage id":"WCR0827","error message-
     A                                       file":"WMESGG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"83","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"1 m-
     A                                      essage","parent tab panel":"W0089F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"constant20","field type":-
     A                                      "output field","value":" ","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"40","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"281px-
     A                                      ","cursor column":"2","top":"550px"-
     A                                      ,"cursor row":"23","css class 2":"B-
     A                                      LU","parent tab panel":"W0089F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant22","field type":"out-
     A                                      put field","value":" ","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"281px","c-
     A                                      ursor column":"2","top":"550px","cu-
     A                                      rsor row":"23","css class 2":"BLU",-
     A                                      "parent tab panel":"W0089F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant21","field type":"output -
     A                                      field","value":" ","css class":"con-
     A                                      stant","visibility":{"fieldName":"N-
     A                                      09 and N40","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"281p-
     A                                      x","cursor column":"2","top":"550px-
     A                                      ","cursor row":"23","css class 2":"-
     A                                      BLU","parent tab panel":"W0089F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"btnSubmit","field type":"but-
     A                                      ton","value":"Enter","shortcut key"-
     A                                      :"Enter","left":"14px","top":"150px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF03","field type":"button","visi-
     A                                      bility":{"fieldName":"40 or N09 and-
     A                                       N40 or 09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"value":"Exi-
     A                                      t","shortcut key":"F3","left":"14px-
     A                                      ","top":"183px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnCF05","field type":-
     A                                      "button","visibility":{"fieldName":-
     A                                      "N40","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"value":"Refresh",-
     A                                      "shortcut key":"F5","left":"14px","-
     A                                      top":"216px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF10","field type":"bu-
     A                                      tton","visibility":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"value":"Search","sho-
     A                                      rtcut key":"F10","left":"14px","top-
     A                                      ":"249px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF12","field typ')
     A                                  1 12HTML('e":"button","visibility":{"fi-
     A                                      eldName":"40 or N09 and N40 or 09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"value":"Cancel","shortc-
     A                                      ut key":"F12","left":"14px","top":"-
     A                                      282px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnHELP","field type":"button",-
     A                                      "shortcut key":"Alt-F1","bypass val-
     A                                      idation":"true","value":"HELP","res-
     A                                      ponse":{"fieldName":"*IN10","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"left":"-
     A                                      14px","top":"315px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCEXM    R        H      REFFLD(RMCD)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDVAD    R        H      REFFLD(RMCD)
     A            SCDVDL    R        H      REFFLD(RMCD)
     A            SCEMFI    R        H      REFFLD(RMCD)
     A            SCEMLS    R        H      REFFLD(RMCD)
     A            SCEMMA    R        H      REFFLD(RMCD)
     A            SCEMNC    R        H      REFFLD(RMCD)
     A            SCEMPA    R        H      REFFLD(RMCD)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCNAME    R        H      REFFLD(NM50)
     A            SCPANC    R        H      REFFLD(RMCD)
     A            SCPCRO    R        H      REFFLD(RMCD)
     A            SCPEXM    R        H      REFFLD(RMCD)
     A            SCPIAP    R        H      REFFLD(RMCD)
     A            SCPINL    R        H      REFFLD(RMCD)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR02
     A  10 11 21
     A  09 40 71
     A  72 73 74                            CA01(10 'Response Indicator *IN10')
     A  75 76 77
     A  78 79 80
     A  81 82 83                            CA02(11 'Response Indicator *IN11')
     A  84 85 86
     A  87 88 89
     A  93                                  CA03(21 'Response Indicator *IN21')
     A                                  1  2HTML('QPUIREC12   RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCENADC7    WCR0827C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     71RERRMS-
     A                                      GID  5    C6    SCENADC7    WC30000-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     93RERRMSGID  5    C6    SCEND-
     A                                      LC7    WCR0827C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     72RERRMSGID  5 -
     A                                         C6    SCENNCC7    WCR0827C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     7-
     A                                      3RERRMSGID  5    C6    SCENMAC7    -
     A                                      WCR0827C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     74RERRMSGID  5    C6  -
     A                                        SCENPAC7    WCR0827C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     75RERRMS-
     A                                      GID  5    C6    SCLCADC7    WCR0827-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     76RERRMSGID  5    C6    SCLCD-
     A                                      LC7    WCR0827C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     77RERRMSGID  5 -
     A                                         C6    SCLCNCC7    WCR0827C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     7-
     A                                      8RERRMSGID  5    C6    SCLCMAC7    -
     A                                      WCR0827C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     79RERRMSGID  5    C6  -
     A                                        SCLCPAC7    WCR0827C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     80')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "return cursor record":{"fieldName"-
     A                                      :"HREC","dataLength":"10","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none"},"return -
     A                                      cursor field":{"fieldName":"HFLD","-
     A                                      dataLength":"10","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none"},"set off":{"field-
     A                                      Name":"*IN21","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"valid command key":{"-
     A                                      fieldName":"*IN11","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"overlay range":"-
     A                                      1-23"},"items":[{"id":"SCR02_HREC",-
     A                                      "field type":"output field","visibi-
     A                                      lity":"hidden","value":{"fieldName"-
     A                                      :"HREC","designValue":"[HREC]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"10"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"SCR02_HFLD","field typ-
     A                                      e":"output field","visibility":"hid-
     A                                      den","value":{"fieldName":"HFLD","d-
     A                                      esignValue":"[HFLD]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"none","dataLength":"-
     A                                      10"},"left":"0px","top":"-30px","cs-
     A                                      s class":"profound-converted"},{"id-
     A                                      ":"W0089F_SCR02_avKeys","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"AV_KEYS","dataLength":"1134","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[AV_KEYS]"},"lef-
     A                                      t":"0px","top":"0px","visibility":"-
     A                                      hidden"},{"id":"W0089F_SCR02_action-
     A                                      ","field type":"html container","wh-
     A                                      ite space":"normal","left":"0px","t-
     A                                      op":"10px","width":"230px","css cla-
     A                                      ss":"action-panel-converted","heigh-
     A                                      t":"700px","html":"<div class=\"top-
     A                                      \"></div><div class=\"imagetop\"><i-
     A                                      mg src=\"/profoundui/userdata/image-
     A                                      s/bar_top.png\" /></div><div class=-
     A                                      \"menulinks\"></div><div class=\"im-
     A                                      agebottom\"><img src=\"/profoundui/-
     A                                      userdata/images/bar_bottom.png\" />-
     A                                      </div><div class=\"bottom\"></div>"-
     A                                      },{"field type":"icon menu button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"32px","-
     A                                      z index":"20","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1170px","id":"W00-
     A                                      89F_SCR02_BtnIconMenuSystemTools","-
     A                                      tool tip":"System Tools","icon alig-
     A                                      nment":"middle left","icon width":"-
     A                                      16px","icon height":"24px","icon so-
     A                                      urce":"/profoundui/userdata/images/-
     A                                      systool/systools.png","data functio-
     A                                      n":"SystemToolbarSystools","show do-
     A                                      wn arrow":"Yes"},{"field type":"pan-
     A                                      el","panel style":"TransformButtonB-
     A                                      ar","id":"W0089F_SCR02_ButtonBar","-
     A                                      top":"35px","left":"1036px","width"-
     A                                      :"187px","height":"28px","css class-
     A                                      ":"stationary","visibility":"hidden-
     A                                      ","locked in place":"true"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1040px","id":"W0089F-
     A                                      _SCR02_BtnSave","tool tip":"Save","-
     A                                      onclick":"SystemToolbarSave","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/save.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1066px","id":-
     A                                      "W0089F_SCR02_BtnRefresh","tool tip-
     A                                      ":"Refresh","onclick":"SystemToolba-
     A                                      rRefresh","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/refresh.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1092px","id":"W0089F_SCR02_Bt-
     A                                      nSearch","tool tip":"Search","oncli-
     A                                      ck":"SystemToolbarSearch","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/search.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background')
     A                                  1  4HTML(' repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1118px","id":"W0089F_SCR02_BtnDiar-
     A                                      yItems","tool tip":"Diary/Work Item-
     A                                      s - IDARTS","onclick":"SystemToolba-
     A                                      rDiary","background image":{"fieldN-
     A                                      ame":"DryIcnURL","dataLength":"128"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none"}},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1144-
     A                                      px","id":"W0089F_SCR02_BtnSystemMes-
     A                                      sages","tool tip":"System Messages"-
     A                                      ,"onclick":"SystemToolbarMessages",-
     A                                      "background image":{"fieldName":"Ms-
     A                                      gIcnURL","dataLength":"128","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none"}}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1196px","id"-
     A                                      :"W0089F_SCR02_BtnHelp","tool tip":-
     A                                      "Help","onclick":"SystemToolbarHelp-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/help.p-
     A                                      ng'')"},{"id":"W0089F_SCR02_ImgSysT-
     A                                      oolBottom","field type":"image","im-
     A                                      age source":"/profoundui/userdata/i-
     A                                      mages/systool/butbarbot.png","left"-
     A                                      :"1036px","top":"64px","width":"187-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"stationary","visibility":"hi-
     A                                      dden"},{"id":"W0089F_SCR02_MainTabP-
     A                                      anel","field type":"tab panel","tab-
     A                                       panel style":"Transform","tab name-
     A                                      s":{"fieldName":"SCPRDS","designVal-
     A                                      ue":"[SCPRDS]","refField":"NAME","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"active tab":"0","left":"250px-
     A                                      ","top":"70px","width":"970px","hei-
     A                                      ght":"657px","z index":"8","locked -
     A                                      in place":"true","css class":"tab-p-
     A                                      anel","css class 2":"stationary"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W0089F_SCR02_-
     A                                      BtnHiddenSave","value":"btnSave","t-
     A                                      op":"100px","response":{"fieldName"-
     A                                      :"btnSave","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"SCR02_SCUSER","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCUSER","designValue":"-
     A                                      [SCUSER]","refField":"USER","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      10px","cursor row":"1","css class 2-
     A                                      ":"top-line","parent tab panel":"W0-
     A                                      089F_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"SCR02_SCCONM","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCCONM","designValue":"[SC-
     A                                      CONM]","refField":"NAME","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"414-
     A                                      px","cursor column":"21","top":"110-
     A                                      px","cursor row":"1","css class 2":-
     A                                      "top-line","css class 3":"HI","desc-
     A                                      ription":"COMPANY NAME","parent tab-
     A                                       panel":"W0089F_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 4":"pr-
     A                                      ofound-converted"},{"id":"constant2-
     A                                      3","field type":"output field","lef-
     A                                      t":"778px","cursor column":"73","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass":"top-line","value":"js: curren-
     A                                      tDate()","css class 2":"output-fiel-
     A                                      d","parent tab panel":"W0089F_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"W0089F_SCR02_fkeyMenu","field -
     A                                      type":"menu","left":"10px","top":"1-
     A                                      20px","height":"350px","width":"230-
     A                                      px","hover background color":"#9AAA-
     A                                      61","hover text color":"#FFFFFF","b-
     A                                      order color":"#4C6106","menu option-
     A                                       indent":"10px","background color":-
     A                                      "#758B27","css class":"action-menu"-
     A                                      ,"css class 2":"stationary","z inde-
     A                                      x":"101"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W0-
     A                                      089F_SCR02_BtnHiddenRefresh","value-
     A                                      ":"btnRefresh","top":"125p')
     A                                  1  5HTML('x","response":{"fieldName":"b-
     A                                      tnRefresh","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"SCR02_Q1PGM","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"Q1PGM","designValue":"[Q-
     A                                      1PGM]","refField":"DS10","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"281-
     A                                      px","cursor column":"2","top":"130p-
     A                                      x","cursor row":"2","parent tab pan-
     A                                      el":"W0089F_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCR02_SCPRDS"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCPRDS","designValu-
     A                                      e":"[SCPRDS]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"414px","cursor column":"21","to-
     A                                      p":"130px","cursor row":"2","css cl-
     A                                      ass 2":"HI","description":"PROGRAM -
     A                                      NAME","parent tab panel":"W0089F_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "visibility":"hidden","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant24","field type":"output field",-
     A                                      "value":"SCR02","css class":"consta-
     A                                      nt","left":"799px","cursor column":-
     A                                      "76","top":"130px","cursor row":"2"-
     A                                      ,"parent tab panel":"W0089F_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant25","field type":"output-
     A                                       field","value":"Group:","css class-
     A                                      ":"constant","left":"281px","cursor-
     A                                       column":"2","top":"150px","cursor -
     A                                      row":"3","parent tab panel":"W0089F-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCR02_SCFND","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCFND","designValue":"[SCFND]",-
     A                                      "refField":"FND","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00"},"css class":"-
     A                                      output-field","left":"337px","curso-
     A                                      r column":"10","top":"150px","curso-
     A                                      r row":"3","width":"21px","text ali-
     A                                      gn":"right","parent tab panel":"W00-
     A                                      89F_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCR02_SCNAME","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCNAME","designValue":"[SCN-
     A                                      AME]","refField":"NM50","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"372p-
     A                                      x","cursor column":"15","top":"150p-
     A                                      x","cursor row":"3","parent tab pan-
     A                                      el":"W0089F_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCR02_SCMODE"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCMODE","designValu-
     A                                      e":"[SCMODE]","refField":"NM10","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","vis-
     A                                      ibility":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"764px","cursor column":-
     A                                      "71","top":"150px","cursor row":"3"-
     A                                      ,"css class 2":"HI","description":"-
     A                                      ADD/UPDATE MODE","parent tab panel"-
     A                                      :"W0089F_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0089F_SCR02_BtnHiddenSearch","valu-
     A                                      e":"btnSearch","top":"150px","respo-
     A                                      nse":{"fieldName":"btnSearch","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W0089F_SCR02_BtnH-
     A                                      iddenDiaryItems","value":"btnDiary"-
     A                                      ,"top":"175px","response":{"fieldNa-
     A                                      me":"btnDiary","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant26","-
     A                                      field type":"output field","value":-
     A                                      "Type information, press Enter.","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "190px","cursor row":"5","css class-
     A                                       2":"BLU","parent tab panel":"W0089-
     A                                      F_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W0089F_-
     A                                      SCR02_BtnHiddenSystemMessages","val-
     A                                      ue":"btnMessage","top":"200px","res-
     A                                      ponse":{"fieldName":"btnMessage","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left')
     A                                  1  6HTML('":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W0089F_SCR02_BtnHiddenWorkSubmitJo-
     A                                      b","value":"btnWrksbmjob","top":"22-
     A                                      5px","response":{"fieldName":"btnWr-
     A                                      kJob","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant27","field typ-
     A                                      e":"output field","value":"Entity C-
     A                                      hange Comment Codes","css class":"c-
     A                                      onstant","left":"295px","cursor col-
     A                                      umn":"4","top":"230px","cursor row"-
     A                                      :"7","parent tab panel":"W0089F_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"constant28","field type":"ou-
     A                                      tput field","value":"Addition of En-
     A                                      tity              :","css class":"c-
     A                                      onstant","left":"309px","cursor col-
     A                                      umn":"6","top":"250px","cursor row"-
     A                                      :"8","parent tab panel":"W0089F_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCENAD","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CENAD","designValue":"[SCENAD]","re-
     A                                      fField":"RMCD","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase"},"text tra-
     A                                      nsform":"uppercase","left":"554px",-
     A                                      "cursor column":"41","top":"250px",-
     A                                      "cursor row":"8","width":"36px","cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"set focus":{"fieldN-
     A                                      ame":"21","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"error message id"-
     A                                      :"WCR0827","error message file":"WM-
     A                                      ESGG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      71","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"2 messages","-
     A                                      error message id 2":"WC30000","erro-
     A                                      r message file 2":"WMESGG","error m-
     A                                      essage library 2":"*LIBL","error co-
     A                                      ndition 2":{"fieldName":"93","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"paren-
     A                                      t tab panel":"W0089F_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 6-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W0089F_SCR02_BtnHiddenW-
     A                                      orkPrinterOutput","value":"btnWrkpr-
     A                                      tout","top":"250px","response":{"fi-
     A                                      eldName":"btnWrkPrnt","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt29","field type":"output field","-
     A                                      value":"Deletion of Entity         -
     A                                           :","css class":"constant","lef-
     A                                      t":"309px","cursor column":"6","top-
     A                                      ":"270px","cursor row":"9","parent -
     A                                      tab panel":"W0089F_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCENDL-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCENDL","desig-
     A                                      nValue":"[SCENDL]","refField":"RMCD-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase"},"text transform":"uppe-
     A                                      rcase","left":"554px","cursor colum-
     A                                      n":"41","top":"270px","cursor row":-
     A                                      "9","width":"36px","css class 3":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"css class -
     A                                      4":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 5":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"set focus":{"fieldName":"81","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"error message id":"WCR0827","e-
     A                                      rror message file":"WMESGG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"72","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"1 message","parent tab pan-
     A                                      el":"W0089F_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 6":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in ')
     A                                  1  7HTML('place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W0089F_SCR02_BtnH-
     A                                      iddenImageQueue","value":"btnImgQue-
     A                                      ","top":"275px","response":{"fieldN-
     A                                      ame":"btnImgQue","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant30"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Entity Name Change              -
     A                                      :","css class":"constant","left":"3-
     A                                      09px","cursor column":"6","top":"29-
     A                                      0px","cursor row":"10","parent tab -
     A                                      panel":"W0089F_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCENNC","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCENNC","designVal-
     A                                      ue":"[SCENNC]","refField":"RMCD","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase"},"text transform":"uppercas-
     A                                      e","left":"554px","cursor column":"-
     A                                      41","top":"290px","cursor row":"10"-
     A                                      ,"width":"36px","css class 3":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"css class 4":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 5":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      set focus":{"fieldName":"82","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"error message id":"WCR0827","erro-
     A                                      r message file":"WMESGG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"73","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"1 message","parent tab panel"-
     A                                      :"W0089F_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0089F_SCR02_BtnHiddenHelp","value"-
     A                                      :"btnHelp","top":"300px","response"-
     A                                      :{"fieldName":"btnHelp","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant31","field type":"output field"-
     A                                      ,"value":"Entity Mailing Adr Change-
     A                                             :","css class":"constant","l-
     A                                      eft":"309px","cursor column":"6","t-
     A                                      op":"310px","cursor row":"11","pare-
     A                                      nt tab panel":"W0089F_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCE-
     A                                      NMA","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SCENMA","de-
     A                                      signValue":"[SCENMA]","refField":"R-
     A                                      MCD","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"uppercase"},"text transform":"u-
     A                                      ppercase","left":"554px","cursor co-
     A                                      lumn":"41","top":"310px","cursor ro-
     A                                      w":"11","width":"36px","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"css cl-
     A                                      ass 4":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"set focus":{"fieldName":"83"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"error message id":"WCR0827-
     A                                      ","error message file":"WMESGG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"74","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"1 message","parent tab-
     A                                       panel":"W0089F_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted"},{"id":"constant3-
     A                                      2","field type":"output field","val-
     A                                      ue":"Entity Physical Addr Change   -
     A                                        :","css class":"constant","left":-
     A                                      "309px","cursor column":"6","top":"-
     A                                      330px","cursor row":"12","parent ta-
     A                                      b panel":"W0089F_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCENPA",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCENPA","designV-
     A                                      alue":"[SCENPA]","refField":"RMCD",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase"},"text transform":"upperc-
     A                                      ase","left":"554px","cursor column"-
     A                                      :"41","top":"330px","curso')
     A                                  1  8HTML('r row":"12","width":"36px","c-
     A                                      ss class 3":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"HI","customFalse":"-
     A                                      "},"css class 4":{"fieldName":"N09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"UL","customFa-
     A                                      lse":""},"read only":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 5":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"set focus":{"field-
     A                                      Name":"84","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error message id-
     A                                      ":"WCR0827","error message file":"W-
     A                                      MESGG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "75","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"1 message","-
     A                                      parent tab panel":"W0089F_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted"},{"id":-
     A                                      "constant33","field type":"output f-
     A                                      ield","value":"Location Change Comm-
     A                                      ent Codes","css class":"constant","-
     A                                      left":"295px","cursor column":"4","-
     A                                      top":"370px","cursor row":"14","par-
     A                                      ent tab panel":"W0089F_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant34","field type":"output fiel-
     A                                      d","value":"Addition of Location   -
     A                                               :","css class":"constant",-
     A                                      "left":"309px","cursor column":"6",-
     A                                      "top":"390px","cursor row":"15","pa-
     A                                      rent tab panel":"W0089F_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CLCAD","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCLCAD","-
     A                                      designValue":"[SCLCAD]","refField":-
     A                                      "RMCD","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase"},"text transform":-
     A                                      "uppercase","left":"554px","cursor -
     A                                      column":"41","top":"390px","cursor -
     A                                      row":"15","width":"36px","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"css -
     A                                      class 4":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 5":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"set focus":{"fieldName":"8-
     A                                      5","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"error message id":"WCR08-
     A                                      27","error message file":"WMESGG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"76","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"1 message","parent t-
     A                                      ab panel":"W0089F_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 6":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t35","field type":"output field","v-
     A                                      alue":"Deletion of Location        -
     A                                          :","css class":"constant","left-
     A                                      ":"309px","cursor column":"6","top"-
     A                                      :"410px","cursor row":"16","parent -
     A                                      tab panel":"W0089F_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCLCDL-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCLCDL","desig-
     A                                      nValue":"[SCLCDL]","refField":"RMCD-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase"},"text transform":"uppe-
     A                                      rcase","left":"554px","cursor colum-
     A                                      n":"41","top":"410px","cursor row":-
     A                                      "16","width":"36px","css class 3":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"css class-
     A                                       4":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"set focus":{"fieldName":"86","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"error message id":"WCR0827","-
     A                                      error message file":"WMESGG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"77","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"1 message","parent tab pa-
     A                                      nel":"W0089F_SCR02_MainTab')
     A                                  1  9HTML('Panel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant36","field type":"output-
     A                                       field","value":"Location Name Chan-
     A                                      ge            :","css class":"const-
     A                                      ant","left":"309px","cursor column"-
     A                                      :"6","top":"430px","cursor row":"17-
     A                                      ","parent tab panel":"W0089F_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCLCNC","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCLC-
     A                                      NC","designValue":"[SCLCNC]","refFi-
     A                                      eld":"RMCD","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase"},"text transf-
     A                                      orm":"uppercase","left":"554px","cu-
     A                                      rsor column":"41","top":"430px","cu-
     A                                      rsor row":"17","width":"36px","css -
     A                                      class 3":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"HI","customFalse":""},-
     A                                      "css class 4":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"read only":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 5":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"PR","cust-
     A                                      omFalse":""},"set focus":{"fieldNam-
     A                                      e":"87","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"error message id":"-
     A                                      WCR0827","error message file":"WMES-
     A                                      GG","error message library":"*LIBL"-
     A                                      ,"error condition":{"fieldName":"78-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"1 message","par-
     A                                      ent tab panel":"W0089F_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"co-
     A                                      nstant37","field type":"output fiel-
     A                                      d","value":"Location Mailing Addr C-
     A                                      hange    :","css class":"constant",-
     A                                      "left":"309px","cursor column":"6",-
     A                                      "top":"450px","cursor row":"18","pa-
     A                                      rent tab panel":"W0089F_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CLCMA","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCLCMA","-
     A                                      designValue":"[SCLCMA]","refField":-
     A                                      "RMCD","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase"},"text transform":-
     A                                      "uppercase","left":"554px","cursor -
     A                                      column":"41","top":"450px","cursor -
     A                                      row":"18","width":"36px","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"css -
     A                                      class 4":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 5":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"set focus":{"fieldName":"8-
     A                                      8","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"error message id":"WCR08-
     A                                      27","error message file":"WMESGG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"79","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"1 message","parent t-
     A                                      ab panel":"W0089F_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 6":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t38","field type":"output field","v-
     A                                      alue":"Location Physical Addr Chang-
     A                                      e   :","css class":"constant","left-
     A                                      ":"309px","cursor column":"6","top"-
     A                                      :"470px","cursor row":"19","parent -
     A                                      tab panel":"W0089F_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCLCPA-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCLCPA","desig-
     A                                      nValue":"[SCLCPA]","refField":"RMCD-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase"},"text transform":"uppe-
     A                                      rcase","left":"554px","cursor colum-
     A                                      n":"41","top":"470px","cursor row":-
     A                                      "19","width":"36px","css class 3":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"css class-
     A                                       4":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Cust')
     A                                  1 10HTML('om Values","customTrue":"PR",-
     A                                      "customFalse":""},"set focus":{"fie-
     A                                      ldName":"89","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"error message -
     A                                      id":"WCR0827","error message file":-
     A                                      "WMESGG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"80","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error messages":"1 message"-
     A                                      ,"parent tab panel":"W0089F_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant41","field type":"output-
     A                                       field","value":" ","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"281px","curs-
     A                                      or column":"2","top":"550px","curso-
     A                                      r row":"23","css class 2":"BLU","pa-
     A                                      rent tab panel":"W0089F_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant40","field type":"output fie-
     A                                      ld","value":" ","css class":"consta-
     A                                      nt","visibility":{"fieldName":"N09 -
     A                                      and N40","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"281px",-
     A                                      "cursor column":"2","top":"550px","-
     A                                      cursor row":"23","css class 2":"BLU-
     A                                      ","parent tab panel":"W0089F_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant39","field type":"outpu-
     A                                      t field","value":" ","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "40","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"281px","cur-
     A                                      sor column":"2","top":"550px","curs-
     A                                      or row":"23","css class 2":"BLU","p-
     A                                      arent tab panel":"W0089F_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      btnSubmit","field type":"button","v-
     A                                      alue":"Enter","shortcut key":"Enter-
     A                                      ","left":"14px","top":"150px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF03"-
     A                                      ,"field type":"button","visibility"-
     A                                      :{"fieldName":"40 or N09 and N40 or-
     A                                       09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"value":"Exit","sho-
     A                                      rtcut key":"F3","left":"14px","top"-
     A                                      :"183px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF05","field type":"button-
     A                                      ","visibility":{"fieldName":"N40","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"value":"Refresh","shortc-
     A                                      ut key":"F5","left":"14px","top":"2-
     A                                      16px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF10","field type":"button","-
     A                                      visibility":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"value":"Search","shortcut k-
     A                                      ey":"F10","left":"14px","top":"249p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF12","field type":"button","vis-
     A                                      ibility":{"fieldName":"40 or N09 an-
     A                                      d N40 or 09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"value":"Ca-
     A                                      ncel","shortcut key":"F12","left":"-
     A                                      14px","top":"282px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnHELP","field ty-
     A                                      pe":"button","shortcut key":"Alt-F1-
     A                                      ","bypass validation":"true","value-
     A                                      ":"HELP","response":{"fieldName":"*-
     A                                      IN10","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"left":"14px","top":"315px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCENAD    R        H      REFFLD(RMCD)
     A            SCENDL    R        H      REFFLD(RMCD)
     A            SCENMA    R        H      REFFLD(RMCD)
     A            SCENNC    R        H      REFFLD(RMCD)
     A            SCENPA    R        H      REFFLD(RMCD)
     A            SCFND     R        H      REFFLD(FND)
     A            SCLCAD    R        H      REFFLD(RMCD)
     A            SCLCDL    R        H      REFFLD(RMCD)
     A            SCLCMA    R        H      REFFLD(RMCD)
     A            SCLCNC    R        H      REFFLD(RMCD)
     A            SCLCPA    R        H      REFFLD(RMCD)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCNAME    R        H      REFFLD(NM50)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR03
     A  10 11 09
     A  40 71 72
     A  73 74 75                            CA01(10 'Response Indicator *IN10')
     A  76 77 78
     A  79 80 81
     A  82 83 84                            CA02(11 'Response Indicator *IN11')
     A  93                                  CA03
     A                                  1  2HTML('QPUIREC12   RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCOOADC7    WCR0827C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     71RERRMS-
     A                                      GID  5    C6    SCOOADC7    WC30000-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     93RERRMSGID  5    C6    SCOON-
     A                                      CC7    WCR0827C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     72RERRMSGID  5 -
     A                                         C6    SCWVARC7    WCR0827C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     8-
     A                                      2RERRMSGID  5    C6    SCWVARC7    -
     A                                      WC30000C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     93RERRMSGID  5    C6  -
     A                                        SCWVCRC7    WCR0827C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     83RERRMS-
     A                                      GID  5    C6    SCWVCRC7    WC30000-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     93RERRMSGID  5    C6    SCWVD-
     A                                      RC7    WCR0827C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     84RERRMSGID  5 -
     A                                         C6    SCWVDRC7    WC30000C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     9-
     A                                      3RERRMSGID  5    C6    SCCERTC7    -
     A                                      WCR0827C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     73RERRMSGID  5    C6  -
     A                                        SCMISCC7    WCR0827C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     74')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "return cursor record":{"fieldName"-
     A                                      :"HREC","dataLength":"10","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none"},"return -
     A                                      cursor field":{"fieldName":"HFLD","-
     A                                      dataLength":"10","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none"},"valid command ke-
     A                                      y":{"fieldName":"*IN11","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"overlay ran-
     A                                      ge":"1-23"},"items":[{"id":"SCR03_H-
     A                                      FLD","field type":"output field","v-
     A                                      isibility":"hidden","value":{"field-
     A                                      Name":"HFLD","designValue":"[HFLD]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      ,"dataLength":"10"},"left":"0px","t-
     A                                      op":"-30px","css class":"profound-c-
     A                                      onverted"},{"id":"SCR03_HREC","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :"hidden","value":{"fieldName":"HRE-
     A                                      C","designValue":"[HREC]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"left":"0px","top":"-30px-
     A                                      ","css class":"profound-converted"}-
     A                                      ,{"id":"W0089F_SCR03_avKeys","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"AV_KEYS","dataLength":"113-
     A                                      4","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none","designValue":"[AV_KEYS]"}-
     A                                      ,"left":"0px","top":"0px","visibili-
     A                                      ty":"hidden"},{"id":"W0089F_SCR03_a-
     A                                      ction","field type":"html container-
     A                                      ","white space":"normal","left":"0p-
     A                                      x","top":"10px","width":"230px","cs-
     A                                      s class":"action-panel-converted","-
     A                                      height":"700px","html":"<div class=-
     A                                      \"top\"></div><div class=\"imagetop-
     A                                      \"><img src=\"/profoundui/userdata/-
     A                                      images/bar_top.png\" /></div><div c-
     A                                      lass=\"menulinks\"></div><div class-
     A                                      =\"imagebottom\"><img src=\"/profou-
     A                                      ndui/userdata/images/bar_bottom.png-
     A                                      \" /></div><div class=\"bottom\"></-
     A                                      div>"},{"field type":"icon menu but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"32-
     A                                      px","z index":"20","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1170px","id"-
     A                                      :"W0089F_SCR03_BtnIconMenuSystemToo-
     A                                      ls","tool tip":"System Tools","icon-
     A                                       alignment":"middle left","icon wid-
     A                                      th":"16px","icon height":"24px","ic-
     A                                      on source":"/profoundui/userdata/im-
     A                                      ages/systool/systools.png","data fu-
     A                                      nction":"SystemToolbarSystools","sh-
     A                                      ow down arrow":"Yes"},{"field type"-
     A                                      :"panel","panel style":"TransformBu-
     A                                      ttonBar","id":"W0089F_SCR03_ButtonB-
     A                                      ar","top":"35px","left":"1036px","w-
     A                                      idth":"187px","height":"28px","css -
     A                                      class":"stationary","visibility":"h-
     A                                      idden","locked in place":"true"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1040px","id":"W-
     A                                      0089F_SCR03_BtnSave","tool tip":"Sa-
     A                                      ve","onclick":"SystemToolbarSave","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/save.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1066px",-
     A                                      "id":"W0089F_SCR03_BtnRefresh","too-
     A                                      l tip":"Refresh","onclick":"SystemT-
     A                                      oolbarRefresh","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/refresh.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1092px","id":"W0089F_SCR-
     A                                      03_BtnSearch","tool tip":"Search","-
     A                                      onclick":"SystemToolbarSearch","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/search.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"no')
     A                                  1  4HTML('ne","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1118px","id":"W0089F_SCR03_Bt-
     A                                      nDiaryItems","tool tip":"Diary/Work-
     A                                       Items - IDARTS","onclick":"SystemT-
     A                                      oolbarDiary","background image":{"f-
     A                                      ieldName":"DryIcnURL","dataLength":-
     A                                      "128","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"}},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1144px","id":"W0089F_SCR03_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"}},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1196px"-
     A                                      ,"id":"W0089F_SCR03_BtnHelp","tool -
     A                                      tip":"Help","onclick":"SystemToolba-
     A                                      rHelp","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/h-
     A                                      elp.png'')"},{"id":"W0089F_SCR03_Im-
     A                                      gSysToolBottom","field type":"image-
     A                                      ","image source":"/profoundui/userd-
     A                                      ata/images/systool/butbarbot.png","-
     A                                      left":"1036px","top":"64px","width"-
     A                                      :"187px","locked in place":"true","-
     A                                      css class":"stationary","visibility-
     A                                      ":"hidden"},{"id":"W0089F_SCR03_Mai-
     A                                      nTabPanel","field type":"tab panel"-
     A                                      ,"tab panel style":"Transform","tab-
     A                                       names":{"fieldName":"SCPRDS","desi-
     A                                      gnValue":"[SCPRDS]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"active tab":"0","left":"-
     A                                      250px","top":"70px","width":"970px"-
     A                                      ,"height":"657px","z index":"8","lo-
     A                                      cked in place":"true","css class":"-
     A                                      tab-panel","css class 2":"stationar-
     A                                      y"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W0089F_S-
     A                                      CR03_BtnHiddenSave","value":"btnSav-
     A                                      e","top":"100px","response":{"field-
     A                                      Name":"btnSave","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"SCR03_SCUSER-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCUSER","designVal-
     A                                      ue":"[SCUSER]","refField":"USER","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass 2":"top-line","parent tab panel-
     A                                      ":"W0089F_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"SCR03_SCCONM","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCCONM","designValue"-
     A                                      :"[SCCONM]","refField":"NAME","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"414px","cursor column":"21","top"-
     A                                      :"110px","cursor row":"1","css clas-
     A                                      s 2":"top-line","css class 3":"HI",-
     A                                      "description":"COMPANY NAME","paren-
     A                                      t tab panel":"W0089F_SCR03_MainTabP-
     A                                      anel","parent tab":"0","css class 4-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant42","field type":"output field"-
     A                                      ,"left":"778px","cursor column":"73-
     A                                      ","top":"110px","cursor row":"1","c-
     A                                      ss class":"top-line","value":"js: c-
     A                                      urrentDate()","css class 2":"output-
     A                                      -field","parent tab panel":"W0089F_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"W0089F_SCR03_fkeyMenu","f-
     A                                      ield type":"menu","left":"10px","to-
     A                                      p":"120px","height":"350px","width"-
     A                                      :"230px","hover background color":"-
     A                                      #9AAA61","hover text color":"#FFFFF-
     A                                      F","border color":"#4C6106","menu o-
     A                                      ption indent":"10px","background co-
     A                                      lor":"#758B27","css class":"action--
     A                                      menu","css class 2":"stationary","z-
     A                                       index":"101"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0089F_SCR03_BtnHiddenRefresh","-
     A                                      value":"btnRefresh","top":"125px","-
     A                                      response":{"fieldName":"btnRefresh"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":')
     A                                  1  5HTML('"1 / 0"}},{"id":"SCR03_Q1PGM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"Q1PGM","designValue-
     A                                      ":"[Q1PGM]","refField":"DS10","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"W0089F_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCR03_SC-
     A                                      PRDS","field type":"output field","-
     A                                      value":{"fieldName":"SCPRDS","desig-
     A                                      nValue":"[SCPRDS]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"414px","cursor column":"21-
     A                                      ","top":"130px","cursor row":"2","c-
     A                                      ss class 2":"HI","description":"PRO-
     A                                      GRAM NAME","parent tab panel":"W008-
     A                                      9F_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","visibility":"hidden","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      constant43","field type":"output fi-
     A                                      eld","value":"SCR03","css class":"c-
     A                                      onstant","left":"799px","cursor col-
     A                                      umn":"76","top":"130px","cursor row-
     A                                      ":"2","parent tab panel":"W0089F_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"constant44","field type":"o-
     A                                      utput field","value":"Group:","css -
     A                                      class":"constant","left":"281px","c-
     A                                      ursor column":"2","top":"150px","cu-
     A                                      rsor row":"3","parent tab panel":"W-
     A                                      0089F_SCR03_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCR03_SCFND","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCFND","designValue":"[SCF-
     A                                      ND]","refField":"FND","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"999.00"},"css cla-
     A                                      ss":"output-field","left":"337px","-
     A                                      cursor column":"10","top":"150px","-
     A                                      cursor row":"3","width":"21px","tex-
     A                                      t align":"right","parent tab panel"-
     A                                      :"W0089F_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCR03_SCNAME","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCNAME","designValue":-
     A                                      "[SCNAME]","refField":"NM50","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "372px","cursor column":"15","top":-
     A                                      "150px","cursor row":"3","parent ta-
     A                                      b panel":"W0089F_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCR03_SC-
     A                                      MODE","field type":"output field","-
     A                                      value":{"fieldName":"SCMODE","desig-
     A                                      nValue":"[SCMODE]","refField":"NM10-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"visibility":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"left":"764px","cursor col-
     A                                      umn":"71","top":"150px","cursor row-
     A                                      ":"3","css class 2":"HI","descripti-
     A                                      on":"ADD/UPDATE MODE","parent tab p-
     A                                      anel":"W0089F_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0089F_SCR03_BtnHiddenSearch",-
     A                                      "value":"btnSearch","top":"150px","-
     A                                      response":{"fieldName":"btnSearch",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0089F_SCR03-
     A                                      _BtnHiddenDiaryItems","value":"btnD-
     A                                      iary","top":"175px","response":{"fi-
     A                                      eldName":"btnDiary","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      45","field type":"output field","va-
     A                                      lue":"Type information, press Enter-
     A                                      .","css class":"constant","visibili-
     A                                      ty":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"190px","cursor row":"5","css -
     A                                      class 2":"BLU","parent tab panel":"-
     A                                      W0089F_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W0-
     A                                      089F_SCR03_BtnHiddenSystemMessages"-
     A                                      ,"value":"btnMessage","top":"200px"-
     A                                      ,"response":{"fieldName":"btnMessag-
     A                                      e","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"de')
     A                                  1  6HTML('fault","visibility":"hidden",-
     A                                      "id":"W0089F_SCR03_BtnHiddenWorkSub-
     A                                      mitJob","value":"btnWrksbmjob","top-
     A                                      ":"225px","response":{"fieldName":"-
     A                                      btnWrkJob","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant46","fiel-
     A                                      d type":"output field","value":"Own-
     A                                      er / Officer Change Comment Codes",-
     A                                      "css class":"constant","left":"295p-
     A                                      x","cursor column":"4","top":"230px-
     A                                      ","cursor row":"7","parent tab pane-
     A                                      l":"W0089F_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant47","f-
     A                                      ield type":"output field","value":"-
     A                                      Addition of Owner / Officer     :",-
     A                                      "css class":"constant","left":"309p-
     A                                      x","cursor column":"6","top":"250px-
     A                                      ","cursor row":"8","parent tab pane-
     A                                      l":"W0089F_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCOOAD","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCOOAD","designValue":-
     A                                      "[SCOOAD]","refField":"RMCD","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se"},"text transform":"uppercase","-
     A                                      left":"547px","cursor column":"40",-
     A                                      "top":"250px","cursor row":"8","wid-
     A                                      th":"36px","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"78","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"err-
     A                                      or message id":"WCR0827","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"71","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "2 messages","error message id 2":"-
     A                                      WC30000","error message file 2":"WM-
     A                                      ESGG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"93","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"parent tab panel":"W0089F_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W0089F_SC-
     A                                      R03_BtnHiddenWorkPrinterOutput","va-
     A                                      lue":"btnWrkprtout","top":"250px","-
     A                                      response":{"fieldName":"btnWrkPrnt"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant48","field type":"o-
     A                                      utput field","value":"Nominal / Own-
     A                                      ership Change      :","css class":"-
     A                                      constant","left":"309px","cursor co-
     A                                      lumn":"6","top":"270px","cursor row-
     A                                      ":"9","parent tab panel":"W0089F_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCOONC","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCOONC","designValue":"[SCOONC]","r-
     A                                      efField":"RMCD","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","left":"547px"-
     A                                      ,"cursor column":"40","top":"270px"-
     A                                      ,"cursor row":"9","width":"36px","c-
     A                                      ss class 3":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"HI","customFalse":"-
     A                                      "},"css class 4":{"fieldName":"N09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"UL","customFa-
     A                                      lse":""},"read only":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 5":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"set focus":{"field-
     A                                      Name":"75","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error message id-
     A                                      ":"WCR0827","error message file":"W-
     A                                      MESGG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "72","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"1 message","-
     A                                      parent tab panel":"W0089F_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0089F_SC')
     A                                  1  7HTML('R03_BtnHiddenImageQueue","val-
     A                                      ue":"btnImgQue","top":"275px","resp-
     A                                      onse":{"fieldName":"btnImgQue","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W0089F_SCR03_Btn-
     A                                      HiddenHelp","value":"btnHelp","top"-
     A                                      :"300px","response":{"fieldName":"b-
     A                                      tnHelp","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant49","field t-
     A                                      ype":"output field","value":"Waiver-
     A                                       of Subro Comment Codes","css class-
     A                                      ":"constant","left":"295px","cursor-
     A                                       column":"4","top":"310px","cursor -
     A                                      row":"11","parent tab panel":"W0089-
     A                                      F_SCR03_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant50","field type-
     A                                      ":"output field","value":"Addition -
     A                                      of Waiver of Subro     :","css clas-
     A                                      s":"constant","left":"309px","curso-
     A                                      r column":"6","top":"330px","cursor-
     A                                       row":"12","parent tab panel":"W008-
     A                                      9F_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCWVAR","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCWVAR","designValue":"[SCWVAR-
     A                                      ]","refField":"RMCD","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"5-
     A                                      47px","cursor column":"40","top":"3-
     A                                      30px","cursor row":"12","width":"36-
     A                                      px","css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"set focus":{-
     A                                      "fieldName":"79","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"error mess-
     A                                      age id":"WCR0827","error message fi-
     A                                      le":"WMESGG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"82","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"2 mess-
     A                                      ages","error message id 2":"WC30000-
     A                                      ","error message file 2":"WMESGG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"93"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"description":"Addition of Waiver -
     A                                      of Subro","parent tab panel":"W0089-
     A                                      F_SCR03_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed"},{"id":"constant51","field type-
     A                                      ":"output field","value":"Waiver of-
     A                                       Subro Changes         :","css clas-
     A                                      s":"constant","left":"309px","curso-
     A                                      r column":"6","top":"350px","cursor-
     A                                       row":"13","parent tab panel":"W008-
     A                                      9F_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCWVCR","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCWVCR","designValue":"[SCWVCR-
     A                                      ]","refField":"RMCD","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"5-
     A                                      47px","cursor column":"40","top":"3-
     A                                      50px","cursor row":"13","width":"36-
     A                                      px","css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"set focus":{-
     A                                      "fieldName":"80","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"error mess-
     A                                      age id":"WCR0827","error message fi-
     A                                      le":"WMESGG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"83","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"2 mess-
     A                                      ages","error message id 2":"WC30000-
     A                                      ","error message file 2":"WMESGG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"93"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"description":"Waiver of Subro Cha-
     A                                      nges","parent tab panel":"W0089F_SC-
     A                                      R03_MainTabPanel","parent ')
     A                                  1  8HTML('tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant52",-
     A                                      "field type":"output field","value"-
     A                                      :"Deletion of Waiver of Subro     :-
     A                                      ","css class":"constant","left":"30-
     A                                      9px","cursor column":"6","top":"370-
     A                                      px","cursor row":"14","parent tab p-
     A                                      anel":"W0089F_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCWVDR","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCWVDR","designValu-
     A                                      e":"[SCWVDR]","refField":"RMCD","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase"},"text transform":"uppercase-
     A                                      ","left":"547px","cursor column":"4-
     A                                      0","top":"370px","cursor row":"14",-
     A                                      "width":"36px","css class 3":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"css class 4":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"s-
     A                                      et focus":{"fieldName":"81","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "error message id":"WCR0827","error-
     A                                       message file":"WMESGG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"84","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"2 messages","error message id -
     A                                      2":"WC30000","error message file 2"-
     A                                      :"WMESGG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"93","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"description":"Deletion-
     A                                       of Waiver of Subrogation","parent -
     A                                      tab panel":"W0089F_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt53","field type":"output field","-
     A                                      value":"Other Change Comment Codes"-
     A                                      ,"css class":"constant","left":"295-
     A                                      px","cursor column":"4","top":"410p-
     A                                      x","cursor row":"16","parent tab pa-
     A                                      nel":"W0089F_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"constant54",-
     A                                      "field type":"output field","value"-
     A                                      :"Certificate Of Insurance        :-
     A                                      ","css class":"constant","left":"30-
     A                                      9px","cursor column":"6","top":"430-
     A                                      px","cursor row":"17","parent tab p-
     A                                      anel":"W0089F_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCCERT","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCCERT","designValu-
     A                                      e":"[SCCERT]","refField":"RMCD","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase"},"text transform":"uppercase-
     A                                      ","left":"547px","cursor column":"4-
     A                                      0","top":"430px","cursor row":"17",-
     A                                      "width":"36px","css class 3":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"css class 4":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"s-
     A                                      et focus":{"fieldName":"76","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "error message id":"WCR0827","error-
     A                                       message file":"WMESGG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"73","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"1 message","parent tab panel":-
     A                                      "W0089F_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 6":"profound-c-
     A                                      onverted"},{"id":"constant55","fiel-
     A                                      d type":"output field","value":"Mis-
     A                                      cellaneous                   :","cs-
     A                                      s class":"constant","left":"309px",-
     A                                      "cursor column":"6","top":"450px","-
     A                                      cursor row":"18","parent tab panel"-
     A                                      :"W0089F_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCMISC","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCMISC","designValue":"[-
     A                                      SCMISC]","refField":"RMCD","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"547px","cursor column":"40","t-
     A                                      op":"450px","cursor row":"')
     A                                  1  9HTML('18","width":"36px","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"css -
     A                                      class 4":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 5":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"set focus":{"fieldName":"7-
     A                                      7","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"error message id":"WCR08-
     A                                      27","error message file":"WMESGG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"74","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"1 message","parent t-
     A                                      ab panel":"W0089F_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 6":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t56","field type":"output field","v-
     A                                      alue":" ","css class":"constant","v-
     A                                      isibility":{"fieldName":"40","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"281px","cursor column"-
     A                                      :"2","top":"550px","cursor row":"23-
     A                                      ","css class 2":"BLU","parent tab p-
     A                                      anel":"W0089F_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant58"-
     A                                      ,"field type":"output field","value-
     A                                      ":" ","css class":"constant","visib-
     A                                      ility":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"550px","cursor row":"23","c-
     A                                      ss class 2":"BLU","parent tab panel-
     A                                      ":"W0089F_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant57","fi-
     A                                      eld type":"output field","value":" -
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"N09 and N40","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"281px","cursor column-
     A                                      ":"2","top":"550px","cursor row":"2-
     A                                      3","css class 2":"BLU","parent tab -
     A                                      panel":"W0089F_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"btnSubmit"-
     A                                      ,"field type":"button","value":"Ent-
     A                                      er","shortcut key":"Enter","left":"-
     A                                      14px","top":"150px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF03","field ty-
     A                                      pe":"button","visibility":{"fieldNa-
     A                                      me":"40 or N09 and N40 or 09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"value":"Exit","shortcut key"-
     A                                      :"F3","left":"14px","top":"183px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F05","field type":"button","visibil-
     A                                      ity":{"fieldName":"N40","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "value":"Refresh","shortcut key":"F-
     A                                      5","left":"14px","top":"216px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF10-
     A                                      ","field type":"button","visibility-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"va-
     A                                      lue":"Search","shortcut key":"F10",-
     A                                      "left":"14px","top":"249px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF12","-
     A                                      field type":"button","visibility":{-
     A                                      "fieldName":"40 or N09 and N40 or 0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"value":"Cancel","sho-
     A                                      rtcut key":"F12","left":"14px","top-
     A                                      ":"282px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnHELP","field type":"butto-
     A                                      n","shortcut key":"Alt-F1","bypass -
     A                                      validation":"true","value":"HELP","-
     A                                      response":{"fieldName":"*IN10","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"left-
     A                                      ":"14px","top":"315px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCERT    R        H      REFFLD(RMCD)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMISC    R        H      REFFLD(RMCD)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCNAME    R        H      REFFLD(NM50)
     A            SCOOAD    R        H      REFFLD(RMCD)
     A            SCOONC    R        H      REFFLD(RMCD)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A            SCWVAR    R        H      REFFLD(RMCD)
     A            SCWVCR    R        H      REFFLD(RMCD)
     A            SCWVDR    R        H      REFFLD(RMCD)
