     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(01)
     A*PUI                                  SFLDEFINE(02)
     A          R SCR01S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A  05 07 08  QPUI000001     1A  O  2  2
     A            SCDBRR         9S 0H
     A            SCDIV          5S 0H
     A            SCPODT         8S 0H
     A            SCSEL          2A  H
     A            SCSTAT         1A  H
     A            SCSUM          3A  H
     A            SCTYPE        15A  H
     A            SCAMT     R        H      REFFLD(A112)
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  01 02 03
     A  04 21 22
     A  23 24 25                            CA01(01 'Response Indicator *IN01')
     A  26 27 28
     A  29 91 92
     A  93 94 95                            CA02(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR01S    5    RS-
     A                                      FLDSP    0    E1    3     04RSFLDSP-
     A                                      CTL 0    E1    3    N03RSFLCLR    0-
     A                                          E1    3     03RSFLPAG    1    C-
     A                                      2    10 RSFLSIZ    1    C2    13 1 -
     A                                         RSFLNXTCHG 0    E1    3     088 -
     A                                         ROVERLAY   0     RWINDOW    0   -
     A                                        RASSUME    0     RSFLMSGID  4    -
     A                                      C7    CPD6A81C7    QCPFMSGC5    *LI-
     A                                      BLC0    E1    3     92RSFLMSGID  4 -
     A                                         C7    CPD6A7CC7    QCPFMSGC5    -
     A                                      *LIBLC0    E1    3     93RERRMSGID -
     A                                       5    C6    SCCONMC7    CPF5203C7  -
     A                                        QCPFMSGC5    *LIBLC0    E1    3  -
     A                                         91RERRMSGID  5    C6    SCCONMC7-
     A                                          CPF5204C7    QCPFMSGC5    *LIBL-
     A                                      C0    E1    3     94FSCPST1    INPU-
     A                                      TONLY 0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"error message id":"CPD6A81","erro-
     A                                      r message file":"QCPFMSG","error me-
     A                                      ssage library":"*LIBL","error condi-
     A                                      tion":{"fieldName":"92","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      ages":"2 messages","error message i-
     A                                      d 2":"CPD6A7C","error message file -
     A                                      2":"QCPFMSG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"93","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"show as window":"tr-
     A                                      ue","overlay":"true","assume":"true-
     A                                      "},"items":[{"id":"SCPST2","field t-
     A                                      ype":"output field","visibility":{"-
     A                                      fieldName":"22","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"value":-
     A                                      {"fieldName":"SCPST2","designValue"-
     A                                      :"[SCPST2]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"1"},"left-
     A                                      ":"0px","top":"-30px","css class":"-
     A                                      profound-converted"},{"id":"SCRRN1"-
     A                                      ,"field type":"output field","visib-
     A                                      ility":"hidden","value":{"fieldName-
     A                                      ":"SCRRN1","designValue":"[SCRRN1]"-
     A                                      ,"dataType":"zoned","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"true","zeroFill":"true","curSym-
     A                                      ":"","units":"","negNum":"-999.00",-
     A                                      "dataLength":"4","decPos":"0"},"lef-
     A                                      t":"0px","top":"-30px","width":"28p-
     A                                      x","text align":"right","css class"-
     A                                      :"profound-converted"},{"id":"SCPST-
     A                                      8","field type":"output field","vis-
     A                                      ibility":{"fieldName":"28","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"value":{"fieldName":"SCPST8","d-
     A                                      esignValue":"[SCPST8]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"1"},"left":"0px","top":"-30px","c-
     A                                      ss class":"profound-converted"},{"i-
     A                                      d":"SCPST6","field type":"output fi-
     A                                      eld","visibility":{"fieldName":"26"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"value":{"fieldName":"S-
     A                                      CPST6","designValue":"[SCPST6]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"none","da-
     A                                      taLength":"1"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"SCPST7","field type":"-
     A                                      output field","visibility":{"fieldN-
     A                                      ame":"27","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"value":{"fiel-
     A                                      dName":"SCPST7","designValue":"[SCP-
     A                                      ST7]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none","dataLength":"1"},"left":"0px-
     A                                      ","top":"-30px","css class":"profou-
     A                                      nd-converted"},{"id":"SCOPL2","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :"hidden","value":{"fieldName":"SCO-
     A                                      PL2","designValue":"[SCOPL2]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none","data-
     A                                      Length":"76"},"left":"0px","top":"--
     A                                      30px","css class":"profound-convert-
     A                                      ed"},{"id":"SCPST9","field type":"o-
     A                                      utput field","visibility":{"fieldNa-
     A                                      me":"29","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"value":{"field-
     A                                      Name":"SCPST9","designValue":"[SCPS-
     A                                      T9]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"n-
     A                                      one","dataLength":"1"},"left":"0px"-
     A                                      ,"top":"-30px","css class":"profoun-
     A                                      d-converted"},{"id":"SFLMOD","field-
     A                                       type":"output field","visibility":-
     A                                      "hidden","value":{"fieldName":"SFLM-
     A                                      OD","designValue":"[SFLMOD]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none","dataL-
     A                                      ength":"1"},"left":"0px","top":"-30-
     A                                      px","css class":"profound-converted-
     A                                      "},{"id":"SCPST5","field type":"out-
     A                                      put field","visibility":{"fieldName-
     A                                      ":"25","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"value":{"fieldNa-
     A                                      me":"SCPST5","designValue":"[SCPST5-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e","dataLength":"1"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"SCPST3","field t-
     A                                      ype":"output field","visibility":{"-
     A                                      fieldName":"23","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"value":-
     A                                      {"fieldName":"SCPST3","designValue"-
     A                                      :"[SCPST3]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"1"},"left-
     A                                      ":"0px","top":"-30px","css class":"-
     A                                      profound-converted"},{"id":"SCPST4"-
     A                                      ,"field type":"output fiel')
     A                                  1  4HTML('d","visibility":{"fieldName":-
     A                                      "24","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"value":{"fieldName-
     A                                      ":"SCPST4","designValue":"[SCPST4]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      ,"dataLength":"1"},"left":"0px","to-
     A                                      p":"-30px","css class":"profound-co-
     A                                      nverted"},{"id":"W0091F_SCR01C_avKe-
     A                                      ys","field type":"output field","va-
     A                                      lue":{"fieldName":"AV_KEYS","dataLe-
     A                                      ngth":"1134","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      AV_KEYS]"},"left":"0px","top":"0px"-
     A                                      ,"visibility":"hidden"},{"id":"W009-
     A                                      1F_SCR01C_action","field type":"htm-
     A                                      l container","white space":"normal"-
     A                                      ,"left":"-10px","top":"255px","widt-
     A                                      h":"230px","css class":"action-pane-
     A                                      l-converted","height":"700px","html-
     A                                      ":"<div class=\"top\"></div><div cl-
     A                                      ass=\"imagetop\"><img src=\"/profou-
     A                                      ndui/userdata/images/bar_top.png\" -
     A                                      /></div><div class=\"menulinks\"></-
     A                                      div><div class=\"imagebottom\"><img-
     A                                       src=\"/profoundui/userdata/images/-
     A                                      bar_bottom.png\" /></div><div class-
     A                                      =\"bottom\"></div>","visibility":"h-
     A                                      idden"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W0091F_SCR01C_BtnIconMenuSystemT-
     A                                      ools","tool tip":"System Tools","ic-
     A                                      on alignment":"middle left","icon w-
     A                                      idth":"16px","icon height":"24px","-
     A                                      icon source":"/profoundui/userdata/-
     A                                      images/systool/systools.png","data -
     A                                      function":"SystemToolbarSystools","-
     A                                      show down arrow":"Yes"},{"field typ-
     A                                      e":"panel","panel style":"Transform-
     A                                      ButtonBar","id":"W0091F_SCR01C_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"W0091F_SCR01C_BtnSave","tool tip"-
     A                                      :"Save","onclick":"SystemToolbarSav-
     A                                      e","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/save.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1066-
     A                                      px","id":"W0091F_SCR01C_BtnRefresh"-
     A                                      ,"tool tip":"Refresh","onclick":"Sy-
     A                                      stemToolbarRefresh","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/refresh.png'')"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1092px","id":"W0091-
     A                                      F_SCR01C_BtnSearch","tool tip":"Sea-
     A                                      rch","onclick":"SystemToolbarSearch-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/search-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"111-
     A                                      8px","id":"W0091F_SCR01C_BtnDiaryIt-
     A                                      ems","tool tip":"Diary/Work Items --
     A                                       IDARTS","onclick":"SystemToolbarDi-
     A                                      ary","background image":{"fieldName-
     A                                      ":"DryIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"}},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1144px"-
     A                                      ,"id":"W0091F_SCR01C_BtnSystemMessa-
     A                                      ges","tool tip":"System Messages","-
     A                                      onclick":"SystemToolbarMessages","b-
     A                                      ackground image":{"fieldNa')
     A                                  1  5HTML('me":"MsgIcnURL","dataLength":-
     A                                      "128","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"}},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1196px","id":"W0091F_SCR01C_BtnHel-
     A                                      p","tool tip":"Help","onclick":"Sys-
     A                                      temToolbarHelp","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/help.png'')"},{"id":"W0091F-
     A                                      _SCR01C_ImgSysToolBottom","field ty-
     A                                      pe":"image","image source":"/profou-
     A                                      ndui/userdata/images/systool/butbar-
     A                                      bot.png","left":"1036px","top":"64p-
     A                                      x","width":"187px","locked in place-
     A                                      ":"true","css class":"stationary","-
     A                                      visibility":"hidden"},{"id":"W0091F-
     A                                      _SCR01C_MainTabPanel","field type":-
     A                                      "tab panel","tab panel style":"Tran-
     A                                      sform","tab names":{"fieldName":"SC-
     A                                      PRDS","designValue":"[SCPRDS]","ref-
     A                                      Field":"NAME","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"active tab":"-
     A                                      0","left":"250px","top":"70px","wid-
     A                                      th":"970px","height":"657px","z ind-
     A                                      ex":"8","locked in place":"true","c-
     A                                      ss class":"tab-panel","css class 2"-
     A                                      :"stationary","visibility":"hidden"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W0091F_SCR-
     A                                      01C_BtnHiddenSave","value":"btnSave-
     A                                      ","top":"100px","response":{"fieldN-
     A                                      ame":"btnSave","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant1","f-
     A                                      ield type":"output field","left":"2-
     A                                      81px","cursor column":"2","top":"11-
     A                                      0px","cursor row":"1","css class":"-
     A                                      top-line","value":"js: currentUser(-
     A                                      )","css class 2":"output-field","pa-
     A                                      rent tab panel":"W0091F_SCR01C_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted","visibil-
     A                                      ity":"hidden"},{"id":"SCCONM","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCCONM","designValue":"[S-
     A                                      CCONM]","refField":"NAME","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"41-
     A                                      4px","cursor column":"21","top":"11-
     A                                      0px","cursor row":"1","css class 2"-
     A                                      :"top-line","css class 3":"HI","err-
     A                                      or message id":"CPF5203","error mes-
     A                                      sage file":"QCPFMSG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"91","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"2 messages","error message id 2":-
     A                                      "CPF5204","error message file 2":"Q-
     A                                      CPFMSG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"94","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"parent tab panel":"W0091-
     A                                      F_SCR01C_MainTabPanel","parent tab"-
     A                                      :"0","css class 4":"profound-conver-
     A                                      ted","visibility":"hidden"},{"id":"-
     A                                      constant2","field type":"output fie-
     A                                      ld","left":"778px","cursor column":-
     A                                      "73","top":"110px","cursor row":"1"-
     A                                      ,"css class":"top-line","value":"js-
     A                                      : currentDate()","css class 2":"out-
     A                                      put-field","parent tab panel":"W009-
     A                                      1F_SCR01C_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted","visibility":"hidden"},{"id":-
     A                                      "W0091F_SCR01C_fkeyMenu","field typ-
     A                                      e":"menu","left":"0px","top":"470px-
     A                                      ","height":"350px","width":"230px",-
     A                                      "hover background color":"#9AAA61",-
     A                                      "hover text color":"#FFFFFF","borde-
     A                                      r color":"#4C6106","menu option ind-
     A                                      ent":"10px","background color":"#75-
     A                                      8B27","css class":"action-menu","cs-
     A                                      s class 2":"stationary","z index":"-
     A                                      101","visibility":"hidden"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W0091F_SCR01C_BtnHi-
     A                                      ddenRefresh","value":"btnRefresh","-
     A                                      top":"125px","response":{"fieldName-
     A                                      ":"btnRefresh","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"Q1PGM","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"Q1PGM","designValue":"[Q1P-
     A                                      GM]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"10"},"css class-
     A                                      ":"output-field","left":"281px","cu-
     A                                      rsor column":"2","top":"130px","cur-
     A                                      sor row":"2","parent tab panel":"W0-
     A                                      091F_SCR01C_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted","visibility":"hidden"},{"id-
     A                                      ":"SCPRDS","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCPRDS","-
     A                                      designValue":"[SCPRDS]","r')
     A                                  1  6HTML('efField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"414px"-
     A                                      ,"cursor column":"21","top":"130px"-
     A                                      ,"cursor row":"2","css class 2":"HI-
     A                                      ","parent tab panel":"W0091F_SCR01C-
     A                                      _MainTabPanel","parent tab":"0","vi-
     A                                      sibility":"hidden","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      3","field type":"output field","val-
     A                                      ue":"SCR01","css class":"constant",-
     A                                      "left":"799px","cursor column":"76"-
     A                                      ,"top":"130px","cursor row":"2","pa-
     A                                      rent tab panel":"W0091F_SCR01C_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted","visibil-
     A                                      ity":"hidden"},{"id":"constant4","f-
     A                                      ield type":"output field","value":"-
     A                                      Group:","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"150px","cursor row":"3","parent -
     A                                      tab panel":"W0091F_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted","visibility":-
     A                                      "hidden"},{"id":"SCFND","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCFND","designValue":"[SCFND]",-
     A                                      "refField":"FND","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00"},"css class":"-
     A                                      output-field","left":"337px","curso-
     A                                      r column":"10","top":"150px","curso-
     A                                      r row":"3","width":"21px","text ali-
     A                                      gn":"right","parent tab panel":"W00-
     A                                      91F_SCR01C_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted","visibility":"hidden"},{"id"-
     A                                      :"SCNAME","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCNAME","d-
     A                                      esignValue":"[SCNAME]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"365px","cursor column"-
     A                                      :"14","top":"150px","cursor row":"3-
     A                                      ","description":"FUND NAME","parent-
     A                                       tab panel":"W0091F_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted","visibility"-
     A                                      :"hidden"},{"id":"constant5","field-
     A                                       type":"output field","value":"Year-
     A                                      :","css class":"constant","left":"7-
     A                                      71px","cursor column":"72","top":"1-
     A                                      50px","cursor row":"3","parent tab -
     A                                      panel":"W0091F_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted","visibility":"hid-
     A                                      den"},{"id":"SCFYR","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCFYR","designValue":"[SCFYR]","ref-
     A                                      Field":"FYR","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00"},"css class":"outp-
     A                                      ut-field","left":"813px","cursor co-
     A                                      lumn":"78","top":"150px","cursor ro-
     A                                      w":"3","width":"21px","text align":-
     A                                      "right","parent tab panel":"W0091F_-
     A                                      SCR01C_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d","visibility":"hidden"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"W0091F_SCR01C_BtnHidd-
     A                                      enSearch","value":"btnSearch","top"-
     A                                      :"150px","response":{"fieldName":"b-
     A                                      tnSearch","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant6","field -
     A                                      type":"output field","value":"Emplo-
     A                                      yer","css class":"label","left":"28-
     A                                      1px","cursor column":"2","top":"170-
     A                                      px","cursor row":"4","width":"110px-
     A                                      "},{"id":"SCEDN","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCE-
     A                                      DN","designValue":"[SCEDN]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none","dataL-
     A                                      ength":"44"},"css class":"output-fi-
     A                                      eld","left":"280px","cursor column"-
     A                                      :"10","top":"185px","cursor row":"4-
     A                                      ","width":"385px"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W0091F_SCR01C_BtnHiddenDiary-
     A                                      Items","value":"btnDiary","top":"17-
     A                                      5px","response":{"fieldName":"btnDi-
     A                                      ary","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W0091F_-
     A                                      SCR01C_BtnHiddenSystemMessages","va-
     A                                      lue":"btnMessage","top":"200px","re-
     A                                      sponse":{"fieldName":"btnMessage","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant7","field type":"outp-
     A                                      ut field","value":"Position to","cs-
     A                                      s class":"label","left":"280px","cu-
     A                                      rsor column":"2","top":"205px","cur-
     A                                      sor row":"6"},{"id":"SCPST1","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","input on-
     A                                      ly":"true","value":{"fieldName":"SC-
     A                                      PST1","designValue":"[SCPS')
     A                                  1  7HTML('T1]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase","dataLength":"5","b-
     A                                      lankFill":"true"},"text transform":-
     A                                      "uppercase","visibility":{"fieldNam-
     A                                      e":"21","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"280px","-
     A                                      cursor column":"20","top":"220px","-
     A                                      cursor row":"6","width":"85px","tex-
     A                                      t align":"right"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0091F_SCR01C_BtnHiddenWorkSu-
     A                                      bmitJob","value":"btnWrksbmjob","to-
     A                                      p":"225px","response":{"fieldName":-
     A                                      "btnWrkJob","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant8","fiel-
     A                                      d type":"output field","value":"Typ-
     A                                      e options, press Enter.","css class-
     A                                      ":"constant","left":"280px","cursor-
     A                                       column":"2","top":"245px","cursor -
     A                                      row":"8","css class 2":"BLU","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W0091F_SCR01C_Btn-
     A                                      HiddenWorkPrinterOutput","value":"b-
     A                                      tnWrkprtout","top":"250px","respons-
     A                                      e":{"fieldName":"btnWrkPrnt","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCOPL1","field type":"output field-
     A                                      ","value":{"fieldName":"SCOPL1","de-
     A                                      signValue":"[SCOPL1]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"76"},"css class":"output-field","-
     A                                      left":"295px","cursor column":"4","-
     A                                      top":"265px","cursor row":"9","css -
     A                                      class 2":"BLU","css class 3":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W0091F_SCR01C_BtnHiddenImageQue-
     A                                      ue","value":"btnImgQue","top":"275p-
     A                                      x","response":{"fieldName":"btnImgQ-
     A                                      ue","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W0091F_S-
     A                                      CR01C_BtnHiddenHelp","value":"btnHe-
     A                                      lp","top":"300px","response":{"fiel-
     A                                      dName":"btnHelp","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant9",-
     A                                      "field type":"output field","value"-
     A                                      :"Opt","css class":"constant","left-
     A                                      ":"280px","cursor column":"2","top"-
     A                                      :"290px","cursor row":"11","css cla-
     A                                      ss 2":"HI","css class 3":"profound--
     A                                      converted","css class 4":"subfile-h-
     A                                      eading"},{"id":"constant10","field -
     A                                      type":"output field","value":"Div",-
     A                                      "css class":"constant","left":"315p-
     A                                      x","cursor column":"7","top":"290px-
     A                                      ","cursor row":"11","css class 2":"-
     A                                      HI","css class 3":"profound-convert-
     A                                      ed","css class 4":"subfile-heading"-
     A                                      },{"id":"constant11","field type":"-
     A                                      output field","value":"Posting Dt",-
     A                                      "css class":"constant","left":"370p-
     A                                      x","cursor column":"15","top":"290p-
     A                                      x","cursor row":"11","css class 2":-
     A                                      "HI","css class 3":"profound-conver-
     A                                      ted","css class 4":"subfile-heading-
     A                                      "},{"id":"constant12","field type":-
     A                                      "output field","value":"Amount","cs-
     A                                      s class":"constant","left":"465px",-
     A                                      "cursor column":"28","top":"290px",-
     A                                      "cursor row":"11","css class 2":"HI-
     A                                      ","css class 3":"profound-converted-
     A                                      ","css class 4":"subfile-heading"},-
     A                                      {"id":"constant13","field type":"ou-
     A                                      tput field","value":"Type","css cla-
     A                                      ss":"constant","left":"590px","curs-
     A                                      or column":"46","top":"290px","curs-
     A                                      or row":"11","css class 2":"HI","cs-
     A                                      s class 3":"profound-converted","cs-
     A                                      s class 4":"subfile-heading"},{"id"-
     A                                      :"constant14","field type":"output -
     A                                      field","value":"Summary","css class-
     A                                      ":"constant","left":"720px","cursor-
     A                                       column":"65","top":"290px","cursor-
     A                                       row":"11","css class 2":"HI","css -
     A                                      class 3":"profound-converted","css -
     A                                      class 4":"subfile-heading"},{"id":"-
     A                                      SCR01S","field type":"grid","number-
     A                                       of columns":"6","record format nam-
     A                                      e":"SCR01S","subfile next changed":-
     A                                      {"fieldName":"08","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"display s-
     A                                      ubfile":{"fieldName":"04","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"d-
     A                                      isplay control record":{"fieldName"-
     A                                      :"N03","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"clear subfile":{"fie-
     A                                      ldName":"03","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"subfile size":-
     A                                      "13","place cursor":"true","header -
     A                                      height":"20","row height":"20","css-
     A                                       class":"subfilegrid","css class 2"-
     A                                      :"profound-converted","sub')
     A                                  1  8HTML('file end":{"fieldName":"95","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"page down response":{"fieldN-
     A                                      ame":"*IN01","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"page up response":{"fi-
     A                                      eldName":"*IN02","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"show paging contro-
     A                                      ls":"true","scrollbar":"none","numb-
     A                                      er of rows":"11","top":"290px","lef-
     A                                      t":"275px","column widths":"35,56,9-
     A                                      1,126,133,117","return mode":{"fiel-
     A                                      dName":"SFLMOD","dataLength":"1","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none"},"-
     A                                      subfile record number":{"fieldName"-
     A                                      :"SCRRN1","designValue":"[SCRRN1]",-
     A                                      "dataType":"zoned","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"true","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      dataLength":"4","decPos":"0"},"heig-
     A                                      ht":"220px","width":"559px"},{"id":-
     A                                      "btnSubmit","field type":"button","-
     A                                      value":"Enter","shortcut key":"Ente-
     A                                      r","left":"125px","top":"355px","wi-
     A                                      dth":"100px","height":"17px","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden"},{"id":"btnCF0-
     A                                      3","field type":"button","value":"F-
     A                                      3","left":"14px","top":"183px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden"},{"id":"btnCF05","field type-
     A                                      ":"button","value":"F5","left":"14p-
     A                                      x","top":"216px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault","visibility":"hidden"},{"id":-
     A                                      "btnCF06","field type":"button","va-
     A                                      lue":"F6","left":"14px","top":"249p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default","visibil-
     A                                      ity":"hidden"},{"id":"btnCF11","fie-
     A                                      ld type":"button","value":"F11","le-
     A                                      ft":"14px","top":"282px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      },{"id":"btnCF12","field type":"but-
     A                                      ton","value":"Cancel","shortcut key-
     A                                      ":"F12","left":"35px","top":"320px"-
     A                                      ,"width":"100px","height":"17px","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden"},{"id":"bt-
     A                                      nCF17","field type":"button","value-
     A                                      ":"F17","left":"14px","top":"348px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default","visibilit-
     A                                      y":"hidden"},{"id":"btnCF23","field-
     A                                       type":"button","value":"F23","left-
     A                                      ":"14px","top":"381px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default","visibility":"hidden"},-
     A                                      {"id":"btnCF24","field type":"butto-
     A                                      n","value":"F24","left":"14px","top-
     A                                      ":"414px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default","-
     A                                      visibility":"hidden"},{"id":"Panel1-
     A                                      ","field type":"panel","css class":-
     A                                      "dialog","value":"Revised Bill Adju-
     A                                      stments","left":"265px","top":"135p-
     A                                      x","width":"580px","height":"450px"-
     A                                      ,"panel style":"Transform Dialog","-
     A                                      z index":"8"},{"id":"BtnCancel","fi-
     A                                      eld type":"button","css class":"but-
     A                                      ton","value":"Cancel","left":"625px-
     A                                      ","top":"555px","width":"100px","cu-
     A                                      rsor":"default","parent tab panel":-
     A                                      "W0091F_SCR01C_MainTabPanel","paren-
     A                                      t tab":"0","shortcut key":"F12"},{"-
     A                                      id":"BtnNext","field type":"button"-
     A                                      ,"css class":"button","value":"Next-
     A                                      ","left":"735px","top":"555px","wid-
     A                                      th":"100px","cursor":"default","sho-
     A                                      rtcut key":"Enter"},{"id":"SCDBRR",-
     A                                      "field type":"output field","visibi-
     A                                      lity":"hidden","value":{"fieldName"-
     A                                      :"SCDBRR","designValue":"[SCDBRR]",-
     A                                      "dataType":"zoned","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"true","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      dataLength":"9","decPos":"0"},"left-
     A                                      ":"-58px","top":"-359px","width":"6-
     A                                      3px","text align":"right","css clas-
     A                                      s":"profound-converted","grid":"SCR-
     A                                      01S","column":"0"},{"id":"SCSTAT","-
     A                                      field type":"output field","visibil-
     A                                      ity":"hidden","value":{"fieldName":-
     A                                      "SCSTAT","designValue":"[SCSTAT]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none","-
     A                                      dataLength":"1"},"left":"-45px","to-
     A                                      p":"-359px","css class":"profound-c-
     A                                      onverted","grid":"SCR01S","column":-
     A                                      "0"},{"id":"SCSEL","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCSEL","designValue":"[SCSEL]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se","dataLength":"2"},"text transfo-
     A                                      rm":"uppercase","left":"5px","curso-
     A                                      r column":"2","top":"1px","cursor r-
     A                                      ow":"12","width":"15px","set focus"-
     A                                      :{"fieldName":"07","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},')
     A                                  1  9HTML('"css class 3":{"fieldName":"0-
     A                                      5","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"RI","custom-
     A                                      False":""},"description":"Selection-
     A                                       Field","css class 4":"profound-con-
     A                                      verted","grid":"SCR01S","column":"0-
     A                                      "},{"id":"SCDIV","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCD-
     A                                      IV","designValue":"[SCDIV]","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"999.00","dataLe-
     A                                      ngth":"5","decPos":"0"},"css class"-
     A                                      :"output-field","left":"5px","curso-
     A                                      r column":"7","top":"1px","cursor r-
     A                                      ow":"12","width":"35px","text align-
     A                                      ":"right","css class 2":"profound-c-
     A                                      onverted","grid":"SCR01S","column":-
     A                                      "1"},{"id":"SCPODT","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCPODT","designValue":"[SCPODT]","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00","da-
     A                                      taLength":"8","decPos":"0","edtWrd"-
     A                                      :"''  /  /    ''"},"css class":"out-
     A                                      put-field","left":"5px","cursor col-
     A                                      umn":"15","top":"1px","cursor row":-
     A                                      "12","width":"70px","text align":"r-
     A                                      ight","css class 2":"profound-conve-
     A                                      rted","grid":"SCR01S","column":"2"}-
     A                                      ,{"id":"SCAMT","field type":"output-
     A                                       field","value":{"fieldName":"SCAMT-
     A                                      ","designValue":"[SCAMT]","refField-
     A                                      ":"A112","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"true",-
     A                                      "zeroBalance":"true","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"-999.00"},"css class":"output-fi-
     A                                      eld","left":"5px","cursor column":"-
     A                                      28","top":"1px","cursor row":"12","-
     A                                      width":"105px","text align":"right"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      ,"grid":"SCR01S","column":"3"},{"id-
     A                                      ":"SCTYPE","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCTYPE","-
     A                                      designValue":"[SCTYPE]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"15"},"css class":"output-field"-
     A                                      ,"left":"5px","cursor column":"46",-
     A                                      "top":"1px","cursor row":"12","css -
     A                                      class 2":"profound-converted","grid-
     A                                      ":"SCR01S","column":"4"},{"id":"SCS-
     A                                      UM","field type":"output field","va-
     A                                      lue":{"fieldName":"SCSUM","designVa-
     A                                      lue":"[SCSUM]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"3"},"-
     A                                      css class":"output-field","left":"5-
     A                                      px","cursor column":"65","top":"1px-
     A                                      ","cursor row":"12","css class 2":"-
     A                                      profound-converted","grid":"SCR01S"-
     A                                      ,"column":"5"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEDN         44A  H
     A            SCOPL1        76A  H
     A            SCOPL2        76A  H
     A            SCPST1         5A  H
     A            SCPST2         1A  H
     A            SCPST3         1A  H
     A            SCPST4         1A  H
     A            SCPST5         1A  H
     A            SCPST6         1A  H
     A            SCPST7         1A  H
     A            SCPST8         1A  H
     A            SCPST9         1A  H
     A            SCRRN1         4S 0H
     A            SFLMOD         1A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCNAME    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR01
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","overlay range":"2-
     A                                      3-23"},"items":[{"id":"SCFKL2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      FKL2","designValue":"[SCFKL2]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"78"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"W0091F_SCR01_avKeys","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"AV_KEYS","dataLength"-
     A                                      :"1134","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[AV_KE-
     A                                      YS]"},"left":"0px","top":"0px","vis-
     A                                      ibility":"hidden"},{"id":"W0091F_SC-
     A                                      R01_action","field type":"html cont-
     A                                      ainer","white space":"normal","left-
     A                                      ":"0px","top":"10px","width":"230px-
     A                                      ","css class":"action-panel-convert-
     A                                      ed","height":"700px","html":"<div c-
     A                                      lass=\"top\"></div><div class=\"ima-
     A                                      getop\"><img src=\"/profoundui/user-
     A                                      data/images/bar_top.png\" /></div><-
     A                                      div class=\"menulinks\"></div><div -
     A                                      class=\"imagebottom\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_botto-
     A                                      m.png\" /></div><div class=\"bottom-
     A                                      \"></div>"},{"field type":"icon men-
     A                                      u button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"32px","z index":"20","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1170px"-
     A                                      ,"id":"W0091F_SCR01_BtnIconMenuSyst-
     A                                      emTools","tool tip":"System Tools",-
     A                                      "icon alignment":"middle left","ico-
     A                                      n width":"16px","icon height":"24px-
     A                                      ","icon source":"/profoundui/userda-
     A                                      ta/images/systool/systools.png","da-
     A                                      ta function":"SystemToolbarSystools-
     A                                      ","show down arrow":"Yes"},{"field -
     A                                      type":"panel","panel style":"Transf-
     A                                      ormButtonBar","id":"W0091F_SCR01_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"W0091F_SCR01_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"W0091F_SCR01_BtnRefresh"-
     A                                      ,"tool tip":"Refresh","onclick":"Sy-
     A                                      stemToolbarRefresh","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/refresh.png'')"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1092px","id":"W0091-
     A                                      F_SCR01_BtnSearch","tool tip":"Sear-
     A                                      ch","onclick":"SystemToolbarSearch"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/search.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1118-
     A                                      px","id":"W0091F_SCR01_BtnDiaryItem-
     A                                      s","tool tip":"Diary/Work Items - I-
     A                                      DARTS","onclick":"SystemToolbarDiar-
     A                                      y","background image":{"fieldName":-
     A                                      "DryIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden')
     A                                  1  4HTML('","locked in place":"true","l-
     A                                      eft":"1144px","id":"W0091F_SCR01_Bt-
     A                                      nSystemMessages","tool tip":"System-
     A                                       Messages","onclick":"SystemToolbar-
     A                                      Messages","background image":{"fiel-
     A                                      dName":"MsgIcnURL","dataLength":"12-
     A                                      8","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"}},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      96px","id":"W0091F_SCR01_BtnHelp","-
     A                                      tool tip":"Help","onclick":"SystemT-
     A                                      oolbarHelp","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/help.png'')"},{"id":"W0091F_SCR-
     A                                      01_ImgSysToolBottom","field type":"-
     A                                      image","image source":"/profoundui/-
     A                                      userdata/images/systool/butbarbot.p-
     A                                      ng","left":"1036px","top":"64px","w-
     A                                      idth":"187px","locked in place":"tr-
     A                                      ue","css class":"stationary","visib-
     A                                      ility":"hidden"},{"id":"W0091F_SCR0-
     A                                      1_MainTabPanel","field type":"tab p-
     A                                      anel","tab panel style":"Transform"-
     A                                      ,"tab names":"Tab 1","active tab":"-
     A                                      0","left":"250px","top":"70px","wid-
     A                                      th":"970px","height":"657px","z ind-
     A                                      ex":"8","locked in place":"true","c-
     A                                      ss class":"tab-panel","css class 2"-
     A                                      :"stationary"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0091F_SCR01_BtnHiddenSave","val-
     A                                      ue":"btnSave","top":"100px","respon-
     A                                      se":{"fieldName":"btnSave","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"W-
     A                                      0091F_SCR01_fkeyMenu","field type":-
     A                                      "menu","left":"10px","top":"120px",-
     A                                      "height":"350px","width":"230px","h-
     A                                      over background color":"#9AAA61","h-
     A                                      over text color":"#FFFFFF","border -
     A                                      color":"#4C6106","menu option inden-
     A                                      t":"10px","background color":"#758B-
     A                                      27","css class":"action-menu","css -
     A                                      class 2":"stationary","z index":"10-
     A                                      1"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W0091F_S-
     A                                      CR01_BtnHiddenRefresh","value":"btn-
     A                                      Refresh","top":"125px","response":{-
     A                                      "fieldName":"btnRefresh","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0091F_SCR01_BtnHidden-
     A                                      Search","value":"btnSearch","top":"-
     A                                      150px","response":{"fieldName":"btn-
     A                                      Search","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W009-
     A                                      1F_SCR01_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W0091F_SCR01_BtnHid-
     A                                      denSystemMessages","value":"btnMess-
     A                                      age","top":"200px","response":{"fie-
     A                                      ldName":"btnMessage","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0091F_SCR01_BtnHiddenWork-
     A                                      SubmitJob","value":"btnWrksbmjob","-
     A                                      top":"225px","response":{"fieldName-
     A                                      ":"btnWrkJob","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0091F_SCR01_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0091F_SCR01_BtnHiddenImageQueue","-
     A                                      value":"btnImgQue","top":"275px","r-
     A                                      esponse":{"fieldName":"btnImgQue","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","c')
     A                                  1  5HTML('ss class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0091F_SCR01_BtnHiddenHelp","valu-
     A                                      e":"btnHelp","top":"300px","respons-
     A                                      e":{"fieldName":"btnHelp","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"SC-
     A                                      FKL1","field type":"output field","-
     A                                      value":{"fieldName":"SCFKL1","desig-
     A                                      nValue":"[SCFKL1]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"none","dataLength":"78-
     A                                      "},"left":"281px","cursor column":"-
     A                                      2","top":"550px","cursor row":"23",-
     A                                      "css class":"BLU","parent tab panel-
     A                                      ":"W0091F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","visibility":"hidden","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"btnSubmit","field type":"but-
     A                                      ton","value":"Enter","shortcut key"-
     A                                      :"Enter","left":"14px","top":"150px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnPAGEDOWN","field type":"button","-
     A                                      value":"Page Down","shortcut key":"-
     A                                      PageDown","response":{"fieldName":"-
     A                                      *IN01","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"left":"14px","top":"183px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnP-
     A                                      AGEUP","field type":"button","value-
     A                                      ":"Page Up","shortcut key":"PageUp"-
     A                                      ,"response":{"fieldName":"*IN02","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"le-
     A                                      ft":"14px","top":"216px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFKL1        78A  H
     A            SCFKL2        78A  H
     A          R SCR02S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            SCDATA        70A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCSF1R         4S 0H
     A          R QSFLCTL002                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  01 02 13
     A  14 15                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR02S    5    RS-
     A                                      FLDSP    0    E1    3     14RSFLDSP-
     A                                      CTL 0    E1    3    N13RSFLCLR    0-
     A                                          E1    3     13RSFLPAG    1    C-
     A                                      2    14 RSFLSIZ    1    C2    15 1 -
     A                                         RSFLNXTCHG 0     2    ROVERLAY  -
     A                                       0     RROWS      2    C1    1C2   -
     A                                       21 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","overlay range":"-
     A                                      1-21"},"items":[{"id":"SCRRN2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      RRN2","designValue":"[SCRRN2]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"4","decPos":"0"},"left":"0-
     A                                      px","top":"-30px","width":"28px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted"},{"id":"W0091F_SCR-
     A                                      02C_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"W0091F_SCR02C_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"W0091F_SCR02C_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon alignment":"mi-
     A                                      ddle left","icon width":"16px","ico-
     A                                      n height":"24px","icon source":"/pr-
     A                                      ofoundui/userdata/images/systool/sy-
     A                                      stools.png","data function":"System-
     A                                      ToolbarSystools","show down arrow":-
     A                                      "Yes"},{"field type":"panel","panel-
     A                                       style":"TransformButtonBar","id":"-
     A                                      W0091F_SCR02C_ButtonBar","top":"35p-
     A                                      x","left":"1036px","width":"187px",-
     A                                      "height":"28px","css class":"statio-
     A                                      nary","visibility":"hidden","locked-
     A                                       in place":"true"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1040px","id":"W0091F_SCR02C_B-
     A                                      tnSave","tool tip":"Save","onclick"-
     A                                      :"SystemToolbarSave","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/save.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1066px","id":"W0091F_-
     A                                      SCR02C_BtnRefresh","tool tip":"Refr-
     A                                      esh","onclick":"SystemToolbarRefres-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/refre-
     A                                      sh.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      092px","id":"W0091F_SCR02C_BtnSearc-
     A                                      h","tool tip":"Search","onclick":"S-
     A                                      ystemToolbarSearch","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/search.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1118px","id":"W0091F-
     A                                      _SCR02C_BtnDiaryItems","tool tip":"-
     A                                      Diary/Work Items - IDARTS","onclick-
     A                                      ":"SystemToolbarDiary","background -
     A                                      image":{"fieldName":"DryIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","bord')
     A                                  1  4HTML('er bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1144px","-
     A                                      id":"W0091F_SCR02C_BtnSystemMessage-
     A                                      s","tool tip":"System Messages","on-
     A                                      click":"SystemToolbarMessages","bac-
     A                                      kground image":{"fieldName":"MsgIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1196px","id":"W0-
     A                                      091F_SCR02C_BtnHelp","tool tip":"He-
     A                                      lp","onclick":"SystemToolbarHelp","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/help.png'-
     A                                      ')"},{"id":"W0091F_SCR02C_ImgSysToo-
     A                                      lBottom","field type":"image","imag-
     A                                      e source":"/profoundui/userdata/ima-
     A                                      ges/systool/butbarbot.png","left":"-
     A                                      1036px","top":"64px","width":"187px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en"},{"id":"W0091F_SCR02C_MainTabPa-
     A                                      nel","field type":"tab panel","tab -
     A                                      panel style":"Transform","tab names-
     A                                      ":{"fieldName":"SCPRD2","designValu-
     A                                      e":"[SCPRD2]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"active tab":"0","left":"250px"-
     A                                      ,"top":"70px","width":"970px","heig-
     A                                      ht":"657px","z index":"8","locked i-
     A                                      n place":"true","css class":"tab-pa-
     A                                      nel","css class 2":"stationary"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0091F_SCR02C_-
     A                                      BtnHiddenSave","value":"btnSave","t-
     A                                      op":"100px","response":{"fieldName"-
     A                                      :"btnSave","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant15","fiel-
     A                                      d type":"output field","left":"281p-
     A                                      x","cursor column":"2","top":"110px-
     A                                      ","cursor row":"1","css class":"top-
     A                                      -line","value":"js: currentUser()",-
     A                                      "css class 2":"output-field","paren-
     A                                      t tab panel":"W0091F_SCR02C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"SCR-
     A                                      02C_SCCONM","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCCONM",-
     A                                      "designValue":"[SCCONM]","refField"-
     A                                      :"NAME","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"414px","cursor colum-
     A                                      n":"21","top":"110px","cursor row":-
     A                                      "1","css class 2":"top-line","css c-
     A                                      lass 3":"HI","parent tab panel":"W0-
     A                                      091F_SCR02C_MainTabPanel","parent t-
     A                                      ab":"0","css class 4":"profound-con-
     A                                      verted"},{"id":"constant16","field -
     A                                      type":"output field","left":"778px"-
     A                                      ,"cursor column":"73","top":"110px"-
     A                                      ,"cursor row":"1","css class":"top--
     A                                      line","value":"js: currentDate()","-
     A                                      css class 2":"output-field","parent-
     A                                       tab panel":"W0091F_SCR02C_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"W009-
     A                                      1F_SCR02C_fkeyMenu","field type":"m-
     A                                      enu","left":"10px","top":"120px","h-
     A                                      eight":"350px","width":"230px","hov-
     A                                      er background color":"#9AAA61","hov-
     A                                      er text color":"#FFFFFF","border co-
     A                                      lor":"#4C6106","menu option indent"-
     A                                      :"10px","background color":"#758B27-
     A                                      ","css class":"action-menu","css cl-
     A                                      ass 2":"stationary","z index":"101"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W0091F_SCR-
     A                                      02C_BtnHiddenRefresh","value":"btnR-
     A                                      efresh","top":"125px","response":{"-
     A                                      fieldName":"btnRefresh","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"SCR0-
     A                                      2C_Q1PGM","field type":"output fiel-
     A                                      d","value":{"fieldName":"Q1PGM","de-
     A                                      signValue":"[Q1PGM]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none","dataLength":-
     A                                      "10"},"css class":"output-field","l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"130px","cursor row":"2","paren-
     A                                      t tab panel":"W0091F_SCR02C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCP-
     A                                      RD2","field type":"output field","v-
     A                                      alue":{"fieldName":"SCPRD2","design-
     A                                      Value":"[SCPRD2]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"130px","cursor row":"2","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "W0091F_SCR02C_MainTabPane')
     A                                  1  5HTML('l","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant17","field type":"output fie-
     A                                      ld","value":"SCR02","css class":"co-
     A                                      nstant","left":"799px","cursor colu-
     A                                      mn":"76","top":"130px","cursor row"-
     A                                      :"2","parent tab panel":"W0091F_SCR-
     A                                      02C_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0091F_SCR0-
     A                                      2C_BtnHiddenSearch","value":"btnSea-
     A                                      rch","top":"150px","response":{"fie-
     A                                      ldName":"btnSearch","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      18","field type":"output field","va-
     A                                      lue":"Press Enter to confirm your c-
     A                                      hoices for 4=Delete.","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"170px","cursor row-
     A                                      ":"4","css class 2":"BLU","parent t-
     A                                      ab panel":"W0091F_SCR02C_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0091F_SCR02C_BtnHiddenDi-
     A                                      aryItems","value":"btnDiary","top":-
     A                                      "175px","response":{"fieldName":"bt-
     A                                      nDiary","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant19","field t-
     A                                      ype":"output field","value":"Press -
     A                                      F12 to return to change your choice-
     A                                      s.","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      90px","cursor row":"5","css class 2-
     A                                      ":"BLU","parent tab panel":"W0091F_-
     A                                      SCR02C_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W0091F_S-
     A                                      CR02C_BtnHiddenSystemMessages","val-
     A                                      ue":"btnMessage","top":"200px","res-
     A                                      ponse":{"fieldName":"btnMessage","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0091F_SCR02C_-
     A                                      BtnHiddenWorkSubmitJob","value":"bt-
     A                                      nWrksbmjob","top":"225px","response-
     A                                      ":{"fieldName":"btnWrkJob","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"S-
     A                                      CHDL1","field type":"output field",-
     A                                      "value":{"fieldName":"SCHDL1","desi-
     A                                      gnValue":"[SCHDL1]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none","dataLength":"7-
     A                                      8"},"left":"281px","cursor column":-
     A                                      "2","top":"230px","cursor row":"7",-
     A                                      "css class":"HI","parent tab panel"-
     A                                      :"W0091F_SCR02C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted","css class 3":"subfile--
     A                                      heading"},{"id":"SCR02S","field typ-
     A                                      e":"grid","number of columns":"2","-
     A                                      record format name":"SCR02S","subfi-
     A                                      le next changed":"true","display su-
     A                                      bfile":{"fieldName":"14","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"di-
     A                                      splay control record":{"fieldName":-
     A                                      "N13","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"clear subfile":{"fiel-
     A                                      dName":"13","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"subfile size":"-
     A                                      15","header height":"20","row heigh-
     A                                      t":"20","css class":"subfilegrid","-
     A                                      css class 2":"profound-converted","-
     A                                      parent tab panel":"W0091F_SCR02C_Ma-
     A                                      inTabPanel","parent tab":"0","subfi-
     A                                      le end":{"fieldName":"N15","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      page down response":{"fieldName":"*-
     A                                      IN01","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"page up response":{"fieldName-
     A                                      ":"*IN02","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"show paging controls":"tr-
     A                                      ue","scrollbar":"none","number of r-
     A                                      ows":"15","top":"230px","left":"276-
     A                                      px","column widths":"35,525","subfi-
     A                                      le record number":{"fieldName":"SCR-
     A                                      RN2","designValue":"[SCRRN2]","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"tr-
     A                                      ue","zeroFill":"true","curSym":"","-
     A                                      units":"","negNum":"-999.00","dataL-
     A                                      ength":"4","decPos":"0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"W0091F_SCR02C_BtnHidd-
     A                                      enWorkPrinterOutput","value":"btnWr-
     A                                      kprtout","top":"250px","response":{-
     A                                      "fieldName":"btnWrkPrnt","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","')
     A                                  1  6HTML('locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W0091F_-
     A                                      SCR02C_BtnHiddenImageQueue","value"-
     A                                      :"btnImgQue","top":"302px","respons-
     A                                      e":{"fieldName":"btnImgQue","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W0091F_SCR02C_BtnHi-
     A                                      ddenHelp","value":"btnHelp","top":"-
     A                                      327px","response":{"fieldName":"btn-
     A                                      Help","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"btnSubmit","field type-
     A                                      ":"button","value":"Enter","shortcu-
     A                                      t key":"Enter","left":"14px","top":-
     A                                      "150px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnCF12","field type":"button"-
     A                                      ,"value":"Cancel","shortcut key":"F-
     A                                      12","left":"14px","top":"183px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"SCR02S-
     A                                      _SCDBRR","field type":"output field-
     A                                      ","visibility":"hidden","value":{"f-
     A                                      ieldName":"SCDBRR","designValue":"[-
     A                                      SCDBRR]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","dataLength":"9","decPos":"-
     A                                      0"},"left":"-58px","top":"-279px","-
     A                                      width":"63px","text align":"right",-
     A                                      "css class":"profound-converted","g-
     A                                      rid":"SCR02S","column":"0"},{"id":"-
     A                                      SCSF1R","field type":"output field"-
     A                                      ,"visibility":"hidden","value":{"fi-
     A                                      eldName":"SCSF1R","designValue":"[S-
     A                                      CSF1R]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"true",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","dataLength":"4","decPos":"0-
     A                                      "},"left":"-23px","top":"-279px","w-
     A                                      idth":"28px","text align":"right","-
     A                                      css class":"profound-converted","gr-
     A                                      id":"SCR02S","column":"0"},{"id":"S-
     A                                      CR02S_SCSEL","field type":"output f-
     A                                      ield","value":{"fieldName":"SCSEL",-
     A                                      "designValue":"[SCSEL]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"2"},"css class":"output-field",-
     A                                      "left":"5px","cursor column":"2","t-
     A                                      op":"1px","cursor row":"8","descrip-
     A                                      tion":"Selection Field","css class -
     A                                      2":"profound-converted","grid":"SCR-
     A                                      02S","column":"0"},{"id":"SCDATA","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCDATA","designValue"-
     A                                      :"[SCDATA]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none","dataLength":"70"},"cs-
     A                                      s class":"output-field","left":"5px-
     A                                      ","cursor column":"7","top":"1px","-
     A                                      cursor row":"8","css class 2":"prof-
     A                                      ound-converted","grid":"SCR02S","co-
     A                                      lumn":"1"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        78A  H
     A            SCRRN2         4S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRD2    R        H      REFFLD(NAME)
     A          R SCR02
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"23-23"},"items":[{-
     A                                      "id":"W0091F_SCR02_avKeys","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"AV_KEYS","dataLength":"1134"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[AV_KEYS]"},"-
     A                                      left":"0px","top":"0px","visibility-
     A                                      ":"hidden"},{"id":"W0091F_SCR02_act-
     A                                      ion","field type":"html container",-
     A                                      "white space":"normal","left":"0px"-
     A                                      ,"top":"10px","width":"230px","css -
     A                                      class":"action-panel-converted","he-
     A                                      ight":"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_bottom.png\"-
     A                                       /></div><div class=\"bottom\"></di-
     A                                      v>"},{"field type":"icon menu butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"32px-
     A                                      ","z index":"20","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1170px","id":"-
     A                                      W0091F_SCR02_BtnIconMenuSystemTools-
     A                                      ","tool tip":"System Tools","icon a-
     A                                      lignment":"middle left","icon width-
     A                                      ":"16px","icon height":"24px","icon-
     A                                       source":"/profoundui/userdata/imag-
     A                                      es/systool/systools.png","data func-
     A                                      tion":"SystemToolbarSystools","show-
     A                                       down arrow":"Yes"},{"field type":"-
     A                                      panel","panel style":"TransformButt-
     A                                      onBar","id":"W0091F_SCR02_ButtonBar-
     A                                      ","top":"35px","left":"1036px","wid-
     A                                      th":"187px","height":"28px","css cl-
     A                                      ass":"stationary","visibility":"hid-
     A                                      den","locked in place":"true"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1040px","id":"W00-
     A                                      91F_SCR02_BtnSave","tool tip":"Save-
     A                                      ","onclick":"SystemToolbarSave","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/save.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1066px","i-
     A                                      d":"W0091F_SCR02_BtnRefresh","tool -
     A                                      tip":"Refresh","onclick":"SystemToo-
     A                                      lbarRefresh","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/refresh.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1092px","id":"W0091F_SCR02-
     A                                      _BtnSearch","tool tip":"Search","on-
     A                                      click":"SystemToolbarSearch","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/search.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1118px","id-
     A                                      ":"W0091F_SCR02_BtnDiaryItems","too-
     A                                      l tip":"Diary/Work Items - IDARTS",-
     A                                      "onclick":"SystemToolbarDiary","bac-
     A                                      kground image":{"fieldName":"DryIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1144px","id":"W0-
     A                                      091F_SCR02_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting"')
     A                                  1  4HTML(':"Text","textTransform":"none-
     A                                      "}},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1196px","-
     A                                      id":"W0091F_SCR02_BtnHelp","tool ti-
     A                                      p":"Help","onclick":"SystemToolbarH-
     A                                      elp","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/hel-
     A                                      p.png'')"},{"id":"W0091F_SCR02_ImgS-
     A                                      ysToolBottom","field type":"image",-
     A                                      "image source":"/profoundui/userdat-
     A                                      a/images/systool/butbarbot.png","le-
     A                                      ft":"1036px","top":"64px","width":"-
     A                                      187px","locked in place":"true","cs-
     A                                      s class":"stationary","visibility":-
     A                                      "hidden"},{"id":"W0091F_SCR02_MainT-
     A                                      abPanel","field type":"tab panel","-
     A                                      tab panel style":"Transform","tab n-
     A                                      ames":"Tab 1","active tab":"0","lef-
     A                                      t":"250px","top":"70px","width":"97-
     A                                      0px","height":"657px","z index":"8"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"tab-panel","css class 2":"stati-
     A                                      onary"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W009-
     A                                      1F_SCR02_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"W0091F_S-
     A                                      CR02_fkeyMenu","field type":"menu",-
     A                                      "left":"10px","top":"120px","height-
     A                                      ":"350px","width":"230px","hover ba-
     A                                      ckground color":"#9AAA61","hover te-
     A                                      xt color":"#FFFFFF","border color":-
     A                                      "#4C6106","menu option indent":"10p-
     A                                      x","background color":"#758B27","cs-
     A                                      s class":"action-menu","css class 2-
     A                                      ":"stationary","z index":"101"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0091F_SCR02_Bt-
     A                                      nHiddenRefresh","value":"btnRefresh-
     A                                      ","top":"125px","response":{"fieldN-
     A                                      ame":"btnRefresh","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0091F_SCR02_BtnHiddenSearch"-
     A                                      ,"value":"btnSearch","top":"150px",-
     A                                      "response":{"fieldName":"btnSearch"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0091F_SCR0-
     A                                      2_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0091F_SCR02_BtnHiddenSyst-
     A                                      emMessages","value":"btnMessage","t-
     A                                      op":"200px","response":{"fieldName"-
     A                                      :"btnMessage","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W0091F_SCR02_BtnHiddenWorkSubmitJ-
     A                                      ob","value":"btnWrksbmjob","top":"2-
     A                                      25px","response":{"fieldName":"btnW-
     A                                      rkJob","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0091-
     A                                      F_SCR02_BtnHiddenWorkPrinterOutput"-
     A                                      ,"value":"btnWrkprtout","top":"250p-
     A                                      x","response":{"fieldName":"btnWrkP-
     A                                      rnt","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W0091F_-
     A                                      SCR02_BtnHiddenImageQueue","value":-
     A                                      "btnImgQue","top":"275px","response-
     A                                      ":{"fieldName":"btnImgQue","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0091F_SCR02_BtnHidd-
     A                                      enHelp","value":"btnHelp","top":"30-
     A                                      0px","response":{"fieldName":"btnHe-
     A                                      lp","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px"')
     A                                  1  5HTML(',"top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnPAGEDOWN","fie-
     A                                      ld type":"button","value":"Page Dow-
     A                                      n","shortcut key":"PageDown","respo-
     A                                      nse":{"fieldName":"*IN01","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"left":"14-
     A                                      px","top":"183px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnPAGEUP","field ty-
     A                                      pe":"button","value":"Page Up","sho-
     A                                      rtcut key":"PageUp","response":{"fi-
     A                                      eldName":"*IN02","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"left":"14px","top"-
     A                                      :"216px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"}]}-
     A                                      ')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR03
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    RWINDOW    0     -
     A                                      RROWS      2    C1    1C1    9 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"4","overlay ra-
     A                                      nge":"1-9"},"items":[{"id":"SCR03",-
     A                                      "field type":"panel","panel style":-
     A                                      "Transform Dialog","text align":"ce-
     A                                      nter","left":"5px","top":"5px","hei-
     A                                      ght":"330px","width":"534px","z ind-
     A                                      ex":"8","locked in place":"true"},{-
     A                                      "id":"constant20","field type":"out-
     A                                      put field","left":"29px","cursor co-
     A                                      lumn":"2","top":"65px","cursor row"-
     A                                      :"1","value":"js: currentUser()","c-
     A                                      ss class":"output-field","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      PRD3","field type":"output field","-
     A                                      value":{"fieldName":"SCPRD3","desig-
     A                                      nValue":"[SCPRD3]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"127px","cursor column":"16-
     A                                      ","top":"65px","cursor row":"1","cs-
     A                                      s class 2":"HI","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant21"-
     A                                      ,"field type":"output field","value-
     A                                      ":"SCR03","css class":"constant","l-
     A                                      eft":"477px","cursor column":"66","-
     A                                      top":"65px","cursor row":"1","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant22","field type":"output -
     A                                      field","value":"Type choices, press-
     A                                       Enter.","css class":"constant","le-
     A                                      ft":"29px","cursor column":"2","top-
     A                                      ":"105px","cursor row":"3","css cla-
     A                                      ss 2":"BLU","css class 3":"profound-
     A                                      -converted"},{"id":"btnSubmit","fie-
     A                                      ld type":"button","value":"Enter","-
     A                                      shortcut key":"Enter","left":"14px"-
     A                                      ,"top":"290px","width":"80px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF12","field type":"b-
     A                                      utton","value":"Cancel","shortcut k-
     A                                      ey":"F12","left":"104px","top":"290-
     A                                      px","width":"80px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnPAGEDOWN","field type":"button",-
     A                                      "value":"Page Down","shortcut key":-
     A                                      "PageDown","response":{"fieldName":-
     A                                      "*IN01","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"left":"194px","top":"290px"-
     A                                      ,"width":"80px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","visibility":"hidden","cursor"-
     A                                      :"default"},{"id":"btnPAGEUP","fiel-
     A                                      d type":"button","value":"Page Up",-
     A                                      "shortcut key":"PageUp","response":-
     A                                      {"fieldName":"*IN02","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"left":"284px",-
     A                                      "top":"290px","width":"80px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","visibility":"hid-
     A                                      den","cursor":"default"}]}')
     A            SCPRD3    R        H      REFFLD(NAME)
     A          R MSGSFL                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            MSGKEY         4A  H
     A            Q1PGM         10A  H
     A          R QSFLCTL003                SFLCTL(MSGSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLMSGSFLC')
     A          R MSGSFLC
     A  01 02 10                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    MSGSFL    6    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LINZ    0     RSFLPAG    1    C1   -
     A                                       1 RSFLSIZ    1    C1    5 FQ1PGM  -
     A                                         SFLPGMQ   0     2    FMSGKEY    -
     A                                      SFLMSGKEY 0     FQ1PGM     SFLPGMQ -
     A                                        0     1    RROWS      2    C2    -
     A                                      24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"MSGSFLC","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","overlay range":"24-24"},"items":-
     A                                      [{"id":"W0091F_MSGSFLC_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"W0091F_MSGSF-
     A                                      LC_action","field type":"html conta-
     A                                      iner","white space":"normal","left"-
     A                                      :"0px","top":"10px","width":"230px"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","height":"700px","html":"<div cl-
     A                                      ass=\"top\"></div><div class=\"imag-
     A                                      etop\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_top.png\" /></div><d-
     A                                      iv class=\"menulinks\"></div><div c-
     A                                      lass=\"imagebottom\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_bottom-
     A                                      .png\" /></div><div class=\"bottom\-
     A                                      "></div>"},{"field type":"icon menu-
     A                                       button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"32px","z index":"20","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1170px",-
     A                                      "id":"W0091F_MSGSFLC_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon alignment":"middle left","ic-
     A                                      on width":"16px","icon height":"24p-
     A                                      x","icon source":"/profoundui/userd-
     A                                      ata/images/systool/systools.png","d-
     A                                      ata function":"SystemToolbarSystool-
     A                                      s","show down arrow":"Yes"},{"field-
     A                                       type":"panel","panel style":"Trans-
     A                                      formButtonBar","id":"W0091F_MSGSFLC-
     A                                      _ButtonBar","top":"35px","left":"10-
     A                                      36px","width":"187px","height":"28p-
     A                                      x","css class":"stationary","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1040px"-
     A                                      ,"id":"W0091F_MSGSFLC_BtnSave","too-
     A                                      l tip":"Save","onclick":"SystemTool-
     A                                      barSave","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /save.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1066px","id":"W0091F_MSGSFLC_BtnR-
     A                                      efresh","tool tip":"Refresh","oncli-
     A                                      ck":"SystemToolbarRefresh","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/refresh.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1092px","id"-
     A                                      :"W0091F_MSGSFLC_BtnSearch","tool t-
     A                                      ip":"Search","onclick":"SystemToolb-
     A                                      arSearch","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/search.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1118px","id":"W0091F_MSGSFLC_B-
     A                                      tnDiaryItems","tool tip":"Diary/Wor-
     A                                      k Items - IDARTS","onclick":"System-
     A                                      ToolbarDiary","background image":{"-
     A                                      fieldName":"DryIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1144px","id":"W0091F_MSGSFLC_BtnS-
     A                                      ystemMessages","tool tip":"System M-
     A                                      essages","onclick":"SystemToolbarMe-
     A                                      ssages","background image":{"fieldN-
     A                                      ame":"MsgIcnURL","dataLength":"128"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType"')
     A                                  1  4HTML(':"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"W0091F_MSG-
     A                                      SFLC_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"W0091F_MSGSFLC_ImgSysToolBotto-
     A                                      m","field type":"image","image sour-
     A                                      ce":"/profoundui/userdata/images/sy-
     A                                      stool/butbarbot.png","left":"1036px-
     A                                      ","top":"64px","width":"187px","loc-
     A                                      ked in place":"true","css class":"s-
     A                                      tationary","visibility":"hidden"},{-
     A                                      "id":"W0091F_MSGSFLC_MainTabPanel",-
     A                                      "field type":"tab panel","tab panel-
     A                                       style":"Transform","tab names":"Ta-
     A                                      b 1","active tab":"0","left":"250px-
     A                                      ","top":"70px","width":"970px","hei-
     A                                      ght":"657px","z index":"8","locked -
     A                                      in place":"true","css class":"tab-p-
     A                                      anel","css class 2":"stationary"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W0091F_MSGSFL-
     A                                      C_BtnHiddenSave","value":"btnSave",-
     A                                      "top":"100px","response":{"fieldNam-
     A                                      e":"btnSave","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"W0091F_MSGSFLC_-
     A                                      fkeyMenu","field type":"menu","left-
     A                                      ":"10px","top":"120px","height":"35-
     A                                      0px","width":"230px","hover backgro-
     A                                      und color":"#9AAA61","hover text co-
     A                                      lor":"#FFFFFF","border color":"#4C6-
     A                                      106","menu option indent":"10px","b-
     A                                      ackground color":"#758B27","css cla-
     A                                      ss":"action-menu","css class 2":"st-
     A                                      ationary","z index":"101"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0091F_MSGSFLC_BtnHi-
     A                                      ddenRefresh","value":"btnRefresh","-
     A                                      top":"125px","response":{"fieldName-
     A                                      ":"btnRefresh","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0091F_MSGSFLC_BtnHiddenSearch",-
     A                                      "value":"btnSearch","top":"150px","-
     A                                      response":{"fieldName":"btnSearch",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0091F_MSGSF-
     A                                      LC_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0091F_MSGSFLC_BtnHiddenS-
     A                                      ystemMessages","value":"btnMessage"-
     A                                      ,"top":"200px","response":{"fieldNa-
     A                                      me":"btnMessage","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0091F_MSGSFLC_BtnHiddenWorkSu-
     A                                      bmitJob","value":"btnWrksbmjob","to-
     A                                      p":"225px","response":{"fieldName":-
     A                                      "btnWrkJob","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0091F_MSGSFLC_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0091F_MSGSFLC_BtnHiddenImageQueue"-
     A                                      ,"value":"btnImgQue","top":"275px",-
     A                                      "response":{"fieldName":"btnImgQue"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0091F_MSGS-
     A                                      FLC_BtnHiddenHelp","value":"btnHelp-
     A                                      ","top":"300px","response":{"fieldN-
     A                                      ame":"btnHelp","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"MSGSFL","fiel-
     A                                      d type":"grid","number of ')
     A                                  1  5HTML('columns":"1","record format n-
     A                                      ame":"MSGSFL","display subfile":"tr-
     A                                      ue","display control record":"true"-
     A                                      ,"subfile size":"5","initialize sub-
     A                                      file":"true","row height":"20","css-
     A                                       class":"subfilegrid","css class 2"-
     A                                      :"profound-converted","parent tab p-
     A                                      anel":"W0091F_MSGSFLC_MainTabPanel"-
     A                                      ,"parent tab":"0","subfile end":{"f-
     A                                      ieldName":"N10","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"number of r-
     A                                      ows":"1","has header":"false","subf-
     A                                      ile program message queue":{"fieldN-
     A                                      ame":"Q1PGM","dataLength":"10","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"},"su-
     A                                      bfile control program message queue-
     A                                      ":{"fieldName":"Q1PGM","dataLength"-
     A                                      :"10","trimLeading":"false","trimTr-
     A                                      ailing":"true","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"},"subfile message key":{"fiel-
     A                                      dName":"MSGKEY","dataLength":"4","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"},"-
     A                                      top":"570px","left":"269px","column-
     A                                       widths":"595"},{"id":"btnSubmit","-
     A                                      field type":"button","value":"Enter-
     A                                      ","shortcut key":"Enter","left":"14-
     A                                      px","top":"150px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnPAGEDOWN","field -
     A                                      type":"button","value":"Page Down",-
     A                                      "shortcut key":"PageDown","response-
     A                                      ":{"fieldName":"*IN01","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"left":"14px"-
     A                                      ,"top":"183px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnPAGEUP","field type"-
     A                                      :"button","value":"Page Up","shortc-
     A                                      ut key":"PageUp","response":{"field-
     A                                      Name":"*IN02","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"left":"14px","top":"2-
     A                                      16px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
