     A                                      REF(*LIBL/WREFP)
     A          R SCR01
     A  50                                  CA01(50 'Response Indicator *IN50')
     A                                  1  2HTML('QPUIREC4    RROWS      2    C-
     A                                      1    1C2    23 RERRMSG    3    C5  -
     A                                        SCJOBC16   Record not foundC5    -
     A                                      *IN50E1    3     50RERRMSG    3    -
     A                                      C6    SCJOBNC16   Record not foundC-
     A                                      5    *IN50E1    3     50RERRMSG    -
     A                                      3    C6    SCUSERC16   Record not f-
     A                                      oundC5    *IN50E1    3     50')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"W0105F_SCR01_avKeys","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"AV_KEYS","dataLength":"1134",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[AV_KEYS]"},"l-
     A                                      eft":"0px","top":"0px","visibility"-
     A                                      :"hidden"},{"id":"W0105F_SCR01_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"W-
     A                                      0105F_SCR01_BtnIconMenuSystemTools"-
     A                                      ,"tool tip":"System Tools","icon al-
     A                                      ignment":"middle left","icon width"-
     A                                      :"16px","icon height":"24px","icon -
     A                                      source":"/profoundui/userdata/image-
     A                                      s/systool/systools.png","data funct-
     A                                      ion":"SystemToolbarSystools","show -
     A                                      down arrow":"Yes"},{"field type":"p-
     A                                      anel","panel style":"TransformButto-
     A                                      nBar","id":"W0105F_SCR01_ButtonBar"-
     A                                      ,"top":"35px","left":"1036px","widt-
     A                                      h":"187px","height":"28px","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en","locked in place":"true"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1040px","id":"W010-
     A                                      5F_SCR01_BtnSave","tool tip":"Save"-
     A                                      ,"onclick":"SystemToolbarSave","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/save.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1066px","id-
     A                                      ":"W0105F_SCR01_BtnRefresh","tool t-
     A                                      ip":"Refresh","onclick":"SystemTool-
     A                                      barRefresh","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/refresh.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1092px","id":"W0105F_SCR01_-
     A                                      BtnSearch","tool tip":"Search","onc-
     A                                      lick":"SystemToolbarSearch","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/search.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1118px","id"-
     A                                      :"W0105F_SCR01_BtnDiaryItems","tool-
     A                                       tip":"Diary/Work Items - IDARTS","-
     A                                      onclick":"SystemToolbarDiary","back-
     A                                      ground image":{"fieldName":"DryIcnU-
     A                                      RL","dataLength":"128","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"}},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1144px","id":"W01-
     A                                      05F_SCR01_BtnSystemMessages","tool -
     A                                      tip":"System Messages","onclick":"S-
     A                                      ystemToolbarMessages","background i-
     A                                      mage":{"fieldName":"MsgIcnURL","dat-
     A                                      aLength":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":')
     A                                  1  4HTML('"Text","textTransform":"none"-
     A                                      }},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1196px","i-
     A                                      d":"W0105F_SCR01_BtnHelp","tool tip-
     A                                      ":"Help","onclick":"SystemToolbarHe-
     A                                      lp","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/help-
     A                                      .png'')"},{"id":"W0105F_SCR01_ImgSy-
     A                                      sToolBottom","field type":"image","-
     A                                      image source":"/profoundui/userdata-
     A                                      /images/systool/butbarbot.png","lef-
     A                                      t":"1036px","top":"64px","width":"1-
     A                                      87px","locked in place":"true","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden"},{"id":"W0105F_SCR01_MainTa-
     A                                      bPanel","field type":"tab panel","t-
     A                                      ab panel style":"Transform","tab na-
     A                                      mes":"Tab 1","active tab":"0","left-
     A                                      ":"250px","top":"70px","width":"970-
     A                                      px","height":"657px","z index":"8",-
     A                                      "locked in place":"true","css class-
     A                                      ":"tab-panel","css class 2":"statio-
     A                                      nary"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0105-
     A                                      F_SCR01_BtnHiddenSave","value":"btn-
     A                                      Save","top":"100px","response":{"fi-
     A                                      eldName":"btnSave","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant1-
     A                                      ","field type":"output field","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"110px","cursor row":"1","css clas-
     A                                      s":"top-line","value":"js: currentU-
     A                                      ser()","css class 2":"output-field"-
     A                                      ,"parent tab panel":"W0105F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"SCCONM","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCCONM","-
     A                                      designValue":"[SCCONM]","refField":-
     A                                      "NAME","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"414px","cursor column-
     A                                      ":"21","top":"110px","cursor row":"-
     A                                      1","css class 2":"top-line","css cl-
     A                                      ass 3":"HI","parent tab panel":"W01-
     A                                      05F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 4":"profound-conve-
     A                                      rted"},{"id":"constant2","field typ-
     A                                      e":"output field","left":"778px","c-
     A                                      ursor column":"73","top":"110px","c-
     A                                      ursor row":"1","css class":"top-lin-
     A                                      e","value":"js: currentDate()","css-
     A                                       class 2":"output-field","parent ta-
     A                                      b panel":"W0105F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"W0105F_S-
     A                                      CR01_fkeyMenu","field type":"menu",-
     A                                      "left":"10px","top":"120px","height-
     A                                      ":"350px","width":"230px","hover ba-
     A                                      ckground color":"#9AAA61","hover te-
     A                                      xt color":"#FFFFFF","border color":-
     A                                      "#4C6106","menu option indent":"10p-
     A                                      x","background color":"#758B27","cs-
     A                                      s class":"action-menu","css class 2-
     A                                      ":"stationary","z index":"101"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0105F_SCR01_Bt-
     A                                      nHiddenRefresh","value":"btnRefresh-
     A                                      ","top":"125px","response":{"fieldN-
     A                                      ame":"btnRefresh","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"Q1PGM","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"Q1PGM","designValue":"[-
     A                                      Q1PGM]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none","dataLength":"10"},"css cl-
     A                                      ass":"output-field","left":"281px",-
     A                                      "cursor column":"2","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "W0105F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant5","field-
     A                                       type":"output field","value":"RECO-
     A                                      RD IN USE MAINTENANCE","css class":-
     A                                      "constant","left":"463px","cursor c-
     A                                      olumn":"28","top":"130px","cursor r-
     A                                      ow":"2","css class 2":"HI","parent -
     A                                      tab panel":"W0105F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt3","field type":"output field","v-
     A                                      alue":"SCR01","css class":"constant-
     A                                      ","left":"799px","cursor column":"7-
     A                                      6","top":"130px","cursor row":"2","-
     A                                      parent tab panel":"W0105F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0105F_SCR01_BtnHi-
     A                                      ddenSearch","value":"btnSearch","to-
     A                                      p":"150px","response":{"fieldName":-
     A                                      "btnSearch","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cu')
     A                                  1  5HTML('rsor":"default","visibility":-
     A                                      "hidden","id":"W0105F_SCR01_BtnHidd-
     A                                      enDiaryItems","value":"btnDiary","t-
     A                                      op":"175px","response":{"fieldName"-
     A                                      :"btnDiary","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0105F_SCR01_BtnHiddenSystemMessage-
     A                                      s","value":"btnMessage","top":"200p-
     A                                      x","response":{"fieldName":"btnMess-
     A                                      age","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"constant4","field type"-
     A                                      :"output field","value":"Type infor-
     A                                      mation, press Enter","css class":"c-
     A                                      onstant","left":"281px","cursor col-
     A                                      umn":"2","top":"210px","cursor row"-
     A                                      :"6","css class 2":"BLU","parent ta-
     A                                      b panel":"W0105F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W0105F_SCR01_BtnHiddenWorkS-
     A                                      ubmitJob","value":"btnWrksbmjob","t-
     A                                      op":"225px","response":{"fieldName"-
     A                                      :"btnWrkJob","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W0105F_SCR01_BtnHiddenWorkPrinterO-
     A                                      utput","value":"btnWrkprtout","top"-
     A                                      :"250px","response":{"fieldName":"b-
     A                                      tnWrkPrnt","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant6","field-
     A                                       type":"output field","value":"Job -
     A                                      name             :","css class":"co-
     A                                      nstant","left":"323px","cursor colu-
     A                                      mn":"8","top":"270px","cursor row":-
     A                                      "9","parent tab panel":"W0105F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCJOB","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCJ-
     A                                      OB","designValue":"[SCJOB]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase","d-
     A                                      ataLength":"10"},"text transform":"-
     A                                      uppercase","left":"498px","cursor c-
     A                                      olumn":"33","top":"270px","cursor r-
     A                                      ow":"9","width":"71px","css class 3-
     A                                      ":{"fieldName":"50","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"RI","customFalse":""},"error -
     A                                      message":"Record not found","error -
     A                                      response":{"fieldName":"*IN50","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r condition":{"fieldName":"50","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"1 message","parent ta-
     A                                      b panel":"W0105F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 4":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W0105F_SCR01_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0105-
     A                                      F_SCR01_BtnHiddenHelp","value":"btn-
     A                                      Help","top":"300px","response":{"fi-
     A                                      eldName":"btnHelp","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant7-
     A                                      ","field type":"output field","valu-
     A                                      e":"Job number           :","css cl-
     A                                      ass":"constant","left":"323px","cur-
     A                                      sor column":"8","top":"310px","curs-
     A                                      or row":"11","parent tab panel":"W0-
     A                                      105F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCJOBN","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCJOBN","designValue":"[SCJO-
     A                                      BN]","dataType":"zoned","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"false","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"999-
     A                                      .00","dataLength":"6","decPos":"0"}-
     A                                      ,"left":"498px","cursor column":"33-
     A                                      ","top":"310px","cursor row":"11","-
     A                                      width":"43px","css class 3":{"field-
     A                                      Name":"50","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"RI"-
     A                                      ,"customFalse":""},"error message":-
     A                                      "Record not found","error response"-
     A                                      :{"fieldName":"*IN50","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error conditi-
     A                                      on":{"fieldName":"50","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"1 message","parent tab panel":-
     A                                      "W0105F_SCR01_MainTabPanel')
     A                                  1  6HTML('","parent tab":"0","css class-
     A                                       4":"profound-converted"},{"id":"co-
     A                                      nstant8","field type":"output field-
     A                                      ","value":"User                 :",-
     A                                      "css class":"constant","left":"323p-
     A                                      x","cursor column":"8","top":"350px-
     A                                      ","cursor row":"13","parent tab pan-
     A                                      el":"W0105F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCUSER","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCUSER","designValue"-
     A                                      :"[SCUSER]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase","dataLength":"10"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"498px","cursor column":"33","top-
     A                                      ":"350px","cursor row":"13","width"-
     A                                      :"71px","css class 3":{"fieldName":-
     A                                      "50","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"RI","cust-
     A                                      omFalse":""},"error message":"Recor-
     A                                      d not found","error response":{"fie-
     A                                      ldName":"*IN50","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error condition":{"-
     A                                      fieldName":"50","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"1-
     A                                       message","parent tab panel":"W0105-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 4":"profound-convert-
     A                                      ed"},{"id":"btnSubmit","field type"-
     A                                      :"button","value":"Enter","shortcut-
     A                                       key":"Enter","left":"14px","top":"-
     A                                      150px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF03","field type":"button",-
     A                                      "value":"Exit","shortcut key":"F3",-
     A                                      "left":"14px","top":"183px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCJOB         10A  H
     A            SCJOBN         6S 0H
     A            SCUSER        10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A          R WDWMSG
     A                                  1  2HTML('QPUIREC3    ROVERLAY   0     -
     A                                      RWINDOW    0     RROWS      2    C1-
     A                                          4C1    7 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"WDWMSG","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","show as window":-
     A                                      "true","window top":"6","window lef-
     A                                      t":"4","overlay range":"4-7"},"item-
     A                                      s":[{"id":"WDWMSG","field type":"pa-
     A                                      nel","panel style":"Transform Dialo-
     A                                      g","text align":"center","left":"5p-
     A                                      x","top":"5px","height":"290px","wi-
     A                                      dth":"541px","z index":"8","locked -
     A                                      in place":"true"},{"id":"constant9"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Record in use lock has been remo-
     A                                      ved.","css class":"constant","left"-
     A                                      :"127px","cursor column":"16","top"-
     A                                      :"125px","cursor row":"4","css clas-
     A                                      s 2":"HI","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant10","fiel-
     A                                      d type":"output field","value":"Pre-
     A                                      ss ENTER to continue...","css class-
     A                                      ":"constant","left":"169px","cursor-
     A                                       column":"22","top":"185px","cursor-
     A                                       row":"7","css class 2":"BLU","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"btnSubmit","field type":"button"-
     A                                      ,"value":"Enter","shortcut key":"En-
     A                                      ter","left":"14px","top":"250px","w-
     A                                      idth":"80px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"}]}')
