     A*
     A*  02/20/09  C:180 133DFC Copied from W0139F - Renamed to W0139XF
     A*                         to avoid conflict with client's mod ver
     A*
     A*%%TS  SD  20070316  123538  MGELDERT    REL-V5R3M0  5722-WDS
     A* (C) Copyright Progressive Data Solutions, Inc., 1996
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SCREFP)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      HELP(10)
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A*%%TS  SD  20070316  123538  MGELDERT    REL-V5R3M0  5722-WDS
     A                                      RTNCSRLOC(&RCD &FLD &POS)
     A                                      OVERLAY
     A                                      CF07
     A                                      CF08
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A                                      SETOF(23)
     A                                      SETOF(24)
     A                                      SETOF(25)
     A                                      SETOF(26)
     A                                      SETOF(27)
     A                                      SETOF(28)
     A                                      SETOF(29)
     A                                      SETOF(30)
     A                                      SETOF(31)
     A                                      SETOF(32)
     A                                      SETOF(33)
     A                                      SETOF(34)
     A                                      SETOF(35)
     A                                      SETOF(36)
     A                                      SETOF(37)
     A                                      SETOF(38)
     A                                      SETOF(39)
     A            FLD           10A  H
     A            RCD           10A  H
     A            POS            4S 0H
     A**** BEG CHANGE **** 02/20/09   *******
     A****                              1  3'W0139F'
     A                                  1  3'W0139XF'
     A**** END CHANGE **** 02/20/09   *******
     A                                  1 23'Bulk Policy Attach - Create PDFs'
     A                                      DSPATR(HI)
     A                                  1 75'SCR01'
     A                                 11 13'Users      :'
     A            SCUSER    R        B 11 27REFFLD(USER)
     A                                      TEXT('User')
     A  31                                  DSPATR(PC)
     A  20                                  ERRMSGID(SCM0508 *LIBL/SCMESG)
     A                                  7 13'Date       :'
     A            SCFRDT    R        B  7 27REFFLD(DT8)
     A                                      TEXT('From Remark Date')
     A                                      CHECK(RB)
     A                                      EDTWRD('  /  /    ')
     A  32                                  DSPATR(PC)
     A  21                                  ERRMSGID(SCM0500 *LIBL/SCMESG)
     A  23                                  ERRMSGID(SCM0551 *LIBL/SCMESG)
     A                                  7 39'to'
     A            SCTODT    R        B  7 43REFFLD(DT8)
     A                                      TEXT('To Remark Date')
     A                                      CHECK(RB)
     A                                      EDTWRD('  /  /    ')
     A  22                                  ERRMSGID(SCM0500 *LIBL/SCMESG)
     A  23                                  ERRMSGID(SCM0551 *LIBL/SCMESG)
     A                                  9 13'Remark Type:'
     A            SCRMTY    R        B  9 27REFFLD(CMRMCD *LIBL/SDCMP)
     A                                      TEXT('Remark Type')
     A  33                                  DSPATR(PC)
     A  24                                  ERRMSGID(SCM0512 *LIBL/SCMESG)
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 24'F7=User srch'
     A                                      COLOR(BLU)
     A                                 23 45'F8=Remark typ srch'
     A                                      COLOR(BLU)
     A                                  4  3'Type information, press Enter:'
     A            SCUSR2    R        B 12 27REFFLD(USER)
     A                                      TEXT('User')
     A  35                                  DSPATR(PC)
     A  25                                  ERRMSGID(SCM0508 *LIBL/SCMESG)
     A            SCUSR3    R        B 13 27REFFLD(USER)
     A                                      TEXT('User')
     A  36                                  DSPATR(PC)
     A  26                                  ERRMSGID(SCM0508 *LIBL/SCMESG)
     A            SCUSR4    R        B 15 27REFFLD(USER)
     A                                      TEXT('User')
     A  37                                  DSPATR(PC)
     A  27                                  ERRMSGID(SCM0508 *LIBL/SCMESG)
     A            SCUSR5    R        B 14 27REFFLD(USER)
     A                                      TEXT('User')
     A  38                                  DSPATR(PC)
     A  28                                  ERRMSGID(SCM0508 *LIBL/SCMESG)
     A          R SCR99
     A*            11:44:02                REL-R08M00  5714-UT1
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
