     A*  (C) Copyright Progressive Data Solutions, Inc., 1997
     A*%%TS  SD  19961227  151713  WINNERW     REL-V3R6M0  5716-PW1
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/WREFP)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      HELP(10)
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A*%%TS  SD  19961227  151713  WINNERW     REL-V3R6M0  5716-PW1
     A                                      CF03
     A                                      CF12
     A                                      ROLLUP(18)
     A                                      ROLLDOWN(19)
     A                                      SETOF(20)
     A            SCUSER    R        O  1  2REFFLD(USER)
     A                                      TEXT('USER')
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2'W0166F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR01'
     A                                  4  2'Fund:'
     A            SCFND     R        O  4 14REFFLD(FND)
     A                                      DSPATR(HI)
     A                                      EDTCDE(Z)
     A            SCNAME    R        O  4 21REFFLD(NM60)
     A                                      DSPATR(HI)
     A                                      TEXT('FUND NAME')
     A                                  5  2'Fund year:'
     A            SCYR      R        O  5 14REFFLD(YR)
     A                                      DSPATR(HI)
     A                                  5 21'Employer:'
     A            SCEMP#    R        O  5 31REFFLD(EMP#)
     A                                      DSPATR(HI)
     A                                      EDTCDE(Z)
     A            SCDIV     R        O  5 41REFFLD(DIV)
     A                                      DSPATR(HI)
     A                                      EDTCDE(Z)
     A            SCENAM        34A  O  5 47TEXT('EMPLOYER NAME')
     A                                      DSPATR(HI)
     A                                  6  2'Agent#:'
     A            SCAGT#    R        O  6 14REFFLD(AGT#)
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCANAM    R        O  6 21REFFLD(NAME)
     A                                      DSPATR(HI)
     A                                      TEXT('AGENT NAME')
     A                                  7 41'Cancellation'
     A                                  7 64'Reinstatement'
     A            SCFL01    R        B  9  1REFFLD(FLAG)
     A                                      DSPATR(ND)
     A  20                                  ERRMSGID(WCR0600 *LIBL/WMESGG)
     A            SCRQ01    R        O  9  3REFFLD(SEQ#)
     A                                      EDTCDE(4)
     A                                      TEXT('Request #')
     A            SCDS01        25A  O  9  9
     A            SCCI01    R        O  9 36REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Issued Date')
     A            SCCX01    R        O  9 47REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Eff Date')
     A            SCRI01    R        O  9 59REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Issued Date')
     A            SCRE01    R        O  9 70REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Eff Date')
     A            SCFL02    R        B 10  1REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCRQ02    R        O 10  3REFFLD(SEQ#)
     A                                      EDTCDE(4)
     A                                      TEXT('Request #')
     A            SCDS02        25A  O 10  9
     A            SCCI02    R        O 10 36REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Issued Date')
     A            SCCX02    R        O 10 47REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Transaction date')
     A            SCRI02    R        O 10 59REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Issued Date')
     A            SCRE02    R        O 10 70REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('DATE')
     A            SCFL03    R        B 11  1REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCRQ03    R        O 11  3REFFLD(SEQ#)
     A                                      EDTCDE(4)
     A                                      TEXT('Request #')
     A            SCDS03        25A  O 11  9
     A            SCCI03    R        O 11 36REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Issued Date')
     A            SCCX03    R        O 11 47REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Transaction date')
     A            SCRI03    R        O 11 59REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Issued Date')
     A            SCRE03    R        O 11 70REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('DATE')
     A            SCFL04    R        B 12  1REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCRQ04    R        O 12  3REFFLD(SEQ#)
     A                                      EDTCDE(4)
     A                                      TEXT('Request #')
     A            SCDS04        25A  O 12  9
     A            SCCI04    R        O 12 36REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Issued Date')
     A            SCCX04    R        O 12 47REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Transaction date')
     A            SCRI04    R        O 12 59REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Issued Date')
     A            SCRE04    R        O 12 70REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('DATE')
     A            SCFL05    R        B 13  1REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCRQ05    R        O 13  3REFFLD(SEQ#)
     A                                      EDTCDE(4)
     A                                      TEXT('Request #')
     A            SCDS05        25A  O 13  9
     A            SCCI05    R        O 13 36REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Issued Date')
     A            SCCX05    R        O 13 47REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Transaction date')
     A            SCRI05    R        O 13 59REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Issued Date')
     A            SCRE05    R        O 13 70REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('DATE')
     A            SCFL06    R        B 14  1REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCRQ06    R        O 14  3REFFLD(SEQ#)
     A                                      EDTCDE(4)
     A                                      TEXT('Request #')
     A            SCDS06        25A  O 14  9
     A            SCCI06    R        O 14 36REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Issued Date')
     A            SCCX06    R        O 14 47REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Transaction date')
     A            SCRI06    R        O 14 59REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Issued Date')
     A            SCRE06    R        O 14 70REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('DATE')
     A            SCFL07    R        B 15  1REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCRQ07    R        O 15  3REFFLD(SEQ#)
     A                                      EDTCDE(4)
     A                                      TEXT('Request #')
     A            SCDS07        25A  O 15  9
     A            SCCI07    R        O 15 36REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Issued Date')
     A            SCCX07    R        O 15 47REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Transaction date')
     A            SCRI07    R        O 15 59REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Issued Date')
     A            SCRE07    R        O 15 70REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('DATE')
     A            SCFL08    R        B 16  1REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCRQ08    R        O 16  3REFFLD(SEQ#)
     A                                      EDTCDE(4)
     A                                      TEXT('Request #')
     A            SCDS08        25A  O 16  9
     A            SCCI08    R        O 16 36REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Issued Date')
     A            SCCX08    R        O 16 47REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Transaction date')
     A            SCRI08    R        O 16 59REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Issued Date')
     A            SCRE08    R        O 16 70REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('DATE')
     A            SCFL09    R        B 17  1REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCRQ09    R        O 17  3REFFLD(SEQ#)
     A                                      EDTCDE(4)
     A                                      TEXT('Request #')
     A            SCDS09        25A  O 17  9
     A            SCCI09    R        O 17 36REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Issued Date')
     A            SCCX09    R        O 17 47REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Transaction date')
     A            SCRI09    R        O 17 59REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Issued Date')
     A            SCRE09    R        O 17 70REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('DATE')
     A            SCFL10    R        B 18  1REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCRQ10    R        O 18  3REFFLD(SEQ#)
     A                                      EDTCDE(4)
     A                                      TEXT('Request #')
     A            SCDS10        25A  O 18  9
     A            SCCI10    R        O 18 36REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Issued Date')
     A            SCCX10    R        O 18 47REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Transaction date')
     A            SCRI10    R        O 18 59REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Issued Date')
     A            SCRE10    R        O 18 70REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('DATE')
     A            SCFL11    R        B 19  1REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCRQ11    R        O 19  3REFFLD(SEQ#)
     A                                      EDTCDE(4)
     A                                      TEXT('Request #')
     A            SCDS11        25A  O 19  9
     A            SCCI11    R        O 19 36REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Issued Date')
     A            SCCX11    R        O 19 47REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Transaction date')
     A            SCRI11    R        O 19 59REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Issued Date')
     A            SCRE11    R        O 19 70REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('DATE')
     A            SCFL12    R        B 20  1REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCRQ12    R        O 20  3REFFLD(SEQ#)
     A                                      EDTCDE(4)
     A                                      TEXT('Request #')
     A            SCDS12        25A  O 20  9
     A            SCCI12    R        O 20 36REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Issued Date')
     A            SCCX12    R        O 20 47REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Transaction date')
     A            SCRI12    R        O 20 59REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Issued Date')
     A            SCRE12    R        O 20 70REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('DATE')
     A            SCFL13    R        B 21  1REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCRQ13    R        O 21  3REFFLD(SEQ#)
     A                                      EDTCDE(4)
     A                                      TEXT('Request #')
     A            SCDS13        25A  O 21  9
     A            SCCI13    R        O 21 36REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Canc. Issued Date')
     A            SCCX13    R        O 21 47REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Transaction date')
     A            SCRI13    R        O 21 59REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Reinst. Issued Date')
     A            SCRE13    R        O 21 70REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('DATE')
     A                                 23  6'F3=Exit         '
     A                                      COLOR(BLU)
     A                                 23 28'F12=Cancel        '
     A                                      COLOR(BLU)
     A            SCUP           9A  O 23 52
     A            SCDOWN         9A  O 23 67
     A                                  8  3'Rqst#'
     A                                      DSPATR(UL)
     A                                  8 36'  Issued    Effective'
     A                                      DSPATR(UL)
     A                                  8 59'  Issued    Effective'
     A                                      DSPATR(UL)
     A                                  8  9'   Cancellation Reason   '
     A                                      DSPATR(UL)
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
