     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A*PUI                                  SFLDEFINE(18)
     A*PUI                                  SFLDEFINE(19)
     A          R SCR01
     A  10 11 18
     A  19 20 30
     A  31 32 33                            CA01(10 'Response Indicator *IN10')
     A  34 35 36
     A  37 38 39
     A  40 41 42                            CA02(11 'Response Indicator *IN11')
     A  43                                  CA03(18 'Response Indicator *IN18')
     A                                      SETOF(19 'Response Indicator *IN19')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(33 'Response Indicator *IN33')
     A                                      SETOF(34 'Response Indicator *IN34')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(36 'Response Indicator *IN36')
     A                                      SETOF(37 'Response Indicator *IN37')
     A                                      SETOF(38 'Response Indicator *IN38')
     A                                      SETOF(39 'Response Indicator *IN39')
     A                                      SETOF(40 'Response Indicator *IN40')
     A                                      SETOF(41 'Response Indicator *IN41')
     A                                      SETOF(42 'Response Indicator *IN42')
     A                                      SETOF(43 'Response Indicator *IN43')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCFL01C7    WCR0600C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     20')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN30","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN31","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN32","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN33","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN34","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN35","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN36","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN37","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N38","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN3-
     A                                      9","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN40"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN41","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN42","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN43","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"valid-
     A                                       command key":{"fieldName":"*IN11",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      overlay range":"1-23"},"items":[{"i-
     A                                      d":"SCDOWN","field type":"output fi-
     A                                      eld","visibility":"hidden","value":-
     A                                      {"fieldName":"SCDOWN","designValue"-
     A                                      :"[SCDOWN]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"9"},"left-
     A                                      ":"0px","top":"-30px","css class":"-
     A                                      profound-converted"},{"id":"W0534F_-
     A                                      SCR01_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"W0534F_SCR01_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"W0534F_SCR01_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon alignment":"mi-
     A                                      ddle left","icon width":"16px","ico-
     A                                      n height":"24px","icon source":"/pr-
     A                                      ofoundui/userdata/images/systool/sy-
     A                                      stools.png","data function":"System-
     A                                      ToolbarSystools","show down arrow":-
     A                                      "Yes"},{"field type":"panel","panel-
     A                                       style":"TransformButtonBar","id":"-
     A                                      W0534F_SCR01_ButtonBar","top":"35px-
     A                                      ","left":"1036px","width":"187px","-
     A                                      height":"28px","css class":"station-
     A                                      ary","visibility":"hidden","locked -
     A                                      in place":"true"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1040px","id":"W0534F_SCR01_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"')
     A                                  1  4HTML('W0534F_SCR01_BtnRefresh","too-
     A                                      l tip":"Refresh","onclick":"SystemT-
     A                                      oolbarRefresh","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/refresh.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1092px","id":"W0534F_SCR-
     A                                      01_BtnSearch","tool tip":"Search","-
     A                                      onclick":"SystemToolbarSearch","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/search.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1118px","-
     A                                      id":"W0534F_SCR01_BtnDiaryItems","t-
     A                                      ool tip":"Diary/Work Items - IDARTS-
     A                                      ","onclick":"SystemToolbarDiary","b-
     A                                      ackground image":{"fieldName":"DryI-
     A                                      cnURL","dataLength":"128","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none"}},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1144px","id":"-
     A                                      W0534F_SCR01_BtnSystemMessages","to-
     A                                      ol tip":"System Messages","onclick"-
     A                                      :"SystemToolbarMessages","backgroun-
     A                                      d image":{"fieldName":"MsgIcnURL","-
     A                                      dataLength":"128","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"}},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1196px","id":"W0534F_S-
     A                                      CR01_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"W0534F_SCR01_ImgSysToolBottom"-
     A                                      ,"field type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"W0534F_SCR01_MainTabPanel","fie-
     A                                      ld type":"tab panel","tab panel sty-
     A                                      le":"Transform","tab names":{"field-
     A                                      Name":"SCPRDS","designValue":"[SCPR-
     A                                      DS]","refField":"NAME","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"acti-
     A                                      ve tab":"0","left":"250px","top":"7-
     A                                      0px","width":"970px","height":"657p-
     A                                      x","z index":"8","locked in place":-
     A                                      "true","css class":"tab-panel","css-
     A                                       class 2":"stationary"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W0534F_SCR01_BtnHiddenS-
     A                                      ave","value":"btnSave","top":"100px-
     A                                      ","response":{"fieldName":"btnSave"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant1","field type":"ou-
     A                                      tput field","left":"281px","cursor -
     A                                      column":"2","top":"110px","cursor r-
     A                                      ow":"1","css class":"top-line","val-
     A                                      ue":"js: currentUser()","css class -
     A                                      2":"output-field","parent tab panel-
     A                                      ":"W0534F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"SCCONM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCCONM","designValue":"[SCC-
     A                                      ONM]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"414p-
     A                                      x","cursor column":"21","top":"110p-
     A                                      x","cursor row":"1","css class 2":"-
     A                                      top-line","css class 3":"HI","descr-
     A                                      iption":"COMPANY NAME","parent tab -
     A                                      panel":"W0534F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 4":"pro-
     A                                      found-converted"},{"id":"constant2"-
     A                                      ,"field type":"output field","left"-
     A                                      :"778px","cursor column":"73","top"-
     A                                      :"110px","cursor row":"1","css clas-
     A                                      s":"top-line","value":"js: currentD-
     A                                      ate()","css class 2":"output-field"-
     A                                      ,"parent tab panel":"W0534')
     A                                  1  5HTML('F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"W0534F_SCR01_fkey-
     A                                      Menu","field type":"menu","left":"1-
     A                                      0px","top":"120px","height":"350px"-
     A                                      ,"width":"230px","hover background -
     A                                      color":"#9AAA61","hover text color"-
     A                                      :"#FFFFFF","border color":"#4C6106"-
     A                                      ,"menu option indent":"10px","backg-
     A                                      round color":"#758B27","css class":-
     A                                      "action-menu","css class 2":"statio-
     A                                      nary","z index":"101"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0534F_SCR01_BtnHiddenRe-
     A                                      fresh","value":"btnRefresh","top":"-
     A                                      125px","response":{"fieldName":"btn-
     A                                      Refresh","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"Q1PGM","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"Q1PGM","designValue":"[Q1PGM]","-
     A                                      refField":"DS10","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"W05-
     A                                      34F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCPRDS","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCPRDS","designValue":"[SCPRDS]",-
     A                                      "refField":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"442px","cu-
     A                                      rsor column":"25","top":"130px","cu-
     A                                      rsor row":"2","css class 2":"HI","p-
     A                                      arent tab panel":"W0534F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","visibil-
     A                                      ity":"hidden","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant3","f-
     A                                      ield type":"output field","value":"-
     A                                      SCR01","css class":"constant","left-
     A                                      ":"799px","cursor column":"76","top-
     A                                      ":"130px","cursor row":"2","parent -
     A                                      tab panel":"W0534F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0534F_SCR01_BtnHiddenSea-
     A                                      rch","value":"btnSearch","top":"150-
     A                                      px","response":{"fieldName":"btnSea-
     A                                      rch","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"constant4","field type"-
     A                                      :"output field","value":"Modifier:"-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"170p-
     A                                      x","cursor row":"4","parent tab pan-
     A                                      el":"W0534F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCMOD","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCMOD","designValue":"-
     A                                      [SCMOD]","refField":"MOD","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","numB-
     A                                      lankFill":"true"},"left":"358px","c-
     A                                      ursor column":"13","top":"170px","c-
     A                                      ursor row":"4","width":"22px","text-
     A                                       align":"right","css class 3":"UL",-
     A                                      "parent tab panel":"W0534F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 4":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W0534F_SCR01_BtnH-
     A                                      iddenDiaryItems","value":"btnDiary"-
     A                                      ,"top":"175px","response":{"fieldNa-
     A                                      me":"btnDiary","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant5","f-
     A                                      ield type":"output field","value":"-
     A                                      Position cursor, press Enter.","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"190px","c-
     A                                      ursor row":"5","css class 2":"BLU",-
     A                                      "parent tab panel":"W0534F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W0534F_SCR01_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0534F_SCR01_BtnHiddenWo-
     A                                      rkSubmitJob","value":"btnWrksbmjob"-
     A                                      ,"top":"225px","response":{"fieldNa-
     A                                      me":"btnWrkJob","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant6","-
     A                                      field type":"output field","value":-
     A                                      "Prov ID  ","css class":"constant",-
     A                                      "left":"288px","cursor column":"3",-
     A                                      "top":"230px","cursor row":"7","css-
     A                                       class 2":"HI","parent tab')
     A                                  1  6HTML(' panel":"W0534F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant7","field type":"output field"-
     A                                      ,"value":"Mod","css class":"constan-
     A                                      t","left":"365px","cursor column":"-
     A                                      14","top":"230px","cursor row":"7",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"W0534F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant8","fi-
     A                                      eld type":"output field","value":"N-
     A                                      ame and Address","css class":"const-
     A                                      ant","left":"400px","cursor column"-
     A                                      :"19","top":"230px","cursor row":"7-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"W0534F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"constant9","-
     A                                      field type":"output field","value":-
     A                                      "Spec","css class":"constant","left-
     A                                      ":"792px","cursor column":"75","top-
     A                                      ":"230px","cursor row":"7","css cla-
     A                                      ss 2":"HI","parent tab panel":"W053-
     A                                      4F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"SCFL01","field type":"-
     A                                      password field","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCFL01","designValue":"-
     A                                      [SCFL01]","refField":"FLAG","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e"},"text transform":"uppercase","l-
     A                                      eft":"274px","cursor column":"1","t-
     A                                      op":"250px","cursor row":"8","width-
     A                                      ":"8px","set focus":{"fieldName":"3-
     A                                      0","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"error message id":"WCR06-
     A                                      00","error message file":"WMESGG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"20","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"1 message","parent t-
     A                                      ab panel":"W0534F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCFE01"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCFE01","designValu-
     A                                      e":"[SCFE01]","refField":"FEIN","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"999.00"-
     A                                      },"css class":"output-field","left"-
     A                                      :"288px","cursor column":"3","top":-
     A                                      "250px","cursor row":"8","width":"6-
     A                                      3px","text align":"right","parent t-
     A                                      ab panel":"W0534F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCMO01"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCMO01","designValu-
     A                                      e":"[SCMO01]","refField":"MOD","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"false","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"999.00"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "365px","cursor column":"14","top":-
     A                                      "250px","cursor row":"8","width":"2-
     A                                      1px","text align":"right","parent t-
     A                                      ab panel":"W0534F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCDE01"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCDE01","designValu-
     A                                      e":"[SCDE01]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none","dataLength":"55"},"-
     A                                      css class":"output-field","left":"4-
     A                                      00px","cursor column":"19","top":"2-
     A                                      50px","cursor row":"8","parent tab -
     A                                      panel":"W0534F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCSP01","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCSP01","designValue":-
     A                                      "[SCSP01]","refField":"SPEC","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "799px","cursor column":"76","top":-
     A                                      "250px","cursor row":"8","descripti-
     A                                      on":"Speciality Code","parent tab p-
     A                                      anel":"W0534F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0534F_SCR01_BtnHiddenWorkPrin-
     A                                      terOutput","value":"btnWrkprtout","-
     A                                      top":"250px","response":{"fieldName-
     A                                      ":"btnWrkPrnt","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"SCFL02","fiel-
     A                                      d type":"password field","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCFL02","desig-
     A                                      nValue":"[SCFL02]","refField":"FLAG-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase"},"text transform":"uppe-
     A                                      rcase","left":"274px","cursor colum-
     A                                      n":"1","top":"270px","cursor row":"-
     A                                      9","width":"8px","set focus":{"fiel-
     A                                      dName":"31","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"parent tab pane-
     A                                      l":"W0534F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3"')
     A                                  1  7HTML(':"profound-converted"},{"id":-
     A                                      "SCFE02","field type":"output field-
     A                                      ","value":{"fieldName":"SCFE02","de-
     A                                      signValue":"[SCFE02]","refField":"F-
     A                                      EIN","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00"},"css class":"output-field-
     A                                      ","left":"288px","cursor column":"3-
     A                                      ","top":"270px","cursor row":"9","w-
     A                                      idth":"63px","text align":"right","-
     A                                      parent tab panel":"W0534F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCMO02","field type":"output field-
     A                                      ","value":{"fieldName":"SCMO02","de-
     A                                      signValue":"[SCMO02]","refField":"M-
     A                                      OD","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"365px","cursor column":"14-
     A                                      ","top":"270px","cursor row":"9","w-
     A                                      idth":"21px","text align":"right","-
     A                                      parent tab panel":"W0534F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCDE02","field type":"output field-
     A                                      ","value":{"fieldName":"SCDE02","de-
     A                                      signValue":"[SCDE02]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"55"},"css class":"output-field","-
     A                                      left":"400px","cursor column":"19",-
     A                                      "top":"270px","cursor row":"9","par-
     A                                      ent tab panel":"W0534F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      SP02","field type":"output field","-
     A                                      value":{"fieldName":"SCSP02","desig-
     A                                      nValue":"[SCSP02]","refField":"SPEC-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"799px","cursor column":"76-
     A                                      ","top":"270px","cursor row":"9","p-
     A                                      arent tab panel":"W0534F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W0534F_SCR01_BtnHid-
     A                                      denImageQueue","value":"btnImgQue",-
     A                                      "top":"275px","response":{"fieldNam-
     A                                      e":"btnImgQue","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"SCFL03","fiel-
     A                                      d type":"password field","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCFL03","desig-
     A                                      nValue":"[SCFL03]","refField":"FLAG-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase"},"text transform":"uppe-
     A                                      rcase","left":"274px","cursor colum-
     A                                      n":"1","top":"290px","cursor row":"-
     A                                      10","width":"8px","set focus":{"fie-
     A                                      ldName":"32","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"parent tab pan-
     A                                      el":"W0534F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCFE03","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCFE03","designValue":"[S-
     A                                      CFE03]","refField":"FEIN","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00"},"css-
     A                                       class":"output-field","left":"288p-
     A                                      x","cursor column":"3","top":"290px-
     A                                      ","cursor row":"10","width":"63px",-
     A                                      "text align":"right","parent tab pa-
     A                                      nel":"W0534F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCMO03","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCMO03","designValue":"[-
     A                                      SCMO03]","refField":"MOD","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00"},"css-
     A                                       class":"output-field","left":"365p-
     A                                      x","cursor column":"14","top":"290p-
     A                                      x","cursor row":"10","width":"21px"-
     A                                      ,"text align":"right","parent tab p-
     A                                      anel":"W0534F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCDE03","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCDE03","designValue":"-
     A                                      [SCDE03]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none","dataLength":"55"},"css -
     A                                      class":"output-field","left":"400px-
     A                                      ","cursor column":"19","top":"290px-
     A                                      ","cursor row":"10","parent tab pan-
     A                                      el":"W0534F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCSP03","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCSP03","designValue":"[S-
     A                                      CSP03]","refField":"SPEC","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"79-
     A                                      9px","cursor column":"76","top":"29-
     A                                      0px","cursor row":"10","pa')
     A                                  1  8HTML('rent tab panel":"W0534F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0534F_SCR01_B-
     A                                      tnHiddenHelp","value":"btnHelp","to-
     A                                      p":"300px","response":{"fieldName":-
     A                                      "btnHelp","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"SCFL04","field typ-
     A                                      e":"password field","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCFL04","designValu-
     A                                      e":"[SCFL04]","refField":"FLAG","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase"},"text transform":"uppercase-
     A                                      ","left":"274px","cursor column":"1-
     A                                      ","top":"310px","cursor row":"11","-
     A                                      width":"8px","set focus":{"fieldNam-
     A                                      e":"33","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"parent tab panel":"-
     A                                      W0534F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCFE04","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCFE04","designValue":"[SCFE04-
     A                                      ]","refField":"FEIN","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00"},"css clas-
     A                                      s":"output-field","left":"288px","c-
     A                                      ursor column":"3","top":"310px","cu-
     A                                      rsor row":"11","width":"63px","text-
     A                                       align":"right","parent tab panel":-
     A                                      "W0534F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCMO04","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCMO04","designValue":"[SCMO0-
     A                                      4]","refField":"MOD","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00"},"css clas-
     A                                      s":"output-field","left":"365px","c-
     A                                      ursor column":"14","top":"310px","c-
     A                                      ursor row":"11","width":"21px","tex-
     A                                      t align":"right","parent tab panel"-
     A                                      :"W0534F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCDE04","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCDE04","designValue":"[SCDE-
     A                                      04]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"55"},"css class-
     A                                      ":"output-field","left":"400px","cu-
     A                                      rsor column":"19","top":"310px","cu-
     A                                      rsor row":"11","parent tab panel":"-
     A                                      W0534F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCSP04","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCSP04","designValue":"[SCSP04-
     A                                      ]","refField":"SPEC","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"799px",-
     A                                      "cursor column":"76","top":"310px",-
     A                                      "cursor row":"11","parent tab panel-
     A                                      ":"W0534F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCFL05","field -
     A                                      type":"password field","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCFL05","designV-
     A                                      alue":"[SCFL05]","refField":"FLAG",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase"},"text transform":"upperc-
     A                                      ase","left":"274px","cursor column"-
     A                                      :"1","top":"330px","cursor row":"12-
     A                                      ","width":"8px","set focus":{"field-
     A                                      Name":"34","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"parent tab panel-
     A                                      ":"W0534F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"SCFE05","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCFE05","designValue":"[SCF-
     A                                      E05]","refField":"FEIN","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"999.00"},"css c-
     A                                      lass":"output-field","left":"288px"-
     A                                      ,"cursor column":"3","top":"330px",-
     A                                      "cursor row":"12","width":"63px","t-
     A                                      ext align":"right","parent tab pane-
     A                                      l":"W0534F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCMO05","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCMO05","designValue":"[SC-
     A                                      MO05]","refField":"MOD","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"999.00"},"css c-
     A                                      lass":"output-field","left":"365px"-
     A                                      ,"cursor column":"14","top":"330px"-
     A                                      ,"cursor row":"12","width":"21px","-
     A                                      text align":"right","parent tab pan-
     A                                      el":"W0534F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCDE05","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCDE05","designV')
     A                                  1  9HTML('alue":"[SCDE05]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none","dataLength-
     A                                      ":"55"},"css class":"output-field",-
     A                                      "left":"400px","cursor column":"19"-
     A                                      ,"top":"330px","cursor row":"12","p-
     A                                      arent tab panel":"W0534F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCSP05","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCSP05","des-
     A                                      ignValue":"[SCSP05]","refField":"SP-
     A                                      EC","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"799px","cursor column":"-
     A                                      76","top":"330px","cursor row":"12"-
     A                                      ,"parent tab panel":"W0534F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCFL06","field type":"password f-
     A                                      ield","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCFL06","designValue":"[SCFL06]",-
     A                                      "refField":"FLAG","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase"},"text -
     A                                      transform":"uppercase","left":"274p-
     A                                      x","cursor column":"1","top":"350px-
     A                                      ","cursor row":"13","width":"8px","-
     A                                      set focus":{"fieldName":"35","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"parent tab panel":"W0534F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"SCFE06","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCFE06","-
     A                                      designValue":"[SCFE06]","refField":-
     A                                      "FEIN","dataType":"reference","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"false","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"999.00"},"css class":"output-fie-
     A                                      ld","left":"288px","cursor column":-
     A                                      "3","top":"350px","cursor row":"13"-
     A                                      ,"width":"63px","text align":"right-
     A                                      ","parent tab panel":"W0534F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCMO06","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCMO06",-
     A                                      "designValue":"[SCMO06]","refField"-
     A                                      :"MOD","dataType":"reference","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"false","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"999.00"},"css class":"output-fie-
     A                                      ld","left":"365px","cursor column":-
     A                                      "14","top":"350px","cursor row":"13-
     A                                      ","width":"21px","text align":"righ-
     A                                      t","parent tab panel":"W0534F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCDE06","field type":"output f-
     A                                      ield","value":{"fieldName":"SCDE06"-
     A                                      ,"designValue":"[SCDE06]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none","dataLen-
     A                                      gth":"55"},"css class":"output-fiel-
     A                                      d","left":"400px","cursor column":"-
     A                                      19","top":"350px","cursor row":"13"-
     A                                      ,"parent tab panel":"W0534F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCSP06","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCSP06","-
     A                                      designValue":"[SCSP06]","refField":-
     A                                      "SPEC","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"799px","cursor column-
     A                                      ":"76","top":"350px","cursor row":"-
     A                                      13","parent tab panel":"W0534F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCFL07","field type":"passwor-
     A                                      d field","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCFL07","designValue":"[SCFL07-
     A                                      ]","refField":"FLAG","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"2-
     A                                      74px","cursor column":"1","top":"37-
     A                                      0px","cursor row":"14","width":"8px-
     A                                      ","set focus":{"fieldName":"36","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"parent tab panel":"W0534F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCFE07","field type":"output -
     A                                      field","value":{"fieldName":"SCFE07-
     A                                      ","designValue":"[SCFE07]","refFiel-
     A                                      d":"FEIN","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00"},"css class":"output--
     A                                      field","left":"288px","cursor colum-
     A                                      n":"3","top":"370px","cursor row":"-
     A                                      14","width":"63px","text align":"ri-
     A                                      ght","parent tab panel":"W0534F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCMO07","field type":"output-
     A                                       field","value":{"fieldName":"SCMO0-
     A                                      7","designValue":"[SCMO07]","refFie-
     A                                      ld":"MOD","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units')
     A                                  1 10HTML('":"","negNum":"999.00"},"css -
     A                                      class":"output-field","left":"365px-
     A                                      ","cursor column":"14","top":"370px-
     A                                      ","cursor row":"14","width":"21px",-
     A                                      "text align":"right","parent tab pa-
     A                                      nel":"W0534F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCDE07","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCDE07","designValue":"[-
     A                                      SCDE07]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none","dataLength":"55"},"css c-
     A                                      lass":"output-field","left":"400px"-
     A                                      ,"cursor column":"19","top":"370px"-
     A                                      ,"cursor row":"14","parent tab pane-
     A                                      l":"W0534F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCSP07","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCSP07","designValue":"[SC-
     A                                      SP07]","refField":"SPEC","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"799-
     A                                      px","cursor column":"76","top":"370-
     A                                      px","cursor row":"14","parent tab p-
     A                                      anel":"W0534F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCFL08","fi-
     A                                      eld type":"password field","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCFL08","des-
     A                                      ignValue":"[SCFL08]","refField":"FL-
     A                                      AG","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase"},"text transform":"up-
     A                                      percase","left":"274px","cursor col-
     A                                      umn":"1","top":"390px","cursor row"-
     A                                      :"15","width":"8px","set focus":{"f-
     A                                      ieldName":"37","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"parent tab p-
     A                                      anel":"W0534F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"SCFE08","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCFE08","designValue":"-
     A                                      [SCFE08]","refField":"FEIN","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00"},"c-
     A                                      ss class":"output-field","left":"28-
     A                                      8px","cursor column":"3","top":"390-
     A                                      px","cursor row":"15","width":"63px-
     A                                      ","text align":"right","parent tab -
     A                                      panel":"W0534F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCMO08","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCMO08","designValue":-
     A                                      "[SCMO08]","refField":"MOD","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00"},"c-
     A                                      ss class":"output-field","left":"36-
     A                                      5px","cursor column":"14","top":"39-
     A                                      0px","cursor row":"15","width":"21p-
     A                                      x","text align":"right","parent tab-
     A                                       panel":"W0534F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCDE08","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCDE08","designValue"-
     A                                      :"[SCDE08]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none","dataLength":"55"},"cs-
     A                                      s class":"output-field","left":"400-
     A                                      px","cursor column":"19","top":"390-
     A                                      px","cursor row":"15","parent tab p-
     A                                      anel":"W0534F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCSP08","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCSP08","designValue":"-
     A                                      [SCSP08]","refField":"SPEC","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      799px","cursor column":"76","top":"-
     A                                      390px","cursor row":"15","parent ta-
     A                                      b panel":"W0534F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCFL09",-
     A                                      "field type":"password field","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCFL09","-
     A                                      designValue":"[SCFL09]","refField":-
     A                                      "FLAG","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase"},"text transform":-
     A                                      "uppercase","left":"274px","cursor -
     A                                      column":"1","top":"410px","cursor r-
     A                                      ow":"16","width":"8px","set focus":-
     A                                      {"fieldName":"38","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"parent ta-
     A                                      b panel":"W0534F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"SCFE09",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCFE09","designValue-
     A                                      ":"[SCFE09]","refField":"FEIN","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"false","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"999.00"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "288px","cursor column":"3","top":"-
     A                                      410px","cursor row":"16","width":"6-
     A                                      3px","text align":"right",')
     A                                  1 11HTML('"parent tab panel":"W0534F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCMO09","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCMO-
     A                                      09","designValue":"[SCMO09]","refFi-
     A                                      eld":"MOD","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00"},"css class":"output-
     A                                      -field","left":"365px","cursor colu-
     A                                      mn":"14","top":"410px","cursor row"-
     A                                      :"16","width":"21px","text align":"-
     A                                      right","parent tab panel":"W0534F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCDE09","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCD-
     A                                      E09","designValue":"[SCDE09]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none","dat-
     A                                      aLength":"55"},"css class":"output--
     A                                      field","left":"400px","cursor colum-
     A                                      n":"19","top":"410px","cursor row":-
     A                                      "16","parent tab panel":"W0534F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCSP09","field type":"output-
     A                                       field","value":{"fieldName":"SCSP0-
     A                                      9","designValue":"[SCSP09]","refFie-
     A                                      ld":"SPEC","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"799px","cursor co-
     A                                      lumn":"76","top":"410px","cursor ro-
     A                                      w":"16","parent tab panel":"W0534F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCFL10","field type":"pas-
     A                                      sword field","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCFL10","designValue":"[SC-
     A                                      FL10]","refField":"FLAG","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"274px","cursor column":"1","top"-
     A                                      :"430px","cursor row":"17","width":-
     A                                      "8px","set focus":{"fieldName":"39"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"parent tab panel":"W0534F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"SCFE10","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      FE10","designValue":"[SCFE10]","ref-
     A                                      Field":"FEIN","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"false","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"999.00"},"css class":"out-
     A                                      put-field","left":"288px","cursor c-
     A                                      olumn":"3","top":"430px","cursor ro-
     A                                      w":"17","width":"63px","text align"-
     A                                      :"right","parent tab panel":"W0534F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCMO10","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CMO10","designValue":"[SCMO10]","re-
     A                                      fField":"MOD","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"false","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"999.00"},"css class":"out-
     A                                      put-field","left":"365px","cursor c-
     A                                      olumn":"14","top":"430px","cursor r-
     A                                      ow":"17","width":"21px","text align-
     A                                      ":"right","parent tab panel":"W0534-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCDE10","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCDE10","designValue":"[SCDE10]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none","-
     A                                      dataLength":"55"},"css class":"outp-
     A                                      ut-field","left":"400px","cursor co-
     A                                      lumn":"19","top":"430px","cursor ro-
     A                                      w":"17","parent tab panel":"W0534F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCSP10","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      SP10","designValue":"[SCSP10]","ref-
     A                                      Field":"SPEC","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"799px","cursor-
     A                                       column":"76","top":"430px","cursor-
     A                                       row":"17","parent tab panel":"W053-
     A                                      4F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCFL11","field type":"-
     A                                      password field","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCFL11","designValue":"-
     A                                      [SCFL11]","refField":"FLAG","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e"},"text transform":"uppercase","l-
     A                                      eft":"274px","cursor column":"1","t-
     A                                      op":"450px","cursor row":"18","widt-
     A                                      h":"8px","set focus":{"fieldName":"-
     A                                      40","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"parent tab panel":"W053-
     A                                      4F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"SCFE11","field type":"-
     A                                      output field","value":{"fi')
     A                                  1 12HTML('eldName":"SCFE11","designValu-
     A                                      e":"[SCFE11]","refField":"FEIN","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"999.00"-
     A                                      },"css class":"output-field","left"-
     A                                      :"288px","cursor column":"3","top":-
     A                                      "450px","cursor row":"18","width":"-
     A                                      63px","text align":"right","parent -
     A                                      tab panel":"W0534F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCMO11-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCMO11","designVal-
     A                                      ue":"[SCMO11]","refField":"MOD","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"999.00"-
     A                                      },"css class":"output-field","left"-
     A                                      :"365px","cursor column":"14","top"-
     A                                      :"450px","cursor row":"18","width":-
     A                                      "21px","text align":"right","parent-
     A                                       tab panel":"W0534F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCDE1-
     A                                      1","field type":"output field","val-
     A                                      ue":{"fieldName":"SCDE11","designVa-
     A                                      lue":"[SCDE11]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none","dataLength":"55"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "400px","cursor column":"19","top":-
     A                                      "450px","cursor row":"18","parent t-
     A                                      ab panel":"W0534F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCSP11"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCSP11","designValu-
     A                                      e":"[SCSP11]","refField":"SPEC","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"799px","cursor column":"76","to-
     A                                      p":"450px","cursor row":"18","paren-
     A                                      t tab panel":"W0534F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCFL-
     A                                      12","field type":"password field","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCFL1-
     A                                      2","designValue":"[SCFL12]","refFie-
     A                                      ld":"FLAG","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase"},"text transfo-
     A                                      rm":"uppercase","left":"274px","cur-
     A                                      sor column":"1","top":"470px","curs-
     A                                      or row":"19","width":"8px","set foc-
     A                                      us":{"fieldName":"41","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"paren-
     A                                      t tab panel":"W0534F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"SCFE-
     A                                      12","field type":"output field","va-
     A                                      lue":{"fieldName":"SCFE12","designV-
     A                                      alue":"[SCFE12]","refField":"FEIN",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00"},"css class":"output-field","le-
     A                                      ft":"288px","cursor column":"3","to-
     A                                      p":"470px","cursor row":"19","width-
     A                                      ":"63px","text align":"right","pare-
     A                                      nt tab panel":"W0534F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCM-
     A                                      O12","field type":"output field","v-
     A                                      alue":{"fieldName":"SCMO12","design-
     A                                      Value":"[SCMO12]","refField":"MOD",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00"},"css class":"output-field","le-
     A                                      ft":"365px","cursor column":"14","t-
     A                                      op":"470px","cursor row":"19","widt-
     A                                      h":"21px","text align":"right","par-
     A                                      ent tab panel":"W0534F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      DE12","field type":"output field","-
     A                                      value":{"fieldName":"SCDE12","desig-
     A                                      nValue":"[SCDE12]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"5-
     A                                      5"},"css class":"output-field","lef-
     A                                      t":"400px","cursor column":"19","to-
     A                                      p":"470px","cursor row":"19","paren-
     A                                      t tab panel":"W0534F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCSP-
     A                                      12","field type":"output field","va-
     A                                      lue":{"fieldName":"SCSP12","designV-
     A                                      alue":"[SCSP12]","refField":"SPEC",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"799px","cursor column":"76",-
     A                                      "top":"470px","cursor row":"19","pa-
     A                                      rent tab panel":"W0534F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CFL13","field type":"password field-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      FL13","designValue":"[SCFL13]","ref-
     A                                      Field":"FLAG","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","left":')
     A                                  1 13HTML('"274px","cursor column":"1","-
     A                                      top":"490px","cursor row":"20","wid-
     A                                      th":"8px","set focus":{"fieldName":-
     A                                      "42","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"parent tab panel":"W05-
     A                                      34F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"SCFE13","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCFE13","designValue":"[SCFE13]",-
     A                                      "refField":"FEIN","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"false","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"999.00"},"css class":-
     A                                      "output-field","left":"288px","curs-
     A                                      or column":"3","top":"490px","curso-
     A                                      r row":"20","width":"63px","text al-
     A                                      ign":"right","parent tab panel":"W0-
     A                                      534F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCMO13","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCMO13","designValue":"[SCMO13]"-
     A                                      ,"refField":"MOD","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"false","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"999.00"},"css class":-
     A                                      "output-field","left":"365px","curs-
     A                                      or column":"14","top":"490px","curs-
     A                                      or row":"20","width":"21px","text a-
     A                                      lign":"right","parent tab panel":"W-
     A                                      0534F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCDE13","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCDE13","designValue":"[SCDE13]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"55"},"css class":"-
     A                                      output-field","left":"400px","curso-
     A                                      r column":"19","top":"490px","curso-
     A                                      r row":"20","parent tab panel":"W05-
     A                                      34F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCSP13","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCSP13","designValue":"[SCSP13]",-
     A                                      "refField":"SPEC","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"799px","cu-
     A                                      rsor column":"76","top":"490px","cu-
     A                                      rsor row":"20","parent tab panel":"-
     A                                      W0534F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCFL14","field typ-
     A                                      e":"password field","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCFL14","designValu-
     A                                      e":"[SCFL14]","refField":"FLAG","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase"},"text transform":"uppercase-
     A                                      ","left":"274px","cursor column":"1-
     A                                      ","top":"510px","cursor row":"21","-
     A                                      width":"8px","set focus":{"fieldNam-
     A                                      e":"43","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"parent tab panel":"-
     A                                      W0534F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCFE14","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCFE14","designValue":"[SCFE14-
     A                                      ]","refField":"FEIN","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00"},"css clas-
     A                                      s":"output-field","left":"288px","c-
     A                                      ursor column":"3","top":"510px","cu-
     A                                      rsor row":"21","width":"63px","text-
     A                                       align":"right","parent tab panel":-
     A                                      "W0534F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCMO14","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCMO14","designValue":"[SCMO1-
     A                                      4]","refField":"MOD","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00"},"css clas-
     A                                      s":"output-field","left":"365px","c-
     A                                      ursor column":"14","top":"510px","c-
     A                                      ursor row":"21","width":"21px","tex-
     A                                      t align":"right","parent tab panel"-
     A                                      :"W0534F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCDE14","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCDE14","designValue":"[SCDE-
     A                                      14]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"55"},"css class-
     A                                      ":"output-field","left":"400px","cu-
     A                                      rsor column":"19","top":"510px","cu-
     A                                      rsor row":"21","parent tab panel":"-
     A                                      W0534F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCSP14","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCSP14","designValue":"[SCSP14-
     A                                      ]","refField":"SPEC","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"799px",-
     A                                      "cursor column":"76","top":"510px",-
     A                                      "cursor row":"21","parent tab panel-
     A                                      ":"W0534F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":')
     A                                  1 14HTML('"profound-converted"},{"id":"-
     A                                      SCUP","field type":"output field","-
     A                                      value":{"fieldName":"SCUP","designV-
     A                                      alue":"[SCUP]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"9"},"-
     A                                      css class":"output-field","left":"7-
     A                                      57px","cursor column":"70","top":"5-
     A                                      30px","cursor row":"22","css class -
     A                                      2":"HI","parent tab panel":"W0534F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"btnSubmit","field type":"-
     A                                      button","value":"Enter","shortcut k-
     A                                      ey":"Enter","left":"14px","top":"15-
     A                                      0px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF03","field type":"button","v-
     A                                      alue":"Exit","shortcut key":"F3","l-
     A                                      eft":"14px","top":"183px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF12","fi-
     A                                      eld type":"button","value":"Cancel"-
     A                                      ,"shortcut key":"F12","left":"14px"-
     A                                      ,"top":"216px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnHELP","field type":"-
     A                                      button","shortcut key":"Alt-F1","by-
     A                                      pass validation":"true","value":"HE-
     A                                      LP","response":{"fieldName":"*IN10"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "left":"14px","top":"249px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnROLLDOW-
     A                                      N","field type":"button","value":"P-
     A                                      age Up","shortcut key":"PageUp","re-
     A                                      sponse":{"fieldName":"*IN19","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"left":-
     A                                      "14px","top":"282px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnROLLUP","field-
     A                                       type":"button","value":"Page Down"-
     A                                      ,"shortcut key":"PageDown","respons-
     A                                      e":{"fieldName":"*IN18","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"left":"14px-
     A                                      ","top":"315px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCDE01        55A  H
     A            SCDE02        55A  H
     A            SCDE03        55A  H
     A            SCDE04        55A  H
     A            SCDE05        55A  H
     A            SCDE06        55A  H
     A            SCDE07        55A  H
     A            SCDE08        55A  H
     A            SCDE09        55A  H
     A            SCDE10        55A  H
     A            SCDE11        55A  H
     A            SCDE12        55A  H
     A            SCDE13        55A  H
     A            SCDE14        55A  H
     A            SCDOWN         9A  H
     A            SCUP           9A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFE01    R        H      REFFLD(FEIN)
     A            SCFE02    R        H      REFFLD(FEIN)
     A            SCFE03    R        H      REFFLD(FEIN)
     A            SCFE04    R        H      REFFLD(FEIN)
     A            SCFE05    R        H      REFFLD(FEIN)
     A            SCFE06    R        H      REFFLD(FEIN)
     A            SCFE07    R        H      REFFLD(FEIN)
     A            SCFE08    R        H      REFFLD(FEIN)
     A            SCFE09    R        H      REFFLD(FEIN)
     A            SCFE10    R        H      REFFLD(FEIN)
     A            SCFE11    R        H      REFFLD(FEIN)
     A            SCFE12    R        H      REFFLD(FEIN)
     A            SCFE13    R        H      REFFLD(FEIN)
     A            SCFE14    R        H      REFFLD(FEIN)
     A            SCFL01    R        H      REFFLD(FLAG)
     A            SCFL02    R        H      REFFLD(FLAG)
     A            SCFL03    R        H      REFFLD(FLAG)
     A            SCFL04    R        H      REFFLD(FLAG)
     A            SCFL05    R        H      REFFLD(FLAG)
     A            SCFL06    R        H      REFFLD(FLAG)
     A            SCFL07    R        H      REFFLD(FLAG)
     A            SCFL08    R        H      REFFLD(FLAG)
     A            SCFL09    R        H      REFFLD(FLAG)
     A            SCFL10    R        H      REFFLD(FLAG)
     A            SCFL11    R        H      REFFLD(FLAG)
     A            SCFL12    R        H      REFFLD(FLAG)
     A            SCFL13    R        H      REFFLD(FLAG)
     A            SCFL14    R        H      REFFLD(FLAG)
     A            SCMO01    R        H      REFFLD(MOD)
     A            SCMO02    R        H      REFFLD(MOD)
     A            SCMO03    R        H      REFFLD(MOD)
     A            SCMO04    R        H      REFFLD(MOD)
     A            SCMO05    R        H      REFFLD(MOD)
     A            SCMO06    R        H      REFFLD(MOD)
     A            SCMO07    R        H      REFFLD(MOD)
     A            SCMO08    R        H      REFFLD(MOD)
     A            SCMO09    R        H      REFFLD(MOD)
     A            SCMO10    R        H      REFFLD(MOD)
     A            SCMO11    R        H      REFFLD(MOD)
     A            SCMO12    R        H      REFFLD(MOD)
     A            SCMO13    R        H      REFFLD(MOD)
     A            SCMO14    R        H      REFFLD(MOD)
     A            SCMOD     R        H      REFFLD(MOD)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSP01    R        H      REFFLD(SPEC)
     A            SCSP02    R        H      REFFLD(SPEC)
     A            SCSP03    R        H      REFFLD(SPEC)
     A            SCSP04    R        H      REFFLD(SPEC)
     A            SCSP05    R        H      REFFLD(SPEC)
     A            SCSP06    R        H      REFFLD(SPEC)
     A            SCSP07    R        H      REFFLD(SPEC)
     A            SCSP08    R        H      REFFLD(SPEC)
     A            SCSP09    R        H      REFFLD(SPEC)
     A            SCSP10    R        H      REFFLD(SPEC)
     A            SCSP11    R        H      REFFLD(SPEC)
     A            SCSP12    R        H      REFFLD(SPEC)
     A            SCSP13    R        H      REFFLD(SPEC)
     A            SCSP14    R        H      REFFLD(SPEC)
     A          R SCR99
     A  10 11 18
     A  19                                  CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                      SETOF(19 'Response Indicator *IN19')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C1    1 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"1-1"},"items"-
     A                                      :[{"id":"W0534F_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"W0534F_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W0534F_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"W0534F_SCR99_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1040px","id":"-
     A                                      W0534F_SCR99_BtnSave","tool tip":"S-
     A                                      ave","onclick":"SystemToolbarSave",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/save.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1066px"-
     A                                      ,"id":"W0534F_SCR99_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"W0534F_SC-
     A                                      R99_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"W0534F_SCR99_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "W0534F_SCR99_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLe')
     A                                  1  4HTML('ading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"W0534F_SCR99_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"W0534F_SCR99_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"W0534F_SCR99_Ma-
     A                                      inTabPanel","field type":"tab panel-
     A                                      ","tab panel style":"Transform","ta-
     A                                      b names":"Tab 1","active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      0534F_SCR99_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCR99-
     A                                      _SCFL01","field type":"output field-
     A                                      ","value":{"fieldName":"SCFL01","de-
     A                                      signValue":"[SCFL01]","refField":"F-
     A                                      LAG","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"110px","cursor row":"1",-
     A                                      "css class 2":"top-line","visibilit-
     A                                      y":"hidden","description":"DUMMY FI-
     A                                      ELD","parent tab panel":"W0534F_SCR-
     A                                      99_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"W0534F_SCR99_fkeyMenu","fiel-
     A                                      d type":"menu","left":"10px","top":-
     A                                      "120px","height":"350px","width":"2-
     A                                      30px","hover background color":"#9A-
     A                                      AA61","hover text color":"#FFFFFF",-
     A                                      "border color":"#4C6106","menu opti-
     A                                      on indent":"10px","background color-
     A                                      ":"#758B27","css class":"action-men-
     A                                      u","css class 2":"stationary","z in-
     A                                      dex":"101"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0534F_SCR99_BtnHiddenRefresh","val-
     A                                      ue":"btnRefresh","top":"125px","res-
     A                                      ponse":{"fieldName":"btnRefresh","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0534F_SCR99_B-
     A                                      tnHiddenSearch","value":"btnSearch"-
     A                                      ,"top":"150px","response":{"fieldNa-
     A                                      me":"btnSearch","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W0534F_SCR99_BtnHiddenDiaryItem-
     A                                      s","value":"btnDiary","top":"175px"-
     A                                      ,"response":{"fieldName":"btnDiary"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0534F_SCR9-
     A                                      9_BtnHiddenSystemMessages","value":-
     A                                      "btnMessage","top":"200px","respons-
     A                                      e":{"fieldName":"btnMessage","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0534F_SCR99_BtnHi-
     A                                      ddenWorkSubmitJob","value":"btnWrks-
     A                                      bmjob","top":"225px","response":{"f-
     A                                      ieldName":"btnWrkJob","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0534F_SCR99_BtnHiddenWor-
     A                                      kPrinterOutput","value":"btnWrkprto-
     A                                      ut","top":"250px","response":{"fiel-
     A                                      dName":"btnWrkPrnt","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility')
     A                                  1  5HTML('":"hidden","id":"W0534F_SCR99-
     A                                      _BtnHiddenImageQueue","value":"btnI-
     A                                      mgQue","top":"275px","response":{"f-
     A                                      ieldName":"btnImgQue","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0534F_SCR99_BtnHiddenHel-
     A                                      p","value":"btnHelp","top":"300px",-
     A                                      "response":{"fieldName":"btnHelp","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"btnSubmit","field type":"butt-
     A                                      on","value":"Enter","shortcut key":-
     A                                      "Enter","left":"14px","top":"150px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF03","field type":"button","value-
     A                                      ":"Exit","shortcut key":"F3","left"-
     A                                      :"14px","top":"183px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF12","field -
     A                                      type":"button","value":"Cancel","sh-
     A                                      ortcut key":"F12","left":"14px","to-
     A                                      p":"216px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnHELP","field type":"butt-
     A                                      on","shortcut key":"Alt-F1","bypass-
     A                                       validation":"true","value":"HELP",-
     A                                      "response":{"fieldName":"*IN10","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"lef-
     A                                      t":"14px","top":"249px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnROLLDOWN","-
     A                                      field type":"button","value":"Page -
     A                                      Up","shortcut key":"PageUp","respon-
     A                                      se":{"fieldName":"*IN19","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"left":"14p-
     A                                      x","top":"282px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnROLLUP","field typ-
     A                                      e":"button","value":"Page Down","sh-
     A                                      ortcut key":"PageDown","response":{-
     A                                      "fieldName":"*IN18","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"left":"14px","t-
     A                                      op":"315px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      }]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFL01    R        H      REFFLD(FLAG)
