     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A*PUI                                  SFLDEFINE(18)
     A*PUI                                  SFLDEFINE(19)
     A          R SCR01
     A  10 11 18
     A  19 20                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                      SETOF(19 'Response Indicator *IN19')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                  1  2HTML('QPUIREC48   RPUTOVR    0     -
     A                                      RROWS      2    C1    1C2    23 FSC-
     A                                      CODE    OVRDTA    0     RERRMSGID  -
     A                                      5    C6    SCFL01C7    WCR0600C6   -
     A                                       WMESGGC0    C0    E1    3     20FS-
     A                                      CFN01    OVRDTA    0     FSCSD01   -
     A                                       OVRDTA    0     FSCST01    OVRDTA -
     A                                         0     FSCFN02    OVRDTA    0    -
     A                                       FSCSD02    OVRDTA    0     FSCST02-
     A                                          OVRDTA    0     FSCFN03    OVRD-
     A                                      TA    0     FSCSD03    OVRDTA    0 -
     A                                          FSCST03    OVRDTA    0     FSCF-
     A                                      N04    OVRDTA    0     FSCSD04    O-
     A                                      VRDTA    0     FSCST04    OVRDTA   -
     A                                       0     FSCFN05    OVRDTA    0     F-
     A                                      SCSD05    OVRDTA    0     FSCST05  -
     A                                        OVRDTA    0     FSCFN06    OVRDTA-
     A                                          0     FSCSD06    OVRDTA    0   -
     A                                        FSCST06    OVRDTA    0     FSCFN0-
     A                                      7    OVRDTA    0     FSCSD07    OVR-
     A                                      DTA    0     FSCST07    OVRDTA    0-
     A                                           FSCFN08    OVRDTA    0     FSC-
     A                                      SD08    OVRDTA    0     FSCST08    -
     A                                      OVRDTA    0     FSCFN09    OVRDTA  -
     A                                        0     FSCSD09    OVRDTA    0     -
     A                                      FSCST09    OVRDTA    0     FSCFN10 -
     A                                         OVRDTA    0     FSCSD10    OVRDT-
     A                                      A    0     FSCST10    OVRDTA    0  -
     A                                         FSCFN11    OVRDTA    0     FSCSD-
     A                                      11    OVRDTA    0     FSCST11    OV-
     A                                      RDTA    0     FSCFN12    OVRDTA    -
     A                                      0     FSCSD12    OVRDTA    0     FS-
     A                                      CST12    OVRDTA    0     FSCFN13   -
     A                                       OVRDTA    0     FSCSD13    OVRDTA -
     A                                         0     FSCST13    OVRDTA    0    -
     A                                       FSCFN14    OVRDTA    0     FSCSD14-
     A                                          OVRDTA    0     FSCST14    OVRD-
     A                                      TA    0     FSCUP      OVRDTA    0 -
     A                                          FSCDOWN    OVRDTA    0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "put override":"true","set off":{"f-
     A                                      ieldName":"*IN20","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"1-23"},"items":[{"id":"W0543F_S-
     A                                      CR01_avKeys","field type":"output f-
     A                                      ield","value":{"fieldName":"AV_KEYS-
     A                                      ","dataLength":"1134","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[AV_KEYS]"},"left":"0px","t-
     A                                      op":"0px","visibility":"hidden"},{"-
     A                                      id":"W0543F_SCR01_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"W0543F_SCR01_B-
     A                                      tnIconMenuSystemTools","tool tip":"-
     A                                      System Tools","icon alignment":"mid-
     A                                      dle left","icon width":"16px","icon-
     A                                       height":"24px","icon source":"/pro-
     A                                      foundui/userdata/images/systool/sys-
     A                                      tools.png","data function":"SystemT-
     A                                      oolbarSystools","show down arrow":"-
     A                                      Yes"},{"field type":"panel","panel -
     A                                      style":"TransformButtonBar","id":"W-
     A                                      0543F_SCR01_ButtonBar","top":"35px"-
     A                                      ,"left":"1036px","width":"187px","h-
     A                                      eight":"28px","css class":"stationa-
     A                                      ry","visibility":"hidden","locked i-
     A                                      n place":"true"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1040px","id":"W0543F_SCR01_BtnS-
     A                                      ave","tool tip":"Save","onclick":"S-
     A                                      ystemToolbarSave","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/save.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1066px","id":"W0543F_SCR-
     A                                      01_BtnRefresh","tool tip":"Refresh"-
     A                                      ,"onclick":"SystemToolbarRefresh","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/refresh.p-
     A                                      ng'')"},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1092p-
     A                                      x","id":"W0543F_SCR01_BtnSearch","t-
     A                                      ool tip":"Search","onclick":"System-
     A                                      ToolbarSearch","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/search.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1118px","id":"W0543F_SCR0-
     A                                      1_BtnDiaryItems","tool tip":"Diary/-
     A                                      Work Items - IDARTS","onclick":"Sys-
     A                                      temToolbarDiary","background image"-
     A                                      :{"fieldName":"DryIcnURL","dataLeng-
     A                                      th":"128","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none"}},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1144px","id":"W0543F_SCR01_Btn-
     A                                      SystemMessages","tool tip"')
     A                                  1  4HTML(':"System Messages","onclick":-
     A                                      "SystemToolbarMessages","background-
     A                                       image":{"fieldName":"MsgIcnURL","d-
     A                                      ataLength":"128","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"}},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1196px","id":"W0543F_SC-
     A                                      R01_BtnHelp","tool tip":"Help","onc-
     A                                      lick":"SystemToolbarHelp","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/help.png'')"},{"i-
     A                                      d":"W0543F_SCR01_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"W0543F_SCR01_MainTabPanel","fiel-
     A                                      d type":"tab panel","tab panel styl-
     A                                      e":"Transform","tab names":{"fieldN-
     A                                      ame":"SCPRDS","designValue":"[SCPRD-
     A                                      S]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0543F_SCR01_BtnHiddenSa-
     A                                      ve","value":"btnSave","top":"100px"-
     A                                      ,"response":{"fieldName":"btnSave",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"SCUSER","field type":"output-
     A                                       field","value":{"fieldName":"SCUSE-
     A                                      R","designValue":"[SCUSER]","refFie-
     A                                      ld":"USER","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"281px","cursor co-
     A                                      lumn":"2","top":"110px","cursor row-
     A                                      ":"1","css class 2":"top-line","par-
     A                                      ent tab panel":"W0543F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"SC-
     A                                      CONM","field type":"output field","-
     A                                      value":{"fieldName":"SCCONM","desig-
     A                                      nValue":"[SCCONM]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"414px","cursor column":"21-
     A                                      ","top":"110px","cursor row":"1","c-
     A                                      ss class 2":"top-line","description-
     A                                      ":"COMPANY NAME","parent tab panel"-
     A                                      :"W0543F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant1","fiel-
     A                                      d type":"output field","left":"778p-
     A                                      x","cursor column":"73","top":"110p-
     A                                      x","cursor row":"1","css class":"to-
     A                                      p-line","value":"js: currentDate()"-
     A                                      ,"css class 2":"output-field","pare-
     A                                      nt tab panel":"W0543F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"W05-
     A                                      43F_SCR01_fkeyMenu","field type":"m-
     A                                      enu","left":"10px","top":"120px","h-
     A                                      eight":"350px","width":"230px","hov-
     A                                      er background color":"#9AAA61","hov-
     A                                      er text color":"#FFFFFF","border co-
     A                                      lor":"#4C6106","menu option indent"-
     A                                      :"10px","background color":"#758B27-
     A                                      ","css class":"action-menu","css cl-
     A                                      ass 2":"stationary","z index":"101"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W0543F_SCR-
     A                                      01_BtnHiddenRefresh","value":"btnRe-
     A                                      fresh","top":"125px","response":{"f-
     A                                      ieldName":"btnRefresh","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant2","field type":"output field","-
     A                                      value":"W0543F","css class":"consta-
     A                                      nt","left":"281px","cursor column":-
     A                                      "2","top":"130px","cursor row":"2",-
     A                                      "parent tab panel":"W0543F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCPRDS","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCPRDS","d-
     A                                      esignValue":"[SCPRDS]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"414px","cursor column"-
     A                                      :"21","top":"130px","cursor row":"2-
     A                                      ","description":"PROGRAM NAME","par-
     A                                      ent tab panel":"W0543F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","visibilit-
     A                                      y":"hidden","css class 2":"profound-
     A                                      -converted"},{"id":"constant3","fie-
     A                                      ld type":"output field","value":"SC-
     A                                      R01","css class":"constant","left":-
     A                                      "799px","cursor column":"7')
     A                                  1  5HTML('6","top":"130px","cursor row"-
     A                                      :"2","parent tab panel":"W0543F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCMODE","field type":"output-
     A                                       field","value":{"fieldName":"SCMOD-
     A                                      E","designValue":"[SCMODE]","refFie-
     A                                      ld":"NM10","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"764px","cursor co-
     A                                      lumn":"71","top":"150px","cursor ro-
     A                                      w":"3","css class 2":"HI","descript-
     A                                      ion":"ADD/UPDATE MODE","parent tab -
     A                                      panel":"W0543F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0543F_SCR01_BtnHiddenSearch"-
     A                                      ,"value":"btnSearch","top":"150px",-
     A                                      "response":{"fieldName":"btnSearch"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant5","field type":"ou-
     A                                      tput field","value":"Agent:","css c-
     A                                      lass":"constant","left":"288px","cu-
     A                                      rsor column":"3","top":"170px","cur-
     A                                      sor row":"4","parent tab panel":"W0-
     A                                      543F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCFEIN","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCFEIN","designValue":"[SCFEIN]"-
     A                                      ,"refField":"FEIN","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00"},"css class"-
     A                                      :"output-field","left":"344px","cur-
     A                                      sor column":"11","top":"170px","cur-
     A                                      sor row":"4","width":"63px","text a-
     A                                      lign":"right","css class 2":"HI","p-
     A                                      arent tab panel":"W0543F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      constant6","field type":"output fie-
     A                                      ld","value":"Modifier:","css class"-
     A                                      :"constant","left":"428px","cursor -
     A                                      column":"23","top":"170px","cursor -
     A                                      row":"4","parent tab panel":"W0543F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCMOD","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      MOD","designValue":"[SCMOD]","refFi-
     A                                      eld":"MOD","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00"},"css class":"output-
     A                                      -field","left":"505px","cursor colu-
     A                                      mn":"34","top":"170px","cursor row"-
     A                                      :"4","width":"21px","text align":"r-
     A                                      ight","css class 2":"HI","parent ta-
     A                                      b panel":"W0543F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"SCANAM",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCANAM","designValue-
     A                                      ":"[SCANAM]","refField":"NM30","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"547px","cursor column":"40","top-
     A                                      ":"170px","cursor row":"4","css cla-
     A                                      ss 2":"HI","description":"agent nam-
     A                                      e","parent tab panel":"W0543F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0543F_SCR01_B-
     A                                      tnHiddenDiaryItems","value":"btnDia-
     A                                      ry","top":"175px","response":{"fiel-
     A                                      dName":"btnDiary","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0543F_SCR01_BtnHiddenSystemM-
     A                                      essages","value":"btnMessage","top"-
     A                                      :"200px","response":{"fieldName":"b-
     A                                      tnMessage","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant4","field-
     A                                       type":"output field","value":"Prod-
     A                                      ucer:","css class":"constant","left-
     A                                      ":"288px","cursor column":"3","top"-
     A                                      :"210px","cursor row":"6","parent t-
     A                                      ab panel":"W0543F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCCODE"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCCODE","design-
     A                                      Value":"[SCCODE]","refField":"AGT#"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"false","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00"},"left":"358px","cursor colum-
     A                                      n":"13","top":"210px","cursor row":-
     A                                      "6","width":"36px","css class 3":"U-
     A                                      L","override data":"true","descript-
     A                                      ion":"PRODUCER","parent tab panel":-
     A                                      "W0543F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 4":"profound-c-
     A                                      onverted"},{"id":"constant7","field-
     A                                       type":"output field","value":"Code-
     A                                      ","css class":"constant","')
     A                                  1  6HTML('left":"456px","cursor column"-
     A                                      :"27","top":"210px","cursor row":"6-
     A                                      ","parent tab panel":"W0543F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant8","field type":"output-
     A                                       field","value":"Description","css -
     A                                      class":"constant","left":"505px","c-
     A                                      ursor column":"34","top":"210px","c-
     A                                      ursor row":"6","parent tab panel":"-
     A                                      W0543F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant9","field -
     A                                      type":"output field","value":"Statu-
     A                                      s","css class":"constant","left":"7-
     A                                      36px","cursor column":"67","top":"2-
     A                                      10px","cursor row":"6","parent tab -
     A                                      panel":"W0543F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0543F_SCR01_BtnHiddenWorkSub-
     A                                      mitJob","value":"btnWrksbmjob","top-
     A                                      ":"225px","response":{"fieldName":"-
     A                                      btnWrkJob","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"SCFL01","field ty-
     A                                      pe":"password field","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCFL01","designVal-
     A                                      ue":"[SCFL01]","refField":"FLAG","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase"},"text transform":"uppercas-
     A                                      e","left":"442px","cursor column":"-
     A                                      25","top":"250px","cursor row":"8",-
     A                                      "width":"8px","error message id":"W-
     A                                      CR0600","error message file":"WMESG-
     A                                      G","error condition":{"fieldName":"-
     A                                      20","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"1 message","p-
     A                                      arent tab panel":"W0543F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      SCFN01","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCFN01","des-
     A                                      ignValue":"[SCFN01]","refField":"AG-
     A                                      T#","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"456px","cursor column":"27-
     A                                      ","top":"250px","cursor row":"8","w-
     A                                      idth":"35px","text align":"right","-
     A                                      override data":"true","parent tab p-
     A                                      anel":"W0543F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCSD01","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCSD01","designValue":"-
     A                                      [SCSD01]","refField":"DS30","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      505px","cursor column":"34","top":"-
     A                                      250px","cursor row":"8","override d-
     A                                      ata":"true","parent tab panel":"W05-
     A                                      43F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCST01","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCST01","designValue":"[SCST01]",-
     A                                      "refField":"FLAG","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"750px","cu-
     A                                      rsor column":"69","top":"250px","cu-
     A                                      rsor row":"8","override data":"true-
     A                                      ","parent tab panel":"W0543F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W0543F_SCR01_Bt-
     A                                      nHiddenWorkPrinterOutput","value":"-
     A                                      btnWrkprtout","top":"250px","respon-
     A                                      se":{"fieldName":"btnWrkPrnt","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"SCFL02","field type":"password fi-
     A                                      eld","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCFL02","designValue":"[SCFL02]","-
     A                                      refField":"FLAG","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"442px-
     A                                      ","cursor column":"25","top":"270px-
     A                                      ","cursor row":"9","width":"8px","p-
     A                                      arent tab panel":"W0543F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      SCFN02","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCFN02","des-
     A                                      ignValue":"[SCFN02]","refField":"AG-
     A                                      T#","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"456px","cursor column":"27-
     A                                      ","top":"270px","cursor row":"9","w-
     A                                      idth":"35px","text align":"right","-
     A                                      override data":"true","parent tab p-
     A                                      anel":"W0543F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCSD02","fi-
     A                                      eld type":"output field","')
     A                                  1  7HTML('value":{"fieldName":"SCSD02",-
     A                                      "designValue":"[SCSD02]","refField"-
     A                                      :"DS30","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"505px","cursor colum-
     A                                      n":"34","top":"270px","cursor row":-
     A                                      "9","override data":"true","parent -
     A                                      tab panel":"W0543F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCST02-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCST02","designVal-
     A                                      ue":"[SCST02]","refField":"FLAG","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"750px","cursor column":"69","t-
     A                                      op":"270px","cursor row":"9","overr-
     A                                      ide data":"true","parent tab panel"-
     A                                      :"W0543F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0543F_SCR01_BtnHiddenImageQueue","-
     A                                      value":"btnImgQue","top":"275px","r-
     A                                      esponse":{"fieldName":"btnImgQue","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"SLFL03","field type":"passwor-
     A                                      d field","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SLFL03","designValue":"[SLFL03-
     A                                      ]","refField":"FLAG","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"4-
     A                                      42px","cursor column":"25","top":"2-
     A                                      90px","cursor row":"10","width":"8p-
     A                                      x","parent tab panel":"W0543F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"SCFN03","field type":"output f-
     A                                      ield","value":{"fieldName":"SCFN03"-
     A                                      ,"designValue":"[SCFN03]","refField-
     A                                      ":"AGT#","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00"},"css class":"output-f-
     A                                      ield","left":"456px","cursor column-
     A                                      ":"27","top":"290px","cursor row":"-
     A                                      10","width":"35px","text align":"ri-
     A                                      ght","override data":"true","parent-
     A                                       tab panel":"W0543F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCSD0-
     A                                      3","field type":"output field","val-
     A                                      ue":{"fieldName":"SCSD03","designVa-
     A                                      lue":"[SCSD03]","refField":"DS30","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"505px","cursor column":"34","-
     A                                      top":"290px","cursor row":"10","ove-
     A                                      rride data":"true","parent tab pane-
     A                                      l":"W0543F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCST03","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCST03","designValue":"[SC-
     A                                      ST03]","refField":"FLAG","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"750-
     A                                      px","cursor column":"69","top":"290-
     A                                      px","cursor row":"10","override dat-
     A                                      a":"true","parent tab panel":"W0543-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W0543F_-
     A                                      SCR01_BtnHiddenHelp","value":"btnHe-
     A                                      lp","top":"300px","response":{"fiel-
     A                                      dName":"btnHelp","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"SCFL04","fi-
     A                                      eld type":"password field","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCFL04","des-
     A                                      ignValue":"[SCFL04]","refField":"FL-
     A                                      AG","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase"},"text transform":"up-
     A                                      percase","left":"442px","cursor col-
     A                                      umn":"25","top":"310px","cursor row-
     A                                      ":"11","width":"8px","parent tab pa-
     A                                      nel":"W0543F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"SCFN04","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCFN04","designValue":"[-
     A                                      SCFN04]","refField":"AGT#","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00"},"cs-
     A                                      s class":"output-field","left":"456-
     A                                      px","cursor column":"27","top":"310-
     A                                      px","cursor row":"11","width":"35px-
     A                                      ","text align":"right","override da-
     A                                      ta":"true","parent tab panel":"W054-
     A                                      3F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCSD04","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCSD04","designValue":"[S')
     A                                  1  8HTML('CSD04]","refField":"DS30","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"505px","cursor column":"34","to-
     A                                      p":"310px","cursor row":"11","overr-
     A                                      ide data":"true","parent tab panel"-
     A                                      :"W0543F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCST04","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCST04","designValue":"[SCST-
     A                                      04]","refField":"FLAG","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"750px-
     A                                      ","cursor column":"69","top":"310px-
     A                                      ","cursor row":"11","override data"-
     A                                      :"true","parent tab panel":"W0543F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCFL05","field type":"pas-
     A                                      sword field","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCFL05","designValue":"[SC-
     A                                      FL05]","refField":"FLAG","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"442px","cursor column":"25","top-
     A                                      ":"330px","cursor row":"12","width"-
     A                                      :"8px","parent tab panel":"W0543F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"SCFN05","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCF-
     A                                      N05","designValue":"[SCFN05]","refF-
     A                                      ield":"AGT#","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00"},"css class":"outp-
     A                                      ut-field","left":"456px","cursor co-
     A                                      lumn":"27","top":"330px","cursor ro-
     A                                      w":"12","width":"35px","text align"-
     A                                      :"right","override data":"true","pa-
     A                                      rent tab panel":"W0543F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CSD05","field type":"output field",-
     A                                      "value":{"fieldName":"SCSD05","desi-
     A                                      gnValue":"[SCSD05]","refField":"DS3-
     A                                      0","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"505px","cursor column":"3-
     A                                      4","top":"330px","cursor row":"12",-
     A                                      "override data":"true","parent tab -
     A                                      panel":"W0543F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCST05","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCST05","designValue":-
     A                                      "[SCST05]","refField":"FLAG","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "750px","cursor column":"69","top":-
     A                                      "330px","cursor row":"12","override-
     A                                       data":"true","parent tab panel":"W-
     A                                      0543F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCFL06","field type-
     A                                      ":"password field","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCFL06","designValue-
     A                                      ":"[SCFL06]","refField":"FLAG","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"442px","cursor column":"25-
     A                                      ","top":"350px","cursor row":"13","-
     A                                      width":"8px","parent tab panel":"W0-
     A                                      543F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"SCFN06","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCFN06","designValue":"[SCFN06]"-
     A                                      ,"refField":"AGT#","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00"},"css class"-
     A                                      :"output-field","left":"456px","cur-
     A                                      sor column":"27","top":"350px","cur-
     A                                      sor row":"13","width":"35px","text -
     A                                      align":"right","override data":"tru-
     A                                      e","parent tab panel":"W0543F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCSD06","field type":"output f-
     A                                      ield","value":{"fieldName":"SCSD06"-
     A                                      ,"designValue":"[SCSD06]","refField-
     A                                      ":"DS30","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"505px","cursor colu-
     A                                      mn":"34","top":"350px","cursor row"-
     A                                      :"13","override data":"true","paren-
     A                                      t tab panel":"W0543F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCST-
     A                                      06","field type":"output field","va-
     A                                      lue":{"fieldName":"SCST06","designV-
     A                                      alue":"[SCST06]","refField":"FLAG",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"750px","cursor column":"69",-
     A                                      "top":"350px","cursor row":"13","ov-
     A                                      erride data":"true","paren')
     A                                  1  9HTML('t tab panel":"W0543F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCFL07","field type":"password fi-
     A                                      eld","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCFL07","designValue":"[SCFL07]","-
     A                                      refField":"FLAG","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"442px-
     A                                      ","cursor column":"25","top":"370px-
     A                                      ","cursor row":"14","width":"8px","-
     A                                      parent tab panel":"W0543F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "SCFN07","field type":"output field-
     A                                      ","value":{"fieldName":"SCFN07","de-
     A                                      signValue":"[SCFN07]","refField":"A-
     A                                      GT#","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00"},"css class":"output-field-
     A                                      ","left":"456px","cursor column":"2-
     A                                      7","top":"370px","cursor row":"14",-
     A                                      "width":"35px","text align":"right"-
     A                                      ,"override data":"true","parent tab-
     A                                       panel":"W0543F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCSD07","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCSD07","designValue"-
     A                                      :"[SCSD07]","refField":"DS30","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"505px","cursor column":"34","top"-
     A                                      :"370px","cursor row":"14","overrid-
     A                                      e data":"true","parent tab panel":"-
     A                                      W0543F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCST07","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCST07","designValue":"[SCST07-
     A                                      ]","refField":"FLAG","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"750px",-
     A                                      "cursor column":"69","top":"370px",-
     A                                      "cursor row":"14","override data":"-
     A                                      true","parent tab panel":"W0543F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCFL08","field type":"passw-
     A                                      ord field","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCFL08","designValue":"[SCFL-
     A                                      08]","refField":"FLAG","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "442px","cursor column":"25","top":-
     A                                      "390px","cursor row":"15","width":"-
     A                                      8px","parent tab panel":"W0543F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"SCFN08","field type":"output-
     A                                       field","value":{"fieldName":"SCFN0-
     A                                      8","designValue":"[SCFN08]","refFie-
     A                                      ld":"AGT#","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00"},"css class":"output-
     A                                      -field","left":"456px","cursor colu-
     A                                      mn":"27","top":"390px","cursor row"-
     A                                      :"15","width":"35px","text align":"-
     A                                      right","override data":"true","pare-
     A                                      nt tab panel":"W0543F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCS-
     A                                      D08","field type":"output field","v-
     A                                      alue":{"fieldName":"SCSD08","design-
     A                                      Value":"[SCSD08]","refField":"DS30"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"505px","cursor column":"34"-
     A                                      ,"top":"390px","cursor row":"15","o-
     A                                      verride data":"true","parent tab pa-
     A                                      nel":"W0543F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCST08","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCST08","designValue":"[-
     A                                      SCST08]","refField":"FLAG","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"7-
     A                                      50px","cursor column":"69","top":"3-
     A                                      90px","cursor row":"15","override d-
     A                                      ata":"true","parent tab panel":"W05-
     A                                      43F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCFL09","field type":-
     A                                      "password field","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCFL09","designValue":-
     A                                      "[SCFL09]","refField":"FLAG","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se"},"text transform":"uppercase","-
     A                                      left":"442px","cursor column":"25",-
     A                                      "top":"410px","cursor row":"16","wi-
     A                                      dth":"8px","parent tab panel":"W054-
     A                                      3F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"SCFN09","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCFN09","designValue":"[SCFN09]","-
     A                                      refField":"AGT#","dataType')
     A                                  1 10HTML('":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"999.00"-
     A                                      },"css class":"output-field","left"-
     A                                      :"456px","cursor column":"27","top"-
     A                                      :"410px","cursor row":"16","width":-
     A                                      "35px","text align":"right","overri-
     A                                      de data":"true","parent tab panel":-
     A                                      "W0543F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCSD09","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCSD09","designValue":"[SCSD0-
     A                                      9]","refField":"DS30","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"505px"-
     A                                      ,"cursor column":"34","top":"410px"-
     A                                      ,"cursor row":"16","override data":-
     A                                      "true","parent tab panel":"W0543F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCST09","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCS-
     A                                      T09","designValue":"[SCST09]","refF-
     A                                      ield":"FLAG","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"750px","cursor -
     A                                      column":"69","top":"410px","cursor -
     A                                      row":"16","override data":"true","p-
     A                                      arent tab panel":"W0543F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCFL10","field type":"password fiel-
     A                                      d","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CFL10","designValue":"[SCFL10]","re-
     A                                      fField":"FLAG","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase"},"text tra-
     A                                      nsform":"uppercase","left":"442px",-
     A                                      "cursor column":"25","top":"430px",-
     A                                      "cursor row":"17","width":"8px","pa-
     A                                      rent tab panel":"W0543F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CFN10","field type":"output field",-
     A                                      "value":{"fieldName":"SCFN10","desi-
     A                                      gnValue":"[SCFN10]","refField":"AGT-
     A                                      #","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"false","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"9-
     A                                      99.00"},"css class":"output-field",-
     A                                      "left":"456px","cursor column":"27"-
     A                                      ,"top":"430px","cursor row":"17","w-
     A                                      idth":"35px","text align":"right","-
     A                                      override data":"true","parent tab p-
     A                                      anel":"W0543F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCSD10","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCSD10","designValue":"-
     A                                      [SCSD10]","refField":"DS30","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      505px","cursor column":"34","top":"-
     A                                      430px","cursor row":"17","override -
     A                                      data":"true","parent tab panel":"W0-
     A                                      543F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCST10","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCST10","designValue":"[SCST10]"-
     A                                      ,"refField":"FLAG","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"750px","c-
     A                                      ursor column":"69","top":"430px","c-
     A                                      ursor row":"17","override data":"tr-
     A                                      ue","parent tab panel":"W0543F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCFL11","field type":"passwor-
     A                                      d field","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCFL11","designValue":"[SCFL11-
     A                                      ]","refField":"FLAG","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"4-
     A                                      42px","cursor column":"25","top":"4-
     A                                      50px","cursor row":"18","width":"8p-
     A                                      x","parent tab panel":"W0543F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"SCFN11","field type":"output f-
     A                                      ield","value":{"fieldName":"SCFN11"-
     A                                      ,"designValue":"[SCFN11]","refField-
     A                                      ":"AGT#","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00"},"css class":"output-f-
     A                                      ield","left":"456px","cursor column-
     A                                      ":"27","top":"450px","cursor row":"-
     A                                      18","width":"35px","text align":"ri-
     A                                      ght","override data":"true","parent-
     A                                       tab panel":"W0543F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCSD1-
     A                                      1","field type":"output field","val-
     A                                      ue":{"fieldName":"SCSD11","designVa-
     A                                      lue":"[SCSD11]","refField":"DS30","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"505px","cursor column":"34","-
     A                                      top":"450px","cursor row":')
     A                                  1 11HTML('"18","override data":"true","-
     A                                      parent tab panel":"W0543F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCST11","field type":"output field-
     A                                      ","value":{"fieldName":"SCST11","de-
     A                                      signValue":"[SCST11]","refField":"F-
     A                                      LAG","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"750px","cursor column":-
     A                                      "69","top":"450px","cursor row":"18-
     A                                      ","override data":"true","parent ta-
     A                                      b panel":"W0543F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCFL12",-
     A                                      "field type":"password field","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCFL12","-
     A                                      designValue":"[SCFL12]","refField":-
     A                                      "FLAG","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase"},"text transform":-
     A                                      "uppercase","left":"442px","cursor -
     A                                      column":"25","top":"470px","cursor -
     A                                      row":"19","width":"8px","parent tab-
     A                                       panel":"W0543F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCFN12","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCFN12","designValue"-
     A                                      :"[SCFN12]","refField":"AGT#","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"999.00"},-
     A                                      "css class":"output-field","left":"-
     A                                      456px","cursor column":"27","top":"-
     A                                      470px","cursor row":"19","width":"3-
     A                                      5px","text align":"right","override-
     A                                       data":"true","parent tab panel":"W-
     A                                      0543F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCSD12","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCSD12","designValue":"[SCSD12]-
     A                                      ","refField":"DS30","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"505px","-
     A                                      cursor column":"34","top":"470px","-
     A                                      cursor row":"19","override data":"t-
     A                                      rue","parent tab panel":"W0543F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCST12","field type":"output-
     A                                       field","value":{"fieldName":"SCST1-
     A                                      2","designValue":"[SCST12]","refFie-
     A                                      ld":"FLAG","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"750px","cursor co-
     A                                      lumn":"69","top":"470px","cursor ro-
     A                                      w":"19","override data":"true","par-
     A                                      ent tab panel":"W0543F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      FL13","field type":"password field"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCF-
     A                                      L13","designValue":"[SCFL13]","refF-
     A                                      ield":"FLAG","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase"},"text trans-
     A                                      form":"uppercase","left":"442px","c-
     A                                      ursor column":"25","top":"490px","c-
     A                                      ursor row":"20","width":"8px","pare-
     A                                      nt tab panel":"W0543F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"SCF-
     A                                      N13","field type":"output field","v-
     A                                      alue":{"fieldName":"SCFN13","design-
     A                                      Value":"[SCFN13]","refField":"AGT#"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"false","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"999-
     A                                      .00"},"css class":"output-field","l-
     A                                      eft":"456px","cursor column":"27","-
     A                                      top":"490px","cursor row":"20","wid-
     A                                      th":"35px","text align":"right","ov-
     A                                      erride data":"true","parent tab pan-
     A                                      el":"W0543F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCSD13","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCSD13","designValue":"[S-
     A                                      CSD13]","refField":"DS30","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"50-
     A                                      5px","cursor column":"34","top":"49-
     A                                      0px","cursor row":"20","override da-
     A                                      ta":"true","parent tab panel":"W054-
     A                                      3F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCST13","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCST13","designValue":"[SCST13]","-
     A                                      refField":"FLAG","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"750px","cur-
     A                                      sor column":"69","top":"490px","cur-
     A                                      sor row":"20","override data":"true-
     A                                      ","parent tab panel":"W0543F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCFL14","field type":"password -
     A                                      field","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCFL14","designValue":"')
     A                                  1 12HTML('[SCFL14]","refField":"FLAG","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase"},"text transform":"upperca-
     A                                      se","left":"442px","cursor column":-
     A                                      "25","top":"510px","cursor row":"21-
     A                                      ","width":"8px","parent tab panel":-
     A                                      "W0543F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"SCFN14","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCFN14","designValue":"[SCFN1-
     A                                      4]","refField":"AGT#","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"999.00"},"css cla-
     A                                      ss":"output-field","left":"456px","-
     A                                      cursor column":"27","top":"510px","-
     A                                      cursor row":"21","width":"35px","te-
     A                                      xt align":"right","override data":"-
     A                                      true","parent tab panel":"W0543F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCSD14","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCSD-
     A                                      14","designValue":"[SCSD14]","refFi-
     A                                      eld":"DS30","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"505px","cursor c-
     A                                      olumn":"34","top":"510px","cursor r-
     A                                      ow":"21","override data":"true","pa-
     A                                      rent tab panel":"W0543F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CST14","field type":"output field",-
     A                                      "value":{"fieldName":"SCST14","desi-
     A                                      gnValue":"[SCST14]","refField":"FLA-
     A                                      G","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"750px","cursor column":"6-
     A                                      9","top":"510px","cursor row":"21",-
     A                                      "override data":"true","parent tab -
     A                                      panel":"W0543F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCUP","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCUP","designValue":"[SC-
     A                                      UP]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"9"},"css class"-
     A                                      :"output-field","left":"631px","cur-
     A                                      sor column":"52","top":"550px","cur-
     A                                      sor row":"23","override data":"true-
     A                                      ","parent tab panel":"W0543F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCDOWN","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCDOWN",-
     A                                      "designValue":"[SCDOWN]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"9"},"css class":"output-field"-
     A                                      ,"left":"736px","cursor column":"67-
     A                                      ","top":"550px","cursor row":"23","-
     A                                      override data":"true","parent tab p-
     A                                      anel":"W0543F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"btnSubmit",-
     A                                      "field type":"button","value":"Ente-
     A                                      r","shortcut key":"Enter","left":"1-
     A                                      4px","top":"150px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF03","field typ-
     A                                      e":"button","value":"Exit         "-
     A                                      ,"shortcut key":"F3","left":"14px",-
     A                                      "top":"183px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF12","field type":"b-
     A                                      utton","value":"Cancel      ","shor-
     A                                      tcut key":"F12","left":"14px","top"-
     A                                      :"216px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnHELP","field type":"button-
     A                                      ","shortcut key":"Alt-F1","bypass v-
     A                                      alidation":"true","value":"HELP","r-
     A                                      esponse":{"fieldName":"*IN10","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"left"-
     A                                      :"14px","top":"249px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnROLLDOWN","fi-
     A                                      eld type":"button","value":"Page Up-
     A                                      ","shortcut key":"PageUp","response-
     A                                      ":{"fieldName":"*IN19","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"left":"14px"-
     A                                      ,"top":"282px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnROLLUP","field type"-
     A                                      :"button","value":"Page Down","shor-
     A                                      tcut key":"PageDown","response":{"f-
     A                                      ieldName":"*IN18","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"left":"14px","top-
     A                                      ":"315px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"}]-
     A                                      }')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCDOWN         9A  H
     A            SCUP           9A  H
     A            SCANAM    R        H      REFFLD(NM30)
     A            SCCODE    R        H      REFFLD(AGT#)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFEIN    R        H      REFFLD(FEIN)
     A            SCFL01    R        H      REFFLD(FLAG)
     A            SCFL02    R        H      REFFLD(FLAG)
     A            SCFL04    R        H      REFFLD(FLAG)
     A            SCFL05    R        H      REFFLD(FLAG)
     A            SCFL06    R        H      REFFLD(FLAG)
     A            SCFL07    R        H      REFFLD(FLAG)
     A            SCFL08    R        H      REFFLD(FLAG)
     A            SCFL09    R        H      REFFLD(FLAG)
     A            SCFL10    R        H      REFFLD(FLAG)
     A            SCFL11    R        H      REFFLD(FLAG)
     A            SCFL12    R        H      REFFLD(FLAG)
     A            SCFL13    R        H      REFFLD(FLAG)
     A            SCFL14    R        H      REFFLD(FLAG)
     A            SCFN01    R        H      REFFLD(AGT#)
     A            SCFN02    R        H      REFFLD(AGT#)
     A            SCFN03    R        H      REFFLD(AGT#)
     A            SCFN04    R        H      REFFLD(AGT#)
     A            SCFN05    R        H      REFFLD(AGT#)
     A            SCFN06    R        H      REFFLD(AGT#)
     A            SCFN07    R        H      REFFLD(AGT#)
     A            SCFN08    R        H      REFFLD(AGT#)
     A            SCFN09    R        H      REFFLD(AGT#)
     A            SCFN10    R        H      REFFLD(AGT#)
     A            SCFN11    R        H      REFFLD(AGT#)
     A            SCFN12    R        H      REFFLD(AGT#)
     A            SCFN13    R        H      REFFLD(AGT#)
     A            SCFN14    R        H      REFFLD(AGT#)
     A            SCMOD     R        H      REFFLD(MOD)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSD01    R        H      REFFLD(DS30)
     A            SCSD02    R        H      REFFLD(DS30)
     A            SCSD03    R        H      REFFLD(DS30)
     A            SCSD04    R        H      REFFLD(DS30)
     A            SCSD05    R        H      REFFLD(DS30)
     A            SCSD06    R        H      REFFLD(DS30)
     A            SCSD07    R        H      REFFLD(DS30)
     A            SCSD08    R        H      REFFLD(DS30)
     A            SCSD09    R        H      REFFLD(DS30)
     A            SCSD10    R        H      REFFLD(DS30)
     A            SCSD11    R        H      REFFLD(DS30)
     A            SCSD12    R        H      REFFLD(DS30)
     A            SCSD13    R        H      REFFLD(DS30)
     A            SCSD14    R        H      REFFLD(DS30)
     A            SCST01    R        H      REFFLD(FLAG)
     A            SCST02    R        H      REFFLD(FLAG)
     A            SCST03    R        H      REFFLD(FLAG)
     A            SCST04    R        H      REFFLD(FLAG)
     A            SCST05    R        H      REFFLD(FLAG)
     A            SCST06    R        H      REFFLD(FLAG)
     A            SCST07    R        H      REFFLD(FLAG)
     A            SCST08    R        H      REFFLD(FLAG)
     A            SCST09    R        H      REFFLD(FLAG)
     A            SCST10    R        H      REFFLD(FLAG)
     A            SCST11    R        H      REFFLD(FLAG)
     A            SCST12    R        H      REFFLD(FLAG)
     A            SCST13    R        H      REFFLD(FLAG)
     A            SCST14    R        H      REFFLD(FLAG)
     A            SCUSER    R        H      REFFLD(USER)
     A            SLFL03    R        H      REFFLD(FLAG)
     A          R SCR99
     A  10 11 18
     A  19                                  CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                      SETOF(19 'Response Indicator *IN19')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C1    1 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"1-1"},"items"-
     A                                      :[{"id":"W0543F_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"W0543F_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W0543F_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"W0543F_SCR99_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1040px","id":"-
     A                                      W0543F_SCR99_BtnSave","tool tip":"S-
     A                                      ave","onclick":"SystemToolbarSave",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/save.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1066px"-
     A                                      ,"id":"W0543F_SCR99_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"W0543F_SC-
     A                                      R99_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"W0543F_SCR99_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "W0543F_SCR99_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLe')
     A                                  1  4HTML('ading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"W0543F_SCR99_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"W0543F_SCR99_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"W0543F_SCR99_Ma-
     A                                      inTabPanel","field type":"tab panel-
     A                                      ","tab panel style":"Transform","ta-
     A                                      b names":"Tab 1","active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      0543F_SCR99_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCR99-
     A                                      _SCFL01","field type":"output field-
     A                                      ","value":{"fieldName":"SCFL01","de-
     A                                      signValue":"[SCFL01]","refField":"F-
     A                                      LAG","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"110px","cursor row":"1",-
     A                                      "css class 2":"top-line","visibilit-
     A                                      y":"hidden","description":"DUMMY FI-
     A                                      ELD","parent tab panel":"W0543F_SCR-
     A                                      99_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"W0543F_SCR99_fkeyMenu","fiel-
     A                                      d type":"menu","left":"10px","top":-
     A                                      "120px","height":"350px","width":"2-
     A                                      30px","hover background color":"#9A-
     A                                      AA61","hover text color":"#FFFFFF",-
     A                                      "border color":"#4C6106","menu opti-
     A                                      on indent":"10px","background color-
     A                                      ":"#758B27","css class":"action-men-
     A                                      u","css class 2":"stationary","z in-
     A                                      dex":"101"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0543F_SCR99_BtnHiddenRefresh","val-
     A                                      ue":"btnRefresh","top":"125px","res-
     A                                      ponse":{"fieldName":"btnRefresh","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0543F_SCR99_B-
     A                                      tnHiddenSearch","value":"btnSearch"-
     A                                      ,"top":"150px","response":{"fieldNa-
     A                                      me":"btnSearch","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W0543F_SCR99_BtnHiddenDiaryItem-
     A                                      s","value":"btnDiary","top":"175px"-
     A                                      ,"response":{"fieldName":"btnDiary"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0543F_SCR9-
     A                                      9_BtnHiddenSystemMessages","value":-
     A                                      "btnMessage","top":"200px","respons-
     A                                      e":{"fieldName":"btnMessage","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0543F_SCR99_BtnHi-
     A                                      ddenWorkSubmitJob","value":"btnWrks-
     A                                      bmjob","top":"225px","response":{"f-
     A                                      ieldName":"btnWrkJob","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0543F_SCR99_BtnHiddenWor-
     A                                      kPrinterOutput","value":"btnWrkprto-
     A                                      ut","top":"250px","response":{"fiel-
     A                                      dName":"btnWrkPrnt","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility')
     A                                  1  5HTML('":"hidden","id":"W0543F_SCR99-
     A                                      _BtnHiddenImageQueue","value":"btnI-
     A                                      mgQue","top":"275px","response":{"f-
     A                                      ieldName":"btnImgQue","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0543F_SCR99_BtnHiddenHel-
     A                                      p","value":"btnHelp","top":"300px",-
     A                                      "response":{"fieldName":"btnHelp","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"btnSubmit","field type":"butt-
     A                                      on","value":"Enter","shortcut key":-
     A                                      "Enter","left":"14px","top":"150px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF03","field type":"button","value-
     A                                      ":"Exit         ","shortcut key":"F-
     A                                      3","left":"14px","top":"183px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF12-
     A                                      ","field type":"button","value":"Ca-
     A                                      ncel      ","shortcut key":"F12","l-
     A                                      eft":"14px","top":"216px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnHELP","fi-
     A                                      eld type":"button","shortcut key":"-
     A                                      Alt-F1","bypass validation":"true",-
     A                                      "value":"HELP","response":{"fieldNa-
     A                                      me":"*IN10","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"left":"14px","top":"249-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnROLLDOWN","field type":"button"-
     A                                      ,"value":"Page Up","shortcut key":"-
     A                                      PageUp","response":{"fieldName":"*I-
     A                                      N19","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"left":"14px","top":"282px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnROL-
     A                                      LUP","field type":"button","value":-
     A                                      "Page Down","shortcut key":"PageDow-
     A                                      n","response":{"fieldName":"*IN18",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      left":"14px","top":"315px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFL01    R        H      REFFLD(FLAG)
