     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(18)
     A          R WDW01S                    SFL
     A                                      SETOF(18)
     A  20 06     QPUI000001     1A  O  2  2
     A            SCDATA        36A  H
     A            SCSEL          1A  H
     A            SCACDS    R        H      REFFLD(DS20)
     A            SCACDT    R        H      REFFLD(DT8)
     A            SCACL#    R        H      REFFLD(DS25)
     A            SCCASE    R        H      REFFLD(CASE)
     A            SCDIV     R        H      REFFLD(DIV)
     A            SCEMP#    R        H      REFFLD(EMP#)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCSTAT    R        H      REFFLD(STAT)
     A          R QSFLCTL001                SFLCTL(WDW01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLWDW01C')
     A          R WDW01C
     A  11 18 01
     A  02 03 04
     A  05 14 20                            CA01(11 'Response Indicator *IN11')
     A  21 22 32                            CA02(18 'Response Indicator *IN18')
     A                                  1  2HTML('QPUICTL1    WDW01S    7    RS-
     A                                      FLDSP    0    E1    3     01RSFLDSP-
     A                                      CTL 0    E1    3     01RSFLINZ    0-
     A                                          E1    3     02RSFLDLT    0    E-
     A                                      1    3     03RSFLCLR    0    E1    -
     A                                      3     04RSFLPAG    1    C1    5 RSF-
     A                                      LSIZ    1    C3    999 0    5    RO-
     A                                      VERLAY   0     RWINDOW    0     RRO-
     A                                      WS      2    C1    1C2    14 RSFLMS-
     A                                      GID  4    C7    WCR1216C6    WMESGG-
     A                                      C5    *LIBLC0    E1    3     20RSFL-
     A                                      MSGID  4    C7    CPF5203C7    QCPF-
     A                                      MSGC5    *LIBLC0    E1    6     32 -
     A                                      18')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"WDW01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","error message id-
     A                                      ":"WCR1216","error message file":"W-
     A                                      MESGG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "20","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"2 messages",-
     A                                      "error message id 2":"CPF5203","err-
     A                                      or message file 2":"QCPFMSG","error-
     A                                       message library 2":"*LIBL","error -
     A                                      condition 2":{"fieldName":"32 and 1-
     A                                      8","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"show as window":"true","window -
     A                                      top":"5","window left":"2","valid c-
     A                                      ommand key":{"fieldName":"*IN11","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"ov-
     A                                      erlay range":"1-14","design overlay-
     A                                       formats":"WDW01"},"items":[{"id":"-
     A                                      #@$2","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"#@$2","designValue":"[#@$2]-
     A                                      ","dataType":"zoned","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"true","zeroFill":"true","curSy-
     A                                      m":"","units":"","negNum":"-999.00"-
     A                                      ,"dataLength":"3","decPos":"0"},"le-
     A                                      ft":"0px","top":"-30px","width":"21-
     A                                      px","text align":"right","css class-
     A                                      ":"profound-converted"},{"id":"WDW0-
     A                                      1C","field type":"panel","panel sty-
     A                                      le":"Transform Dialog","text align"-
     A                                      :"center","left":"5px","top":"5px",-
     A                                      "height":"477px","width":"562px","z-
     A                                       index":"8","locked in place":"true-
     A                                      "},{"id":"SCUSER","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      USER","designValue":"[SCUSER]","ref-
     A                                      Field":"USER","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"22px","cursor -
     A                                      column":"1","top":"65px","cursor ro-
     A                                      w":"1","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCCONM","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCCONM","designValue":"[SCCONM]"-
     A                                      ,"refField":"NAME","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"113px","c-
     A                                      ursor column":"14","top":"65px","cu-
     A                                      rsor row":"1","css class 2":"HI","d-
     A                                      escription":"COMPANY NAME","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      constant1","field type":"output fie-
     A                                      ld","left":"442px","cursor column":-
     A                                      "61","top":"65px","cursor row":"1",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass":"output-field","css class 2":"-
     A                                      profound-converted"},{"id":"SCFILE"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCFILE","designValu-
     A                                      e":"[SCFILE]","refField":"FLE","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"22px","cursor column":"1","top":-
     A                                      "85px","cursor row":"2","css class -
     A                                      2":"profound-converted"},{"id":"SCP-
     A                                      RDS","field type":"output field","v-
     A                                      alue":{"fieldName":"SCPRDS","design-
     A                                      Value":"[SCPRDS]","refField":"DS40"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"113px","cursor column":"14"-
     A                                      ,"top":"85px","cursor row":"2","css-
     A                                       class 2":"HI","description":"PROGR-
     A                                      AM NAME","visibility":"hidden","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant2","field type":"output-
     A                                       field","value":"WDW01","css class"-
     A                                      :"constant","left":"463px","cursor -
     A                                      column":"64","top":"85px","cursor r-
     A                                      ow":"2","css class 2":"profound-con-
     A                                      verted"},{"id":"constant3","field t-
     A                                      ype":"output field","value":"Claima-
     A                                      nt:","css class":"constant","left":-
     A                                      "22px","cursor column":"1","top":"1-
     A                                      25px","cursor row":"4","css class 2-
     A                                      ":"profound-converted"},{"id":"SCSS-
     A                                      #","field type":"output field","val-
     A                                      ue":{"fieldName":"SCSS#","designVal-
     A                                      ue":"[SCSS#]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none","dataLength":"11"},"-
     A                                      css class":"output-field","left":"9-
     A                                      2px","cursor column":"11","top":"12-
     A                                      5px","cursor row":"4","css class 2"-
     A                                      :"profound-converted"},{"id":"SCCNA-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"SCCNAM","designVa-
     A                                      lue":"[SCCNAM]","refField":"DS40","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"176px","cursor column":"23","-
     A                                      top":"125px","cursor row":"4","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant4","field type":"output -
     A                                      field","value":"Accident date:","cs-
     A                                      s class":"constant","left":"22px","-
     A                                      cursor column":"1","top":"145px","c-
     A                                      ursor row":"5","css class 2":"profo-
     A                                      und-converted"},{"id":"SCD')
     A                                  1  4HTML('ATE","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCDAT-
     A                                      E","designValue":"[SCDATE]","refFie-
     A                                      ld":"DT8","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"-999.00"},"left":"127px","cur-
     A                                      sor column":"16","top":"145px","cur-
     A                                      sor row":"5","width":"57px","set fo-
     A                                      cus":"true","css class 3":"profound-
     A                                      -converted"},{"id":"constant5","fie-
     A                                      ld type":"output field","value":"Op-
     A                                      tions:","css class":"constant","lef-
     A                                      t":"36px","cursor column":"3","top"-
     A                                      :"185px","cursor row":"7","css clas-
     A                                      s 2":"profound-converted"},{"id":"c-
     A                                      onstant6","field type":"output fiel-
     A                                      d","value":"1=Select","css class":"-
     A                                      constant","left":"106px","cursor co-
     A                                      lumn":"13","top":"185px","cursor ro-
     A                                      w":"7","css class 2":"profound-conv-
     A                                      erted"},{"id":"constant7","field ty-
     A                                      pe":"output field","value":"Acciden-
     A                                      t","css class":"constant","left":"5-
     A                                      0px","cursor column":"5","top":"205-
     A                                      px","cursor row":"8","css class 2":-
     A                                      "profound-converted","css class 3":-
     A                                      "subfile-heading"},{"id":"constant8-
     A                                      ","field type":"output field","valu-
     A                                      e":"Accident","css class":"constant-
     A                                      ","visibility":{"fieldName":"21","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"left":"344px","cursor col-
     A                                      umn":"47","top":"205px","cursor row-
     A                                      ":"8","css class 2":"profound-conve-
     A                                      rted","css class 3":"subfile-headin-
     A                                      g"},{"id":"constant9","field type":-
     A                                      "output field","value":"Opt","css c-
     A                                      lass":"constant","left":"22px","cur-
     A                                      sor column":"1","top":"225px","curs-
     A                                      or row":"9","css class 2":"profound-
     A                                      -converted","css class 3":"subfile--
     A                                      heading"},{"id":"constant10","field-
     A                                       type":"output field","value":"date-
     A                                      ","css class":"constant","left":"64-
     A                                      px","cursor column":"7","top":"225p-
     A                                      x","cursor row":"9","css class 2":"-
     A                                      profound-converted","css class 3":"-
     A                                      subfile-heading"},{"id":"constant11-
     A                                      ","field type":"output field","valu-
     A                                      e":"Grp","css class":"constant","le-
     A                                      ft":"120px","cursor column":"15","t-
     A                                      op":"225px","cursor row":"9","css c-
     A                                      lass 2":"profound-converted","css c-
     A                                      lass 3":"subfile-heading"},{"id":"c-
     A                                      onstant12","field type":"output fie-
     A                                      ld","value":"Yr","css class":"const-
     A                                      ant","left":"155px","cursor column"-
     A                                      :"20","top":"225px","cursor row":"9-
     A                                      ","css class 2":"profound-converted-
     A                                      ","css class 3":"subfile-heading"},-
     A                                      {"id":"constant13","field type":"ou-
     A                                      tput field","value":"Case","css cla-
     A                                      ss":"constant","left":"183px","curs-
     A                                      or column":"24","top":"225px","curs-
     A                                      or row":"9","css class 2":"profound-
     A                                      -converted","css class 3":"subfile--
     A                                      heading"},{"id":"constant17","field-
     A                                       type":"output field","value":"Stat-
     A                                      e Claim #","css class":"constant","-
     A                                      visibility":{"fieldName":"22","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"232px","cursor column-
     A                                      ":"31","top":"225px","cursor row":"-
     A                                      9","css class 2":"profound-converte-
     A                                      d","css class 3":"subfile-heading"}-
     A                                      ,{"id":"constant14","field type":"o-
     A                                      utput field","value":"Emp#","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"21","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"267p-
     A                                      x","cursor column":"36","top":"225p-
     A                                      x","cursor row":"9","css class 2":"-
     A                                      profound-converted","css class 3":"-
     A                                      subfile-heading"},{"id":"constant15-
     A                                      ","field type":"output field","valu-
     A                                      e":"Div","css class":"constant","vi-
     A                                      sibility":{"fieldName":"21","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"316px","cursor column":-
     A                                      "43","top":"225px","cursor row":"9"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      ,"css class 3":"subfile-heading"},{-
     A                                      "id":"constant16","field type":"out-
     A                                      put field","value":"description","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"21","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "344px","cursor column":"47","top":-
     A                                      "225px","cursor row":"9","css class-
     A                                       2":"profound-converted","css class-
     A                                       3":"subfile-heading"},{"id":"const-
     A                                      ant18","field type":"output field",-
     A                                      "value":"  St","css class":"constan-
     A                                      t","left":"470px","cursor column":"-
     A                                      65","top":"225px","cursor row":"9",-
     A                                      "css class 2":"profound-converted",-
     A                                      "css class 3":"subfile-heading"},{"-
     A                                      id":"WDW01S","field type":"grid","n-
     A                                      umber of columns":"7","record forma-
     A                                      t name":"WDW01S","display subfile":-
     A                                      {"fieldName":"01","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"display c-
     A                                      ontrol record":{"fieldName":"01","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"clear subfile":{"fieldName":"-
     A                                      04","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"subfile size":"999","in-
     A                                      itialize subfile":{"fieldN')
     A                                  1  5HTML('ame":"02","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"delete subf-
     A                                      ile":{"fieldName":"03","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"plac-
     A                                      e cursor":"true","header height":"4-
     A                                      0","row height":"20","css class":"s-
     A                                      ubfilegrid","css class 2":"profound-
     A                                      -converted","parent tab panel":"W05-
     A                                      63F_WDW01C_MainTabPanel","parent ta-
     A                                      b":"0","subfile end":{"fieldName":"-
     A                                      05","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"page down response":{"f-
     A                                      ieldName":"*IN18","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"show paging contr-
     A                                      ols":"true","show page number":"tru-
     A                                      e","scrollbar":"none","number of ro-
     A                                      ws":"6","top":"205px","left":"22px"-
     A                                      ,"column widths":"16,77,28,28,56,25-
     A                                      9,40","subfile record number":{"fie-
     A                                      ldName":"#@$2","designValue":"[#@$2-
     A                                      ]","dataType":"zoned","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"true","zeroFill":"true","curS-
     A                                      ym":"","units":"","negNum":"-999.00-
     A                                      ","dataLength":"3","decPos":"0"}},{-
     A                                      "id":"btnSubmit","field type":"butt-
     A                                      on","value":"Enter","shortcut key":-
     A                                      "Enter","left":"14px","top":"437px"-
     A                                      ,"width":"80px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF03","field type":"button","value"-
     A                                      :"Exit","shortcut key":"F3","left":-
     A                                      "104px","top":"437px","width":"80px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF11","field t-
     A                                      ype":"button","visibility":{"fieldN-
     A                                      ame":"14","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"value":"Chang-
     A                                      e view","shortcut key":"F11","left"-
     A                                      :"194px","top":"437px","width":"80p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF12","field -
     A                                      type":"button","value":"Cancel","sh-
     A                                      ortcut key":"F12","left":"284px","t-
     A                                      op":"437px","width":"80px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnHELP","field type":"butt-
     A                                      on","shortcut key":"Alt-F1","onclic-
     A                                      k":"pui.showHelp()","value":"HELP",-
     A                                      "left":"374px","top":"437px","width-
     A                                      ":"80px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","v-
     A                                      isibility":"hidden","cursor":"defau-
     A                                      lt"},{"id":"SCEMP#","field type":"o-
     A                                      utput field","visibility":"hidden",-
     A                                      "value":{"fieldName":"SCEMP#","desi-
     A                                      gnValue":"[SCEMP#]","refField":"EMP-
     A                                      #","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"true","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00"},"left":"-58px","top":"-274px-
     A                                      ","width":"63px","text align":"righ-
     A                                      t","css class":"profound-converted"-
     A                                      ,"grid":"WDW01S","column":"0"},{"id-
     A                                      ":"SCACL#","field type":"output fie-
     A                                      ld","visibility":"hidden","value":{-
     A                                      "fieldName":"SCACL#","designValue":-
     A                                      "[SCACL#]","refField":"DS25","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none"},-
     A                                      "left":"-45px","top":"-274px","css -
     A                                      class":"profound-converted","grid":-
     A                                      "WDW01S","column":"0"},{"id":"SCACD-
     A                                      S","field type":"output field","vis-
     A                                      ibility":"hidden","value":{"fieldNa-
     A                                      me":"SCACDS","designValue":"[SCACDS-
     A                                      ]","refField":"DS20","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none"},"left":"-
     A                                      -45px","top":"-274px","css class":"-
     A                                      profound-converted","grid":"WDW01S"-
     A                                      ,"column":"0"},{"id":"SCDIV","field-
     A                                       type":"output field","visibility":-
     A                                      "hidden","value":{"fieldName":"SCDI-
     A                                      V","designValue":"[SCDIV]","refFiel-
     A                                      d":"DIV","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"true","zeroFill":"t-
     A                                      rue","curSym":"","units":"","negNum-
     A                                      ":"-999.00"},"left":"-30px","top":"-
     A                                      -274px","width":"35px","text align"-
     A                                      :"right","css class":"profound-conv-
     A                                      erted","grid":"WDW01S","column":"0"-
     A                                      },{"id":"SCSEL","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCSEL","designValue":"[SCSEL]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      ,"dataLength":"1"},"text transform"-
     A                                      :"uppercase","left":"7px","cursor c-
     A                                      olumn":"2","top":"1px","cursor row"-
     A                                      :"10","width":"8px","css class 3":{-
     A                                      "fieldName":"N06","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"css clas-
     A                                      s 4":{"fieldName":"20","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"RI","customFalse":""},"set-
     A                                       focus":{"fieldName":"20","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"d-
     A                                      escription":"SELECTION FIELD","css -
     A                                      class 5":"profound-convert')
     A                                  1  6HTML('ed","grid":"WDW01S","column":-
     A                                      "0"},{"id":"SCACDT","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCACDT","designValue":"[SCACDT]","r-
     A                                      efField":"DT8","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"true","curSym":"","units":"","-
     A                                      negNum":"-999.00","edtWrd":"''  /  -
     A                                      /    ''"},"css class":"output-field-
     A                                      ","left":"5px","cursor column":"4",-
     A                                      "top":"1px","cursor row":"10","widt-
     A                                      h":"70px","text align":"right","css-
     A                                       class 2":"profound-converted","gri-
     A                                      d":"WDW01S","column":"1"},{"id":"SC-
     A                                      FND","field type":"output field","v-
     A                                      alue":{"fieldName":"SCFND","designV-
     A                                      alue":"[SCFND]","refField":"FND","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"false","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"999.00-
     A                                      "},"css class":"output-field","left-
     A                                      ":"5px","cursor column":"15","top":-
     A                                      "1px","cursor row":"10","width":"21-
     A                                      px","text align":"right","css class-
     A                                       2":"profound-converted","grid":"WD-
     A                                      W01S","column":"2"},{"id":"SCFYR","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCFYR","designValue":-
     A                                      "[SCFYR]","refField":"FYR","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00"},"cs-
     A                                      s class":"output-field","left":"5px-
     A                                      ","cursor column":"19","top":"1px",-
     A                                      "cursor row":"10","width":"21px","t-
     A                                      ext align":"right","css class 2":"p-
     A                                      rofound-converted","grid":"WDW01S",-
     A                                      "column":"3"},{"id":"SCCASE","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCCASE","designValue":"[SC-
     A                                      CASE]","refField":"CASE","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00"},"css -
     A                                      class":"output-field","left":"5px",-
     A                                      "cursor column":"23","top":"1px","c-
     A                                      ursor row":"10","width":"49px","tex-
     A                                      t align":"right","css class 2":"pro-
     A                                      found-converted","grid":"WDW01S","c-
     A                                      olumn":"4"},{"id":"SCDATA","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCDATA","designValue":"[SCDA-
     A                                      TA]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"36"},"css class-
     A                                      ":"output-field","left":"5px","curs-
     A                                      or column":"31","top":"1px","cursor-
     A                                       row":"10","css class 2":"profound--
     A                                      converted","grid":"WDW01S","column"-
     A                                      :"5"},{"id":"SCSTAT","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCSTAT","designValue":"[SCSTAT]","-
     A                                      refField":"STAT","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"5px","curso-
     A                                      r column":"68","top":"1px","cursor -
     A                                      row":"10","css class 2":"profound-c-
     A                                      onverted","grid":"WDW01S","column":-
     A                                      "6"}]}')
     A            #@$2           3S 0H
     A            SCSS#         11A  H
     A            SCCNAM    R        H      REFFLD(DS40)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDATE    R        H      REFFLD(DT8)
     A            SCFILE    R        H      REFFLD(FLE)
     A            SCPRDS    R        H      REFFLD(DS40)
     A            SCUSER    R        H      REFFLD(USER)
     A          R WDW01
     A  11 18 14                            CA01(11 'Response Indicator *IN11')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                  1  2HTML('QPUIREC3    ROVERLAY   0     -
     A                                      RWINDOW    1    C6    WDW01C RROWS -
     A                                           2    C2    15C2    15 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"WDW01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "window reference":"WDW01C","overla-
     A                                      y":"true","valid command key":{"fie-
     A                                      ldName":"*IN11","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"overlay range":"15--
     A                                      15","design overlay formats":"WDW01-
     A                                      C"},"items":[{"id":"constant20","fi-
     A                                      eld type":"output field","value":" -
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"14","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"22px","cursor column":"1","top-
     A                                      ":"345px","cursor row":"15","css cl-
     A                                      ass 2":"BLU","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant19","f-
     A                                      ield type":"output field","value":"-
     A                                       ","css class":"constant","visibili-
     A                                      ty":{"fieldName":"N14","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"22px","cursor column":"1","t-
     A                                      op":"345px","cursor row":"15","css -
     A                                      class 2":"BLU","css class 3":"profo-
     A                                      und-converted"},{"id":"btnSubmit","-
     A                                      field type":"button","value":"Enter-
     A                                      ","shortcut key":"Enter","left":"14-
     A                                      px","top":"410px","width":"80px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnHELP","field type"-
     A                                      :"button","shortcut key":"Alt-F1","-
     A                                      onclick":"pui.showHelp()","value":"-
     A                                      HELP","left":"104px","top":"410px",-
     A                                      "width":"80px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnR-
     A                                      OLLUP","field type":"button","value-
     A                                      ":"Page Down","shortcut key":"PageD-
     A                                      own","response":{"fieldName":"*IN18-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"left":"194px","top":"410px","widt-
     A                                      h":"80px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"}]}')
     A          R SCR99
     A  11 18                               CA01(11 'Response Indicator *IN11')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                  1  2HTML('QPUIREC3    RASSUME    0     -
     A                                      RROWS      2    C1    2C1    2 FSCE-
     A                                      RR     INPUTONLY 0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","valid command key"-
     A                                      :{"fieldName":"*IN11","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"overlay range-
     A                                      ":"2-2"},"items":[{"id":"W0563F_SCR-
     A                                      99_avKeys","field type":"output fie-
     A                                      ld","value":{"fieldName":"AV_KEYS",-
     A                                      "dataLength":"1134","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[AV_KEYS]"},"left":"0px","top-
     A                                      ":"0px","visibility":"hidden"},{"id-
     A                                      ":"W0563F_SCR99_action","field type-
     A                                      ":"html container","white space":"n-
     A                                      ormal","left":"0px","top":"10px","w-
     A                                      idth":"230px","css class":"action-p-
     A                                      anel-converted","height":"700px","h-
     A                                      tml":"<div class=\"top\"></div><div-
     A                                       class=\"imagetop\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_top.png-
     A                                      \" /></div><div class=\"menulinks\"-
     A                                      ></div><div class=\"imagebottom\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_bottom.png\" /></div><div cl-
     A                                      ass=\"bottom\"></div>"},{"field typ-
     A                                      e":"icon menu button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"32px","z index":"20"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1170px","id":"W0563F_SCR99_Btn-
     A                                      IconMenuSystemTools","tool tip":"Sy-
     A                                      stem Tools","icon alignment":"middl-
     A                                      e left","icon width":"16px","icon h-
     A                                      eight":"24px","icon source":"/profo-
     A                                      undui/userdata/images/systool/systo-
     A                                      ols.png","data function":"SystemToo-
     A                                      lbarSystools","show down arrow":"Ye-
     A                                      s"},{"field type":"panel","panel st-
     A                                      yle":"TransformButtonBar","id":"W05-
     A                                      63F_SCR99_ButtonBar","top":"35px","-
     A                                      left":"1036px","width":"187px","hei-
     A                                      ght":"28px","css class":"stationary-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1040px","id":"W0563F_SCR99_BtnSav-
     A                                      e","tool tip":"Save","onclick":"Sys-
     A                                      temToolbarSave","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/save.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1066px","id":"W0563F_SCR99-
     A                                      _BtnRefresh","tool tip":"Refresh","-
     A                                      onclick":"SystemToolbarRefresh","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/refresh.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1092px"-
     A                                      ,"id":"W0563F_SCR99_BtnSearch","too-
     A                                      l tip":"Search","onclick":"SystemTo-
     A                                      olbarSearch","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/search.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1118px","id":"W0563F_SCR99_-
     A                                      BtnDiaryItems","tool tip":"Diary/Wo-
     A                                      rk Items - IDARTS","onclick":"Syste-
     A                                      mToolbarDiary","background image":{-
     A                                      "fieldName":"DryIcnURL","dataLength-
     A                                      ":"128","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"}},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1144px","id":"W0563F_SCR99_BtnSy-
     A                                      stemMessages","tool tip":"System Me-
     A                                      ssages","onclick":"SystemToolbarMes-
     A                                      sages","background image":{"fieldNa-
     A                                      me":"MsgIcnURL","dataLengt')
     A                                  1  4HTML('h":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1196px","id":"W0563F_SCR9-
     A                                      9_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"W0563F_SCR99_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "W0563F_SCR99_MainTabPanel","field -
     A                                      type":"tab panel","tab panel style"-
     A                                      :"Transform","tab names":"Tab 1","a-
     A                                      ctive tab":"0","left":"250px","top"-
     A                                      :"70px","width":"970px","height":"6-
     A                                      57px","z index":"8","locked in plac-
     A                                      e":"true","css class":"tab-panel","-
     A                                      css class 2":"stationary"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0563F_SCR99_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"W0563F_SCR99_fkeyMenu","-
     A                                      field type":"menu","left":"10px","t-
     A                                      op":"120px","height":"350px","width-
     A                                      ":"230px","hover background color":-
     A                                      "#9AAA61","hover text color":"#FFFF-
     A                                      FF","border color":"#4C6106","menu -
     A                                      option indent":"10px","background c-
     A                                      olor":"#758B27","css class":"action-
     A                                      -menu","css class 2":"stationary","-
     A                                      z index":"101"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W0563F_SCR99_BtnHiddenRefresh",-
     A                                      "value":"btnRefresh","top":"125px",-
     A                                      "response":{"fieldName":"btnRefresh-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"SCERR","field type":"passw-
     A                                      ord field","css class":"input","css-
     A                                       class 2":"textbox","input only":"t-
     A                                      rue","value":{"fieldName":"SCERR","-
     A                                      designValue":"[SCERR]","refField":"-
     A                                      FLAG","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","left":"288px","cursor c-
     A                                      olumn":"3","top":"130px","cursor ro-
     A                                      w":"2","width":"8px","read only":"t-
     A                                      rue","css class 3":"PR-UL","parent -
     A                                      tab panel":"W0563F_SCR99_MainTabPan-
     A                                      el","parent tab":"0","css class 4":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0563F_SCR99_BtnHiddenSea-
     A                                      rch","value":"btnSearch","top":"150-
     A                                      px","response":{"fieldName":"btnSea-
     A                                      rch","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W0563F_-
     A                                      SCR99_BtnHiddenDiaryItems","value":-
     A                                      "btnDiary","top":"175px","response"-
     A                                      :{"fieldName":"btnDiary","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0563F_SCR99_BtnHidden-
     A                                      SystemMessages","value":"btnMessage-
     A                                      ","top":"200px","response":{"fieldN-
     A                                      ame":"btnMessage","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0563F_SCR99_BtnHiddenWorkSub-
     A                                      mitJob","value":"btnWrksbmjob","top-
     A                                      ":"225px","response":{"fieldName":"-
     A                                      btnWrkJob","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      0563F_SCR99_BtnHiddenWorkPrinterOut-
     A                                      put","value":"btnWrkprtout","top":"-
     A                                      250px","response":{"fieldName":"btn-
     A                                      WrkPrnt","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place"')
     A                                  1  5HTML(':"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W0563F_SCR99_BtnHiddenI-
     A                                      mageQueue","value":"btnImgQue","top-
     A                                      ":"275px","response":{"fieldName":"-
     A                                      btnImgQue","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      0563F_SCR99_BtnHiddenHelp","value":-
     A                                      "btnHelp","top":"300px","response":-
     A                                      {"fieldName":"btnHelp","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"btnSu-
     A                                      bmit","field type":"button","value"-
     A                                      :"Enter","shortcut key":"Enter","le-
     A                                      ft":"14px","top":"150px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnHELP","fie-
     A                                      ld type":"button","shortcut key":"A-
     A                                      lt-F1","onclick":"pui.showHelp()","-
     A                                      value":"HELP","left":"14px","top":"-
     A                                      183px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnROLLUP","field type":"button-
     A                                      ","value":"Page Down","shortcut key-
     A                                      ":"PageDown","response":{"fieldName-
     A                                      ":"*IN18","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"left":"14px","top":"216px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR     R        H      REFFLD(FLAG)
