     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A*PUI                                  SFLDEFINE(18)
     A*PUI                                  SFLDEFINE(19)
     A          R SCR01
     A  10 11 18
     A  19 20 21
     A  22 23 24                            CA01(10 'Response Indicator *IN10')
     A  25 26 27
     A  28 29 30
     A  31 32 33                            CA02(11 'Response Indicator *IN11')
     A  34 83                               CA03(18 'Response Indicator *IN18')
     A                                      SETOF(19 'Response Indicator *IN19')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(33 'Response Indicator *IN33')
     A                                      SETOF(34 'Response Indicator *IN34')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    1C2    24 RERRMSGID  5    C6  -
     A                                        SCFL01C7    WCR0600C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     20')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN26","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN28","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N29","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN3-
     A                                      0","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN31"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN32","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN33","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN34","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"valid-
     A                                       command key":{"fieldName":"*IN11",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      overlay range":"1-24"},"items":[{"i-
     A                                      d":"W0569F_SCR01_avKeys","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"AV_KEYS","dataLength":"1134","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[AV_KEYS]"},"le-
     A                                      ft":"0px","top":"0px","visibility":-
     A                                      "hidden"},{"id":"W0569F_SCR01_actio-
     A                                      n","field type":"html container","w-
     A                                      hite space":"normal","left":"0px","-
     A                                      top":"10px","width":"230px","css cl-
     A                                      ass":"action-panel-converted","heig-
     A                                      ht":"700px","html":"<div class=\"to-
     A                                      p\"></div><div class=\"imagetop\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_top.png\" /></div><div class-
     A                                      =\"menulinks\"></div><div class=\"i-
     A                                      magebottom\"><img src=\"/profoundui-
     A                                      /userdata/images/bar_bottom.png\" /-
     A                                      ></div><div class=\"bottom\"></div>-
     A                                      "},{"field type":"icon menu button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"32px",-
     A                                      "z index":"20","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1170px","id":"W0-
     A                                      569F_SCR01_BtnIconMenuSystemTools",-
     A                                      "tool tip":"System Tools","icon ali-
     A                                      gnment":"middle left","icon width":-
     A                                      "16px","icon height":"24px","icon s-
     A                                      ource":"/profoundui/userdata/images-
     A                                      /systool/systools.png","data functi-
     A                                      on":"SystemToolbarSystools","show d-
     A                                      own arrow":"Yes"},{"field type":"pa-
     A                                      nel","panel style":"TransformButton-
     A                                      Bar","id":"W0569F_SCR01_ButtonBar",-
     A                                      "top":"35px","left":"1036px","width-
     A                                      ":"187px","height":"28px","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n","locked in place":"true"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1040px","id":"W0569-
     A                                      F_SCR01_BtnSave","tool tip":"Save",-
     A                                      "onclick":"SystemToolbarSave","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/save.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1066px","id"-
     A                                      :"W0569F_SCR01_BtnRefresh","tool ti-
     A                                      p":"Refresh","onclick":"SystemToolb-
     A                                      arRefresh","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/refresh.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-r')
     A                                  1  4HTML('epeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1092px","id":-
     A                                      "W0569F_SCR01_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"W0569F_SCR01_BtnDia-
     A                                      ryItems","tool tip":"Diary/Work Ite-
     A                                      ms - IDARTS","onclick":"SystemToolb-
     A                                      arDiary","background image":{"field-
     A                                      Name":"DryIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"114-
     A                                      4px","id":"W0569F_SCR01_BtnSystemMe-
     A                                      ssages","tool tip":"System Messages-
     A                                      ","onclick":"SystemToolbarMessages"-
     A                                      ,"background image":{"fieldName":"M-
     A                                      sgIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1196px","id-
     A                                      ":"W0569F_SCR01_BtnHelp","tool tip"-
     A                                      :"Help","onclick":"SystemToolbarHel-
     A                                      p","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/help.-
     A                                      png'')"},{"id":"W0569F_SCR01_ImgSys-
     A                                      ToolBottom","field type":"image","i-
     A                                      mage source":"/profoundui/userdata/-
     A                                      images/systool/butbarbot.png","left-
     A                                      ":"1036px","top":"64px","width":"18-
     A                                      7px","locked in place":"true","css -
     A                                      class":"stationary","visibility":"h-
     A                                      idden"},{"id":"W0569F_SCR01_MainTab-
     A                                      Panel","field type":"tab panel","ta-
     A                                      b panel style":"Transform","tab nam-
     A                                      es":{"fieldName":"SCPRDS","designVa-
     A                                      lue":"[SCPRDS]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"active tab":"0","left":"250p-
     A                                      x","top":"70px","width":"970px","he-
     A                                      ight":"657px","z index":"8","locked-
     A                                       in place":"true","css class":"tab--
     A                                      panel","css class 2":"stationary"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0569F_SCR01-
     A                                      _BtnHiddenSave","value":"btnSave","-
     A                                      top":"100px","response":{"fieldName-
     A                                      ":"btnSave","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"SCUSER","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCUSER","designValue":"[SCUS-
     A                                      ER]","refField":"USER","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"281px-
     A                                      ","cursor column":"2","top":"110px"-
     A                                      ,"cursor row":"1","css class 2":"to-
     A                                      p-line","parent tab panel":"W0569F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"SCCONM","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      CONM","designValue":"[SCCONM]","ref-
     A                                      Field":"NAME","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"414px","cursor-
     A                                       column":"21","top":"110px","cursor-
     A                                       row":"1","css class 2":"top-line",-
     A                                      "description":"COMPANY NAME","paren-
     A                                      t tab panel":"W0569F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant1","field type":"output field",-
     A                                      "left":"778px","cursor column":"73"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class":"top-line","value":"js: cu-
     A                                      rrentDate()","css class 2":"output--
     A                                      field","parent tab panel":"W0569F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"W0569F_SCR01_fkeyMenu","fi-
     A                                      eld type":"menu","left":"10px","top-
     A                                      ":"120px","height":"350px"')
     A                                  1  5HTML(',"width":"230px","hover backg-
     A                                      round color":"#9AAA61","hover text -
     A                                      color":"#FFFFFF","border color":"#4-
     A                                      C6106","menu option indent":"10px",-
     A                                      "background color":"#758B27","css c-
     A                                      lass":"action-menu","css class 2":"-
     A                                      stationary","z index":"101"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0569F_SCR01_BtnHi-
     A                                      ddenRefresh","value":"btnRefresh","-
     A                                      top":"125px","response":{"fieldName-
     A                                      ":"btnRefresh","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant2","f-
     A                                      ield type":"output field","value":"-
     A                                      W0569F","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"130px","cursor row":"2","parent -
     A                                      tab panel":"W0569F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPRDS-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCPRDS","designVal-
     A                                      ue":"[SCPRDS]","refField":"NAME","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"414px","cursor column":"21","t-
     A                                      op":"130px","cursor row":"2","descr-
     A                                      iption":"PROGRAM NAME","parent tab -
     A                                      panel":"W0569F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","visibility":"hidd-
     A                                      en","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant3","field type"-
     A                                      :"output field","value":"SCR01","cs-
     A                                      s class":"constant","left":"799px",-
     A                                      "cursor column":"76","top":"130px",-
     A                                      "cursor row":"2","parent tab panel"-
     A                                      :"W0569F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"constant4","fiel-
     A                                      d type":"output field","value":"Fun-
     A                                      d#:","css class":"constant","left":-
     A                                      "288px","cursor column":"3","top":"-
     A                                      150px","cursor row":"3","parent tab-
     A                                       panel":"W0569F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCFND","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCFND","designValue":"-
     A                                      [SCFND]","refField":"FND","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00"},"css-
     A                                       class":"output-field","left":"337p-
     A                                      x","cursor column":"10","top":"150p-
     A                                      x","cursor row":"3","width":"21px",-
     A                                      "text align":"right","css class 2":-
     A                                      "HI","parent tab panel":"W0569F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"SCNAME","field type":"output-
     A                                       field","value":{"fieldName":"SCNAM-
     A                                      E","designValue":"[SCNAME]","refFie-
     A                                      ld":"NM60","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"414px","cursor co-
     A                                      lumn":"21","top":"150px","cursor ro-
     A                                      w":"3","css class 2":"HI","parent t-
     A                                      ab panel":"W0569F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0569F_SCR01_BtnHiddenSear-
     A                                      ch","value":"btnSearch","top":"150p-
     A                                      x","response":{"fieldName":"btnSear-
     A                                      ch","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W0569F_S-
     A                                      CR01_BtnHiddenDiaryItems","value":"-
     A                                      btnDiary","top":"175px","response":-
     A                                      {"fieldName":"btnDiary","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant5","field type":"output field",-
     A                                      "value":"Fund Year:","css class":"c-
     A                                      onstant","left":"288px","cursor col-
     A                                      umn":"3","top":"190px","cursor row"-
     A                                      :"5","parent tab panel":"W0569F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCFYR","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      FYR","designValue":"[SCFYR]","refFi-
     A                                      eld":"FYR","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00"},"left":"365px","cur-
     A                                      sor column":"14","top":"190px","cur-
     A                                      sor row":"5","width":"22px","css cl-
     A                                      ass 3":"UL","parent tab panel":"W05-
     A                                      69F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 4":"profound-conve-
     A                                      rted"},{"id":"constant6","field typ-
     A                                      e":"output field","value":"Case:","-
     A                                      css class":"constant","left":"414px-
     A                                      ","cursor column":"21","top":"190px-
     A                                      ","cursor row":"5","parent tab pane-
     A                                      l":"W0569F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCCASE","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox",')
     A                                  1  6HTML('"value":{"fieldName":"SCCASE"-
     A                                      ,"designValue":"[SCCASE]","refField-
     A                                      ":"CASE","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00"},"left":"456px","curso-
     A                                      r column":"27","top":"190px","curso-
     A                                      r row":"5","width":"50px","css clas-
     A                                      s 3":"UL","parent tab panel":"W0569-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 4":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W0569F_-
     A                                      SCR01_BtnHiddenSystemMessages","val-
     A                                      ue":"btnMessage","top":"200px","res-
     A                                      ponse":{"fieldName":"btnMessage","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant7","field type":"outpu-
     A                                      t field","value":"Year","css class"-
     A                                      :"constant","left":"288px","cursor -
     A                                      column":"3","top":"210px","cursor r-
     A                                      ow":"6","css class 2":"UL","parent -
     A                                      tab panel":"W0569F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt8","field type":"output field","v-
     A                                      alue":"Case","css class":"constant"-
     A                                      ,"left":"344px","cursor column":"11-
     A                                      ","top":"210px","cursor row":"6","c-
     A                                      ss class 2":"UL","parent tab panel"-
     A                                      :"W0569F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant9","fiel-
     A                                      d type":"output field","value":"Acc-
     A                                      .Date","css class":"constant","left-
     A                                      ":"414px","cursor column":"21","top-
     A                                      ":"210px","cursor row":"6","css cla-
     A                                      ss 2":"UL","parent tab panel":"W056-
     A                                      9F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant10","field typ-
     A                                      e":"output field","value":"Prior Yr-
     A                                      ","css class":"constant","left":"49-
     A                                      1px","cursor column":"32","top":"21-
     A                                      0px","cursor row":"6","css class 2"-
     A                                      :"UL","parent tab panel":"W0569F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant11","field type":"o-
     A                                      utput field","value":"Current Yr","-
     A                                      css class":"constant","left":"568px-
     A                                      ","cursor column":"43","top":"210px-
     A                                      ","cursor row":"6","css class 2":"U-
     A                                      L","parent tab panel":"W0569F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"constant12","field type":"outp-
     A                                      ut field","value":"To Date","css cl-
     A                                      ass":"constant","left":"666px","cur-
     A                                      sor column":"57","top":"210px","cur-
     A                                      sor row":"6","css class 2":"UL","pa-
     A                                      rent tab panel":"W0569F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0569F_SCR01_BtnHidd-
     A                                      enWorkSubmitJob","value":"btnWrksbm-
     A                                      job","top":"225px","response":{"fie-
     A                                      ldName":"btnWrkJob","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"SCFL01",-
     A                                      "field type":"password field","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCFL01","-
     A                                      designValue":"[SCFL01]","refField":-
     A                                      "FLAG","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase"},"text transform":-
     A                                      "uppercase","left":"274px","cursor -
     A                                      column":"1","top":"250px","cursor r-
     A                                      ow":"8","width":"8px","set focus":{-
     A                                      "fieldName":"21","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"error mess-
     A                                      age id":"WCR0600","error message fi-
     A                                      le":"WMESGG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"20","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"1 mess-
     A                                      age","parent tab panel":"W0569F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"SCYR01","field type":"output-
     A                                       field","value":{"fieldName":"SCYR0-
     A                                      1","designValue":"[SCYR01]","refFie-
     A                                      ld":"FYR","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00"},"css class":"output--
     A                                      field","left":"288px","cursor colum-
     A                                      n":"3","top":"250px","cursor row":"-
     A                                      8","width":"21px","text align":"rig-
     A                                      ht","parent tab panel":"W0569F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCCA01","field type":"output -
     A                                      field","value":{"fieldName":"SCCA01-
     A                                      ","designValue":"[SCCA01]","refFiel-
     A                                      d":"CASE","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00"},"css class":"output--
     A                                      field","left":"323px","cursor colum-
     A                                      n":"8","top":"250px","cursor row":"-
     A                                      8","width":"49px","text align":"rig-
     A                                      ht","parent tab panel":"W0569F_SCR0-
     A                                      1_MainTabPanel","parent ta')
     A                                  1  7HTML('b":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCAD01","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCAD01","designValue":"[SC-
     A                                      AD01]","refField":"DT8","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"true","curSym":"","un-
     A                                      its":"","negNum":"-999.00","edtWrd"-
     A                                      :"''  /  /    ''"},"css class":"out-
     A                                      put-field","left":"414px","cursor c-
     A                                      olumn":"21","top":"250px","cursor r-
     A                                      ow":"8","width":"70px","text align"-
     A                                      :"right","parent tab panel":"W0569F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCPY01","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CPY01","designValue":"[SCPY01]","re-
     A                                      fField":"DT8","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"true","zeroFil-
     A                                      l":"true","curSym":"","units":"","n-
     A                                      egNum":"-999.00","edtWrd":"''  /  /-
     A                                          ''"},"css class":"output-field"-
     A                                      ,"left":"491px","cursor column":"32-
     A                                      ","top":"250px","cursor row":"8","w-
     A                                      idth":"70px","text align":"right","-
     A                                      parent tab panel":"W0569F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCCY01","field type":"output field-
     A                                      ","value":{"fieldName":"SCCY01","de-
     A                                      signValue":"[SCCY01]","refField":"D-
     A                                      T8","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"true",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","edtWrd":"''  /  /    ''"},"-
     A                                      css class":"output-field","left":"5-
     A                                      75px","cursor column":"44","top":"2-
     A                                      50px","cursor row":"8","width":"70p-
     A                                      x","text align":"right","parent tab-
     A                                       panel":"W0569F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCTD01","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCTD01","designValue"-
     A                                      :"[SCTD01]","refField":"DT8","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00","ed-
     A                                      tWrd":"''  /  /    ''"},"css class"-
     A                                      :"output-field","left":"659px","cur-
     A                                      sor column":"56","top":"250px","cur-
     A                                      sor row":"8","width":"70px","text a-
     A                                      lign":"right","parent tab panel":"W-
     A                                      0569F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W05-
     A                                      69F_SCR01_BtnHiddenWorkPrinterOutpu-
     A                                      t","value":"btnWrkprtout","top":"25-
     A                                      0px","response":{"fieldName":"btnWr-
     A                                      kPrnt","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"SCFL02","field type":-
     A                                      "password field","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCFL02","designValue":-
     A                                      "[SCFL02]","refField":"FLAG","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se"},"text transform":"uppercase","-
     A                                      left":"274px","cursor column":"1","-
     A                                      top":"270px","cursor row":"9","widt-
     A                                      h":"8px","set focus":{"fieldName":"-
     A                                      22","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"parent tab panel":"W056-
     A                                      9F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"SCYR02","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCYR02","designValue":"[SCYR02]","-
     A                                      refField":"FYR","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"999.00"},"css class":"o-
     A                                      utput-field","left":"288px","cursor-
     A                                       column":"3","top":"270px","cursor -
     A                                      row":"9","width":"21px","text align-
     A                                      ":"right","parent tab panel":"W0569-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCCA02","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCCA02","designValue":"[SCCA02]","r-
     A                                      efField":"CASE","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"999.00"},"css class":"o-
     A                                      utput-field","left":"323px","cursor-
     A                                       column":"8","top":"270px","cursor -
     A                                      row":"9","width":"49px","text align-
     A                                      ":"right","parent tab panel":"W0569-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCAD02","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCAD02","designValue":"[SCAD02]","r-
     A                                      efField":"DT8","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"true","curSym":"","units":"","-
     A                                      negNum":"-999.00","edtWrd":"''  /  -
     A                                      /    ''"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"270px","cursor row":"9","-
     A                                      width":"70px","text align":"right",-
     A                                      "parent tab panel":"W0569F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"')
     A                                  1  8HTML('0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCPY02","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCPY02","designValue":"[SCPY02-
     A                                      ]","refField":"DT8","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"true","curSym":"","units"-
     A                                      :"","negNum":"-999.00","edtWrd":"''-
     A                                        /  /    ''"},"css class":"output--
     A                                      field","left":"491px","cursor colum-
     A                                      n":"32","top":"270px","cursor row":-
     A                                      "9","width":"70px","text align":"ri-
     A                                      ght","parent tab panel":"W0569F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCCY02","field type":"output-
     A                                       field","value":{"fieldName":"SCCY0-
     A                                      2","designValue":"[SCCY02]","refFie-
     A                                      ld":"DT8","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      true","curSym":"","units":"","negNu-
     A                                      m":"-999.00","edtWrd":"''  /  /    -
     A                                      ''"},"css class":"output-field","le-
     A                                      ft":"575px","cursor column":"44","t-
     A                                      op":"270px","cursor row":"9","width-
     A                                      ":"70px","text align":"right","pare-
     A                                      nt tab panel":"W0569F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCT-
     A                                      D02","field type":"output field","v-
     A                                      alue":{"fieldName":"SCTD02","design-
     A                                      Value":"[SCTD02]","refField":"DT8",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"true","zeroFill":"true","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0","edtWrd":"''  /  /    ''"},"css -
     A                                      class":"output-field","left":"659px-
     A                                      ","cursor column":"56","top":"270px-
     A                                      ","cursor row":"9","width":"70px","-
     A                                      text align":"right","parent tab pan-
     A                                      el":"W0569F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0569F_SCR01_BtnHiddenImageQueue-
     A                                      ","value":"btnImgQue","top":"275px"-
     A                                      ,"response":{"fieldName":"btnImgQue-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"SLFL03","field type":"pass-
     A                                      word field","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SLFL03","designValue":"[SLF-
     A                                      L03]","refField":"FLAG","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"274px","cursor column":"1","top":-
     A                                      "290px","cursor row":"10","width":"-
     A                                      8px","set focus":{"fieldName":"23",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"parent tab panel":"W0569F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"SCYR03","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCY-
     A                                      R03","designValue":"[SCYR03]","refF-
     A                                      ield":"FYR","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00"},"css class":"outpu-
     A                                      t-field","left":"288px","cursor col-
     A                                      umn":"3","top":"290px","cursor row"-
     A                                      :"10","width":"21px","text align":"-
     A                                      right","parent tab panel":"W0569F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCCA03","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCC-
     A                                      A03","designValue":"[SCCA03]","refF-
     A                                      ield":"CASE","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00"},"css class":"outp-
     A                                      ut-field","left":"323px","cursor co-
     A                                      lumn":"8","top":"290px","cursor row-
     A                                      ":"10","width":"49px","text align":-
     A                                      "right","parent tab panel":"W0569F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCAD03","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      AD03","designValue":"[SCAD03]","ref-
     A                                      Field":"DT8","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"true","zeroFill-
     A                                      ":"true","curSym":"","units":"","ne-
     A                                      gNum":"-999.00","edtWrd":"''  /  / -
     A                                         ''"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"290px","cursor row":"10","w-
     A                                      idth":"70px","text align":"right","-
     A                                      parent tab panel":"W0569F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCPY03","field type":"output field-
     A                                      ","value":{"fieldName":"SCPY03","de-
     A                                      signValue":"[SCPY03]","refField":"D-
     A                                      T8","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"true",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","edtWrd":"''  /  /    ''"},"-
     A                                      css class":"output-field","left":"4-
     A                                      91px","cursor column":"32","top":"2-
     A                                      90px","cursor row":"10","width":"70-
     A                                      px","text align":"right","parent ta-
     A                                      b panel":"W0569F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css cl')
     A                                  1  9HTML('ass 2":"profound-converted"},-
     A                                      {"id":"SCCY03","field type":"output-
     A                                       field","value":{"fieldName":"SCCY0-
     A                                      3","designValue":"[SCCY03]","refFie-
     A                                      ld":"DT8","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      true","curSym":"","units":"","negNu-
     A                                      m":"-999.00","edtWrd":"''  /  /    -
     A                                      ''"},"css class":"output-field","le-
     A                                      ft":"575px","cursor column":"44","t-
     A                                      op":"290px","cursor row":"10","widt-
     A                                      h":"70px","text align":"right","par-
     A                                      ent tab panel":"W0569F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      TD03","field type":"output field","-
     A                                      value":{"fieldName":"SCTD03","desig-
     A                                      nValue":"[SCTD03]","refField":"DT8"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"true","zeroFill":"true","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00","edtWrd":"''  /  /    ''"},"css-
     A                                       class":"output-field","left":"659p-
     A                                      x","cursor column":"56","top":"290p-
     A                                      x","cursor row":"10","width":"70px"-
     A                                      ,"text align":"right","parent tab p-
     A                                      anel":"W0569F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0569F_SCR01_BtnHiddenHelp","v-
     A                                      alue":"btnHelp","top":"300px","resp-
     A                                      onse":{"fieldName":"btnHelp","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCFL04","field type":"password fie-
     A                                      ld","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCFL04","designValue":"[SCFL04]","r-
     A                                      efField":"FLAG","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","left":"274px"-
     A                                      ,"cursor column":"1","top":"310px",-
     A                                      "cursor row":"11","width":"8px","se-
     A                                      t focus":{"fieldName":"24","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      parent tab panel":"W0569F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "SCYR04","field type":"output field-
     A                                      ","value":{"fieldName":"SCYR04","de-
     A                                      signValue":"[SCYR04]","refField":"F-
     A                                      YR","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"288px","cursor column":"3"-
     A                                      ,"top":"310px","cursor row":"11","w-
     A                                      idth":"21px","text align":"right","-
     A                                      parent tab panel":"W0569F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCCA04","field type":"output field-
     A                                      ","value":{"fieldName":"SCCA04","de-
     A                                      signValue":"[SCCA04]","refField":"C-
     A                                      ASE","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00"},"css class":"output-field-
     A                                      ","left":"323px","cursor column":"8-
     A                                      ","top":"310px","cursor row":"11","-
     A                                      width":"49px","text align":"right",-
     A                                      "parent tab panel":"W0569F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCAD04","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCAD04","d-
     A                                      esignValue":"[SCAD04]","refField":"-
     A                                      DT8","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","edtWrd":"''  /  /    ''"},-
     A                                      "css class":"output-field","left":"-
     A                                      414px","cursor column":"21","top":"-
     A                                      310px","cursor row":"11","width":"7-
     A                                      0px","text align":"right","parent t-
     A                                      ab panel":"W0569F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCPY04"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCPY04","designValu-
     A                                      e":"[SCPY04]","refField":"DT8","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"true","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      edtWrd":"''  /  /    ''"},"css clas-
     A                                      s":"output-field","left":"491px","c-
     A                                      ursor column":"32","top":"310px","c-
     A                                      ursor row":"11","width":"70px","tex-
     A                                      t align":"right","parent tab panel"-
     A                                      :"W0569F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCCY04","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCCY04","designValue":"[SCCY-
     A                                      04]","refField":"DT8","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"true",-
     A                                      "zeroFill":"true","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","edtWrd":"-
     A                                      ''  /  /    ''"},"css class":"outpu-
     A                                      t-field","left":"575px","cursor col-
     A                                      umn":"44","top":"310px","cursor row-
     A                                      ":"11","width":"70px","text align":-
     A                                      "right","parent tab panel":"W0569F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-')
     A                                  1 10HTML('converted"},{"id":"SCTD04","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCTD04","designValue":-
     A                                      "[SCTD04]","refField":"DT8","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      true","zeroFill":"true","curSym":""-
     A                                      ,"units":"","negNum":"-999.00","edt-
     A                                      Wrd":"''  /  /    ''"},"css class":-
     A                                      "output-field","left":"659px","curs-
     A                                      or column":"56","top":"310px","curs-
     A                                      or row":"11","width":"70px","text a-
     A                                      lign":"right","parent tab panel":"W-
     A                                      0569F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCFL05","field type-
     A                                      ":"password field","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCFL05","designValue-
     A                                      ":"[SCFL05]","refField":"FLAG","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"274px","cursor column":"1"-
     A                                      ,"top":"330px","cursor row":"12","w-
     A                                      idth":"8px","set focus":{"fieldName-
     A                                      ":"25","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"parent tab panel":"W-
     A                                      0569F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"SCYR05","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCYR05","designValue":"[SCYR05]-
     A                                      ","refField":"FYR","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00"},"css class"-
     A                                      :"output-field","left":"288px","cur-
     A                                      sor column":"3","top":"330px","curs-
     A                                      or row":"12","width":"21px","text a-
     A                                      lign":"right","parent tab panel":"W-
     A                                      0569F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCCA05","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCCA05","designValue":"[SCCA05]-
     A                                      ","refField":"CASE","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"999.00"},"css class-
     A                                      ":"output-field","left":"323px","cu-
     A                                      rsor column":"8","top":"330px","cur-
     A                                      sor row":"12","width":"49px","text -
     A                                      align":"right","parent tab panel":"-
     A                                      W0569F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCAD05","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCAD05","designValue":"[SCAD05-
     A                                      ]","refField":"DT8","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"true","curSym":"","units"-
     A                                      :"","negNum":"-999.00","edtWrd":"''-
     A                                        /  /    ''"},"css class":"output--
     A                                      field","left":"414px","cursor colum-
     A                                      n":"21","top":"330px","cursor row":-
     A                                      "12","width":"70px","text align":"r-
     A                                      ight","parent tab panel":"W0569F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCPY05","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCPY-
     A                                      05","designValue":"[SCPY05]","refFi-
     A                                      eld":"DT8","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"true","zeroFill":-
     A                                      "true","curSym":"","units":"","negN-
     A                                      um":"-999.00","edtWrd":"''  /  /   -
     A                                       ''"},"css class":"output-field","l-
     A                                      eft":"491px","cursor column":"32","-
     A                                      top":"330px","cursor row":"12","wid-
     A                                      th":"70px","text align":"right","pa-
     A                                      rent tab panel":"W0569F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CCY05","field type":"output field",-
     A                                      "value":{"fieldName":"SCCY05","desi-
     A                                      gnValue":"[SCCY05]","refField":"DT8-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"true","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","edtWrd":"''  /  /    ''"},"cs-
     A                                      s class":"output-field","left":"575-
     A                                      px","cursor column":"44","top":"330-
     A                                      px","cursor row":"12","width":"70px-
     A                                      ","text align":"right","parent tab -
     A                                      panel":"W0569F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCTD05","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCTD05","designValue":-
     A                                      "[SCTD05]","refField":"DT8","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      true","zeroFill":"true","curSym":""-
     A                                      ,"units":"","negNum":"-999.00","edt-
     A                                      Wrd":"''  /  /    ''"},"css class":-
     A                                      "output-field","left":"659px","curs-
     A                                      or column":"56","top":"330px","curs-
     A                                      or row":"12","width":"70px","text a-
     A                                      lign":"right","parent tab panel":"W-
     A                                      0569F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCFL06","field type-
     A                                      ":"password field","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCFL06","designValue-
     A                                      ":"[SCFL06]","refField":"FLAG","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"274px","cursor co')
     A                                  1 11HTML('lumn":"1","top":"350px","curs-
     A                                      or row":"13","width":"8px","set foc-
     A                                      us":{"fieldName":"26","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"paren-
     A                                      t tab panel":"W0569F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"SCYR-
     A                                      06","field type":"output field","va-
     A                                      lue":{"fieldName":"SCYR06","designV-
     A                                      alue":"[SCYR06]","refField":"FYR","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"999.0-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"288px","cursor column":"3","top-
     A                                      ":"350px","cursor row":"13","width"-
     A                                      :"21px","text align":"right","paren-
     A                                      t tab panel":"W0569F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCCA-
     A                                      06","field type":"output field","va-
     A                                      lue":{"fieldName":"SCCA06","designV-
     A                                      alue":"[SCCA06]","refField":"CASE",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00"},"css class":"output-field","le-
     A                                      ft":"323px","cursor column":"8","to-
     A                                      p":"350px","cursor row":"13","width-
     A                                      ":"49px","text align":"right","pare-
     A                                      nt tab panel":"W0569F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCA-
     A                                      D06","field type":"output field","v-
     A                                      alue":{"fieldName":"SCAD06","design-
     A                                      Value":"[SCAD06]","refField":"DT8",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"true","zeroFill":"true","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0","edtWrd":"''  /  /    ''"},"css -
     A                                      class":"output-field","left":"414px-
     A                                      ","cursor column":"21","top":"350px-
     A                                      ","cursor row":"13","width":"70px",-
     A                                      "text align":"right","parent tab pa-
     A                                      nel":"W0569F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCPY06","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCPY06","designValue":"[-
     A                                      SCPY06]","refField":"DT8","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"tr-
     A                                      ue","zeroFill":"true","curSym":"","-
     A                                      units":"","negNum":"-999.00","edtWr-
     A                                      d":"''  /  /    ''"},"css class":"o-
     A                                      utput-field","left":"491px","cursor-
     A                                       column":"32","top":"350px","cursor-
     A                                       row":"13","width":"70px","text ali-
     A                                      gn":"right","parent tab panel":"W05-
     A                                      69F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCCY06","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCCY06","designValue":"[SCCY06]",-
     A                                      "refField":"DT8","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"true","zero-
     A                                      Fill":"true","curSym":"","units":""-
     A                                      ,"negNum":"-999.00","edtWrd":"''  /-
     A                                        /    ''"},"css class":"output-fie-
     A                                      ld","left":"575px","cursor column":-
     A                                      "44","top":"350px","cursor row":"13-
     A                                      ","width":"70px","text align":"righ-
     A                                      t","parent tab panel":"W0569F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCTD06","field type":"output f-
     A                                      ield","value":{"fieldName":"SCTD06"-
     A                                      ,"designValue":"[SCTD06]","refField-
     A                                      ":"DT8","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00","edtWrd":"''  /  /    ''-
     A                                      "},"css class":"output-field","left-
     A                                      ":"659px","cursor column":"56","top-
     A                                      ":"350px","cursor row":"13","width"-
     A                                      :"70px","text align":"right","paren-
     A                                      t tab panel":"W0569F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCFL-
     A                                      07","field type":"password field","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCFL0-
     A                                      7","designValue":"[SCFL07]","refFie-
     A                                      ld":"FLAG","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase"},"text transfo-
     A                                      rm":"uppercase","left":"274px","cur-
     A                                      sor column":"1","top":"370px","curs-
     A                                      or row":"14","width":"8px","set foc-
     A                                      us":{"fieldName":"27","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"paren-
     A                                      t tab panel":"W0569F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"SCYR-
     A                                      07","field type":"output field","va-
     A                                      lue":{"fieldName":"SCYR07","designV-
     A                                      alue":"[SCYR07]","refField":"FYR","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"999.0-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"288px","cursor column":"3","top-
     A                                      ":"370px","cursor row":"14","width"-
     A                                      :"21px","text align":"right","paren-
     A                                      t tab panel":"W0569F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCCA-
     A                                      07","field type":"output field","va-
     A                                      lue":{"fieldName":"SCCA07","designV-
     A                                      alue":"[SCCA07]","refField')
     A                                  1 12HTML('":"CASE","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"999.00"},"css class":"ou-
     A                                      tput-field","left":"323px","cursor -
     A                                      column":"8","top":"370px","cursor r-
     A                                      ow":"14","width":"49px","text align-
     A                                      ":"right","parent tab panel":"W0569-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCAD07","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCAD07","designValue":"[SCAD07]","r-
     A                                      efField":"DT8","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"true","curSym":"","units":"","-
     A                                      negNum":"-999.00","edtWrd":"''  /  -
     A                                      /    ''"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"370px","cursor row":"14",-
     A                                      "width":"70px","text align":"right"-
     A                                      ,"parent tab panel":"W0569F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCPY07","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCPY07","-
     A                                      designValue":"[SCPY07]","refField":-
     A                                      "DT8","dataType":"reference","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"true","zeroFill":"true-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","edtWrd":"''  /  /    ''"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "491px","cursor column":"32","top":-
     A                                      "370px","cursor row":"14","width":"-
     A                                      70px","text align":"right","parent -
     A                                      tab panel":"W0569F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCCY07-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCCY07","designVal-
     A                                      ue":"[SCCY07]","refField":"DT8","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"true","zeroFill":"true","curSym-
     A                                      ":"","units":"","negNum":"-999.00",-
     A                                      "edtWrd":"''  /  /    ''"},"css cla-
     A                                      ss":"output-field","left":"575px","-
     A                                      cursor column":"44","top":"370px","-
     A                                      cursor row":"14","width":"70px","te-
     A                                      xt align":"right","parent tab panel-
     A                                      ":"W0569F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCTD07","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCTD07","designValue":"[SCT-
     A                                      D07]","refField":"DT8","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","edtWrd":-
     A                                      "''  /  /    ''"},"css class":"outp-
     A                                      ut-field","left":"659px","cursor co-
     A                                      lumn":"56","top":"370px","cursor ro-
     A                                      w":"14","width":"70px","text align"-
     A                                      :"right","parent tab panel":"W0569F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCFL08","field type":"pa-
     A                                      ssword field","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCFL08","designValue":"[S-
     A                                      CFL08]","refField":"FLAG","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"274px","cursor column":"1","top-
     A                                      ":"390px","cursor row":"15","width"-
     A                                      :"8px","set focus":{"fieldName":"28-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"parent tab panel":"W0569F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCYR08","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CYR08","designValue":"[SCYR08]","re-
     A                                      fField":"FYR","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"false","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"999.00"},"css class":"out-
     A                                      put-field","left":"288px","cursor c-
     A                                      olumn":"3","top":"390px","cursor ro-
     A                                      w":"15","width":"21px","text align"-
     A                                      :"right","parent tab panel":"W0569F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCCA08","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CCA08","designValue":"[SCCA08]","re-
     A                                      fField":"CASE","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"999.00"},"css class":"ou-
     A                                      tput-field","left":"323px","cursor -
     A                                      column":"8","top":"390px","cursor r-
     A                                      ow":"15","width":"49px","text align-
     A                                      ":"right","parent tab panel":"W0569-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCAD08","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCAD08","designValue":"[SCAD08]","r-
     A                                      efField":"DT8","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"true","curSym":"","units":"","-
     A                                      negNum":"-999.00","edtWrd":"''  /  -
     A                                      /    ''"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"390px","cursor row":"15",-
     A                                      "width":"70px","text align":"right"-
     A                                      ,"parent tab panel":"W0569F_SCR01_M-
     A                                      ainTabPanel","parent tab":')
     A                                  1 13HTML('"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCPY08","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCPY08","designValue":"[SCPY0-
     A                                      8]","refField":"DT8","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"true","-
     A                                      zeroFill":"true","curSym":"","units-
     A                                      ":"","negNum":"-999.00","edtWrd":"'-
     A                                      '  /  /    ''"},"css class":"output-
     A                                      -field","left":"491px","cursor colu-
     A                                      mn":"32","top":"390px","cursor row"-
     A                                      :"15","width":"70px","text align":"-
     A                                      right","parent tab panel":"W0569F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCCY08","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCC-
     A                                      Y08","designValue":"[SCCY08]","refF-
     A                                      ield":"DT8","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"true","zeroFill"-
     A                                      :"true","curSym":"","units":"","neg-
     A                                      Num":"-999.00","edtWrd":"''  /  /  -
     A                                        ''"},"css class":"output-field","-
     A                                      left":"575px","cursor column":"44",-
     A                                      "top":"390px","cursor row":"15","wi-
     A                                      dth":"70px","text align":"right","p-
     A                                      arent tab panel":"W0569F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCTD08","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCTD08","des-
     A                                      ignValue":"[SCTD08]","refField":"DT-
     A                                      8","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"true","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00","edtWrd":"''  /  /    ''"},"c-
     A                                      ss class":"output-field","left":"65-
     A                                      9px","cursor column":"56","top":"39-
     A                                      0px","cursor row":"15","width":"70p-
     A                                      x","text align":"right","parent tab-
     A                                       panel":"W0569F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCFL09","-
     A                                      field type":"password field","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCFL09","d-
     A                                      esignValue":"[SCFL09]","refField":"-
     A                                      FLAG","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","left":"274px","cursor c-
     A                                      olumn":"1","top":"410px","cursor ro-
     A                                      w":"16","width":"8px","set focus":{-
     A                                      "fieldName":"29","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"parent tab-
     A                                       panel":"W0569F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCYR09","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCYR09","designValue"-
     A                                      :"[SCYR09]","refField":"FYR","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"999.00"},"-
     A                                      css class":"output-field","left":"2-
     A                                      88px","cursor column":"3","top":"41-
     A                                      0px","cursor row":"16","width":"21p-
     A                                      x","text align":"right","parent tab-
     A                                       panel":"W0569F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCCA09","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCCA09","designValue"-
     A                                      :"[SCCA09]","refField":"CASE","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"999.00"},-
     A                                      "css class":"output-field","left":"-
     A                                      323px","cursor column":"8","top":"4-
     A                                      10px","cursor row":"16","width":"49-
     A                                      px","text align":"right","parent ta-
     A                                      b panel":"W0569F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCAD09",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCAD09","designValue-
     A                                      ":"[SCAD09]","refField":"DT8","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"true","zeroFill":"true","curSym":-
     A                                      "","units":"","negNum":"-999.00","e-
     A                                      dtWrd":"''  /  /    ''"},"css class-
     A                                      ":"output-field","left":"414px","cu-
     A                                      rsor column":"21","top":"410px","cu-
     A                                      rsor row":"16","width":"70px","text-
     A                                       align":"right","parent tab panel":-
     A                                      "W0569F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCPY09","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCPY09","designValue":"[SCPY0-
     A                                      9]","refField":"DT8","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"true","-
     A                                      zeroFill":"true","curSym":"","units-
     A                                      ":"","negNum":"-999.00","edtWrd":"'-
     A                                      '  /  /    ''"},"css class":"output-
     A                                      -field","left":"491px","cursor colu-
     A                                      mn":"32","top":"410px","cursor row"-
     A                                      :"16","width":"70px","text align":"-
     A                                      right","parent tab panel":"W0569F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCCY09","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCC-
     A                                      Y09","designValue":"[SCCY09]","refF-
     A                                      ield":"DT8","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"true","zeroFill"-
     A                                      :"true","curSym":"","units":"","neg-
     A                                      Num":"-999.00","edtWrd":"''  /  /  -
     A                                        ''"},"css class":"output')
     A                                  1 14HTML('-field","left":"575px","curso-
     A                                      r column":"44","top":"410px","curso-
     A                                      r row":"16","width":"70px","text al-
     A                                      ign":"right","parent tab panel":"W0-
     A                                      569F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCTD09","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCTD09","designValue":"[SCTD09]"-
     A                                      ,"refField":"DT8","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"true","zer-
     A                                      oFill":"true","curSym":"","units":"-
     A                                      ","negNum":"-999.00","edtWrd":"''  -
     A                                      /  /    ''"},"css class":"output-fi-
     A                                      eld","left":"659px","cursor column"-
     A                                      :"56","top":"410px","cursor row":"1-
     A                                      6","width":"70px","text align":"rig-
     A                                      ht","parent tab panel":"W0569F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCFL10","field type":"passwor-
     A                                      d field","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCFL10","designValue":"[SCFL10-
     A                                      ]","refField":"FLAG","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"2-
     A                                      74px","cursor column":"1","top":"43-
     A                                      0px","cursor row":"17","width":"8px-
     A                                      ","set focus":{"fieldName":"30","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"parent tab panel":"W0569F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCYR10","field type":"output -
     A                                      field","value":{"fieldName":"SCYR10-
     A                                      ","designValue":"[SCYR10]","refFiel-
     A                                      d":"FYR","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00"},"css class":"output-f-
     A                                      ield","left":"288px","cursor column-
     A                                      ":"3","top":"430px","cursor row":"1-
     A                                      7","width":"21px","text align":"rig-
     A                                      ht","parent tab panel":"W0569F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCCA10","field type":"output -
     A                                      field","value":{"fieldName":"SCCA10-
     A                                      ","designValue":"[SCCA10]","refFiel-
     A                                      d":"CASE","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00"},"css class":"output--
     A                                      field","left":"323px","cursor colum-
     A                                      n":"8","top":"430px","cursor row":"-
     A                                      17","width":"49px","text align":"ri-
     A                                      ght","parent tab panel":"W0569F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCAD10","field type":"output-
     A                                       field","value":{"fieldName":"SCAD1-
     A                                      0","designValue":"[SCAD10]","refFie-
     A                                      ld":"DT8","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      true","curSym":"","units":"","negNu-
     A                                      m":"-999.00","edtWrd":"''  /  /    -
     A                                      ''"},"css class":"output-field","le-
     A                                      ft":"414px","cursor column":"21","t-
     A                                      op":"430px","cursor row":"17","widt-
     A                                      h":"70px","text align":"right","par-
     A                                      ent tab panel":"W0569F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      PY10","field type":"output field","-
     A                                      value":{"fieldName":"SCPY10","desig-
     A                                      nValue":"[SCPY10]","refField":"DT8"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"true","zeroFill":"true","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00","edtWrd":"''  /  /    ''"},"css-
     A                                       class":"output-field","left":"491p-
     A                                      x","cursor column":"32","top":"430p-
     A                                      x","cursor row":"17","width":"70px"-
     A                                      ,"text align":"right","parent tab p-
     A                                      anel":"W0569F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCCY10","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCCY10","designValue":"-
     A                                      [SCCY10]","refField":"DT8","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","edtW-
     A                                      rd":"''  /  /    ''"},"css class":"-
     A                                      output-field","left":"575px","curso-
     A                                      r column":"44","top":"430px","curso-
     A                                      r row":"17","width":"70px","text al-
     A                                      ign":"right","parent tab panel":"W0-
     A                                      569F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCTD10","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCTD10","designValue":"[SCTD10]"-
     A                                      ,"refField":"DT8","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"true","zer-
     A                                      oFill":"true","curSym":"","units":"-
     A                                      ","negNum":"-999.00","edtWrd":"''  -
     A                                      /  /    ''"},"css class":"output-fi-
     A                                      eld","left":"659px","cursor column"-
     A                                      :"56","top":"430px","cursor row":"1-
     A                                      7","width":"70px","text align":"rig-
     A                                      ht","parent tab panel":"W0569F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCFL11","field type":"passwor-
     A                                      d field","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCFL11","designValue"')
     A                                  1 15HTML(':"[SCFL11]","refField":"FLAG"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase"},"text transform":"upper-
     A                                      case","left":"274px","cursor column-
     A                                      ":"1","top":"450px","cursor row":"1-
     A                                      8","width":"8px","set focus":{"fiel-
     A                                      dName":"31","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"parent tab pane-
     A                                      l":"W0569F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"SCYR11","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCYR11","designValue":"[SC-
     A                                      YR11]","refField":"FYR","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"999.00"},"css c-
     A                                      lass":"output-field","left":"288px"-
     A                                      ,"cursor column":"3","top":"450px",-
     A                                      "cursor row":"18","width":"21px","t-
     A                                      ext align":"right","parent tab pane-
     A                                      l":"W0569F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCCA11","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCCA11","designValue":"[SC-
     A                                      CA11]","refField":"CASE","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00"},"css -
     A                                      class":"output-field","left":"323px-
     A                                      ","cursor column":"8","top":"450px"-
     A                                      ,"cursor row":"18","width":"49px","-
     A                                      text align":"right","parent tab pan-
     A                                      el":"W0569F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCAD11","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCAD11","designValue":"[S-
     A                                      CAD11]","refField":"DT8","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"true","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","edtWrd-
     A                                      ":"''  /  /    ''"},"css class":"ou-
     A                                      tput-field","left":"414px","cursor -
     A                                      column":"21","top":"450px","cursor -
     A                                      row":"18","width":"70px","text alig-
     A                                      n":"right","parent tab panel":"W056-
     A                                      9F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCPY11","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCPY11","designValue":"[SCPY11]","-
     A                                      refField":"DT8","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"true","zeroF-
     A                                      ill":"true","curSym":"","units":"",-
     A                                      "negNum":"-999.00","edtWrd":"''  / -
     A                                       /    ''"},"css class":"output-fiel-
     A                                      d","left":"491px","cursor column":"-
     A                                      32","top":"450px","cursor row":"18"-
     A                                      ,"width":"70px","text align":"right-
     A                                      ","parent tab panel":"W0569F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCCY11","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCCY11",-
     A                                      "designValue":"[SCCY11]","refField"-
     A                                      :"DT8","dataType":"reference","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"true","zeroFill":"tru-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00","edtWrd":"''  /  /    ''"-
     A                                      },"css class":"output-field","left"-
     A                                      :"575px","cursor column":"44","top"-
     A                                      :"450px","cursor row":"18","width":-
     A                                      "70px","text align":"right","parent-
     A                                       tab panel":"W0569F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCTD1-
     A                                      1","field type":"output field","val-
     A                                      ue":{"fieldName":"SCTD11","designVa-
     A                                      lue":"[SCTD11]","refField":"DT8","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"true","zeroFill":"true","curSy-
     A                                      m":"","units":"","negNum":"-999.00"-
     A                                      ,"edtWrd":"''  /  /    ''"},"css cl-
     A                                      ass":"output-field","left":"659px",-
     A                                      "cursor column":"56","top":"450px",-
     A                                      "cursor row":"18","width":"70px","t-
     A                                      ext align":"right","parent tab pane-
     A                                      l":"W0569F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCFL12","field-
     A                                       type":"password field","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCFL12","design-
     A                                      Value":"[SCFL12]","refField":"FLAG"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase"},"text transform":"upper-
     A                                      case","left":"274px","cursor column-
     A                                      ":"1","top":"470px","cursor row":"1-
     A                                      9","width":"8px","set focus":{"fiel-
     A                                      dName":"32","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"parent tab pane-
     A                                      l":"W0569F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"SCYR12","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCYR12","designValue":"[SC-
     A                                      YR12]","refField":"FYR","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"999.00"},"css c-
     A                                      lass":"output-field","left":"288px"-
     A                                      ,"cursor column":"3","top":"470px",-
     A                                      "cursor row":"19","width":"21px","t-
     A                                      ext align":"right","parent')
     A                                  1 16HTML(' tab panel":"W0569F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCCA12","field type":"output field-
     A                                      ","value":{"fieldName":"SCCA12","de-
     A                                      signValue":"[SCCA12]","refField":"C-
     A                                      ASE","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00"},"css class":"output-field-
     A                                      ","left":"323px","cursor column":"8-
     A                                      ","top":"470px","cursor row":"19","-
     A                                      width":"49px","text align":"right",-
     A                                      "parent tab panel":"W0569F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCAD12","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCAD12","d-
     A                                      esignValue":"[SCAD12]","refField":"-
     A                                      DT8","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","edtWrd":"''  /  /    ''"},-
     A                                      "css class":"output-field","left":"-
     A                                      414px","cursor column":"21","top":"-
     A                                      470px","cursor row":"19","width":"7-
     A                                      0px","text align":"right","parent t-
     A                                      ab panel":"W0569F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCPY12"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCPY12","designValu-
     A                                      e":"[SCPY12]","refField":"DT8","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"true","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      edtWrd":"''  /  /    ''"},"css clas-
     A                                      s":"output-field","left":"491px","c-
     A                                      ursor column":"32","top":"470px","c-
     A                                      ursor row":"19","width":"70px","tex-
     A                                      t align":"right","parent tab panel"-
     A                                      :"W0569F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCCY12","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCCY12","designValue":"[SCCY-
     A                                      12]","refField":"DT8","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"true",-
     A                                      "zeroFill":"true","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","edtWrd":"-
     A                                      ''  /  /    ''"},"css class":"outpu-
     A                                      t-field","left":"575px","cursor col-
     A                                      umn":"44","top":"470px","cursor row-
     A                                      ":"19","width":"70px","text align":-
     A                                      "right","parent tab panel":"W0569F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCTD12","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      TD12","designValue":"[SCTD12]","ref-
     A                                      Field":"DT8","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"true","zeroFill-
     A                                      ":"true","curSym":"","units":"","ne-
     A                                      gNum":"-999.00","edtWrd":"''  /  / -
     A                                         ''"},"css class":"output-field",-
     A                                      "left":"659px","cursor column":"56"-
     A                                      ,"top":"470px","cursor row":"19","w-
     A                                      idth":"70px","text align":"right","-
     A                                      parent tab panel":"W0569F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCFL13","field type":"password fie-
     A                                      ld","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCFL13","designValue":"[SCFL13]","r-
     A                                      efField":"FLAG","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","left":"274px"-
     A                                      ,"cursor column":"1","top":"490px",-
     A                                      "cursor row":"20","width":"8px","se-
     A                                      t focus":{"fieldName":"33","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      parent tab panel":"W0569F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "SCYR13","field type":"output field-
     A                                      ","value":{"fieldName":"SCYR13","de-
     A                                      signValue":"[SCYR13]","refField":"F-
     A                                      YR","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"288px","cursor column":"3"-
     A                                      ,"top":"490px","cursor row":"20","w-
     A                                      idth":"21px","text align":"right","-
     A                                      parent tab panel":"W0569F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCCA13","field type":"output field-
     A                                      ","value":{"fieldName":"SCCA13","de-
     A                                      signValue":"[SCCA13]","refField":"C-
     A                                      ASE","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00"},"css class":"output-field-
     A                                      ","left":"323px","cursor column":"8-
     A                                      ","top":"490px","cursor row":"20","-
     A                                      width":"49px","text align":"right",-
     A                                      "parent tab panel":"W0569F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCAD13","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCAD13","d-
     A                                      esignValue":"[SCAD13]","refField":"-
     A                                      DT8","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","edtWrd":"''  /  /')
     A                                  1 17HTML('    ''"},"css class":"output--
     A                                      field","left":"414px","cursor colum-
     A                                      n":"21","top":"490px","cursor row":-
     A                                      "20","width":"70px","text align":"r-
     A                                      ight","parent tab panel":"W0569F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCPY13","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCPY-
     A                                      13","designValue":"[SCPY13]","refFi-
     A                                      eld":"DT8","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"true","zeroFill":-
     A                                      "true","curSym":"","units":"","negN-
     A                                      um":"-999.00","edtWrd":"''  /  /   -
     A                                       ''"},"css class":"output-field","l-
     A                                      eft":"491px","cursor column":"32","-
     A                                      top":"490px","cursor row":"20","wid-
     A                                      th":"70px","text align":"right","pa-
     A                                      rent tab panel":"W0569F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CCY13","field type":"output field",-
     A                                      "value":{"fieldName":"SCCY13","desi-
     A                                      gnValue":"[SCCY13]","refField":"DT8-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"true","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","edtWrd":"''  /  /    ''"},"cs-
     A                                      s class":"output-field","left":"575-
     A                                      px","cursor column":"44","top":"490-
     A                                      px","cursor row":"20","width":"70px-
     A                                      ","text align":"right","parent tab -
     A                                      panel":"W0569F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCTD13","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCTD13","designValue":-
     A                                      "[SCTD13]","refField":"DT8","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      true","zeroFill":"true","curSym":""-
     A                                      ,"units":"","negNum":"-999.00","edt-
     A                                      Wrd":"''  /  /    ''"},"css class":-
     A                                      "output-field","left":"659px","curs-
     A                                      or column":"56","top":"490px","curs-
     A                                      or row":"20","width":"70px","text a-
     A                                      lign":"right","parent tab panel":"W-
     A                                      0569F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCFL14","field type-
     A                                      ":"password field","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCFL14","designValue-
     A                                      ":"[SCFL14]","refField":"FLAG","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"274px","cursor column":"1"-
     A                                      ,"top":"510px","cursor row":"21","w-
     A                                      idth":"8px","set focus":{"fieldName-
     A                                      ":"34","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"parent tab panel":"W-
     A                                      0569F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"SCYR14","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCYR14","designValue":"[SCYR14]-
     A                                      ","refField":"FYR","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00"},"css class"-
     A                                      :"output-field","left":"288px","cur-
     A                                      sor column":"3","top":"510px","curs-
     A                                      or row":"21","width":"21px","text a-
     A                                      lign":"right","parent tab panel":"W-
     A                                      0569F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCCA14","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCCA14","designValue":"[SCCA14]-
     A                                      ","refField":"CASE","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"999.00"},"css class-
     A                                      ":"output-field","left":"323px","cu-
     A                                      rsor column":"8","top":"510px","cur-
     A                                      sor row":"21","width":"49px","text -
     A                                      align":"right","parent tab panel":"-
     A                                      W0569F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCAD14","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCAD14","designValue":"[SCAD14-
     A                                      ]","refField":"DT8","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"true","curSym":"","units"-
     A                                      :"","negNum":"-999.00","edtWrd":"''-
     A                                        /  /    ''"},"css class":"output--
     A                                      field","left":"414px","cursor colum-
     A                                      n":"21","top":"510px","cursor row":-
     A                                      "21","width":"70px","text align":"r-
     A                                      ight","parent tab panel":"W0569F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCPY14","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCPY-
     A                                      14","designValue":"[SCPY14]","refFi-
     A                                      eld":"DT8","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"true","zeroFill":-
     A                                      "true","curSym":"","units":"","negN-
     A                                      um":"-999.00","edtWrd":"''  /  /   -
     A                                       ''"},"css class":"output-field","l-
     A                                      eft":"491px","cursor column":"32","-
     A                                      top":"510px","cursor row":"21","wid-
     A                                      th":"70px","text align":"right","pa-
     A                                      rent tab panel":"W0569F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CCY14","field type":"output field",-
     A                                      "value":{"fieldName":"SCCY14","desi-
     A                                      gnValue":"[SCCY14]","refFi')
     A                                  1 18HTML('eld":"DT8","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"true","zero-
     A                                      Fill":"true","curSym":"","units":""-
     A                                      ,"negNum":"-999.00","edtWrd":"''  /-
     A                                        /    ''"},"css class":"output-fie-
     A                                      ld","left":"575px","cursor column":-
     A                                      "44","top":"510px","cursor row":"21-
     A                                      ","width":"70px","text align":"righ-
     A                                      t","parent tab panel":"W0569F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCTD14","field type":"output f-
     A                                      ield","value":{"fieldName":"SCTD14"-
     A                                      ,"designValue":"[SCTD14]","refField-
     A                                      ":"DT8","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00","edtWrd":"''  /  /    ''-
     A                                      "},"css class":"output-field","left-
     A                                      ":"659px","cursor column":"56","top-
     A                                      ":"510px","cursor row":"21","width"-
     A                                      :"70px","text align":"right","paren-
     A                                      t tab panel":"W0569F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCMS-
     A                                      G1","field type":"output field","va-
     A                                      lue":{"fieldName":"SCMSG1","designV-
     A                                      alue":"[SCMSG1]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"29"-
     A                                      },"css class":"output-field","visib-
     A                                      ility":{"fieldName":"83","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"309px","cursor column":"6"-
     A                                      ,"top":"530px","cursor row":"22","c-
     A                                      ss class 2":"RI","description":"MES-
     A                                      SAGE 1","parent tab panel":"W0569F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"SCUP","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCUP-
     A                                      ","designValue":"[SCUP]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"9"},"css class":"output-field"-
     A                                      ,"left":"631px","cursor column":"52-
     A                                      ","top":"550px","cursor row":"23","-
     A                                      parent tab panel":"W0569F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCDOWN","field type":"output field-
     A                                      ","value":{"fieldName":"SCDOWN","de-
     A                                      signValue":"[SCDOWN]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"9"},"css class":"output-field","l-
     A                                      eft":"736px","cursor column":"67","-
     A                                      top":"550px","cursor row":"23","par-
     A                                      ent tab panel":"W0569F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"bt-
     A                                      nSubmit","field type":"button","val-
     A                                      ue":"Enter","shortcut key":"Enter",-
     A                                      "left":"14px","top":"150px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF03","-
     A                                      field type":"button","value":"Exit -
     A                                              ","shortcut key":"F3","left-
     A                                      ":"14px","top":"183px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF12","field-
     A                                       type":"button","value":"Cancel    -
     A                                        ","shortcut key":"F12","left":"14-
     A                                      px","top":"216px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF23","field type-
     A                                      ":"button","value":"Delete record  -
     A                                       ","shortcut key":"F23","left":"14p-
     A                                      x","top":"249px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnHELP","field type"-
     A                                      :"button","shortcut key":"Alt-F1","-
     A                                      bypass validation":"true","value":"-
     A                                      HELP","response":{"fieldName":"*IN1-
     A                                      0","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"left":"14px","top":"282px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnROLLD-
     A                                      OWN","field type":"button","value":-
     A                                      "Page Up","shortcut key":"PageUp","-
     A                                      response":{"fieldName":"*IN19","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"left-
     A                                      ":"14px","top":"315px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnROLLUP","fie-
     A                                      ld type":"button","value":"Page Dow-
     A                                      n","shortcut key":"PageDown","respo-
     A                                      nse":{"fieldName":"*IN18","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"left":"14-
     A                                      px","top":"348px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCDOWN         9A  H
     A            SCMSG1        29A  H
     A            SCUP           9A  H
     A            SCAD01    R        H      REFFLD(DT8)
     A            SCAD02    R        H      REFFLD(DT8)
     A            SCAD03    R        H      REFFLD(DT8)
     A            SCAD04    R        H      REFFLD(DT8)
     A            SCAD05    R        H      REFFLD(DT8)
     A            SCAD06    R        H      REFFLD(DT8)
     A            SCAD07    R        H      REFFLD(DT8)
     A            SCAD08    R        H      REFFLD(DT8)
     A            SCAD09    R        H      REFFLD(DT8)
     A            SCAD10    R        H      REFFLD(DT8)
     A            SCAD11    R        H      REFFLD(DT8)
     A            SCAD12    R        H      REFFLD(DT8)
     A            SCAD13    R        H      REFFLD(DT8)
     A            SCAD14    R        H      REFFLD(DT8)
     A            SCCA01    R        H      REFFLD(CASE)
     A            SCCA02    R        H      REFFLD(CASE)
     A            SCCA03    R        H      REFFLD(CASE)
     A            SCCA04    R        H      REFFLD(CASE)
     A            SCCA05    R        H      REFFLD(CASE)
     A            SCCA06    R        H      REFFLD(CASE)
     A            SCCA07    R        H      REFFLD(CASE)
     A            SCCA08    R        H      REFFLD(CASE)
     A            SCCA09    R        H      REFFLD(CASE)
     A            SCCA10    R        H      REFFLD(CASE)
     A            SCCA11    R        H      REFFLD(CASE)
     A            SCCA12    R        H      REFFLD(CASE)
     A            SCCA13    R        H      REFFLD(CASE)
     A            SCCA14    R        H      REFFLD(CASE)
     A            SCCASE    R        H      REFFLD(CASE)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCY01    R        H      REFFLD(DT8)
     A            SCCY02    R        H      REFFLD(DT8)
     A            SCCY03    R        H      REFFLD(DT8)
     A            SCCY04    R        H      REFFLD(DT8)
     A            SCCY05    R        H      REFFLD(DT8)
     A            SCCY06    R        H      REFFLD(DT8)
     A            SCCY07    R        H      REFFLD(DT8)
     A            SCCY08    R        H      REFFLD(DT8)
     A            SCCY09    R        H      REFFLD(DT8)
     A            SCCY10    R        H      REFFLD(DT8)
     A            SCCY11    R        H      REFFLD(DT8)
     A            SCCY12    R        H      REFFLD(DT8)
     A            SCCY13    R        H      REFFLD(DT8)
     A            SCCY14    R        H      REFFLD(DT8)
     A            SCFL01    R        H      REFFLD(FLAG)
     A            SCFL02    R        H      REFFLD(FLAG)
     A            SCFL04    R        H      REFFLD(FLAG)
     A            SCFL05    R        H      REFFLD(FLAG)
     A            SCFL06    R        H      REFFLD(FLAG)
     A            SCFL07    R        H      REFFLD(FLAG)
     A            SCFL08    R        H      REFFLD(FLAG)
     A            SCFL09    R        H      REFFLD(FLAG)
     A            SCFL10    R        H      REFFLD(FLAG)
     A            SCFL11    R        H      REFFLD(FLAG)
     A            SCFL12    R        H      REFFLD(FLAG)
     A            SCFL13    R        H      REFFLD(FLAG)
     A            SCFL14    R        H      REFFLD(FLAG)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPY01    R        H      REFFLD(DT8)
     A            SCPY02    R        H      REFFLD(DT8)
     A            SCPY03    R        H      REFFLD(DT8)
     A            SCPY04    R        H      REFFLD(DT8)
     A            SCPY05    R        H      REFFLD(DT8)
     A            SCPY06    R        H      REFFLD(DT8)
     A            SCPY07    R        H      REFFLD(DT8)
     A            SCPY08    R        H      REFFLD(DT8)
     A            SCPY09    R        H      REFFLD(DT8)
     A            SCPY10    R        H      REFFLD(DT8)
     A            SCPY11    R        H      REFFLD(DT8)
     A            SCPY12    R        H      REFFLD(DT8)
     A            SCPY13    R        H      REFFLD(DT8)
     A            SCPY14    R        H      REFFLD(DT8)
     A            SCTD01    R        H      REFFLD(DT8)
     A            SCTD02    R        H      REFFLD(DT8)
     A            SCTD03    R        H      REFFLD(DT8)
     A            SCTD04    R        H      REFFLD(DT8)
     A            SCTD05    R        H      REFFLD(DT8)
     A            SCTD06    R        H      REFFLD(DT8)
     A            SCTD07    R        H      REFFLD(DT8)
     A            SCTD08    R        H      REFFLD(DT8)
     A            SCTD09    R        H      REFFLD(DT8)
     A            SCTD10    R        H      REFFLD(DT8)
     A            SCTD11    R        H      REFFLD(DT8)
     A            SCTD12    R        H      REFFLD(DT8)
     A            SCTD13    R        H      REFFLD(DT8)
     A            SCTD14    R        H      REFFLD(DT8)
     A            SCUSER    R        H      REFFLD(USER)
     A            SCYR01    R        H      REFFLD(FYR)
     A            SCYR02    R        H      REFFLD(FYR)
     A            SCYR03    R        H      REFFLD(FYR)
     A            SCYR04    R        H      REFFLD(FYR)
     A            SCYR05    R        H      REFFLD(FYR)
     A            SCYR06    R        H      REFFLD(FYR)
     A            SCYR07    R        H      REFFLD(FYR)
     A            SCYR08    R        H      REFFLD(FYR)
     A            SCYR09    R        H      REFFLD(FYR)
     A            SCYR10    R        H      REFFLD(FYR)
     A            SCYR11    R        H      REFFLD(FYR)
     A            SCYR12    R        H      REFFLD(FYR)
     A            SCYR13    R        H      REFFLD(FYR)
     A            SCYR14    R        H      REFFLD(FYR)
     A            SLFL03    R        H      REFFLD(FLAG)
     A          R SCR99
     A  10 11 18
     A  19                                  CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                      SETOF(19 'Response Indicator *IN19')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C1    1 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"1-1"},"items"-
     A                                      :[{"id":"W0569F_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"W0569F_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W0569F_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"W0569F_SCR99_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1040px","id":"-
     A                                      W0569F_SCR99_BtnSave","tool tip":"S-
     A                                      ave","onclick":"SystemToolbarSave",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/save.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1066px"-
     A                                      ,"id":"W0569F_SCR99_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"W0569F_SC-
     A                                      R99_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"W0569F_SCR99_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "W0569F_SCR99_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLe')
     A                                  1  4HTML('ading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"W0569F_SCR99_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"W0569F_SCR99_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"W0569F_SCR99_Ma-
     A                                      inTabPanel","field type":"tab panel-
     A                                      ","tab panel style":"Transform","ta-
     A                                      b names":"Tab 1","active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      0569F_SCR99_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCR99-
     A                                      _SCFL01","field type":"output field-
     A                                      ","value":{"fieldName":"SCFL01","de-
     A                                      signValue":"[SCFL01]","refField":"F-
     A                                      LAG","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"110px","cursor row":"1",-
     A                                      "css class 2":"top-line","visibilit-
     A                                      y":"hidden","description":"DUMMY FI-
     A                                      ELD","parent tab panel":"W0569F_SCR-
     A                                      99_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"W0569F_SCR99_fkeyMenu","fiel-
     A                                      d type":"menu","left":"10px","top":-
     A                                      "120px","height":"350px","width":"2-
     A                                      30px","hover background color":"#9A-
     A                                      AA61","hover text color":"#FFFFFF",-
     A                                      "border color":"#4C6106","menu opti-
     A                                      on indent":"10px","background color-
     A                                      ":"#758B27","css class":"action-men-
     A                                      u","css class 2":"stationary","z in-
     A                                      dex":"101"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W0569F_SCR99_BtnHiddenRefresh","val-
     A                                      ue":"btnRefresh","top":"125px","res-
     A                                      ponse":{"fieldName":"btnRefresh","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0569F_SCR99_B-
     A                                      tnHiddenSearch","value":"btnSearch"-
     A                                      ,"top":"150px","response":{"fieldNa-
     A                                      me":"btnSearch","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W0569F_SCR99_BtnHiddenDiaryItem-
     A                                      s","value":"btnDiary","top":"175px"-
     A                                      ,"response":{"fieldName":"btnDiary"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0569F_SCR9-
     A                                      9_BtnHiddenSystemMessages","value":-
     A                                      "btnMessage","top":"200px","respons-
     A                                      e":{"fieldName":"btnMessage","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0569F_SCR99_BtnHi-
     A                                      ddenWorkSubmitJob","value":"btnWrks-
     A                                      bmjob","top":"225px","response":{"f-
     A                                      ieldName":"btnWrkJob","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0569F_SCR99_BtnHiddenWor-
     A                                      kPrinterOutput","value":"btnWrkprto-
     A                                      ut","top":"250px","response":{"fiel-
     A                                      dName":"btnWrkPrnt","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility')
     A                                  1  5HTML('":"hidden","id":"W0569F_SCR99-
     A                                      _BtnHiddenImageQueue","value":"btnI-
     A                                      mgQue","top":"275px","response":{"f-
     A                                      ieldName":"btnImgQue","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0569F_SCR99_BtnHiddenHel-
     A                                      p","value":"btnHelp","top":"300px",-
     A                                      "response":{"fieldName":"btnHelp","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"btnSubmit","field type":"butt-
     A                                      on","value":"Enter","shortcut key":-
     A                                      "Enter","left":"14px","top":"150px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF03","field type":"button","value-
     A                                      ":"Exit         ","shortcut key":"F-
     A                                      3","left":"14px","top":"183px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF12-
     A                                      ","field type":"button","value":"Ca-
     A                                      ncel      ","shortcut key":"F12","l-
     A                                      eft":"14px","top":"216px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnHELP","fi-
     A                                      eld type":"button","shortcut key":"-
     A                                      Alt-F1","bypass validation":"true",-
     A                                      "value":"HELP","response":{"fieldNa-
     A                                      me":"*IN10","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"left":"14px","top":"249-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnROLLDOWN","field type":"button"-
     A                                      ,"value":"Page Up","shortcut key":"-
     A                                      PageUp","response":{"fieldName":"*I-
     A                                      N19","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"left":"14px","top":"282px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnROL-
     A                                      LUP","field type":"button","value":-
     A                                      "Page Down","shortcut key":"PageDow-
     A                                      n","response":{"fieldName":"*IN18",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      left":"14px","top":"315px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFL01    R        H      REFFLD(FLAG)
