     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(01)
     A*PUI                                  SFLDEFINE(02)
     A          R SCR01S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A  05 07 08  QPUI000001     1A  O  2  2
     A            SCDATA        32A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCAMT     R        H      REFFLD(A92)
     A            SCCHK#    R        H      REFFLD(CHK#)
     A            SCDESC    R        H      REFFLD(DS15)
     A            SCDT      R        H      REFFLD(DT)
     A            SCFEIN    R        H      REFFLD(FEIN)
     A            SCMOD     R        H      REFFLD(MOD)
     A            SCRECD    R        H      REFFLD(CODE)
     A            SCRETP    R        H      REFFLD(FLAG)
     A            SCSEQ#    R        H      REFFLD(SEQ#)
     A            SCTRCD    R        H      REFFLD(CODE)
     A            SCTRDT    R        H      REFFLD(DT)
     A            SCTYPE    R        H      REFFLD(FLAG)
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  01 02 03
     A  04 21 22
     A  23 24 25                            CA01(01 'Response Indicator *IN01')
     A  26 27 28
     A  29 45 91
     A  92 93 94                            CA02(02 'Response Indicator *IN02')
     A  95 06                               CA03
     A                                  1  2HTML('QPUICTL1    SCR01S    5    RS-
     A                                      FLDSP    0    E1    3     04RSFLDSP-
     A                                      CTL 0    E1    3    N03RSFLCLR    0-
     A                                          E1    3     03RSFLPAG    1    C-
     A                                      2    12 RSFLSIZ    1    C2    13 1 -
     A                                         RSFLNXTCHG 0    E1    3     0810-
     A                                         ROVERLAY   0     RROWS      2   -
     A                                       C1    1C2    21 RSFLMSGID  4    C7-
     A                                          CPD6A81C7    QCPFMSGC5    *LIBL-
     A                                      C0    E1    3     92RSFLMSGID  4   -
     A                                       C7    CPD6A7CC7    QCPFMSGC5    *L-
     A                                      IBLC0    E1    3     93RERRMSGID  5-
     A                                          C6    SCCONMC7    CPF5203C7    -
     A                                      QCPFMSGC5    *LIBLC0    E1    3    -
     A                                       91RERRMSGID  5    C6    SCCONMC7  -
     A                                        CPF5204C7    QCPFMSGC5    *LIBLC0-
     A                                          E1    3     94FSCPST1    INPUTO-
     A                                      NLY 0     FSCPST3    INPUTONLY 0   -
     A                                        FSCPST2    INPUTONLY 0     FSCPST-
     A                                      A    INPUTONLY 0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","error message id-
     A                                      ":"CPD6A81","error message file":"Q-
     A                                      CPFMSG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"92","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"2 messages"-
     A                                      ,"error message id 2":"CPD6A7C","er-
     A                                      ror message file 2":"QCPFMSG","erro-
     A                                      r message library 2":"*LIBL","error-
     A                                       condition 2":{"fieldName":"93","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"ov-
     A                                      erlay range":"1-21"},"items":[{"id"-
     A                                      :"SCOPL2","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"SCOPL2","designValue":"-
     A                                      [SCOPL2]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"none","dataLength":"76"},"left"-
     A                                      :"0px","top":"-30px","css class":"p-
     A                                      rofound-converted"},{"id":"SCPST6",-
     A                                      "field type":"output field","visibi-
     A                                      lity":{"fieldName":"26","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "value":{"fieldName":"SCPST6","desi-
     A                                      gnValue":"[SCPST6]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      "},"left":"0px","top":"-30px","css -
     A                                      class":"profound-converted"},{"id":-
     A                                      "SCPST8","field type":"output field-
     A                                      ","visibility":{"fieldName":"28","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"value":{"fieldName":"SCPS-
     A                                      T8","designValue":"[SCPST8]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none","dataL-
     A                                      ength":"1"},"left":"0px","top":"-30-
     A                                      px","css class":"profound-converted-
     A                                      "},{"id":"SCPST9","field type":"out-
     A                                      put field","visibility":{"fieldName-
     A                                      ":"29","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"value":{"fieldNa-
     A                                      me":"SCPST9","designValue":"[SCPST9-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e","dataLength":"1"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"SFLMOD","field t-
     A                                      ype":"output field","visibility":"h-
     A                                      idden","value":{"fieldName":"SFLMOD-
     A                                      ","designValue":"[SFLMOD]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"none","dataLen-
     A                                      gth":"1"},"left":"0px","top":"-30px-
     A                                      ","css class":"profound-converted"}-
     A                                      ,{"id":"SCRRN1","fiel')
     A                                  1  2HTML('d type":"output field","visib-
     A                                      ility":"hidden","value":{"fieldName-
     A                                      ":"SCRRN1","designValue":"[SCRRN1]"-
     A                                      ,"dataType":"zoned","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"true","zeroFill":"true","curSym-
     A                                      ":"","units":"","negNum":"-999.00",-
     A                                      "dataLength":"4","decPos":"0"},"lef-
     A                                      t":"0px","top":"-30px","width":"28p-
     A                                      x","text align":"right","css class"-
     A                                      :"profound-converted"},{"id":"SCPST-
     A                                      7","field type":"output field","vis-
     A                                      ibility":{"fieldName":"27","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"value":{"fieldName":"SCPST7","d-
     A                                      esignValue":"[SCPST7]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"1"},"left":"0px","top":"-30px","c-
     A                                      ss class":"profound-converted"},{"i-
     A                                      d":"SCPST5","field type":"output fi-
     A                                      eld","visibility":{"fieldName":"25"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"value":{"fieldName":"S-
     A                                      CPST5","designValue":"[SCPST5]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"none","da-
     A                                      taLength":"1"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"SCPST4","field type":"-
     A                                      output field","visibility":{"fieldN-
     A                                      ame":"24","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"value":{"fiel-
     A                                      dName":"SCPST4","designValue":"[SCP-
     A                                      ST4]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none","dataLength":"1"},"left":"0px-
     A                                      ","top":"-30px","css class":"profou-
     A                                      nd-converted"},{"id":"W0620F_SCR01C-
     A                                      _avKeys","field type":"output field-
     A                                      ","value":{"fieldName":"AV_KEYS","d-
     A                                      ataLength":"1134","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[AV_KEYS]"},"left":"0px","top":-
     A                                      "0px","visibility":"hidden"},{"id":-
     A                                      "W0620F_SCR01C_action","field type"-
     A                                      :"html container","white space":"no-
     A                                      rmal","left":"0px","top":"10px","wi-
     A                                      dth":"230px","css class":"action-pa-
     A                                      nel-converted","height":"700px","ht-
     A                                      ml":"<div class=\"top\"></div><div -
     A                                      class=\"imagetop\"><img src=\"/prof-
     A                                      oundui/userdata/images/bar_top.png\-
     A                                      " /></div><div class=\"menulinks\">-
     A                                      </div><div class=\"imagebottom\"><i-
     A                                      mg src=\"/profoundui/userdata/image-
     A                                      s/bar_bottom.png\" /></div><div cla-
     A                                      ss=\"bottom\"></div>"},{"field type-
     A                                      ":"icon menu button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"32px","z index":"20",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in plac')
     A                                  1  2HTML('e":"true","left":"1170px","id-
     A                                      ":"W0620F_SCR01C_BtnIconMenuSystemT-
     A                                      ools","tool tip":"System Tools","ic-
     A                                      on source":"/profoundui/userdata/im-
     A                                      ages/systool/systools.png","data fu-
     A                                      nction":"SystemToolbarSystools","sh-
     A                                      ow down arrow":"Yes"},{"field type"-
     A                                      :"panel","panel style":"TransformBu-
     A                                      ttonBar","id":"W0620F_SCR01C_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1040px","id":"-
     A                                      W0620F_SCR01C_BtnSave","tool tip":"-
     A                                      Save","onclick":"SystemToolbarSave"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/save.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1066px-
     A                                      ","id":"W0620F_SCR01C_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"W0620F_-
     A                                      SCR01C_BtnSearch","tool tip":"Searc-
     A                                      h","onclick":"SystemToolbarSearch",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/search.p-
     A                                      ng'')"},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1118p-
     A                                      x","id":"W0620F_SCR01C_BtnDiaryItem-
     A                                      s","tool tip":"Diary/Work Items - I-
     A                                      DARTS","onclick":"SystemToolbarDiar-
     A                                      y","background image":{"fieldName":-
     A                                      "DryIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","tr')
     A                                  1  2HTML('imTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1144px","id":"W0620F_SCR-
     A                                      01C_BtnSystemMessages","tool tip":"-
     A                                      System Messages","onclick":"SystemT-
     A                                      oolbarMessages","background image":-
     A                                      {"fieldName":"MsgIcnURL","dataLengt-
     A                                      h":"128","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none"}},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1196px","id":"W0620F_SCR01C_Btn-
     A                                      Help","tool tip":"Help","onclick":"-
     A                                      SystemToolbarHelp","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/help.png'')"},{"id":"W06-
     A                                      20F_SCR01C_ImgSysToolBottom","field-
     A                                       type":"image","image source":"/pro-
     A                                      foundui/userdata/images/systool/but-
     A                                      barbot.png","left":"1036px","top":"-
     A                                      64px","width":"187px","locked in pl-
     A                                      ace":"true","css class":"stationary-
     A                                      ","visibility":"hidden"},{"id":"W06-
     A                                      20F_SCR01C_MainTabPanel","field typ-
     A                                      e":"tab panel","tab panel style":"T-
     A                                      ransform","tab names":{"fieldName":-
     A                                      "SCPRDS","designValue":"[SCPRDS]","-
     A                                      refField":"NAME","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"active tab-
     A                                      ":"0","left":"250px","top":"70px","-
     A                                      width":"970px","height":"657px","z -
     A                                      index":"8","locked in place":"true"-
     A                                      ,"css class":"tab-panel","css class-
     A                                       2":"stationary"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W0620F_SCR01C_BtnHiddenSave",-
     A                                      "value":"btnSave","top":"100px","re-
     A                                      sponse":{"fieldName":"btnSave","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant1","field type":"output -
     A                                      field","left":"281px","cursor colum-
     A                                      n":"2","top":"110px","cursor row":"-
     A                                      1","css class":"top-line","value":"-
     A                                      js: currentUser()","css class 2":"o-
     A                                      utput-field","parent')
     A                                  1  2HTML(' tab panel":"W0620F_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"SCCONM","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCCONM","d-
     A                                      esignValue":"[SCCONM]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"414px","cursor column"-
     A                                      :"21","top":"110px","cursor row":"1-
     A                                      ","css class 2":"top-line","css cla-
     A                                      ss 3":"HI","error message id":"CPF5-
     A                                      203","error message file":"QCPFMSG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"91","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"2 messages","error-
     A                                       message id 2":"CPF5204","error mes-
     A                                      sage file 2":"QCPFMSG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"94","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"parent ta-
     A                                      b panel":"W0620F_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 4":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t2","field type":"output field","le-
     A                                      ft":"778px","cursor column":"73","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass":"top-line","value":"js: curre-
     A                                      ntDate()","css class 2":"output-fie-
     A                                      ld","parent tab panel":"W0620F_SCR0-
     A                                      1C_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"W0620F_SCR01C_fkeyMenu","fie-
     A                                      ld type":"menu","left":"10px","top"-
     A                                      :"120px","height":"350px","width":"-
     A                                      230px","hover background color":"#9-
     A                                      AAA61","hover text color":"#FFFFFF"-
     A                                      ,"border color":"#4C6106","menu opt-
     A                                      ion indent":"10px","background colo-
     A                                      r":"#758B27","css class":"action-me-
     A                                      nu","css class 2":"stationary","z i-
     A                                      ndex":"101"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W0620F_SCR01C_BtnHiddenRefresh","v-
     A                                      alue":"btnRefresh","top":"125px","r-
     A                                      esponse":{"fieldName":"btnRefresh",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"Q1PGM","field type":"output -
     A                                      field","value":{"fieldName":"Q1PGM"-
     A                                      ,"designValue":"[Q1PGM]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"css class":"output-field-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"W0620F_SCR01C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCPRDS","field type":"output field-
     A                                      ","value":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"refe')
     A                                  1  2HTML('rence","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"414-
     A                                      px","cursor column":"21","top":"130-
     A                                      px","cursor row":"2","css class 2":-
     A                                      "HI","parent tab panel":"W0620F_SCR-
     A                                      01C_MainTabPanel","parent tab":"0",-
     A                                      "visibility":"hidden","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant3","field type":"output field","-
     A                                      value":"SCR01","css class":"constan-
     A                                      t","left":"799px","cursor column":"-
     A                                      76","top":"130px","cursor row":"2",-
     A                                      "parent tab panel":"W0620F_SCR01C_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant4","field type":"output -
     A                                      field","value":"Group:","css class"-
     A                                      :"constant","left":"281px","cursor -
     A                                      column":"2","top":"150px","cursor r-
     A                                      ow":"3","parent tab panel":"W0620F_-
     A                                      SCR01C_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCFND","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      FND","designValue":"[SCFND]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"true","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","dataLe-
     A                                      ngth":"3","decPos":"0"},"css class"-
     A                                      :"output-field","left":"330px","cur-
     A                                      sor column":"9","top":"150px","curs-
     A                                      or row":"3","width":"21px","text al-
     A                                      ign":"right","parent tab panel":"W0-
     A                                      620F_SCR01C_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCNAME","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCNAME","designValue":"[SCNAME]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"60"},"css class":"-
     A                                      output-field","left":"358px","curso-
     A                                      r column":"13","top":"150px","curso-
     A                                      r row":"3","parent tab panel":"W062-
     A                                      0F_SCR01C_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0620-
     A                                      F_SCR01C_BtnHiddenSearch","value":"-
     A                                      btnSearch","top":"150px","response"-
     A                                      :{"fieldName":"btnSearch","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant5","field type":"output field-
     A                                      ","value":"Case#:","css class":"con-
     A                                      stant","left":"281px","cursor colum-
     A                                      n":"2","top":"170px","cursor row":"-
     A                                      4","parent tab panel":"W0620F_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCCASE","field type":"output -
     A                                      field","value":{"fieldName":"SCCASE-
     A                                      ","designValue":"[SCCASE]","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      umSep":"false","zeroB')
     A                                  1  2HTML('alance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00","dataLength":"10","decPo-
     A                                      s":"0","edtWrd":"''   -       ''"},-
     A                                      "css class":"output-field","left":"-
     A                                      330px","cursor column":"9","top":"1-
     A                                      70px","cursor row":"4","width":"77p-
     A                                      x","text align":"right","parent tab-
     A                                       panel":"W0620F_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      6","field type":"output field","val-
     A                                      ue":"SS#:","css class":"constant","-
     A                                      left":"421px","cursor column":"22",-
     A                                      "top":"170px","cursor row":"4","par-
     A                                      ent tab panel":"W0620F_SCR01C_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CSS#","field type":"output field","-
     A                                      value":{"fieldName":"SCSS#","dataLe-
     A                                      ngth":"9","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[SCS-
     A                                      S#]"},"css class":"output-field","l-
     A                                      eft":"456px","cursor column":"27","-
     A                                      top":"170px","cursor row":"4","widt-
     A                                      h":"77px","text align":"right","par-
     A                                      ent tab panel":"W0620F_SCR01C_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CCNAM","field type":"output field",-
     A                                      "value":{"fieldName":"SCCNAM","desi-
     A                                      gnValue":"[SCCNAM]","refField":"DS2-
     A                                      5","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"547px","cursor column":"4-
     A                                      0","top":"170px","cursor row":"4","-
     A                                      parent tab panel":"W0620F_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant7","field type":"output f-
     A                                      ield","value":"DOI:","css class":"c-
     A                                      onstant","left":"729px","cursor col-
     A                                      umn":"66","top":"170px","cursor row-
     A                                      ":"4","parent tab panel":"W0620F_SC-
     A                                      R01C_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCDOI","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCDO-
     A                                      I","designValue":"[SCDOI]","refFiel-
     A                                      d":"DT8","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"true","zeroFill":"t-
     A                                      rue","curSym":"","units":"","negNum-
     A                                      ":"-999.00","edtWrd":"''  /  /    '-
     A                                      '"},"css class":"output-field","lef-
     A                                      t":"764px","cursor column":"71","to-
     A                                      p":"170px","cursor row":"4","width"-
     A                                      :"70px","text align":"right","paren-
     A                                      t tab panel":"W0620F_SCR01C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0620F_SCR01C_BtnHidde-
     A                                      nDiaryItems","value":')
     A                                  1  2HTML('"btnDiary","top":"175px","res-
     A                                      ponse":{"fieldName":"btnDiary","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant13","field type":"output-
     A                                       field","value":"Transaction:","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"45","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"2-
     A                                      81px","cursor column":"2","top":"19-
     A                                      0px","cursor row":"5","parent tab p-
     A                                      anel":"W0620F_SCR01C_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCTCOD","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCTCOD","designValue":-
     A                                      "[SCTCOD]","refField":"CODE","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","visibi-
     A                                      lity":{"fieldName":"45","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"372px","cursor column":"15"-
     A                                      ,"top":"190px","cursor row":"5","pa-
     A                                      rent tab panel":"W0620F_SCR01C_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCTRTP","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCTRTP","des-
     A                                      ignValue":"[SCTRTP]","refField":"FL-
     A                                      AG","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","visibility":{"fieldName":"45","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"393px","cursor co-
     A                                      lumn":"18","top":"190px","cursor ro-
     A                                      w":"5","parent tab panel":"W0620F_S-
     A                                      CR01C_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W0620F_SC-
     A                                      R01C_BtnHiddenSystemMessages","valu-
     A                                      e":"btnMessage","top":"200px","resp-
     A                                      onse":{"fieldName":"btnMessage","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant8","field type":"output-
     A                                       field","value":"Position to . . ."-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"210p-
     A                                      x","cursor row":"6","parent tab pan-
     A                                      el":"W0620F_SCR01C_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"constant11",-
     A                                      "field type":"output field","value"-
     A                                      :"Check #:","css class":"constant",-
     A                                      "visibility":{"fieldName":"23","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"414px","cursor colum-
     A                                      n":"21","top":"210px","cursor row":-
     A                                      "6","parent tab panel":"W0620F_SCR0-
     A                                      1C_MainTabPanel","par')
     A                                  1  2HTML('ent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      10","field type":"output field","va-
     A                                      lue":"Fein/Mod:","css class":"const-
     A                                      ant","visibility":{"fieldName":"22"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"414px","cursor -
     A                                      column":"21","top":"210px","cursor -
     A                                      row":"6","parent tab panel":"W0620F-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant9","field type"-
     A                                      :"output field","value":"Date:","cs-
     A                                      s class":"constant","visibility":{"-
     A                                      fieldName":"21","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      414px","cursor column":"21","top":"-
     A                                      210px","cursor row":"6","parent tab-
     A                                       panel":"W0620F_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCPST1",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","in-
     A                                      put only":"true","value":{"fieldNam-
     A                                      e":"SCPST1","designValue":"[SCPST1]-
     A                                      ","dataType":"char","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"-999.00-
     A                                      ","dataLength":"8","numBlankFill":"-
     A                                      true"},"visibility":{"fieldName":"2-
     A                                      1","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"456px","curso-
     A                                      r column":"27","top":"210px","curso-
     A                                      r row":"6","width":"57px","text ali-
     A                                      gn":"right","set focus":{"fieldName-
     A                                      ":"N06","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"description":"DATE"-
     A                                      ,"parent tab panel":"W0620F_SCR01C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"SCPST3","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","input only":"true","value-
     A                                      ":{"fieldName":"SCPST3","designValu-
     A                                      e":"[SCPST3]","dataType":"char","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00","dataLength":"7","num-
     A                                      BlankFill":"true"},"visibility":{"f-
     A                                      ieldName":"23","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"4-
     A                                      77px","cursor column":"30","top":"2-
     A                                      10px","cursor row":"6","width":"50p-
     A                                      x","text align":"right","set focus"-
     A                                      :{"fieldName":"N06","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"descrip-
     A                                      tion":"CHECK #","parent tab panel":-
     A                                      "W0620F_SCR01C_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"SCPST2","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","input only-
     A                                      ":"true","value":{"fieldName":"SCPS-
     A                                      T2","designValue":"[S')
     A                                  1  2HTML('CPST2]","dataType":"char","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00","dataLength":"9","num-
     A                                      BlankFill":"true"},"visibility":{"f-
     A                                      ieldName":"22","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"4-
     A                                      84px","cursor column":"31","top":"2-
     A                                      10px","cursor row":"6","width":"64p-
     A                                      x","text align":"right","set focus"-
     A                                      :{"fieldName":"N06","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"descrip-
     A                                      tion":"FEIN","parent tab panel":"W0-
     A                                      620F_SCR01C_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"SCPSTA","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","input only":"-
     A                                      true","value":{"fieldName":"SCPSTA"-
     A                                      ,"designValue":"[SCPSTA]","dataType-
     A                                      ":"char","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","dataLeng-
     A                                      th":"3","numBlankFill":"true"},"vis-
     A                                      ibility":{"fieldName":"22","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"554px","cursor column":"-
     A                                      41","top":"210px","cursor row":"6",-
     A                                      "width":"22px","text align":"right"-
     A                                      ,"description":"MOD","parent tab pa-
     A                                      nel":"W0620F_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0620F_SCR01C_BtnHiddenWorkSub-
     A                                      mitJob","value":"btnWrksbmjob","top-
     A                                      ":"225px","response":{"fieldName":"-
     A                                      btnWrkJob","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant12","fiel-
     A                                      d type":"output field","value":"Typ-
     A                                      e options, press Enter.","css class-
     A                                      ":"constant","left":"281px","cursor-
     A                                       column":"2","top":"230px","cursor -
     A                                      row":"7","css class 2":"BLU","paren-
     A                                      t tab panel":"W0620F_SCR01C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"SCO-
     A                                      PL1","field type":"output field","v-
     A                                      alue":{"fieldName":"SCOPL1","design-
     A                                      Value":"[SCOPL1]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none","dataLength":"76-
     A                                      "},"css class":"output-field","left-
     A                                      ":"295px","cursor column":"4","top"-
     A                                      :"250px","cursor row":"8","css clas-
     A                                      s 2":"BLU","parent tab panel":"W062-
     A                                      0F_SCR01C_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted","css class 4":"subfile-headin-
     A                                      g"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place"')
     A                                  1  2HTML(':"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W0620F_SCR01C_BtnHidden-
     A                                      WorkPrinterOutput","value":"btnWrkp-
     A                                      rtout","top":"250px","response":{"f-
     A                                      ieldName":"btnWrkPrnt","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCHDL-
     A                                      1","field type":"output field","val-
     A                                      ue":{"fieldName":"SCHDL1","designVa-
     A                                      lue":"[SCHDL1]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none","dataLength":"78"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      270px","cursor row":"9","css class -
     A                                      2":"HI","parent tab panel":"W0620F_-
     A                                      SCR01C_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d","css class 4":"subfile-heading"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0620F_SCR0-
     A                                      1C_BtnHiddenImageQueue","value":"bt-
     A                                      nImgQue","top":"275px","response":{-
     A                                      "fieldName":"btnImgQue","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"SCR0-
     A                                      1S","field type":"grid","number of -
     A                                      columns":"8","record format name":"-
     A                                      SCR01S","subfile next changed":{"fi-
     A                                      eldName":"08","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"display subfi-
     A                                      le":{"fieldName":"04","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"displ-
     A                                      ay control record":{"fieldName":"N0-
     A                                      3","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"clear subfile":{"fieldNa-
     A                                      me":"03","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"subfile size":"13"-
     A                                      ,"place cursor":"true","header heig-
     A                                      ht":"40","row height":"20","css cla-
     A                                      ss":"subfilegrid","css class 2":"pr-
     A                                      ofound-converted","parent tab panel-
     A                                      ":"W0620F_SCR01C_MainTabPanel","par-
     A                                      ent tab":"0","subfile end":{"fieldN-
     A                                      ame":"95","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"page down respons-
     A                                      e":{"fieldName":"*IN01","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"page up res-
     A                                      ponse":{"fieldName":"*IN02","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"show pa-
     A                                      ging controls":"true","scrollbar":"-
     A                                      none","number of rows":"13","top":"-
     A                                      250px","left":"276px","column width-
     A                                      s":"28,238,21,21,21,21,112,126","re-
     A                                      turn mode":{"fieldName":"SFLMOD","d-
     A                                      ataLength":"1","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"subfile record num-
     A                                      ber":{"fieldName":"SC')
     A                                  1  2HTML('RRN1","designValue":"[SCRRN1]-
     A                                      ","dataType":"zoned","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"true","zeroFill":"true","curSy-
     A                                      m":"","units":"","negNum":"-999.00"-
     A                                      ,"dataLength":"4","decPos":"0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W0620F_SCR01C_-
     A                                      BtnHiddenHelp","value":"btnHelp","t-
     A                                      op":"327px","response":{"fieldName"-
     A                                      :"btnHelp","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"150px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF03","field type":"bu-
     A                                      tton","value":"F3","shortcut key":"-
     A                                      F3","left":"14px","top":"183px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF0-
     A                                      5","field type":"button","value":"F-
     A                                      5","shortcut key":"F5","left":"14px-
     A                                      ","top":"216px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnCF06","field type":-
     A                                      "button","value":"F6","shortcut key-
     A                                      ":"F6","left":"14px","top":"249px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF11","field type":"button","value"-
     A                                      :"F11","shortcut key":"F11","left":-
     A                                      "14px","top":"282px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF12","field t-
     A                                      ype":"button","value":"Cancel","sho-
     A                                      rtcut key":"F12","left":"14px","top-
     A                                      ":"315px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF17","field type":"butto-
     A                                      n","value":"F17","shortcut key":"F1-
     A                                      7","left":"14px","top":"348px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF21-
     A                                      ","field type":"button","value":"F2-
     A                                      1","shortcut key":"F21","left":"14p-
     A                                      x","top":"381px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnCF23","field type"-
     A                                      :"button","value":"F23","shortcut k-
     A                                      ey":"F23","left":"14px","top":"414p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF24","field type":"button","val-
     A                                      ue":"F24","shortcut key":"F24","lef-
     A                                      t":"14px","top":"447px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"')
     A                                  1  2HTML('SCDBRR","field type":"output -
     A                                      field","visibility":"hidden","value-
     A                                      ":{"fieldName":"SCDBRR","designValu-
     A                                      e":"[SCDBRR]","dataType":"zoned","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      true","curSym":"","units":"","negNu-
     A                                      m":"-999.00","dataLength":"9","decP-
     A                                      os":"0"},"left":"-58px","top":"-319-
     A                                      px","width":"63px","text align":"ri-
     A                                      ght","css class":"profound-converte-
     A                                      d","grid":"SCR01S","column":"0"},{"-
     A                                      id":"SCFEIN","field type":"output f-
     A                                      ield","visibility":"hidden","value"-
     A                                      :{"fieldName":"SCFEIN","designValue-
     A                                      ":"[SCFEIN]","refField":"FEIN","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"true","curSym"-
     A                                      :"","units":"","negNum":"-999.00"},-
     A                                      "left":"-58px","top":"-319px","widt-
     A                                      h":"63px","text align":"right","css-
     A                                       class":"profound-converted","grid"-
     A                                      :"SCR01S","column":"0"},{"id":"SCDT-
     A                                      ","field type":"output field","visi-
     A                                      bility":"hidden","value":{"fieldNam-
     A                                      e":"SCDT","designValue":"[SCDT]","r-
     A                                      efField":"DT","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"true","zeroFil-
     A                                      l":"true","curSym":"","units":"","n-
     A                                      egNum":"-999.00"},"left":"-44px","t-
     A                                      op":"-319px","width":"49px","text a-
     A                                      lign":"right","css class":"profound-
     A                                      -converted","grid":"SCR01S","column-
     A                                      ":"0"},{"id":"SCCHK#","field type":-
     A                                      "output field","visibility":"hidden-
     A                                      ","value":{"fieldName":"SCCHK#","de-
     A                                      signValue":"[SCCHK#]","refField":"C-
     A                                      HK#","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00"},"left":"-44px","top":"-319-
     A                                      px","width":"49px","text align":"ri-
     A                                      ght","css class":"profound-converte-
     A                                      d","grid":"SCR01S","column":"0"},{"-
     A                                      id":"SCTRDT","field type":"output f-
     A                                      ield","visibility":"hidden","value"-
     A                                      :{"fieldName":"SCTRDT","designValue-
     A                                      ":"[SCTRDT]","refField":"DT","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00"},"l-
     A                                      eft":"-44px","top":"-319px","width"-
     A                                      :"49px","text align":"right","css c-
     A                                      lass":"profound-converted","grid":"-
     A                                      SCR01S","column":"0"},{"id":"SCSEQ#-
     A                                      ","field type":"output field","visi-
     A                                      bility":"hidden","value":{"fieldNam-
     A                                      e":"SCSEQ#","designValue":"[SCSEQ#]-
     A                                      ","refField":"SEQ#","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"true","curSym":"","units"-
     A                                      :"","negNum":"-999.00"},"left":"-30-
     A                                      px","top":"-319px","width":"35px","-
     A                                      text align":"right","css class":"pr-
     A                                      ofound-converted","grid":"SCR01S","-
     A                                      column":"0"},{"id":"SCMOD","field t-
     A                                      ype":"output field","')
     A                                  1  2HTML('visibility":"hidden","value":-
     A                                      {"fieldName":"SCMOD","designValue":-
     A                                      "[SCMOD]","refField":"MOD","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00"},"lef-
     A                                      t":"-16px","top":"-319px","width":"-
     A                                      21px","text align":"right","css cla-
     A                                      ss":"profound-converted","grid":"SC-
     A                                      R01S","column":"0"},{"id":"SCSEL","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCSEL","designVal-
     A                                      ue":"[SCSEL]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"uppercase","dataLength":"2"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"5px","cursor column":"2","top":-
     A                                      "1px","cursor row":"10","width":"15-
     A                                      px","set focus":{"fieldName":"07","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 3":{"fieldName":"0-
     A                                      5","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"RI","custom-
     A                                      False":""},"description":"Selection-
     A                                       Field","css class 4":"profound-con-
     A                                      verted","grid":"SCR01S","column":"0-
     A                                      "},{"id":"SCDATA","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      DATA","designValue":"[SCDATA]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none","da-
     A                                      taLength":"32"},"css class":"output-
     A                                      -field","left":"5px","cursor column-
     A                                      ":"6","top":"1px","cursor row":"10"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      ,"grid":"SCR01S","column":"1"},{"id-
     A                                      ":"SCTRCD","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCTRCD","-
     A                                      designValue":"[SCTRCD]","refField":-
     A                                      "CODE","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"5px","cursor column":-
     A                                      "40","top":"1px","cursor row":"10",-
     A                                      "description":"Transaction Code","c-
     A                                      ss class 2":"profound-converted","g-
     A                                      rid":"SCR01S","column":"2"},{"id":"-
     A                                      SCTYPE","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCTYPE","des-
     A                                      ignValue":"[SCTYPE]","refField":"FL-
     A                                      AG","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"5px","cursor column":"43-
     A                                      ","top":"1px","cursor row":"10","de-
     A                                      scription":"Record Type","css class-
     A                                       2":"profound-converted","grid":"SC-
     A                                      R01S","column":"3"},{"id":"SCRECD",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCRECD","designValue-
     A                                      ":"[SCRECD]","refField":"CODE","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTr')
     A                                  1  2HTML('ansform":"none"},"css class":-
     A                                      "output-field","left":"5px","cursor-
     A                                       column":"46","top":"1px","cursor r-
     A                                      ow":"10","description":"Reserve Cod-
     A                                      e","css class 2":"profound-converte-
     A                                      d","grid":"SCR01S","column":"4"},{"-
     A                                      id":"SCRETP","field type":"output f-
     A                                      ield","value":{"fieldName":"SCRETP"-
     A                                      ,"designValue":"[SCRETP]","refField-
     A                                      ":"FLAG","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"5px","cursor column-
     A                                      ":"49","top":"1px","cursor row":"10-
     A                                      ","description":"Reserve Type","css-
     A                                       class 2":"profound-converted","gri-
     A                                      d":"SCR01S","column":"5"},{"id":"SC-
     A                                      DESC","field type":"output field","-
     A                                      value":{"fieldName":"SCDESC","desig-
     A                                      nValue":"[SCDESC]","refField":"DS15-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"5px","cursor column":"52",-
     A                                      "top":"1px","cursor row":"10","css -
     A                                      class 2":"profound-converted","grid-
     A                                      ":"SCR01S","column":"6"},{"id":"SCA-
     A                                      MT","field type":"output field","va-
     A                                      lue":{"fieldName":"SCAMT","designVa-
     A                                      lue":"[SCAMT]","refField":"A92","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"true","zeroBalance-
     A                                      ":"false","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"-999.00"-
     A                                      },"css class":"output-field","left"-
     A                                      :"5px","cursor column":"68","top":"-
     A                                      1px","cursor row":"10","width":"91p-
     A                                      x","text align":"right","css class -
     A                                      2":"profound-converted","grid":"SCR-
     A                                      01S","column":"7"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCASE        10S 0H
     A            SCFND          3S 0H
     A            SCHDL1        78A  H
     A            SCNAME        60A  H
     A            SCOPL1        76A  H
     A            SCOPL2        76A  H
     A            SCPST1         8A  H
     A            SCPST2         9A  H
     A            SCPST3         7A  H
     A            SCPST4         1A  H
     A            SCPST5         1A  H
     A            SCPST6         1A  H
     A            SCPST7         1A  H
     A            SCPST8         1A  H
     A            SCPST9         1A  H
     A            SCPSTA         3A  H
     A            SCRRN1         4S 0H
     A            SCSS#          9A  H
     A            SFLMOD         1A  H
     A            SCCNAM    R        H      REFFLD(DS25)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDOI     R        H      REFFLD(DT8)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCTCOD    R        H      REFFLD(CODE)
     A            SCTRTP    R        H      REFFLD(FLAG)
     A          R SCR01
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    23C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","overlay range":"2-
     A                                      3-23"},"items":[{"id":"SCFKL2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      FKL2","designValue":"[SCFKL2]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"78"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"W0620F_SCR01_avKeys","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"AV_KEYS","dataLength"-
     A                                      :"1134","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[AV_KE-
     A                                      YS]"},"left":"0px","top":"0px","vis-
     A                                      ibility":"hidden"},{"id":"W0620F_SC-
     A                                      R01_action","field type":"html cont-
     A                                      ainer","white space":"normal","left-
     A                                      ":"0px","top":"10px","width":"230px-
     A                                      ","css class":"action-panel-convert-
     A                                      ed","height":"700px","html":"<div c-
     A                                      lass=\"top\"></div><div class=\"ima-
     A                                      getop\"><img src=\"/profoundui/user-
     A                                      data/images/bar_top.png\" /></div><-
     A                                      div class=\"menulinks\"></div><div -
     A                                      class=\"imagebottom\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_botto-
     A                                      m.png\" /></div><div class=\"bottom-
     A                                      \"></div>"},{"field type":"icon men-
     A                                      u button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"32px","z index":"20","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1170px"-
     A                                      ,"id":"W0620F_SCR01_BtnIconMenuSyst-
     A                                      emTools","tool tip":"System Tools",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"W0620F_SCR01_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"W0620F_SCR01_BtnSave","tool tip":-
     A                                      "Save","onclick":"SystemToolbarSave-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/save.p-
     A                                      ng'')"},{"field type":"button","css-
     A                                       class":"stationary",')
     A                                  1  2HTML('"width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1066px","id":"W0620F-
     A                                      _SCR01_BtnRefresh","tool tip":"Refr-
     A                                      esh","onclick":"SystemToolbarRefres-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/refre-
     A                                      sh.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      092px","id":"W0620F_SCR01_BtnSearch-
     A                                      ","tool tip":"Search","onclick":"Sy-
     A                                      stemToolbarSearch","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/search.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1118px","id":"W0620F_-
     A                                      SCR01_BtnDiaryItems","tool tip":"Di-
     A                                      ary/Work Items - IDARTS","onclick":-
     A                                      "SystemToolbarDiary","background im-
     A                                      age":{"fieldName":"DryIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1144px","id":"W0620F_SCR01-
     A                                      _BtnSystemMessages","tool tip":"Sys-
     A                                      tem Messages","onclick":"SystemTool-
     A                                      barMessages","background image":{"f-
     A                                      ieldName":"MsgIcnURL","dataLength":-
     A                                      "128","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"}},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bo')
     A                                  1  2HTML('ttom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1196px","id":"-
     A                                      W0620F_SCR01_BtnHelp","tool tip":"H-
     A                                      elp","onclick":"SystemToolbarHelp",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/help.png-
     A                                      '')"},{"id":"W0620F_SCR01_ImgSysToo-
     A                                      lBottom","field type":"image","imag-
     A                                      e source":"/profoundui/userdata/ima-
     A                                      ges/systool/butbarbot.png","left":"-
     A                                      1036px","top":"64px","width":"187px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en"},{"id":"W0620F_SCR01_MainTabPan-
     A                                      el","field type":"tab panel","tab p-
     A                                      anel style":"Transform","tab names"-
     A                                      :"Tab 1","active tab":"0","left":"2-
     A                                      50px","top":"70px","width":"970px",-
     A                                      "height":"657px","z index":"8","loc-
     A                                      ked in place":"true","css class":"t-
     A                                      ab-panel","css class 2":"stationary-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W0620F_SC-
     A                                      R01_BtnHiddenSave","value":"btnSave-
     A                                      ","top":"100px","response":{"fieldN-
     A                                      ame":"btnSave","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"W0620F_SCR01_-
     A                                      fkeyMenu","field type":"menu","left-
     A                                      ":"10px","top":"120px","height":"35-
     A                                      0px","width":"230px","hover backgro-
     A                                      und color":"#9AAA61","hover text co-
     A                                      lor":"#FFFFFF","border color":"#4C6-
     A                                      106","menu option indent":"10px","b-
     A                                      ackground color":"#758B27","css cla-
     A                                      ss":"action-menu","css class 2":"st-
     A                                      ationary","z index":"101"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W0620F_SCR01_BtnHidd-
     A                                      enRefresh","value":"btnRefresh","to-
     A                                      p":"125px","response":{"fieldName":-
     A                                      "btnRefresh","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W0620F_SCR01_BtnHiddenSearch","val-
     A                                      ue":"btnSearch","top":"150px","resp-
     A                                      onse":{"fieldName":"btnSearch","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W0620F_SCR01_Btn-
     A                                      HiddenDiaryItems","value":"btnDiary-
     A                                      ","top":"175px","response":{"fieldN-
     A                                      ame":"btnDiary","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","')
     A                                  1  2HTML('height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W0620F_SCR0-
     A                                      1_BtnHiddenSystemMessages","value":-
     A                                      "btnMessage","top":"200px","respons-
     A                                      e":{"fieldName":"btnMessage","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0620F_SCR01_BtnHi-
     A                                      ddenWorkSubmitJob","value":"btnWrks-
     A                                      bmjob","top":"225px","response":{"f-
     A                                      ieldName":"btnWrkJob","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0620F_SCR01_BtnHiddenWor-
     A                                      kPrinterOutput","value":"btnWrkprto-
     A                                      ut","top":"250px","response":{"fiel-
     A                                      dName":"btnWrkPrnt","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W0620F_SCR01_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W0620-
     A                                      F_SCR01_BtnHiddenHelp","value":"btn-
     A                                      Help","top":"300px","response":{"fi-
     A                                      eldName":"btnHelp","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"SCFKL1","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCFKL1","designValue"-
     A                                      :"[SCFKL1]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"78"},"lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"550px","cursor row":"23","css cl-
     A                                      ass":"BLU","parent tab panel":"W062-
     A                                      0F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","visibility":"hidden","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      btnSubmit","field type":"button","v-
     A                                      alue":"Enter","shortcut key":"Enter-
     A                                      ","left":"14px","top":"150px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnPAGED-
     A                                      OWN","field type":"button","value":-
     A                                      "Page Down","shortcut key":"PageDow-
     A                                      n","response":{"fieldName":"*IN01",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      left":"14px","top":"1')
     A                                  1  2HTML('83px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnPAGEUP","field type":"b-
     A                                      utton","value":"Page Up","shortcut -
     A                                      key":"PageUp","response":{"fieldNam-
     A                                      e":"*IN02","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"left":"14px","top":"216p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFKL1        78A  H
     A            SCFKL2        78A  H
     A          R SCR02S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI000001     1A  O  2  2
     A            SCDATA        32A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCSF1R         4S 0H
     A            SCAMT     R        H      REFFLD(A92)
     A            SCDESC    R        H      REFFLD(DS15)
     A            SCRECD    R        H      REFFLD(CODE)
     A            SCRETP    R        H      REFFLD(FLAG)
     A            SCTRCD    R        H      REFFLD(CODE)
     A            SCTYPE    R        H      REFFLD(FLAG)
     A          R QSFLCTL002                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  01 02 13
     A  14 15                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR02S    5    RS-
     A                                      FLDSP    0    E1    3     14RSFLDSP-
     A                                      CTL 0    E1    3    N13RSFLCLR    0-
     A                                          E1    3     13RSFLPAG    1    C-
     A                                      2    14 RSFLSIZ    1    C2    15 1 -
     A                                         RSFLNXTCHG 0     2    ROVERLAY  -
     A                                       0     RROWS      2    C1    1C2   -
     A                                       21 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","overlay range":"-
     A                                      1-21"},"items":[{"id":"SCRRN2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      RRN2","designValue":"[SCRRN2]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"4","decPos":"0"},"left":"0-
     A                                      px","top":"-30px","width":"28px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted"},{"id":"W0620F_SCR-
     A                                      02C_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"W0620F_SCR02C_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"W0620F_SCR02C_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"W0-
     A                                      620F_SCR02C_ButtonBar","top":"35px"-
     A                                      ,"left":"1036px","width":"187px","h-
     A                                      eight":"28px","css class":"stationa-
     A                                      ry","visibility":"hidden","locked i-
     A                                      n place":"true"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1040px","id":"W0620F_SCR02C_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui')
     A                                  1  2HTML('/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"W0620F_SCR02C_BtnRefresh-
     A                                      ","tool tip":"Refresh","onclick":"S-
     A                                      ystemToolbarRefresh","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/refresh.png'')"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1092px","id":"W062-
     A                                      0F_SCR02C_BtnSearch","tool tip":"Se-
     A                                      arch","onclick":"SystemToolbarSearc-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/searc-
     A                                      h.png'')"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      18px","id":"W0620F_SCR02C_BtnDiaryI-
     A                                      tems","tool tip":"Diary/Work Items -
     A                                      - IDARTS","onclick":"SystemToolbarD-
     A                                      iary","background image":{"fieldNam-
     A                                      e":"DryIcnURL","dataLength":"128","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1144px-
     A                                      ","id":"W0620F_SCR02C_BtnSystemMess-
     A                                      ages","tool tip":"System Messages",-
     A                                      "onclick":"SystemToolbarMessages","-
     A                                      background image":{"fieldName":"Msg-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","back')
     A                                  1  2HTML('ground repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1196px","id":"W0620F_SCR02C_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      W0620F_SCR02C_ImgSysToolBottom","fi-
     A                                      eld type":"image","image source":"/-
     A                                      profoundui/userdata/images/systool/-
     A                                      butbarbot.png","left":"1036px","top-
     A                                      ":"64px","width":"187px","locked in-
     A                                       place":"true","css class":"station-
     A                                      ary","visibility":"hidden"},{"id":"-
     A                                      W0620F_SCR02C_MainTabPanel","field -
     A                                      type":"tab panel","tab panel style"-
     A                                      :"Transform","tab names":{"fieldNam-
     A                                      e":"SCPRD2","designValue":"[SCPRD2]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"active -
     A                                      tab":"0","left":"250px","top":"70px-
     A                                      ","width":"970px","height":"657px",-
     A                                      "z index":"8","locked in place":"tr-
     A                                      ue","css class":"tab-panel","css cl-
     A                                      ass 2":"stationary"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W0620F_SCR02C_BtnHiddenSav-
     A                                      e","value":"btnSave","top":"100px",-
     A                                      "response":{"fieldName":"btnSave","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant14","field type":"out-
     A                                      put field","left":"281px","cursor c-
     A                                      olumn":"2","top":"110px","cursor ro-
     A                                      w":"1","css class":"top-line","valu-
     A                                      e":"js: currentUser()","css class 2-
     A                                      ":"output-field","parent tab panel"-
     A                                      :"W0620F_SCR02C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"SCR02C_SCCONM",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCCONM","designValue-
     A                                      ":"[SCCONM]","refField":"NAME","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"414px","cursor column":"21","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss 2":"top-line","css class 3":"HI"-
     A                                      ,"parent tab panel":"W0620F_SCR02C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 4":"profound-converted"},{"i-
     A                                      d":"constant15","field type":"outpu-
     A                                      t field","left":"778px","cursor col-
     A                                      umn":"73","top":"110px","cursor row-
     A                                      ":"1","css class":"top-line","value-
     A                                      ":"js: currentDate()","css class 2"-
     A                                      :"output-field","parent tab panel":-
     A                                      "W0620F_SCR02C_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"W0620F_SCR02C_fk-
     A                                      eyMenu","field type":')
     A                                  1  2HTML('"menu","left":"10px","top":"1-
     A                                      20px","height":"350px","width":"230-
     A                                      px","hover background color":"#9AAA-
     A                                      61","hover text color":"#FFFFFF","b-
     A                                      order color":"#4C6106","menu option-
     A                                       indent":"10px","background color":-
     A                                      "#758B27","css class":"action-menu"-
     A                                      ,"css class 2":"stationary","z inde-
     A                                      x":"101"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W0-
     A                                      620F_SCR02C_BtnHiddenRefresh","valu-
     A                                      e":"btnRefresh","top":"125px","resp-
     A                                      onse":{"fieldName":"btnRefresh","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"SCR02C_Q1PGM","field type":"out-
     A                                      put field","value":{"fieldName":"Q1-
     A                                      PGM","designValue":"[Q1PGM]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none","data-
     A                                      Length":"10"},"css class":"output-f-
     A                                      ield","left":"281px","cursor column-
     A                                      ":"2","top":"130px","cursor row":"2-
     A                                      ","parent tab panel":"W0620F_SCR02C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCPRD2","field type":"output f-
     A                                      ield","value":{"fieldName":"SCPRD2"-
     A                                      ,"designValue":"[SCPRD2]","refField-
     A                                      ":"NAME","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"414px","cursor colu-
     A                                      mn":"21","top":"130px","cursor row"-
     A                                      :"2","css class 2":"HI","parent tab-
     A                                       panel":"W0620F_SCR02C_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      16","field type":"output field","va-
     A                                      lue":"SCR02","css class":"constant"-
     A                                      ,"left":"799px","cursor column":"76-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"W0620F_SCR02C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W0620F_SCR02C_BtnH-
     A                                      iddenSearch","value":"btnSearch","t-
     A                                      op":"150px","response":{"fieldName"-
     A                                      :"btnSearch","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant17","fi-
     A                                      eld type":"output field","value":"P-
     A                                      ress Enter to confirm your choices -
     A                                      for 4=Delete.","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"170px","cursor row":"4","-
     A                                      css class 2":"BLU","parent tab pane-
     A                                      l":"W0620F_SCR02C_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"but')
     A                                  1  2HTML('ton","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0620F_SCR02-
     A                                      C_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t18","field type":"output field","v-
     A                                      alue":"Press F12 to return to chang-
     A                                      e your choices.","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"190px","cursor row":"5"-
     A                                      ,"css class 2":"BLU","parent tab pa-
     A                                      nel":"W0620F_SCR02C_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W0620F_SCR02C_BtnHiddenSystemM-
     A                                      essages","value":"btnMessage","top"-
     A                                      :"200px","response":{"fieldName":"b-
     A                                      tnMessage","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      0620F_SCR02C_BtnHiddenWorkSubmitJob-
     A                                      ","value":"btnWrksbmjob","top":"225-
     A                                      px","response":{"fieldName":"btnWrk-
     A                                      Job","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"SCR02C_SCHDL1","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCHDL1","designValue":"[SCHD-
     A                                      L1]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"n-
     A                                      one","dataLength":"78"},"left":"281-
     A                                      px","cursor column":"2","top":"230p-
     A                                      x","cursor row":"7","css class":"HI-
     A                                      ","parent tab panel":"W0620F_SCR02C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted","cs-
     A                                      s class 3":"subfile-heading"},{"id"-
     A                                      :"SCR02S","field type":"grid","numb-
     A                                      er of columns":"8","record format n-
     A                                      ame":"SCR02S","subfile next changed-
     A                                      ":"true","display subfile":{"fieldN-
     A                                      ame":"14","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"display control r-
     A                                      ecord":{"fieldName":"N13","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      lear subfile":{"fieldName":"13","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"subfile size":"15","header hei-
     A                                      ght":"20","row height":"20","css cl-
     A                                      ass":"subfilegrid","css class 2":"p-
     A                                      rofound-converted","parent tab pane-
     A                                      l":"W0620F_SCR02C_MainTabPanel","pa-
     A                                      rent tab":"0","subfile end":{"field-
     A                                      Name":"N15","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"page down respo-
     A                                      nse":{"fieldName":"*IN01","dataType-
     A                                      ":"indicator","format')
     A                                  1  2HTML('ting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"page up response":{"fiel-
     A                                      dName":"*IN02","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"show paging controls-
     A                                      ":"true","scrollbar":"none","number-
     A                                       of rows":"15","top":"230px","left"-
     A                                      :"276px","column widths":"28,238,21-
     A                                      ,21,21,21,112,126","subfile record -
     A                                      number":{"fieldName":"SCRRN2","desi-
     A                                      gnValue":"[SCRRN2]","dataType":"zon-
     A                                      ed","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"true","zeroF-
     A                                      ill":"true","curSym":"","units":"",-
     A                                      "negNum":"-999.00","dataLength":"4"-
     A                                      ,"decPos":"0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W0620F_SCR02C_BtnHiddenWorkPrin-
     A                                      terOutput","value":"btnWrkprtout","-
     A                                      top":"250px","response":{"fieldName-
     A                                      ":"btnWrkPrnt","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0620F_SCR02C_BtnHiddenImageQueu-
     A                                      e","value":"btnImgQue","top":"302px-
     A                                      ","response":{"fieldName":"btnImgQu-
     A                                      e","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W0620F_SC-
     A                                      R02C_BtnHiddenHelp","value":"btnHel-
     A                                      p","top":"327px","response":{"field-
     A                                      Name":"btnHelp","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"btnSubmit","-
     A                                      field type":"button","value":"Enter-
     A                                      ","shortcut key":"Enter","left":"14-
     A                                      px","top":"150px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF12","field type-
     A                                      ":"button","value":"Cancel","shortc-
     A                                      ut key":"F12","left":"14px","top":"-
     A                                      183px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"SCR02S_SCDBRR","field type":"ou-
     A                                      tput field","visibility":"hidden","-
     A                                      value":{"fieldName":"SCDBRR","desig-
     A                                      nValue":"[SCDBRR]","dataType":"zone-
     A                                      d","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"true","curSym":"","units":"","-
     A                                      negNum":"-999.00","dataLength":"9",-
     A                                      "decPos":"0"},"left":"-58px","top":-
     A                                      "-279px","width":"63px","text align-
     A                                      ":"right","css class":"profound-con-
     A                                      verted","grid":"SCR02S","column":"0-
     A                                      "},{"id":"SCSF1R","field type":"out-
     A                                      put field","visibility":"hidden","v-
     A                                      alue":{"fieldName":"SCSF1R","design-
     A                                      Value":"[SCSF1R]","da')
     A                                  1  2HTML('taType":"zoned","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"true","zeroFill":"true","curS-
     A                                      ym":"","units":"","negNum":"-999.00-
     A                                      ","dataLength":"4","decPos":"0"},"l-
     A                                      eft":"-23px","top":"-279px","width"-
     A                                      :"28px","text align":"right","css c-
     A                                      lass":"profound-converted","grid":"-
     A                                      SCR02S","column":"0"},{"id":"SCR02S-
     A                                      _SCSEL","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCSEL","desi-
     A                                      gnValue":"[SCSEL]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"2-
     A                                      "},"css class":"output-field","left-
     A                                      ":"5px","cursor column":"2","top":"-
     A                                      1px","cursor row":"8","description"-
     A                                      :"Selection Field","css class 2":"p-
     A                                      rofound-converted","grid":"SCR02S",-
     A                                      "column":"0"},{"id":"SCR02S_SCDATA"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCDATA","designValu-
     A                                      e":"[SCDATA]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none","dataLength":"32"},"-
     A                                      css class":"output-field","left":"5-
     A                                      px","cursor column":"6","top":"1px"-
     A                                      ,"cursor row":"8","css class 2":"pr-
     A                                      ofound-converted","grid":"SCR02S","-
     A                                      column":"1"},{"id":"SCR02S_SCTRCD",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCTRCD","designValue-
     A                                      ":"[SCTRCD]","refField":"CODE","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"5px","cursor column":"40","top":-
     A                                      "1px","cursor row":"8","css class 2-
     A                                      ":"profound-converted","grid":"SCR0-
     A                                      2S","column":"2"},{"id":"SCR02S_SCT-
     A                                      YPE","field type":"output field","v-
     A                                      alue":{"fieldName":"SCTYPE","design-
     A                                      Value":"[SCTYPE]","refField":"FLAG"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"5px","cursor column":"43","-
     A                                      top":"1px","cursor row":"8","css cl-
     A                                      ass 2":"profound-converted","grid":-
     A                                      "SCR02S","column":"3"},{"id":"SCR02-
     A                                      S_SCRECD","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCRECD","d-
     A                                      esignValue":"[SCRECD]","refField":"-
     A                                      CODE","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"5px","cursor column":"-
     A                                      46","top":"1px","cursor row":"8","c-
     A                                      ss class 2":"profound-converted","g-
     A                                      rid":"SCR02S","column":"4"},{"id":"-
     A                                      SCR02S_SCRETP","field type":"output-
     A                                       field","value":{"fieldName":"SCRET-
     A                                      P","designValue":"[SCRETP]","refFie-
     A                                      ld":"FLAG","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"cs')
     A                                  1  2HTML('s class":"output-field","left-
     A                                      ":"5px","cursor column":"49","top":-
     A                                      "1px","cursor row":"8","css class 2-
     A                                      ":"profound-converted","grid":"SCR0-
     A                                      2S","column":"5"},{"id":"SCR02S_SCD-
     A                                      ESC","field type":"output field","v-
     A                                      alue":{"fieldName":"SCDESC","design-
     A                                      Value":"[SCDESC]","refField":"DS15"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"5px","cursor column":"52","-
     A                                      top":"1px","cursor row":"8","css cl-
     A                                      ass 2":"profound-converted","grid":-
     A                                      "SCR02S","column":"6"},{"id":"SCR02-
     A                                      S_SCAMT","field type":"output field-
     A                                      ","value":{"fieldName":"SCAMT","des-
     A                                      ignValue":"[SCAMT]","refField":"A92-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"true","zeroBa-
     A                                      lance":"false","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00"},"css class":"output-field","-
     A                                      left":"5px","cursor column":"68","t-
     A                                      op":"1px","cursor row":"8","width":-
     A                                      "91px","text align":"right","css cl-
     A                                      ass 2":"profound-converted","grid":-
     A                                      "SCR02S","column":"7"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        78A  H
     A            SCRRN2         4S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRD2    R        H      REFFLD(NAME)
     A          R SCR02
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      2    23C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"23-23"},"items":[{-
     A                                      "id":"W0620F_SCR02_avKeys","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"AV_KEYS","dataLength":"1134"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[AV_KEYS]"},"-
     A                                      left":"0px","top":"0px","visibility-
     A                                      ":"hidden"},{"id":"W0620F_SCR02_act-
     A                                      ion","field type":"html container",-
     A                                      "white space":"normal","left":"0px"-
     A                                      ,"top":"10px","width":"230px","css -
     A                                      class":"action-panel-converted","he-
     A                                      ight":"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_bottom.png\"-
     A                                       /></div><div class=\"bottom\"></di-
     A                                      v>"},{"field type":"icon menu butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"32px-
     A                                      ","z index":"20","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1170px","id":"-
     A                                      W0620F_SCR02_BtnIconMenuSystemTools-
     A                                      ","tool tip":"System Tools","icon s-
     A                                      ource":"/profoundui/userdata/images-
     A                                      /systool/systools.png","data functi-
     A                                      on":"SystemToolbarSystools","show d-
     A                                      own arrow":"Yes"},{"field type":"pa-
     A                                      nel","panel style":"TransformButton-
     A                                      Bar","id":"W0620F_SCR02_ButtonBar",-
     A                                      "top":"35px","left":"1036px","width-
     A                                      ":"187px","height":"28px","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n","locked in place":"true"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1040px","id":"W0620-
     A                                      F_SCR02_BtnSave","tool tip":"Save",-
     A                                      "onclick":"SystemToolbarSave","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/save.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1066px","id"-
     A                                      :"W0620F_SCR02_BtnRef')
     A                                  1  2HTML('resh","tool tip":"Refresh","o-
     A                                      nclick":"SystemToolbarRefresh","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/refresh.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1092px",-
     A                                      "id":"W0620F_SCR02_BtnSearch","tool-
     A                                       tip":"Search","onclick":"SystemToo-
     A                                      lbarSearch","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/search.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1118px","id":"W0620F_SCR02_B-
     A                                      tnDiaryItems","tool tip":"Diary/Wor-
     A                                      k Items - IDARTS","onclick":"System-
     A                                      ToolbarDiary","background image":{"-
     A                                      fieldName":"DryIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1144px","id":"W0620F_SCR02_BtnSys-
     A                                      temMessages","tool tip":"System Mes-
     A                                      sages","onclick":"SystemToolbarMess-
     A                                      ages","background image":{"fieldNam-
     A                                      e":"MsgIcnURL","dataLength":"128","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"W0620F_SCR02_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"W0620F_SCR02_I-
     A                                      mgSysToolBottom","fie')
     A                                  1  2HTML('ld type":"image","image sourc-
     A                                      e":"/profoundui/userdata/images/sys-
     A                                      tool/butbarbot.png","left":"1036px"-
     A                                      ,"top":"64px","width":"187px","lock-
     A                                      ed in place":"true","css class":"st-
     A                                      ationary","visibility":"hidden"},{"-
     A                                      id":"W0620F_SCR02_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":"Tab 1-
     A                                      ","active tab":"0","left":"250px","-
     A                                      top":"70px","width":"970px","height-
     A                                      ":"657px","z index":"8","locked in -
     A                                      place":"true","css class":"tab-pane-
     A                                      l","css class 2":"stationary"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W0620F_SCR02_Btn-
     A                                      HiddenSave","value":"btnSave","top"-
     A                                      :"100px","response":{"fieldName":"b-
     A                                      tnSave","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"W0620F_SCR02_fkeyMen-
     A                                      u","field type":"menu","left":"10px-
     A                                      ","top":"120px","height":"350px","w-
     A                                      idth":"230px","hover background col-
     A                                      or":"#9AAA61","hover text color":"#-
     A                                      FFFFFF","border color":"#4C6106","m-
     A                                      enu option indent":"10px","backgrou-
     A                                      nd color":"#758B27","css class":"ac-
     A                                      tion-menu","css class 2":"stationar-
     A                                      y","z index":"101"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W0620F_SCR02_BtnHiddenRefre-
     A                                      sh","value":"btnRefresh","top":"125-
     A                                      px","response":{"fieldName":"btnRef-
     A                                      resh","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W0620F-
     A                                      _SCR02_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W0620F_SCR02_BtnHiddenD-
     A                                      iaryItems","value":"btnDiary","top"-
     A                                      :"175px","response":{"fieldName":"b-
     A                                      tnDiary","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W06-
     A                                      20F_SCR02_BtnHiddenSystemMessages",-
     A                                      "value":"btnMessage","top":"200px",-
     A                                      "response":{"fieldName":"btnMessage-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"butt')
     A                                  1  2HTML('on","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0620F_SCR02_BtnHiddenWor-
     A                                      kSubmitJob","value":"btnWrksbmjob",-
     A                                      "top":"225px","response":{"fieldNam-
     A                                      e":"btnWrkJob","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0620F_SCR02_BtnHiddenWorkPrinte-
     A                                      rOutput","value":"btnWrkprtout","to-
     A                                      p":"250px","response":{"fieldName":-
     A                                      "btnWrkPrnt","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W0620F_SCR02_BtnHiddenImageQueue",-
     A                                      "value":"btnImgQue","top":"275px","-
     A                                      response":{"fieldName":"btnImgQue",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W0620F_SCR02-
     A                                      _BtnHiddenHelp","value":"btnHelp","-
     A                                      top":"300px","response":{"fieldName-
     A                                      ":"btnHelp","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"btnSubmit","fiel-
     A                                      d type":"button","value":"Enter","s-
     A                                      hortcut key":"Enter","left":"14px",-
     A                                      "top":"150px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnPAGEDOWN","field type-
     A                                      ":"button","value":"Page Down","sho-
     A                                      rtcut key":"PageDown","response":{"-
     A                                      fieldName":"*IN01","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"left":"14px","to-
     A                                      p":"183px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnPAGEUP","field type":"bu-
     A                                      tton","value":"Page Up","shortcut k-
     A                                      ey":"PageUp","response":{"fieldName-
     A                                      ":"*IN02","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"left":"14px","top":"216px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR03
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    RWINDOW    0     -
     A                                      RROWS      2    C1    1C1    9 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"4","overlay ra-
     A                                      nge":"1-9"},"items":[{"id":"SCR03",-
     A                                      "field type":"panel","panel style":-
     A                                      "Transform Dialog","text align":"ce-
     A                                      nter","left":"5px","top":"5px","hei-
     A                                      ght":"330px","width":"534px","z ind-
     A                                      ex":"8","locked in place":"true"},{-
     A                                      "id":"constant19","field type":"out-
     A                                      put field","left":"29px","cursor co-
     A                                      lumn":"2","top":"65px","cursor row"-
     A                                      :"1","value":"js: currentUser()","c-
     A                                      ss class":"output-field","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      PRD3","field type":"output field","-
     A                                      value":{"fieldName":"SCPRD3","desig-
     A                                      nValue":"[SCPRD3]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"127px","cursor column":"16-
     A                                      ","top":"65px","cursor row":"1","cs-
     A                                      s class 2":"HI","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant20"-
     A                                      ,"field type":"output field","value-
     A                                      ":"SCR03","css class":"constant","l-
     A                                      eft":"477px","cursor column":"66","-
     A                                      top":"65px","cursor row":"1","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant21","field type":"output -
     A                                      field","value":"Type choices, press-
     A                                       Enter.","css class":"constant","le-
     A                                      ft":"29px","cursor column":"2","top-
     A                                      ":"105px","cursor row":"3","css cla-
     A                                      ss 2":"BLU","css class 3":"profound-
     A                                      -converted"},{"id":"btnSubmit","fie-
     A                                      ld type":"button","value":"Enter","-
     A                                      shortcut key":"Enter","left":"14px"-
     A                                      ,"top":"290px","width":"80px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF12","field type":"b-
     A                                      utton","value":"Cancel","shortcut k-
     A                                      ey":"F12","left":"104px","top":"290-
     A                                      px","width":"80px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnPAGEDOWN","field type":"button",-
     A                                      "value":"Page Down","shortcut key":-
     A                                      "PageDown","response":{"fieldName":-
     A                                      "*IN01","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"left":"194px","top":"290px"-
     A                                      ,"width":"80px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","visibility":"hidden","cursor"-
     A                                      :"default"},{"id":"btnPAGEUP","fiel-
     A                                      d type":"button","value":"Page Up",-
     A                                      "shortcut key":"PageUp","response":-
     A                                      {"fieldName":"*IN02","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"left":"284px",-
     A                                      "top":"290px","width":"80px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","vi')
     A                                  1  2HTML('sibility":"hidden","cursor":"-
     A                                      default"}]}')
     A            SCPRD3    R        H      REFFLD(NAME)
     A          R MSGSFL                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI000001     1A  O  2  2
     A            MSGKEY         4A  H
     A            Q1PGM         10A  H
     A          R QSFLCTL003                SFLCTL(MSGSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLMSGSFLC')
     A          R MSGSFLC
     A  01 02 10                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    MSGSFL    6    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LINZ    0     RSFLPAG    1    C1   -
     A                                       1 RSFLSIZ    1    C1    5 FQ1PGM  -
     A                                         SFLPGMQ   0     2    FMSGKEY    -
     A                                      SFLMSGKEY 0     FQ1PGM     SFLPGMQ -
     A                                        0     1    RROWS      2    C2    -
     A                                      24C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"MSGSFLC","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","overlay range":"24-24"},"items":-
     A                                      [{"id":"W0620F_MSGSFLC_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"W0620F_MSGSF-
     A                                      LC_action","field type":"html conta-
     A                                      iner","white space":"normal","left"-
     A                                      :"0px","top":"10px","width":"230px"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","height":"700px","html":"<div cl-
     A                                      ass=\"top\"></div><div class=\"imag-
     A                                      etop\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_top.png\" /></div><d-
     A                                      iv class=\"menulinks\"></div><div c-
     A                                      lass=\"imagebottom\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_bottom-
     A                                      .png\" /></div><div class=\"bottom\-
     A                                      "></div>"},{"field type":"icon menu-
     A                                       button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"32px","z index":"20","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1170px",-
     A                                      "id":"W0620F_MSGSFLC_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon source":"/profoundui/userdat-
     A                                      a/images/systool/systools.png","dat-
     A                                      a function":"SystemToolbarSystools"-
     A                                      ,"show down arrow":"Yes"},{"field t-
     A                                      ype":"panel","panel style":"Transfo-
     A                                      rmButtonBar","id":"W0620F_MSGSFLC_B-
     A                                      uttonBar","top":"35px","left":"1036-
     A                                      px","width":"187px","height":"28px"-
     A                                      ,"css class":"stationary","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1040px","-
     A                                      id":"W0620F_MSGSFLC_BtnSave","tool -
     A                                      tip":"Save","onclick":"SystemToolba-
     A                                      rSave","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      ave.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1066px","id":"W0620F_')
     A                                  1  2HTML('MSGSFLC_BtnRefresh","tool tip-
     A                                      ":"Refresh","onclick":"SystemToolba-
     A                                      rRefresh","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/refresh.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1092px","id":"W0620F_MSGSFLC_-
     A                                      BtnSearch","tool tip":"Search","onc-
     A                                      lick":"SystemToolbarSearch","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/search.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1118px","id"-
     A                                      :"W0620F_MSGSFLC_BtnDiaryItems","to-
     A                                      ol tip":"Diary/Work Items - IDARTS"-
     A                                      ,"onclick":"SystemToolbarDiary","ba-
     A                                      ckground image":{"fieldName":"DryIc-
     A                                      nURL","dataLength":"128","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"}},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1144px","id":"W-
     A                                      0620F_MSGSFLC_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"}},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1196px","id":"W0620F_-
     A                                      MSGSFLC_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemToolbarHelp","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/help.png'')"}-
     A                                      ,{"id":"W0620F_MSGSFL')
     A                                  1  2HTML('C_ImgSysToolBottom","field ty-
     A                                      pe":"image","image source":"/profou-
     A                                      ndui/userdata/images/systool/butbar-
     A                                      bot.png","left":"1036px","top":"64p-
     A                                      x","width":"187px","locked in place-
     A                                      ":"true","css class":"stationary","-
     A                                      visibility":"hidden"},{"id":"W0620F-
     A                                      _MSGSFLC_MainTabPanel","field type"-
     A                                      :"tab panel","tab panel style":"Tra-
     A                                      nsform","tab names":"Tab 1","active-
     A                                       tab":"0","left":"250px","top":"70p-
     A                                      x","width":"970px","height":"657px"-
     A                                      ,"z index":"8","locked in place":"t-
     A                                      rue","css class":"tab-panel","css c-
     A                                      lass 2":"stationary"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W0620F_MSGSFLC_BtnHiddenS-
     A                                      ave","value":"btnSave","top":"100px-
     A                                      ","response":{"fieldName":"btnSave"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"W0620F_MSGSFLC_fkeyMenu","f-
     A                                      ield type":"menu","left":"10px","to-
     A                                      p":"120px","height":"350px","width"-
     A                                      :"230px","hover background color":"-
     A                                      #9AAA61","hover text color":"#FFFFF-
     A                                      F","border color":"#4C6106","menu o-
     A                                      ption indent":"10px","background co-
     A                                      lor":"#758B27","css class":"action--
     A                                      menu","css class 2":"stationary","z-
     A                                       index":"101"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W0620F_MSGSFLC_BtnHiddenRefresh"-
     A                                      ,"value":"btnRefresh","top":"125px"-
     A                                      ,"response":{"fieldName":"btnRefres-
     A                                      h","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W0620F_MS-
     A                                      GSFLC_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W0620F_MSGSFLC_BtnHidden-
     A                                      DiaryItems","value":"btnDiary","top-
     A                                      ":"175px","response":{"fieldName":"-
     A                                      btnDiary","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W0-
     A                                      620F_MSGSFLC_BtnHiddenSystemMessage-
     A                                      s","value":"btnMessage","top":"200p-
     A                                      x","response":{"fieldName":"btnMess-
     A                                      age","dataType":"indicator","format-
     A                                      ting":"Indicator","in')
     A                                  1  2HTML('dFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W0620F_MSGSFLC_BtnHidd-
     A                                      enWorkSubmitJob","value":"btnWrksbm-
     A                                      job","top":"225px","response":{"fie-
     A                                      ldName":"btnWrkJob","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W0620F_MSGSFLC_BtnHiddenWor-
     A                                      kPrinterOutput","value":"btnWrkprto-
     A                                      ut","top":"250px","response":{"fiel-
     A                                      dName":"btnWrkPrnt","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W0620F_MSGSFLC_BtnHiddenIma-
     A                                      geQueue","value":"btnImgQue","top":-
     A                                      "275px","response":{"fieldName":"bt-
     A                                      nImgQue","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W06-
     A                                      20F_MSGSFLC_BtnHiddenHelp","value":-
     A                                      "btnHelp","top":"300px","response":-
     A                                      {"fieldName":"btnHelp","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"MSGSF-
     A                                      L","field type":"grid","number of c-
     A                                      olumns":"1","record format name":"M-
     A                                      SGSFL","display subfile":"true","di-
     A                                      splay control record":"true","subfi-
     A                                      le size":"5","initialize subfile":"-
     A                                      true","row height":"20","css class"-
     A                                      :"subfilegrid","css class 2":"profo-
     A                                      und-converted","parent tab panel":"-
     A                                      W0620F_MSGSFLC_MainTabPanel","paren-
     A                                      t tab":"0","subfile end":{"fieldNam-
     A                                      e":"N10","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"number of rows":"1-
     A                                      ","has header":"false","subfile pro-
     A                                      gram message queue":{"fieldName":"Q-
     A                                      1PGM","dataLength":"10","trimLeadin-
     A                                      g":"false","trimTrailing":"true","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"},"subfile c-
     A                                      ontrol program message queue":{"fie-
     A                                      ldName":"Q1PGM","dataLength":"10","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none"},-
     A                                      "subfile message key":{"fieldName":-
     A                                      "MSGKEY","dataLength":"4","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none"},"top":"5-
     A                                      70px","left":"269px","column widths-
     A                                      ":"595"},{"id":"btnSubmit","field t-
     A                                      ype":"button","value"')
     A                                  1  2HTML(':"Enter","shortcut key":"Ente-
     A                                      r","left":"14px","top":"150px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnPAGE-
     A                                      DOWN","field type":"button","value"-
     A                                      :"Page Down","shortcut key":"PageDo-
     A                                      wn","response":{"fieldName":"*IN01"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "left":"14px","top":"183px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnPAGEUP"-
     A                                      ,"field type":"button","value":"Pag-
     A                                      e Up","shortcut key":"PageUp","resp-
     A                                      onse":{"fieldName":"*IN02","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"left":"1-
     A                                      4px","top":"216px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
