     A                                      REF(WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20
     A  21                                  CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                  1  2HTML('QPUIREC5    RPUTOVR    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C6    SCCODEC7    WCR0-
     A                                      503C6    WMESGGC0    C0    E1    3 -
     A                                          20RERRMSGID  5    C6    SCCODEC-
     A                                      7    WCR0505C6    WMESGGC0    C0   -
     A                                       E1    3     21FSCCODE    OVRDTA   -
     A                                       0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "put override":"true","set off":{"f-
     A                                      ieldName":"*IN20","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 2":{"fiel-
     A                                      dName":"*IN21","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"valid command key":{-
     A                                      "fieldName":"*IN11","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"overlay range":-
     A                                      "1-23"},"items":[{"id":"W1201F_SCR0-
     A                                      1_avKeys","field type":"output fiel-
     A                                      d","value":{"fieldName":"AV_KEYS","-
     A                                      dataLength":"1134","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none","designVal-
     A                                      ue":"[AV_KEYS]"},"left":"0px","top"-
     A                                      :"0px","visibility":"hidden"},{"id"-
     A                                      :"W1201F_SCR01_action","field type"-
     A                                      :"html container","white space":"no-
     A                                      rmal","left":"0px","top":"10px","wi-
     A                                      dth":"230px","css class":"action-pa-
     A                                      nel-converted","height":"700px","ht-
     A                                      ml":"<div class=\"top\"></div><div -
     A                                      class=\"imagetop\"><img src=\"/prof-
     A                                      oundui/userdata/images/bar_top.png\-
     A                                      " /></div><div class=\"menulinks\">-
     A                                      </div><div class=\"imagebottom\"><i-
     A                                      mg src=\"/profoundui/userdata/image-
     A                                      s/bar_bottom.png\" /></div><div cla-
     A                                      ss=\"bottom\"></div>"},{"field type-
     A                                      ":"icon menu button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"32px","z index":"20",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1170px","id":"W1201F_SCR01_BtnI-
     A                                      conMenuSystemTools","tool tip":"Sys-
     A                                      tem Tools","icon alignment":"middle-
     A                                       left","icon width":"16px","icon he-
     A                                      ight":"24px","icon source":"/profou-
     A                                      ndui/userdata/images/systool/systoo-
     A                                      ls.png","data function":"SystemTool-
     A                                      barSystools","show down arrow":"Yes-
     A                                      "},{"field type":"panel","panel sty-
     A                                      le":"TransformButtonBar","id":"W120-
     A                                      1F_SCR01_ButtonBar","top":"35px","l-
     A                                      eft":"1036px","width":"187px","heig-
     A                                      ht":"28px","css class":"stationary"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1040px","id":"W1201F_SCR01_BtnSave-
     A                                      ","tool tip":"Save","onclick":"Syst-
     A                                      emToolbarSave","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/save.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1066px","id":"W1201F_SCR01_-
     A                                      BtnRefresh","tool tip":"Refresh","o-
     A                                      nclick":"SystemToolbarRefresh","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/refresh.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1092px",-
     A                                      "id":"W1201F_SCR01_BtnSearch","tool-
     A                                       tip":"Search","onclick":"SystemToo-
     A                                      lbarSearch","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/search.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1118px","id":"W1201F_SCR01_B-
     A                                      tnDiaryItems","tool tip":"Diary/Wor-
     A                                      k Items - IDARTS","onclick":"System-
     A                                      ToolbarDiary","background image":{"-
     A                                      fieldName":"DryIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibili')
     A                                  1  4HTML('ty":"hidden","locked in place-
     A                                      ":"true","left":"1144px","id":"W120-
     A                                      1F_SCR01_BtnSystemMessages","tool t-
     A                                      ip":"System Messages","onclick":"Sy-
     A                                      stemToolbarMessages","background im-
     A                                      age":{"fieldName":"MsgIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1196px","id":"W1201F_SCR01-
     A                                      _BtnHelp","tool tip":"Help","onclic-
     A                                      k":"SystemToolbarHelp","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/help.png'')"},{"id":-
     A                                      "W1201F_SCR01_ImgSysToolBottom","fi-
     A                                      eld type":"image","image source":"/-
     A                                      profoundui/userdata/images/systool/-
     A                                      butbarbot.png","left":"1036px","top-
     A                                      ":"64px","width":"187px","locked in-
     A                                       place":"true","css class":"station-
     A                                      ary","visibility":"hidden"},{"id":"-
     A                                      W1201F_SCR01_MainTabPanel","field t-
     A                                      ype":"tab panel","tab panel style":-
     A                                      "Transform","tab names":{"fieldName-
     A                                      ":"SCPRDS","designValue":"[SCPRDS]"-
     A                                      ,"refField":"NAME","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"active t-
     A                                      ab":"0","left":"250px","top":"70px"-
     A                                      ,"width":"970px","height":"657px","-
     A                                      z index":"8","locked in place":"tru-
     A                                      e","css class":"tab-panel","css cla-
     A                                      ss 2":"stationary"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W1201F_SCR01_BtnHiddenSave"-
     A                                      ,"value":"btnSave","top":"100px","r-
     A                                      esponse":{"fieldName":"btnSave","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"SCUSER","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCUSER",-
     A                                      "designValue":"[SCUSER]","refField"-
     A                                      :"USER","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"281px","cursor colum-
     A                                      n":"2","top":"110px","cursor row":"-
     A                                      1","css class 2":"top-line","parent-
     A                                       tab panel":"W1201F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"SCCON-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"SCCONM","designVa-
     A                                      lue":"[SCCONM]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class 2":"top-line","description":"-
     A                                      COMPANY NAME","parent tab panel":"W-
     A                                      1201F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"constant1","field t-
     A                                      ype":"output field","left":"778px",-
     A                                      "cursor column":"73","top":"110px",-
     A                                      "cursor row":"1","css class":"top-l-
     A                                      ine","value":"js: currentDate()","c-
     A                                      ss class 2":"output-field","parent -
     A                                      tab panel":"W1201F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"W1201F-
     A                                      _SCR01_fkeyMenu","field type":"menu-
     A                                      ","left":"10px","top":"120px","heig-
     A                                      ht":"350px","width":"230px","hover -
     A                                      background color":"#9AAA61","hover -
     A                                      text color":"#FFFFFF","border color-
     A                                      ":"#4C6106","menu option indent":"1-
     A                                      0px","background color":"#758B27","-
     A                                      css class":"action-menu","css class-
     A                                       2":"stationary","z index":"101"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W1201F_SCR01_-
     A                                      BtnHiddenRefresh","value":"btnRefre-
     A                                      sh","top":"125px","response":{"fiel-
     A                                      dName":"btnRefresh","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      2","field type":"output field","val-
     A                                      ue":"W1201F","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"130px","cursor row":"2","pa-
     A                                      rent tab panel":"W1201F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CPRDS","field type":"output field",-
     A                                      "value":{"fieldName":"SCPRDS","desi-
     A                                      gnValue":"[SCPRDS]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"130px","cursor row":"2","-
     A                                      description":"PROGRAM NAME","parent-
     A                                       tab panel":"W1201F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","visibility":-
     A                                      "hidden","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant3')
     A                                  1  5HTML('","field type":"output field"-
     A                                      ,"value":"SCR01","css class":"const-
     A                                      ant","left":"799px","cursor column"-
     A                                      :"76","top":"130px","cursor row":"2-
     A                                      ","parent tab panel":"W1201F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W1201F_SCR01_Bt-
     A                                      nHiddenSearch","value":"btnSearch",-
     A                                      "top":"150px","response":{"fieldNam-
     A                                      e":"btnSearch","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W1201F_SCR01_BtnHiddenDiaryItems-
     A                                      ","value":"btnDiary","top":"175px",-
     A                                      "response":{"fieldName":"btnDiary",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W1201F_SCR01-
     A                                      _BtnHiddenSystemMessages","value":"-
     A                                      btnMessage","top":"200px","response-
     A                                      ":{"fieldName":"btnMessage","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W1201F_SCR01_BtnHid-
     A                                      denWorkSubmitJob","value":"btnWrksb-
     A                                      mjob","top":"225px","response":{"fi-
     A                                      eldName":"btnWrkJob","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W1201F_SCR01_BtnHiddenWork-
     A                                      PrinterOutput","value":"btnWrkprtou-
     A                                      t","top":"250px","response":{"field-
     A                                      Name":"btnWrkPrnt","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W1201F_SCR01_BtnHiddenImageQ-
     A                                      ueue","value":"btnImgQue","top":"27-
     A                                      5px","response":{"fieldName":"btnIm-
     A                                      gQue","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant4","field type-
     A                                      ":"output field","value":"System A/-
     A                                      R Batch Code:","css class":"constan-
     A                                      t","left":"435px","cursor column":"-
     A                                      24","top":"290px","cursor row":"10"-
     A                                      ,"parent tab panel":"W1201F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCCODE","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCCOD-
     A                                      E","designValue":"[SCCODE]","refFie-
     A                                      ld":"CODE","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase"},"text transfo-
     A                                      rm":"uppercase","left":"603px","cur-
     A                                      sor column":"48","top":"290px","cur-
     A                                      sor row":"10","width":"15px","error-
     A                                       message id":"WCR0503","error messa-
     A                                      ge file":"WMESGG","error condition"-
     A                                      :{"fieldName":"20","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"2 messages","error message id 2":-
     A                                      "WCR0505","error message file 2":"W-
     A                                      MESGG","error condition 2":{"fieldN-
     A                                      ame":"21","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"override data":"true","d-
     A                                      escription":"CODE","parent tab pane-
     A                                      l":"W1201F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W1201F_SCR01_BtnHiddenHelp","valu-
     A                                      e":"btnHelp","top":"300px","respons-
     A                                      e":{"fieldName":"btnHelp","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"bt-
     A                                      nSubmit","field type":"button","val-
     A                                      ue":"Enter","shortcut key":"Enter",-
     A                                      "left":"14px","top":"150px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF03","-
     A                                      field type":"button","value":"Exit -
     A                                              ","shortcut key":"F3","left-
     A                                      ":"14px","top":"183px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF05","field-
     A                                       type":"button","value":"Search   "-
     A                                      ,"shortcut key":"F5","left":"14px",-
     A                                      "top":"216px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnHELP","field type":"b-
     A                                      utton","shortcut key":"Alt-F1","byp-
     A                                      ass validation":"true","value":"HEL-
     A                                      P","response":{"fieldName"')
     A                                  1  6HTML(':"*IN10","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"left":"14px","top":"-
     A                                      249px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCCODE    R        H      REFFLD(CODE)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR02
     A  10 11 20
     A  21 09 40                            CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                  1  2HTML('QPUIREC7    RPUTOVR    0     -
     A                                      RROWS      2    C1    1C2    23 FSC-
     A                                      STAT    OVRDTA    0     RERRMSGID  -
     A                                      5    C6    SCDESCC7    WCR0503C6   -
     A                                       WMESGGC0    C0    E1    3     20FS-
     A                                      CDESC    OVRDTA    0     RERRMSGID -
     A                                       5    C6    SCTYPEC7    WCR0501C6  -
     A                                        WMESGGC0    C0    E1    3     21F-
     A                                      SCTYPE    OVRDTA    0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"put ove-
     A                                      rride":"true","valid command key":{-
     A                                      "fieldName":"*IN11","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"overlay range":-
     A                                      "1-23"},"items":[{"id":"W1201F_SCR0-
     A                                      2_avKeys","field type":"output fiel-
     A                                      d","value":{"fieldName":"AV_KEYS","-
     A                                      dataLength":"1134","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none","designVal-
     A                                      ue":"[AV_KEYS]"},"left":"0px","top"-
     A                                      :"0px","visibility":"hidden"},{"id"-
     A                                      :"W1201F_SCR02_action","field type"-
     A                                      :"html container","white space":"no-
     A                                      rmal","left":"0px","top":"10px","wi-
     A                                      dth":"230px","css class":"action-pa-
     A                                      nel-converted","height":"700px","ht-
     A                                      ml":"<div class=\"top\"></div><div -
     A                                      class=\"imagetop\"><img src=\"/prof-
     A                                      oundui/userdata/images/bar_top.png\-
     A                                      " /></div><div class=\"menulinks\">-
     A                                      </div><div class=\"imagebottom\"><i-
     A                                      mg src=\"/profoundui/userdata/image-
     A                                      s/bar_bottom.png\" /></div><div cla-
     A                                      ss=\"bottom\"></div>"},{"field type-
     A                                      ":"icon menu button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"32px","z index":"20",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1170px","id":"W1201F_SCR02_BtnI-
     A                                      conMenuSystemTools","tool tip":"Sys-
     A                                      tem Tools","icon alignment":"middle-
     A                                       left","icon width":"16px","icon he-
     A                                      ight":"24px","icon source":"/profou-
     A                                      ndui/userdata/images/systool/systoo-
     A                                      ls.png","data function":"SystemTool-
     A                                      barSystools","show down arrow":"Yes-
     A                                      "},{"field type":"panel","panel sty-
     A                                      le":"TransformButtonBar","id":"W120-
     A                                      1F_SCR02_ButtonBar","top":"35px","l-
     A                                      eft":"1036px","width":"187px","heig-
     A                                      ht":"28px","css class":"stationary"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1040px","id":"W1201F_SCR02_BtnSave-
     A                                      ","tool tip":"Save","onclick":"Syst-
     A                                      emToolbarSave","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/save.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1066px","id":"W1201F_SCR02_-
     A                                      BtnRefresh","tool tip":"Refresh","o-
     A                                      nclick":"SystemToolbarRefresh","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/refresh.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1092px",-
     A                                      "id":"W1201F_SCR02_BtnSearch","tool-
     A                                       tip":"Search","onclick":"SystemToo-
     A                                      lbarSearch","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/search.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1118px","id":"W1201F_SCR02_B-
     A                                      tnDiaryItems","tool tip":"Diary/Wor-
     A                                      k Items - IDARTS","onclick":"System-
     A                                      ToolbarDiary","background image":{"-
     A                                      fieldName":"DryIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibili')
     A                                  1  4HTML('ty":"hidden","locked in place-
     A                                      ":"true","left":"1144px","id":"W120-
     A                                      1F_SCR02_BtnSystemMessages","tool t-
     A                                      ip":"System Messages","onclick":"Sy-
     A                                      stemToolbarMessages","background im-
     A                                      age":{"fieldName":"MsgIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1196px","id":"W1201F_SCR02-
     A                                      _BtnHelp","tool tip":"Help","onclic-
     A                                      k":"SystemToolbarHelp","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/help.png'')"},{"id":-
     A                                      "W1201F_SCR02_ImgSysToolBottom","fi-
     A                                      eld type":"image","image source":"/-
     A                                      profoundui/userdata/images/systool/-
     A                                      butbarbot.png","left":"1036px","top-
     A                                      ":"64px","width":"187px","locked in-
     A                                       place":"true","css class":"station-
     A                                      ary","visibility":"hidden"},{"id":"-
     A                                      W1201F_SCR02_MainTabPanel","field t-
     A                                      ype":"tab panel","tab panel style":-
     A                                      "Transform","tab names":{"fieldName-
     A                                      ":"SCPRDS","designValue":"[SCPRDS]"-
     A                                      ,"refField":"NAME","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"active t-
     A                                      ab":"0","left":"250px","top":"70px"-
     A                                      ,"width":"970px","height":"657px","-
     A                                      z index":"8","locked in place":"tru-
     A                                      e","css class":"tab-panel","css cla-
     A                                      ss 2":"stationary"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W1201F_SCR02_BtnHiddenSave"-
     A                                      ,"value":"btnSave","top":"100px","r-
     A                                      esponse":{"fieldName":"btnSave","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"SCR02_SCUSER","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      USER","designValue":"[SCUSER]","ref-
     A                                      Field":"USER","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"281px","cursor-
     A                                       column":"2","top":"110px","cursor -
     A                                      row":"1","css class 2":"top-line","-
     A                                      parent tab panel":"W1201F_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "SCR02_SCCONM","field type":"output-
     A                                       field","value":{"fieldName":"SCCON-
     A                                      M","designValue":"[SCCONM]","refFie-
     A                                      ld":"NAME","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"414px","cursor co-
     A                                      lumn":"21","top":"110px","cursor ro-
     A                                      w":"1","css class 2":"top-line","de-
     A                                      scription":"COMPANY NAME","parent t-
     A                                      ab panel":"W1201F_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t5","field type":"output field","le-
     A                                      ft":"778px","cursor column":"73","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass":"top-line","value":"js: curre-
     A                                      ntDate()","css class 2":"output-fie-
     A                                      ld","parent tab panel":"W1201F_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"W1201F_SCR02_fkeyMenu","field-
     A                                       type":"menu","left":"10px","top":"-
     A                                      120px","height":"350px","width":"23-
     A                                      0px","hover background color":"#9AA-
     A                                      A61","hover text color":"#FFFFFF","-
     A                                      border color":"#4C6106","menu optio-
     A                                      n indent":"10px","background color"-
     A                                      :"#758B27","css class":"action-menu-
     A                                      ","css class 2":"stationary","z ind-
     A                                      ex":"101"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      1201F_SCR02_BtnHiddenRefresh","valu-
     A                                      e":"btnRefresh","top":"125px","resp-
     A                                      onse":{"fieldName":"btnRefresh","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant6","field type":"output-
     A                                       field","value":"W1201F","css class-
     A                                      ":"constant","left":"281px","cursor-
     A                                       column":"2","top":"130px","cursor -
     A                                      row":"2","parent tab panel":"W1201F-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCR02_SCPRDS","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCPRDS","designValue":"[SCPRDS-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"414px",-
     A                                      "cursor column":"21","top":"130px",-
     A                                      "cursor row":"2","description":"PRO-
     A                                      GRAM NAME","parent tab panel":"W120-
     A                                      1F_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","visibility":"hidden","css cla-
     A                                      ss 2":"profound-converted"')
     A                                  1  5HTML('},{"id":"constant7","field ty-
     A                                      pe":"output field","value":"SCR02",-
     A                                      "css class":"constant","left":"799p-
     A                                      x","cursor column":"76","top":"130p-
     A                                      x","cursor row":"2","parent tab pan-
     A                                      el":"W1201F_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCMODE","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCMODE","designValue":"[S-
     A                                      CMODE]","refField":"NM10","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","visibilit-
     A                                      y":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"764px","cursor column":"71","-
     A                                      top":"150px","cursor row":"3","css -
     A                                      class 2":"HI","description":"ADD/UP-
     A                                      DATE MODE","parent tab panel":"W120-
     A                                      1F_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W1201F-
     A                                      _SCR02_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W1201F_SCR02_BtnHiddenD-
     A                                      iaryItems","value":"btnDiary","top"-
     A                                      :"175px","response":{"fieldName":"b-
     A                                      tnDiary","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"constant8","field t-
     A                                      ype":"output field","value":"System-
     A                                       A/R Batch Code:","css class":"cons-
     A                                      tant","left":"330px","cursor column-
     A                                      ":"9","top":"190px","cursor row":"5-
     A                                      ","parent tab panel":"W1201F_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCR02_SCCODE","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      CODE","designValue":"[SCCODE]","ref-
     A                                      Field":"CODE","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"498px","cursor-
     A                                       column":"33","top":"190px","cursor-
     A                                       row":"5","css class 2":"HI","paren-
     A                                      t tab panel":"W1201F_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant9","field type":"output field",-
     A                                      "value":"Status:","css class":"cons-
     A                                      tant","left":"547px","cursor column-
     A                                      ":"40","top":"190px","cursor row":"-
     A                                      5","parent tab panel":"W1201F_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCSTAT","field type":"output f-
     A                                      ield","value":{"fieldName":"SCSTAT"-
     A                                      ,"designValue":"[SCSTAT]","refField-
     A                                      ":"STAT","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"610px","cursor colu-
     A                                      mn":"49","top":"190px","cursor row"-
     A                                      :"5","css class 2":"HI","override d-
     A                                      ata":"true","parent tab panel":"W12-
     A                                      01F_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W1201-
     A                                      F_SCR02_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W1201F_SCR02-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant10","field type":"output fi-
     A                                      eld","value":"Description:","css cl-
     A                                      ass":"constant","left":"386px","cur-
     A                                      sor column":"17","top":"250px","cur-
     A                                      sor row":"8","parent tab panel":"W1-
     A                                      201F_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCDESC","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCDESC","designValue":"[SCDE-
     A                                      SC]","refField":"DS30","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "484px","cursor column":"31","top":-
     A                                      "250px","cursor row":"8","width":"2-
     A                                      11px","css class 3":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"css class 4":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","in')
     A                                  1  6HTML('dFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"re-
     A                                      ad only":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 5":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"error message id":"WCR0503","e-
     A                                      rror message file":"WMESGG","error -
     A                                      condition":{"fieldName":"20","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"1 message","override da-
     A                                      ta":"true","description":"DESCRIPTI-
     A                                      ON","parent tab panel":"W1201F_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W1201F_SCR02_-
     A                                      BtnHiddenWorkPrinterOutput","value"-
     A                                      :"btnWrkprtout","top":"250px","resp-
     A                                      onse":{"fieldName":"btnWrkPrnt","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W1201F_SCR02_Bt-
     A                                      nHiddenImageQueue","value":"btnImgQ-
     A                                      ue","top":"275px","response":{"fiel-
     A                                      dName":"btnImgQue","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant1-
     A                                      1","field type":"output field","val-
     A                                      ue":"Type (Post Batch Entries to WC-
     A                                      MS      ):","css class":"constant",-
     A                                      "left":"386px","cursor column":"17"-
     A                                      ,"top":"290px","cursor row":"10","p-
     A                                      arent tab panel":"W1201F_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCTYPE","field type":"checkbox","cs-
     A                                      s class":"input","css class 2":"che-
     A                                      ckbox","value":{"fieldName":"SCTYPE-
     A                                      ","designValue":"[SCTYPE]","refFiel-
     A                                      d":"FLAG","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"687px","top"-
     A                                      :"290px","width":"8px","css class 3-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"css c-
     A                                      lass 4":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"error message id":"WCR0501",-
     A                                      "error message file":"WMESGG","erro-
     A                                      r condition":{"fieldName":"21","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"1 message","descripti-
     A                                      on":"FLAG","parent tab panel":"W120-
     A                                      1F_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 6":"profound-conver-
     A                                      ted","checked value":"Y","unchecked-
     A                                       value":"N"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W1201F_SCR02_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant12","field type":"output field-
     A                                      ","value":" ","css class":"constant-
     A                                      ","visibility":{"fieldName":"N09 an-
     A                                      d N40","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"715px","c-
     A                                      ursor column":"64","top":"550px","c-
     A                                      ursor row":"23","css class 2":"BLU"-
     A                                      ,"parent tab panel":"W1201F_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"btnSubmit","field type":"button"-
     A                                      ,"value":"Enter","shortcut key":"En-
     A                                      ter","left":"14px","top":"150px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnCF-
     A                                      03","field type":"button","value":"-
     A                                      Exit         ","shortcut key":"F3",-
     A                                      "left":"14px","top":"183px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF12","-
     A                                      field type":"button","value":"Cance-
     A                                      l      ","shortcut key":"F12","left-
     A                                      ":"14px","top":"216px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF20","field-
     A                                       type":"button","visibility":{"fiel-
     A                                      dName":"N09 and N40","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"va-
     A                                      lue":"Chg status   ","shortcut key"-
     A                                      :"F20","left":"14px","top":"249px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto ar')
     A                                  1  7HTML('range":"true","cursor":"defau-
     A                                      lt"},{"id":"btnHELP","field type":"-
     A                                      button","shortcut key":"Alt-F1","by-
     A                                      pass validation":"true","value":"HE-
     A                                      LP","response":{"fieldName":"*IN10"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "left":"14px","top":"282px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCCODE    R        H      REFFLD(CODE)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDESC    R        H      REFFLD(DS30)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSTAT    R        H      REFFLD(STAT)
     A            SCTYPE    R        H      REFFLD(FLAG)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR99
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    3C1    3 FSCERR     INPUTONLY -
     A                                      0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"3-3"},"items"-
     A                                      :[{"id":"W1201F_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"W1201F_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W1201F_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"W1201F_SCR99_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1040px","id":"-
     A                                      W1201F_SCR99_BtnSave","tool tip":"S-
     A                                      ave","onclick":"SystemToolbarSave",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/save.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1066px"-
     A                                      ,"id":"W1201F_SCR99_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"W1201F_SC-
     A                                      R99_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"W1201F_SCR99_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "W1201F_SCR99_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLe')
     A                                  1  4HTML('ading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"W1201F_SCR99_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"W1201F_SCR99_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"W1201F_SCR99_Ma-
     A                                      inTabPanel","field type":"tab panel-
     A                                      ","tab panel style":"Transform","ta-
     A                                      b names":"Tab 1","active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      1201F_SCR99_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"W1201-
     A                                      F_SCR99_fkeyMenu","field type":"men-
     A                                      u","left":"10px","top":"120px","hei-
     A                                      ght":"350px","width":"230px","hover-
     A                                       background color":"#9AAA61","hover-
     A                                       text color":"#FFFFFF","border colo-
     A                                      r":"#4C6106","menu option indent":"-
     A                                      10px","background color":"#758B27",-
     A                                      "css class":"action-menu","css clas-
     A                                      s 2":"stationary","z index":"101"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W1201F_SCR99-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCERR",-
     A                                      "field type":"password field","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","input only":"true","value":{"f-
     A                                      ieldName":"SCERR","designValue":"[S-
     A                                      CERR]","refField":"FLAG","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"288px","cursor column":"3","top"-
     A                                      :"150px","cursor row":"3","width":"-
     A                                      8px","read only":"true","css class -
     A                                      3":"PR-UL","parent tab panel":"W120-
     A                                      1F_SCR99_MainTabPanel","parent tab"-
     A                                      :"0","css class 4":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W1201F-
     A                                      _SCR99_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W1201F_SCR99_BtnHiddenD-
     A                                      iaryItems","value":"btnDiary","top"-
     A                                      :"175px","response":{"fieldName":"b-
     A                                      tnDiary","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W12-
     A                                      01F_SCR99_BtnHiddenSystemMessages",-
     A                                      "value":"btnMessage","top":"200px",-
     A                                      "response":{"fieldName":"btnMessage-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W1201F_SCR-
     A                                      99_BtnHiddenWorkSubmitJob","value":-
     A                                      "btnWrksbmjob","top":"225px","respo-
     A                                      nse":{"fieldName":"btnWrkJob","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W1201F_SCR99_BtnH-
     A                                      iddenWorkPrinterOutput","value":"bt-
     A                                      nWrkprtout","top":"250px","response-
     A                                      ":{"fieldName":"btnWrkPrnt","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css cla')
     A                                  1  5HTML('ss":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W120-
     A                                      1F_SCR99_BtnHiddenImageQueue","valu-
     A                                      e":"btnImgQue","top":"275px","respo-
     A                                      nse":{"fieldName":"btnImgQue","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W1201F_SCR99_BtnH-
     A                                      iddenHelp","value":"btnHelp","top":-
     A                                      "300px","response":{"fieldName":"bt-
     A                                      nHelp","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"btnSubmit","field typ-
     A                                      e":"button","value":"Enter","shortc-
     A                                      ut key":"Enter","left":"14px","top"-
     A                                      :"150px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF03","field type":"button-
     A                                      ","value":"Exit         ","shortcut-
     A                                       key":"F3","left":"14px","top":"183-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnHELP","field type":"button","sh-
     A                                      ortcut key":"Alt-F1","bypass valida-
     A                                      tion":"true","value":"HELP","respon-
     A                                      se":{"fieldName":"*IN10","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"left":"14p-
     A                                      x","top":"216px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR     R        H      REFFLD(FLAG)
