     A                                      REF(*LIBL/WREFP)
     A          R SCR01
     A  11 31 32
     A  33 34 35
     A  70 71 72                            CA01(11 'Response Indicator *IN11')
     A  73 74 75
     A  76 77 78
     A  79 80 81                            CA02(31 'Response Indicator *IN31')
     A  82 83 84
     A  85 86 87
     A  88 89 09                            CA03(32 'Response Indicator *IN32')
     A                                      SETOF(33 'Response Indicator *IN33')
     A                                      SETOF(34 'Response Indicator *IN34')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(70 'Response Indicator *IN70')
     A                                      SETOF(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                      SETOF(74 'Response Indicator *IN74')
     A                                      SETOF(75 'Response Indicator *IN75')
     A                                      SETOF(76 'Response Indicator *IN76')
     A                                      SETOF(77 'Response Indicator *IN77')
     A                                      SETOF(78 'Response Indicator *IN78')
     A                                      SETOF(79 'Response Indicator *IN79')
     A                                      SETOF(80 'Response Indicator *IN80')
     A                                      SETOF(81 'Response Indicator *IN81')
     A                                      SETOF(82 'Response Indicator *IN82')
     A                                      SETOF(83 'Response Indicator *IN83')
     A                                      SETOF(84 'Response Indicator *IN84')
     A                                      SETOF(85 'Response Indicator *IN85')
     A                                      SETOF(86 'Response Indicator *IN86')
     A                                      SETOF(87 'Response Indicator *IN87')
     A                                      SETOF(88 'Response Indicator *IN88')
     A                                      SETOF(89 'Response Indicator *IN89')
     A                                  1  2HTML('QPUIREC22   ROVERLAY   0     -
     A                                      RROWS      2    C1    1C2    24 RER-
     A                                      RMSGID  5    C6    SCPRCAC7    WCR0-
     A                                      807C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     72RERRMSGID  5    C6    SC-
     A                                      PRDAC7    WCR0590C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     70RERRMSGID -
     A                                       5    C6    SCPRDAC7    WCR0807C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        71RERRMSGID  5    C6    SCPRR1C7 -
     A                                         WC32407C6    WMESGGC5    *LIBLC0-
     A                                          E1    3     31RERRMSGID  5    C-
     A                                      6    SCCPCAC7    WCR0807C6    WMESG-
     A                                      GC5    *LIBLC0    E1    3     75RER-
     A                                      RMSGID  5    C6    SCCPDAC7    WCR0-
     A                                      590C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     73RERRMSGID  5    C6    SC-
     A                                      CPDAC7    WCR0807C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     74RERRMSGID -
     A                                       5    C6    SCCPR1C7    WC32407C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        32RERRMSGID  5    C6    SCMFCAC7 -
     A                                         WCR0807C6    WMESGGC5    *LIBLC0-
     A                                          E1    3     78RERRMSGID  5    C-
     A                                      6    SCMFDAC7    WCR0590C6    WMESG-
     A                                      GC5    *LIBLC0    E1    3     76RER-
     A                                      RMSGID  5    C6    SCMFDAC7    WCR0-
     A                                      807C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     77RERRMSGID  5    C6    SC-
     A                                      MFR1C7    WC32407C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     33RERRMSGID -
     A                                       5    C6    SCSDCAC7    WCR0807C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        81RERRMSGID  5    C6    SCSDDAC7 -
     A                                         WCR0590C6    WMESGGC5    *LIBLC0-
     A                                          E1    3     79RERRMSGID  5    C-
     A                                      6    SCSDDAC7    WCR0807C6    WMESG-
     A                                      GC5    *LIBLC0    E1    3     80RER-
     A                                      RMSGID  5    C6    SCSDR1C7    WC32-
     A                                      407C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     34RERRMSGID  5    C6    SC-
     A                                      EMCAC7    WCR0807C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     84RERRMSGID -
     A                                       5    C6    SCEMDAC7    WCR0590C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        82RERRMSGID  5    C6    SCEMDAC7 -
     A                                         WCR0807C6    WMESGGC5    *LIBLC0-
     A                                          E1    3     83RERRMSGID  5    C-
     A                                      6    SCEMR1C7    WC32407C6    WMESG-
     A                                      GC5    *LIBLC0    E1    3     35')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN31","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN32","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN33","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN34","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN35","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN70","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN71","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN72","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN73","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N74","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN7-
     A                                      5","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN76"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN77","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN78","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN79","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 16":{"fieldName":"*IN80","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       17":{"fieldName":"*IN81","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 1-
     A                                      8":{"fieldName":"*IN82","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 19"-
     A                                      :{"fieldName":"*IN83","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 20":{-
     A                                      "fieldName":"*IN84","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 21":{"f-
     A                                      ieldName":"*IN85","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 22":{"fie-
     A                                      ldName":"*IN86","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 23":{"field-
     A                                      Name":"*IN87","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 24":{"fieldNa-
     A                                      me":"*IN88","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 25":{"fieldName-
     A                                      ":"*IN89","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"overlay":"true","valid co-
     A                                      mmand key":{"fieldName":"*IN11","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"ove-
     A                                      rlay range":"1-24"},"items":[{"id":-
     A                                      "W1551F02_SCR01_avKeys","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"AV_KEYS","dataLength":"1134","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[AV_KEYS]"},"lef-
     A                                      t":"0px","top":"0px","visibility":"-
     A                                      hidden"},{"id":"W1551F02_SCR01_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"W-
     A                                      1551F02_SCR01_BtnIconMenuSystemTool-
     A                                      s","tool tip":"System Tools","icon -
     A                                      alignment":"middle left","icon widt-
     A                                      h":"16px","icon height":"24px","ico-
     A                                      n source":"/profoundui/userdata/ima-
     A                                      ges/systool/systools.png","data fun-
     A                                      ction":"SystemToolbarSystools","sho-
     A                                      w down arrow":"Yes"},{"field type":-
     A                                      "panel","panel style":"TransformBut-
     A                                      tonBar","id":"W1551F02_SCR01_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","back')
     A                                  1  4HTML('ground color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1040px","id":"W1551F02_SCR01_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1066px","id":"W1551F02_SC-
     A                                      R01_BtnRefresh","tool tip":"Refresh-
     A                                      ","onclick":"SystemToolbarRefresh",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/refresh.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1092-
     A                                      px","id":"W1551F02_SCR01_BtnSearch"-
     A                                      ,"tool tip":"Search","onclick":"Sys-
     A                                      temToolbarSearch","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/search.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1118px","id":"W1551F02-
     A                                      _SCR01_BtnDiaryItems","tool tip":"D-
     A                                      iary/Work Items - IDARTS","onclick"-
     A                                      :"SystemToolbarDiary","background i-
     A                                      mage":{"fieldName":"DryIcnURL","dat-
     A                                      aLength":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1144px","id":"W1551F02_SC-
     A                                      R01_BtnSystemMessages","tool tip":"-
     A                                      System Messages","onclick":"SystemT-
     A                                      oolbarMessages","background image":-
     A                                      {"fieldName":"MsgIcnURL","dataLengt-
     A                                      h":"128","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none"}},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1196px","id":"W1551F02_SCR01_Bt-
     A                                      nHelp","tool tip":"Help","onclick":-
     A                                      "SystemToolbarHelp","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/help.png'')"},{"id":"W1-
     A                                      551F02_SCR01_ImgSysToolBottom","fie-
     A                                      ld type":"image","image source":"/p-
     A                                      rofoundui/userdata/images/systool/b-
     A                                      utbarbot.png","left":"1036px","top"-
     A                                      :"64px","width":"187px","locked in -
     A                                      place":"true","css class":"stationa-
     A                                      ry","visibility":"hidden"},{"id":"W-
     A                                      1551F02_SCR01_MainTabPanel","field -
     A                                      type":"tab panel","tab panel style"-
     A                                      :"Transform","tab names":{"fieldNam-
     A                                      e":"SCPRDS","designValue":"[SCPRDS]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"active -
     A                                      tab":"0","left":"250px","top":"70px-
     A                                      ","width":"970px","height":"657px",-
     A                                      "z index":"8","locked in place":"tr-
     A                                      ue","css class":"tab-panel","css cl-
     A                                      ass 2":"stationary"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W1551F02_SCR01_BtnHiddenSa-
     A                                      ve","value":"btnSave","top":"100px"-
     A                                      ,"response":{"fieldName":"btnSave",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant1","field type":"out-
     A                                      put field","left":"281px","cursor c-
     A                                      olumn":"2","top":"110px","cursor ro-
     A                                      w":"1","css class":"top-line","valu-
     A                                      e":"js: currentUser()","css class 2-
     A                                      ":"output-field","parent tab panel"-
     A                                      :"W1551F02_SCR01_MainTabPa')
     A                                  1  5HTML('nel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "SCCONM","field type":"output field-
     A                                      ","value":{"fieldName":"SCCONM","de-
     A                                      signValue":"[SCCONM]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"414px","cursor column":-
     A                                      "21","top":"110px","cursor row":"1"-
     A                                      ,"css class 2":"top-line","css clas-
     A                                      s 3":"HI","parent tab panel":"W1551-
     A                                      F02_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 4":"profound-conve-
     A                                      rted"},{"id":"constant2","field typ-
     A                                      e":"output field","left":"778px","c-
     A                                      ursor column":"73","top":"110px","c-
     A                                      ursor row":"1","css class":"top-lin-
     A                                      e","value":"js: currentDate()","css-
     A                                       class 2":"output-field","parent ta-
     A                                      b panel":"W1551F02_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"W1551F-
     A                                      02_SCR01_fkeyMenu","field type":"me-
     A                                      nu","left":"10px","top":"120px","he-
     A                                      ight":"350px","width":"230px","hove-
     A                                      r background color":"#9AAA61","hove-
     A                                      r text color":"#FFFFFF","border col-
     A                                      or":"#4C6106","menu option indent":-
     A                                      "10px","background color":"#758B27"-
     A                                      ,"css class":"action-menu","css cla-
     A                                      ss 2":"stationary","z index":"101"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W1551F02_SC-
     A                                      R01_BtnHiddenRefresh","value":"btnR-
     A                                      efresh","top":"125px","response":{"-
     A                                      fieldName":"btnRefresh","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"Q1PG-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"Q1PGM","designVal-
     A                                      ue":"[Q1PGM]","refField":"DS10","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"130px","cursor row":"2","parent -
     A                                      tab panel":"W1551F02_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCPR-
     A                                      DS","field type":"output field","va-
     A                                      lue":{"fieldName":"SCPRDS","designV-
     A                                      alue":"[SCPRDS]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"414px","cursor column":"21",-
     A                                      "top":"130px","cursor row":"2","css-
     A                                       class 2":"HI","parent tab panel":"-
     A                                      W1551F02_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","visibility":"hidden","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant3","field type":"outp-
     A                                      ut field","value":"SCR01","css clas-
     A                                      s":"constant","left":"799px","curso-
     A                                      r column":"76","top":"130px","curso-
     A                                      r row":"2","parent tab panel":"W155-
     A                                      1F02_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"constant4","field ty-
     A                                      pe":"output field","value":"Group:"-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"150p-
     A                                      x","cursor row":"3","parent tab pan-
     A                                      el":"W1551F02_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCFND","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCFND","designValue":"[S-
     A                                      CFND]","refField":"FND","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"999.00"},"css c-
     A                                      lass":"output-field","left":"337px"-
     A                                      ,"cursor column":"10","top":"150px"-
     A                                      ,"cursor row":"3","width":"21px","t-
     A                                      ext align":"right","parent tab pane-
     A                                      l":"W1551F02_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCNAME","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCNAME","designValue":"[-
     A                                      SCNAME]","refField":"NAME","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"3-
     A                                      65px","cursor column":"14","top":"1-
     A                                      50px","cursor row":"3","description-
     A                                      ":"FUND NAME","parent tab panel":"W-
     A                                      1551F02_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCMODE","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCMODE","designValue":"[SCMOD-
     A                                      E]","refField":"NM10","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"764px"-
     A                                      ,"cursor column":"71","top":"150px"-
     A                                      ,"cursor row":"3","css class 2":"HI-
     A                                      ","description":"ADD/UPDATE MODE","-
     A                                      parent tab panel":"W1551F02_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W1551F02_SCR01_B-
     A                                      tnHiddenSearch","value":"b')
     A                                  1  6HTML('tnSearch","top":"150px","resp-
     A                                      onse":{"fieldName":"btnSearch","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant5","field type":"output -
     A                                      field","value":"Emp #:","css class"-
     A                                      :"constant","left":"281px","cursor -
     A                                      column":"2","top":"170px","cursor r-
     A                                      ow":"4","parent tab panel":"W1551F0-
     A                                      2_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCEDN","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CEDN","designValue":"[SCEDN]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none","dat-
     A                                      aLength":"44"},"css class":"output--
     A                                      field","left":"337px","cursor colum-
     A                                      n":"10","top":"170px","cursor row":-
     A                                      "4","parent tab panel":"W1551F02_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W1551F02_SC-
     A                                      R01_BtnHiddenDiaryItems","value":"b-
     A                                      tnDiary","top":"175px","response":{-
     A                                      "fieldName":"btnDiary","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant6","field type":"output field","-
     A                                      value":"Category","css class":"cons-
     A                                      tant","left":"281px","cursor column-
     A                                      ":"2","top":"190px","cursor row":"5-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"W1551F02_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant7"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Avail Range","css class":"consta-
     A                                      nt","left":"414px","cursor column":-
     A                                      "21","top":"190px","cursor row":"5"-
     A                                      ,"css class 2":"HI","parent tab pan-
     A                                      el":"W1551F02_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant8",-
     A                                      "field type":"output field","value"-
     A                                      :"Credit","css class":"constant","l-
     A                                      eft":"512px","cursor column":"35","-
     A                                      top":"190px","cursor row":"5","css -
     A                                      class 2":"HI","parent tab panel":"W-
     A                                      1551F02_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant9","field-
     A                                       type":"output field","value":"Debi-
     A                                      t","css class":"constant","left":"5-
     A                                      75px","cursor column":"44","top":"1-
     A                                      90px","cursor row":"5","css class 2-
     A                                      ":"HI","parent tab panel":"W1551F02-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant10","field type"-
     A                                      :"output field","value":"Reason","c-
     A                                      ss class":"constant","left":"631px"-
     A                                      ,"cursor column":"52","top":"190px"-
     A                                      ,"cursor row":"5","css class 2":"HI-
     A                                      ","parent tab panel":"W1551F02_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W1551F02_SCR0-
     A                                      1_BtnHiddenSystemMessages","value":-
     A                                      "btnMessage","top":"200px","respons-
     A                                      e":{"fieldName":"btnMessage","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "constant11","field type":"output f-
     A                                      ield","value":"of Mod","css class":-
     A                                      "constant","left":"414px","cursor c-
     A                                      olumn":"21","top":"210px","cursor r-
     A                                      ow":"6","css class 2":"HI","parent -
     A                                      tab panel":"W1551F02_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant12","field type":"output field"-
     A                                      ,"value":"Applied","css class":"con-
     A                                      stant","left":"505px","cursor colum-
     A                                      n":"34","top":"210px","cursor row":-
     A                                      "6","css class 2":"HI","parent tab -
     A                                      panel":"W1551F02_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      13","field type":"output field","va-
     A                                      lue":"Applied","css class":"constan-
     A                                      t","left":"568px","cursor column":"-
     A                                      43","top":"210px","cursor row":"6",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"W1551F02_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W1551F02_SCR01_BtnHiddenWorkSub-
     A                                      mitJob","value":"btnWrksbmjob","top-
     A                                      ":"225px","response":{"fieldName":"-
     A                                      btnWrkJob","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant14","fiel-
     A                                      d type":"output field","value":"Pre-
     A                                      mises","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"250px","cursor row":"8","parent t-
     A                                      ab panel":"W1551F02_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant15","field type":"output field",-
     A                                      "value":" 0% to 10%","css class":"c-
     A                                      onstant","left":"414px","cursor col-
     A                                      umn":"21","top":"250px","cursor row-
     A                                      ":"8","parent tab panel":"W1551F02_-
     A                                      SCR01_MainTabPanel","paren')
     A                                  1  7HTML('t tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCPRCA","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCPRCA","designVal-
     A                                      ue":"[SCPRCA]","refField":"RFP01/RF-
     A                                      PRCA *LIBL/WMRFP","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"true","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00","numBlankFill"-
     A                                      :"true"},"left":"512px","cursor col-
     A                                      umn":"35","top":"250px","cursor row-
     A                                      ":"8","width":"43px","text align":"-
     A                                      right","read only":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 3":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"css class 4":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"set focus":{"f-
     A                                      ieldName":"72","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"error messag-
     A                                      e id":"WCR0807","error message file-
     A                                      ":"WMESGG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"72","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"1 messag-
     A                                      e","parent tab panel":"W1551F02_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 5":"profound-converted"},-
     A                                      {"id":"SCPRDA","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CPRDA","designValue":"[SCPRDA]","re-
     A                                      fField":"RFP01/RFPRDA *LIBL/WMRFP",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"true","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"999.0-
     A                                      0","numBlankFill":"true"},"left":"5-
     A                                      75px","cursor column":"44","top":"2-
     A                                      50px","cursor row":"8","width":"43p-
     A                                      x","text align":"right","read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 3":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"css-
     A                                       class 4":{"fieldName":"N09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"UL","customFalse":""-
     A                                      },"set focus":{"fieldName":"70","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"error message id":"WCR0590","e-
     A                                      rror message file":"WMESGG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"70","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"2 messages","error message-
     A                                       id 2":"WCR0807","error message fil-
     A                                      e 2":"WMESGG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"71","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"parent tab panel":-
     A                                      "W1551F02_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 5":"profound-
     A                                      -converted"},{"id":"SCPRR1","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCPRR1","designValue":"-
     A                                      [SCPRR1]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","dataLength":-
     A                                      "25"},"left":"631px","cursor column-
     A                                      ":"52","top":"250px","cursor row":"-
     A                                      8","width":"176px","read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 3":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"PR","customFalse":""},"css clas-
     A                                      s 4":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"se-
     A                                      t focus":{"fieldName":"31","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      error message id":"WC32407","error -
     A                                      message file":"WMESGG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"31","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"1 message","parent tab panel":"-
     A                                      W1551F02_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 5":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W1551F02_SCR01_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"SCPRR2","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCPRR2","designValue":"[-
     A                                      SCPRR2]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":')
     A                                  1  8HTML('"false","trimTrailing":"true"-
     A                                      ,"dataLength":"25"},"left":"631px",-
     A                                      "cursor column":"52","top":"270px",-
     A                                      "cursor row":"9","width":"176px","r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 3":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"css class 4":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"parent tab panel":"W155-
     A                                      1F02_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 5":"profound-conv-
     A                                      erted"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W155-
     A                                      1F02_SCR01_BtnHiddenImageQueue","va-
     A                                      lue":"btnImgQue","top":"275px","res-
     A                                      ponse":{"fieldName":"btnImgQue","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W1551F02_SCR01_-
     A                                      BtnHiddenHelp","value":"btnHelp","t-
     A                                      op":"300px","response":{"fieldName"-
     A                                      :"btnHelp","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant16","fiel-
     A                                      d type":"output field","value":"Cla-
     A                                      ssification","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"310px","cursor row":"11","p-
     A                                      arent tab panel":"W1551F02_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant17","field type":"output -
     A                                      field","value":" 0% to 10%","css cl-
     A                                      ass":"constant","left":"414px","cur-
     A                                      sor column":"21","top":"310px","cur-
     A                                      sor row":"11","parent tab panel":"W-
     A                                      1551F02_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCCPCA","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCCPCA","designValue":"[S-
     A                                      CCPCA]","refField":"RFP01/RFCPCA *L-
     A                                      IBL/WMRFP","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"true","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00","numBlankFill":"true"-
     A                                      },"left":"512px","cursor column":"3-
     A                                      5","top":"310px","cursor row":"11",-
     A                                      "width":"43px","text align":"right"-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 3":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"css class 4":{"fieldName":-
     A                                      "N09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"set focus":{"fieldNa-
     A                                      me":"75","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"error message id":-
     A                                      "WCR0807","error message file":"WME-
     A                                      SGG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"7-
     A                                      5","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"1 message","pa-
     A                                      rent tab panel":"W1551F02_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 5":"profound-converted"},{"id":-
     A                                      "SCCPDA","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCCPDA"-
     A                                      ,"designValue":"[SCCPDA]","refField-
     A                                      ":"RFP01/RFCPCA *LIBL/WMRFP","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00","nu-
     A                                      mBlankFill":"true"},"left":"575px",-
     A                                      "cursor column":"44","top":"310px",-
     A                                      "cursor row":"11","width":"43px","t-
     A                                      ext align":"right","read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 3":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"PR","customFalse":""},"css clas-
     A                                      s 4":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"se-
     A                                      t focus":{"fieldName":"73","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      error message id":"WCR0590","error -
     A                                      message file":"WMESGG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"73","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"2 messages","error message id 2-
     A                                      ":"WCR0807","error message file 2":-
     A                                      "WMESGG","error message library 2":-
     A                                      "*LIBL","error condition 2":{"field-
     A                                      Name":"74","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"parent tab pan')
     A                                  1  9HTML('el":"W1551F02_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 5"-
     A                                      :"profound-converted"},{"id":"SCCPR-
     A                                      1","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCCPR1","desi-
     A                                      gnValue":"[SCCPR1]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","da-
     A                                      taLength":"25"},"left":"631px","cur-
     A                                      sor column":"52","top":"310px","cur-
     A                                      sor row":"11","width":"176px","read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"set focus":{"fieldName":"3-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"error message id":"WC324-
     A                                      07","error message file":"WMESGG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"32","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"1 message","parent t-
     A                                      ab panel":"W1551F02_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 5"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant18","field type":"output field",-
     A                                      "value":"Peculiarities","css class"-
     A                                      :"constant","left":"281px","cursor -
     A                                      column":"2","top":"330px","cursor r-
     A                                      ow":"12","parent tab panel":"W1551F-
     A                                      02_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCCPR2","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCCPR2","designValue":"[SCCPR2-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","dataLength":"25"},"-
     A                                      left":"631px","cursor column":"52",-
     A                                      "top":"330px","cursor row":"12","wi-
     A                                      dth":"176px","read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 3":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"css class 4":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"parent t-
     A                                      ab panel":"W1551F02_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 5"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant19","field type":"output field",-
     A                                      "value":"Medical Facilities","css c-
     A                                      lass":"constant","left":"281px","cu-
     A                                      rsor column":"2","top":"370px","cur-
     A                                      sor row":"14","parent tab panel":"W-
     A                                      1551F02_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant20","fiel-
     A                                      d type":"output field","value":"0% -
     A                                      to  5%","css class":"constant","lef-
     A                                      t":"421px","cursor column":"22","to-
     A                                      p":"370px","cursor row":"14","paren-
     A                                      t tab panel":"W1551F02_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      MFCA","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCMFCA","d-
     A                                      esignValue":"[SCMFCA]","refField":"-
     A                                      RFP01/RFMFCA *LIBL/WMRFP","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"tr-
     A                                      ue","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00","numBl-
     A                                      ankFill":"true"},"left":"512px","cu-
     A                                      rsor column":"35","top":"370px","cu-
     A                                      rsor row":"14","width":"43px","text-
     A                                       align":"right","read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 3":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"css class 4-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"78","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"err-
     A                                      or message id":"WCR0807","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"78","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","parent tab panel":"W15-
     A                                      51F02_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 5":"profound-con-
     A                                      verted"},{"id":"SCMFDA","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCMFDA","designValue":"[SCM-
     A                                      FDA]","refField":"RFP01/RFMFDA *LIB-
     A                                      L/WMRFP","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"true","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"999.00","numBlankFill":"true"},-
     A                                      "left":"575px","cursor col')
     A                                  1 10HTML('umn":"44","top":"370px","curs-
     A                                      or row":"14","width":"43px","text a-
     A                                      lign":"right","read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 3":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"css class 4":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"set foc-
     A                                      us":{"fieldName":"76","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"error-
     A                                       message id":"WCR0590","error messa-
     A                                      ge file":"WMESGG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"76","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"2-
     A                                       messages","error message id 2":"WC-
     A                                      R0807","error message file 2":"WMES-
     A                                      GG","error message library 2":"*LIB-
     A                                      L","error condition 2":{"fieldName"-
     A                                      :"77","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"parent tab panel":"W1551F02_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 5":"profound-converted-
     A                                      "},{"id":"SCMFR1","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCMFR1","designValue":"[SCMFR1]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","dataLength":"25"},"lef-
     A                                      t":"631px","cursor column":"52","to-
     A                                      p":"370px","cursor row":"14","width-
     A                                      ":"176px","read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"set focus":-
     A                                      {"fieldName":"33","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"error mes-
     A                                      sage id":"WC32407","error message f-
     A                                      ile":"WMESGG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"33","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"1 mes-
     A                                      sage","parent tab panel":"W1551F02_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 5":"profound-converted-
     A                                      "},{"id":"SCMFR2","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCMFR2","designValue":"[SCMFR2]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","dataLength":"25"},"lef-
     A                                      t":"631px","cursor column":"52","to-
     A                                      p":"390px","cursor row":"15","width-
     A                                      ":"176px","read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"parent tab -
     A                                      panel":"W1551F02_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 5":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      21","field type":"output field","va-
     A                                      lue":"Safety Devices","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"430px","cursor row-
     A                                      ":"17","parent tab panel":"W1551F02-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"constant22","field type"-
     A                                      :"output field","value":"0% to  5%"-
     A                                      ,"css class":"constant","left":"421-
     A                                      px","cursor column":"22","top":"430-
     A                                      px","cursor row":"17","parent tab p-
     A                                      anel":"W1551F02_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCSDCA","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCSDCA","designVa-
     A                                      lue":"[SCSDCA]","refField":"RFP01/R-
     A                                      FSDCA *LIBL/WMRFP","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"true","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"999.00","numBlankFill-
     A                                      ":"true"},"left":"512px","cursor co-
     A                                      lumn":"35","top":"430px","cursor ro-
     A                                      w":"17","width":"43px","text align"-
     A                                      :"right","read only":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"set focus":{-
     A                                      "fieldName":"81","dataType')
     A                                  1 11HTML('":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"error message id":"WCR0807","e-
     A                                      rror message file":"WMESGG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"81","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"1 message","parent tab pan-
     A                                      el":"W1551F02_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 5":"prof-
     A                                      ound-converted"},{"id":"SCSDDA","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCSDDA","designValu-
     A                                      e":"[SCSDDA]","refField":"RFP01/RFS-
     A                                      DDA *LIBL/WMRFP","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"true","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"999.00","numBlankFill":-
     A                                      "true"},"left":"575px","cursor colu-
     A                                      mn":"44","top":"430px","cursor row"-
     A                                      :"17","width":"43px","text align":"-
     A                                      right","read only":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 3":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"css class 4":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"set focus":{"f-
     A                                      ieldName":"79","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"error messag-
     A                                      e id":"WCR0590","error message file-
     A                                      ":"WMESGG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"79","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"2 messag-
     A                                      es","error message id 2":"WCR0807",-
     A                                      "error message file 2":"WMESGG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"80","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      parent tab panel":"W1551F02_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 5":"profound-converted"},{"id-
     A                                      ":"SCSDR1","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCSDR-
     A                                      1","designValue":"[SCSDR1]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","dataLength":"25"},"left":"631-
     A                                      px","cursor column":"52","top":"430-
     A                                      px","cursor row":"17","width":"176p-
     A                                      x","read only":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"css class 3":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"css class 4":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"set focus":{"field-
     A                                      Name":"34","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error message id-
     A                                      ":"WC32407","error message file":"W-
     A                                      MESGG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "34","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"1 message","-
     A                                      parent tab panel":"W1551F02_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 5":"profound-converted"},{"id-
     A                                      ":"SCSDR2","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCSDR-
     A                                      2","designValue":"[SCSDR2]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","dataLength":"25"},"left":"631-
     A                                      px","cursor column":"52","top":"450-
     A                                      px","cursor row":"18","width":"176p-
     A                                      x","read only":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"css class 3":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"css class 4":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"parent tab panel":-
     A                                      "W1551F02_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 5":"profound-
     A                                      -converted"},{"id":"constant23","fi-
     A                                      eld type":"output field","value":"E-
     A                                      mployees -","css class":"constant",-
     A                                      "left":"281px","cursor column":"2",-
     A                                      "top":"490px","cursor row":"20","pa-
     A                                      rent tab panel":"W1551F02_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant24","field type":"output f-
     A                                      ield","value":" 0% to 10%","css cla-
     A                                      ss":"constant","left":"414px","curs-
     A                                      or column":"21","top":"490px","curs-
     A                                      or row":"20","parent tab panel":"W1-
     A                                      551F02_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCEMCA","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCEMCA","designVa')
     A                                  1 12HTML('lue":"[SCEMCA]","refField":"R-
     A                                      FP01/RFEMDA *LIBL/WMRFP","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"999.00","numBla-
     A                                      nkFill":"true"},"left":"512px","cur-
     A                                      sor column":"35","top":"490px","cur-
     A                                      sor row":"20","width":"43px","text -
     A                                      align":"right","read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 3":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"css class 4"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"set fo-
     A                                      cus":{"fieldName":"84","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"erro-
     A                                      r message id":"WCR0807","error mess-
     A                                      age file":"WMESGG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"84","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      1 message","parent tab panel":"W155-
     A                                      1F02_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 5":"profound-conv-
     A                                      erted"},{"id":"SCEMDA","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCEMDA","designValue":"[SCEM-
     A                                      DA]","refField":"RFP01/RFEMDA *LIBL-
     A                                      /WMRFP","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"999.00","numBlankFill":"true"},"-
     A                                      left":"575px","cursor column":"44",-
     A                                      "top":"490px","cursor row":"20","wi-
     A                                      dth":"43px","text align":"right","r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 3":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"css class 4":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"set focus":{"fieldName"-
     A                                      :"82","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"error message id":"WC-
     A                                      R0590","error message file":"WMESGG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"82",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"2 messages","erro-
     A                                      r message id 2":"WCR0807","error me-
     A                                      ssage file 2":"WMESGG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"83","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"parent ta-
     A                                      b panel":"W1551F02_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 5":-
     A                                      "profound-converted"},{"id":"SCEMR1-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCEMR1","desig-
     A                                      nValue":"[SCEMR1]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","dat-
     A                                      aLength":"25"},"left":"631px","curs-
     A                                      or column":"52","top":"490px","curs-
     A                                      or row":"20","width":"176px","read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 3":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 4":{"fieldName":"N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"set focus":{"fieldName":"35-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"error message id":"WC3240-
     A                                      7","error message file":"WMESGG","e-
     A                                      rror message library":"*LIBL","erro-
     A                                      r condition":{"fieldName":"35","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"1 message","parent ta-
     A                                      b panel":"W1551F02_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 5":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt25","field type":"output field","-
     A                                      value":"Selection, Training","css c-
     A                                      lass":"constant","left":"281px","cu-
     A                                      rsor column":"2","top":"510px","cur-
     A                                      sor row":"21","parent tab panel":"W-
     A                                      1551F02_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCEMR2","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCEMR2","designValue":"[S-
     A                                      CEMR2]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","dataLength":"2-
     A                                      5"},"left":"631px","cursor column":-
     A                                      "52","top":"510px","cursor row":"21-
     A                                      ","width":"176px","read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css c')
     A                                  1 13HTML('lass 3":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"css class 4":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"parent tab panel":"W155-
     A                                      1F02_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 5":"profound-conv-
     A                                      erted"},{"id":"constant26","field t-
     A                                      ype":"output field","value":"And Su-
     A                                      pervision","css class":"constant","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"530px","cursor row":"22","par-
     A                                      ent tab panel":"W1551F02_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      btnSubmit","field type":"button","v-
     A                                      alue":"Enter","shortcut key":"Enter-
     A                                      ","left":"14px","top":"150px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF03"-
     A                                      ,"field type":"button","value":"Exi-
     A                                      t","shortcut key":"F3","left":"14px-
     A                                      ","top":"183px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnCF05","field type":-
     A                                      "button","value":"Refresh","shortcu-
     A                                      t key":"F5","left":"14px","top":"21-
     A                                      6px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF12","field type":"button","v-
     A                                      alue":"Cancel","shortcut key":"F12"-
     A                                      ,"left":"14px","top":"249px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF21",-
     A                                      "field type":"button","value":"Prin-
     A                                      t schedule rating form","shortcut k-
     A                                      ey":"F21","left":"14px","top":"282p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCCPR1        25A  H
     A            SCCPR2        25A  H
     A            SCEDN         44A  H
     A            SCEMR1        25A  H
     A            SCEMR2        25A  H
     A            SCMFR1        25A  H
     A            SCMFR2        25A  H
     A            SCPRR1        25A  H
     A            SCPRR2        25A  H
     A            SCSDR1        25A  H
     A            SCSDR2        25A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCPCA    R        H      REFFLD(RFP01/RFCPCA *LIBL/WMRFP)
     A            SCCPDA    R        H      REFFLD(RFP01/RFCPCA *LIBL/WMRFP)
     A            SCEMCA    R        H      REFFLD(RFP01/RFEMDA *LIBL/WMRFP)
     A            SCEMDA    R        H      REFFLD(RFP01/RFEMDA *LIBL/WMRFP)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMFCA    R        H      REFFLD(RFP01/RFMFCA *LIBL/WMRFP)
     A            SCMFDA    R        H      REFFLD(RFP01/RFMFDA *LIBL/WMRFP)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCNAME    R        H      REFFLD(NAME)
     A            SCPRCA    R        H      REFFLD(RFP01/RFPRCA *LIBL/WMRFP)
     A            SCPRDA    R        H      REFFLD(RFP01/RFPRDA *LIBL/WMRFP)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSDCA    R        H      REFFLD(RFP01/RFSDCA *LIBL/WMRFP)
     A            SCSDDA    R        H      REFFLD(RFP01/RFSDDA *LIBL/WMRFP)
     A          R SCR02
     A  11 36 37
     A  39 70 71
     A  72 73 74                            CA01(11 'Response Indicator *IN11')
     A  75 76 77
     A  78 79 80
     A  81 82 83                            CA02(36 'Response Indicator *IN36')
     A  84 85 86
     A  87 88 89
     A  09 69                               CA03(37 'Response Indicator *IN37')
     A                                      SETOF(39 'Response Indicator *IN39')
     A                                      SETOF(70 'Response Indicator *IN70')
     A                                      SETOF(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                      SETOF(74 'Response Indicator *IN74')
     A                                      SETOF(75 'Response Indicator *IN75')
     A                                      SETOF(76 'Response Indicator *IN76')
     A                                      SETOF(77 'Response Indicator *IN77')
     A                                      SETOF(78 'Response Indicator *IN78')
     A                                      SETOF(79 'Response Indicator *IN79')
     A                                      SETOF(80 'Response Indicator *IN80')
     A                                      SETOF(81 'Response Indicator *IN81')
     A                                      SETOF(82 'Response Indicator *IN82')
     A                                      SETOF(83 'Response Indicator *IN83')
     A                                      SETOF(84 'Response Indicator *IN84')
     A                                      SETOF(85 'Response Indicator *IN85')
     A                                      SETOF(86 'Response Indicator *IN86')
     A                                      SETOF(87 'Response Indicator *IN87')
     A                                      SETOF(88 'Response Indicator *IN88')
     A                                      SETOF(89 'Response Indicator *IN89')
     A                                  1  2HTML('QPUIREC10   ROVERLAY   0     -
     A                                      RROWS      2    C1    1C2    24 RER-
     A                                      RMSGID  5    C6    SCMCCAC7    WCR0-
     A                                      807C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     87RERRMSGID  5    C6    SC-
     A                                      MCDAC7    WCR0590C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     85RERRMSGID -
     A                                       5    C6    SCMCDAC7    WCR0807C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        86RERRMSGID  5    C6    SCMCR1C7 -
     A                                         WC32407C6    WMESGGC5    *LIBLC0-
     A                                          E1    3     36RERRMSGID  5    C-
     A                                      6    SCMSCAC7    WCR0807C6    WMESG-
     A                                      GC5    *LIBLC0    E1    3     69RER-
     A                                      RMSGID  5    C6    SCMSDAC7    WCR0-
     A                                      590C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     88RERRMSGID  5    C6    SC-
     A                                      MSDAC7    WCR0807C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     89RERRMSGID -
     A                                       5    C6    SCMSR1C7    WC32407C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        37')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN36","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN37","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN39","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN70","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN71","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN72","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN73","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN74","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN75","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N76","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN7-
     A                                      7","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN78"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN79","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN80","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN81","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 16":{"fieldName":"*IN82","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       17":{"fieldName":"*IN83","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 1-
     A                                      8":{"fieldName":"*IN84","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 19"-
     A                                      :{"fieldName":"*IN85","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 20":{-
     A                                      "fieldName":"*IN86","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 21":{"f-
     A                                      ieldName":"*IN87","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 22":{"fie-
     A                                      ldName":"*IN88","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 23":{"field-
     A                                      Name":"*IN89","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"overlay":"true","vali-
     A                                      d command key":{"fieldName":"*IN11"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "overlay range":"1-24"},"items":[{"-
     A                                      id":"W1551F02_SCR02_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"W1551F02_SCR02_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W1551F02_SCR02_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"W1551F02_SCR02_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden"')
     A                                  1  4HTML(',"locked in place":"true","le-
     A                                      ft":"1040px","id":"W1551F02_SCR02_B-
     A                                      tnSave","tool tip":"Save","onclick"-
     A                                      :"SystemToolbarSave","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/save.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1066px","id":"W1551F0-
     A                                      2_SCR02_BtnRefresh","tool tip":"Ref-
     A                                      resh","onclick":"SystemToolbarRefre-
     A                                      sh","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/refr-
     A                                      esh.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1092px","id":"W1551F02_SCR02_BtnSea-
     A                                      rch","tool tip":"Search","onclick":-
     A                                      "SystemToolbarSearch","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/search.png'')"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1118px","id":"W155-
     A                                      1F02_SCR02_BtnDiaryItems","tool tip-
     A                                      ":"Diary/Work Items - IDARTS","oncl-
     A                                      ick":"SystemToolbarDiary","backgrou-
     A                                      nd image":{"fieldName":"DryIcnURL",-
     A                                      "dataLength":"128","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"}},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1144px","id":"W1551F0-
     A                                      2_SCR02_BtnSystemMessages","tool ti-
     A                                      p":"System Messages","onclick":"Sys-
     A                                      temToolbarMessages","background ima-
     A                                      ge":{"fieldName":"MsgIcnURL","dataL-
     A                                      ength":"128","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"W1551F02_SCR0-
     A                                      2_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"W1551F02_SCR02_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"W1551F02_SCR02_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W1551F02_SCR02_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant27","field type"-
     A                                      :"output field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentUser()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"W1551F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR02_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","f')
     A                                  1  5HTML('ormatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"414px","curs-
     A                                      or column":"21","top":"110px","curs-
     A                                      or row":"1","css class 2":"top-line-
     A                                      ","css class 3":"HI","parent tab pa-
     A                                      nel":"W1551F02_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 4":"pro-
     A                                      found-converted"},{"id":"constant28-
     A                                      ","field type":"output field","left-
     A                                      ":"778px","cursor column":"73","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss":"top-line","value":"js: current-
     A                                      Date()","css class 2":"output-field-
     A                                      ","parent tab panel":"W1551F02_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"W1551F02_SCR02_fkeyMenu","fie-
     A                                      ld type":"menu","left":"10px","top"-
     A                                      :"120px","height":"350px","width":"-
     A                                      230px","hover background color":"#9-
     A                                      AAA61","hover text color":"#FFFFFF"-
     A                                      ,"border color":"#4C6106","menu opt-
     A                                      ion indent":"10px","background colo-
     A                                      r":"#758B27","css class":"action-me-
     A                                      nu","css class 2":"stationary","z i-
     A                                      ndex":"101"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W1551F02_SCR02_BtnHiddenRefresh","-
     A                                      value":"btnRefresh","top":"125px","-
     A                                      response":{"fieldName":"btnRefresh"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"SCR02_Q1PGM","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "Q1PGM","designValue":"[Q1PGM]","re-
     A                                      fField":"DS10","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"281px","curso-
     A                                      r column":"2","top":"130px","cursor-
     A                                       row":"2","parent tab panel":"W1551-
     A                                      F02_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCR02_SCPRDS","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"414p-
     A                                      x","cursor column":"21","top":"130p-
     A                                      x","cursor row":"2","css class 2":"-
     A                                      HI","parent tab panel":"W1551F02_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "visibility":"hidden","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant29","field type":"output field",-
     A                                      "value":"SCR02","css class":"consta-
     A                                      nt","left":"799px","cursor column":-
     A                                      "76","top":"130px","cursor row":"2"-
     A                                      ,"parent tab panel":"W1551F02_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"constant30","field type":"outp-
     A                                      ut field","value":"Group:","css cla-
     A                                      ss":"constant","left":"281px","curs-
     A                                      or column":"2","top":"150px","curso-
     A                                      r row":"3","parent tab panel":"W155-
     A                                      1F02_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCR02_SCFND","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCFND","designValue":"[SCFN-
     A                                      D]","refField":"FND","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00"},"css clas-
     A                                      s":"output-field","left":"337px","c-
     A                                      ursor column":"10","top":"150px","c-
     A                                      ursor row":"3","width":"21px","text-
     A                                       align":"right","parent tab panel":-
     A                                      "W1551F02_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR02_SCNAME","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCNAME","designValue"-
     A                                      :"[SCNAME]","refField":"NAME","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"365px","cursor column":"14","top"-
     A                                      :"150px","cursor row":"3","descript-
     A                                      ion":"FUND NAME","parent tab panel"-
     A                                      :"W1551F02_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCR02_SCMODE",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCMODE","designValue-
     A                                      ":"[SCMODE]","refField":"NM10","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"764px","cursor column":"71","top-
     A                                      ":"150px","cursor row":"3","css cla-
     A                                      ss 2":"HI","description":"ADD/UPDAT-
     A                                      E MODE","parent tab panel":"W1551F0-
     A                                      2_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W1551F0-
     A                                      2_SCR02_BtnHiddenSearch","value":"b-
     A                                      tnSearch","top":"150px","response":-
     A                                      {"fieldName":"btnSearch","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant31","field type":"out')
     A                                  1  6HTML('put field","value":"Emp #:","-
     A                                      css class":"constant","left":"281px-
     A                                      ","cursor column":"2","top":"170px"-
     A                                      ,"cursor row":"4","parent tab panel-
     A                                      ":"W1551F02_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCR02_SCEDN",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCEDN","designValue"-
     A                                      :"[SCEDN]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none","dataLength":"44"},"css-
     A                                       class":"output-field","left":"337p-
     A                                      x","cursor column":"10","top":"170p-
     A                                      x","cursor row":"4","parent tab pan-
     A                                      el":"W1551F02_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W1551F02_SCR02_BtnHiddenDiaryI-
     A                                      tems","value":"btnDiary","top":"175-
     A                                      px","response":{"fieldName":"btnDia-
     A                                      ry","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W1551F02-
     A                                      _SCR02_BtnHiddenSystemMessages","va-
     A                                      lue":"btnMessage","top":"200px","re-
     A                                      sponse":{"fieldName":"btnMessage","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant32","field type":"out-
     A                                      put field","value":"Category","css -
     A                                      class":"constant","left":"281px","c-
     A                                      ursor column":"2","top":"210px","cu-
     A                                      rsor row":"6","css class 2":"HI","p-
     A                                      arent tab panel":"W1551F02_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant33","field type":"output -
     A                                      field","value":"Avail Range","css c-
     A                                      lass":"constant","left":"428px","cu-
     A                                      rsor column":"23","top":"210px","cu-
     A                                      rsor row":"6","css class 2":"HI","p-
     A                                      arent tab panel":"W1551F02_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant35","field type":"output -
     A                                      field","value":"Credit","css class"-
     A                                      :"constant","left":"519px","cursor -
     A                                      column":"36","top":"210px","cursor -
     A                                      row":"6","css class 2":"HI","parent-
     A                                       tab panel":"W1551F02_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant34","field type":"output field-
     A                                      ","value":"Debit","css class":"cons-
     A                                      tant","left":"589px","cursor column-
     A                                      ":"46","top":"210px","cursor row":"-
     A                                      6","css class 2":"HI","parent tab p-
     A                                      anel":"W1551F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant3-
     A                                      6","field type":"output field","val-
     A                                      ue":"Reason","css class":"constant"-
     A                                      ,"left":"645px","cursor column":"54-
     A                                      ","top":"210px","cursor row":"6","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"W1551F02_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W1551F02_SCR02_BtnHiddenWorkSubmi-
     A                                      tJob","value":"btnWrksbmjob","top":-
     A                                      "225px","response":{"fieldName":"bt-
     A                                      nWrkJob","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"constant37","field -
     A                                      type":"output field","value":"of Mo-
     A                                      d","css class":"constant","left":"4-
     A                                      28px","cursor column":"23","top":"2-
     A                                      30px","cursor row":"7","css class 2-
     A                                      ":"HI","parent tab panel":"W1551F02-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant38","field type"-
     A                                      :"output field","value":"Applied","-
     A                                      css class":"constant","left":"512px-
     A                                      ","cursor column":"35","top":"230px-
     A                                      ","cursor row":"7","css class 2":"H-
     A                                      I","parent tab panel":"W1551F02_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"constant39","field type":"ou-
     A                                      tput field","value":"Applied","css -
     A                                      class":"constant","left":"582px","c-
     A                                      ursor column":"45","top":"230px","c-
     A                                      ursor row":"7","css class 2":"HI","-
     A                                      parent tab panel":"W1551F02_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W1551F02_SCR02_B-
     A                                      tnHiddenWorkPrinterOutput","value":-
     A                                      "btnWrkprtout","top":"250px","respo-
     A                                      nse":{"fieldName":"btnWrkPrnt","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant40","field type":"output-
     A                                       field","value":"Management","css c-
     A                                      lass":"constant","left":"281px","cu-
     A                                      rsor column":"2","top":"270px","cur-
     A                                      sor row":"9","parent tab panel":"W1-
     A                                      551F02_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant4')
     A                                  1  7HTML('1","field type":"output field-
     A                                      ","value":"0% to  5%","css class":"-
     A                                      constant","left":"435px","cursor co-
     A                                      lumn":"24","top":"270px","cursor ro-
     A                                      w":"9","parent tab panel":"W1551F02-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCMCCA","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCMCCA","designValue":"[SCMCCA]"-
     A                                      ,"refField":"RFP01/RFMCCA *LIBL/WMR-
     A                                      FP","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"9-
     A                                      99.00","numBlankFill":"true"},"left-
     A                                      ":"519px","cursor column":"36","top-
     A                                      ":"270px","cursor row":"9","width":-
     A                                      "43px","text align":"right","read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 3":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "css class 4":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"set focus":{"fieldName":"87"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"error message id":"WCR0807-
     A                                      ","error message file":"WMESGG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"87","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"1 message","parent tab-
     A                                       panel":"W1551F02_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 5":"-
     A                                      profound-converted"},{"id":"SCMCDA"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCMCDA","design-
     A                                      Value":"[SCMCDA]","refField":"RFP01-
     A                                      /RFMCDA *LIBL/WMRFP","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"true","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"999.00","numBlankFi-
     A                                      ll":"true"},"left":"589px","cursor -
     A                                      column":"46","top":"270px","cursor -
     A                                      row":"9","width":"43px","text align-
     A                                      ":"right","read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"set focus":-
     A                                      {"fieldName":"85","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"error mes-
     A                                      sage id":"WCR0590","error message f-
     A                                      ile":"WMESGG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"85","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"2 mes-
     A                                      sages","error message id 2":"WCR080-
     A                                      7","error message file 2":"WMESGG",-
     A                                      "error message library 2":"*LIBL","-
     A                                      error condition 2":{"fieldName":"86-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"parent tab panel":"W1551F02_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 5":"profound-converted"},{-
     A                                      "id":"SCMCR1","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      MCR1","designValue":"[SCMCR1]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","dataLength":"25"},"left":"-
     A                                      645px","cursor column":"54","top":"-
     A                                      270px","cursor row":"9","width":"17-
     A                                      6px","read only":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 3":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"css class 4":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"set focus":{"fie-
     A                                      ldName":"36","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"error message -
     A                                      id":"WC32407","error message file":-
     A                                      "WMESGG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"36","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error messages":"1 message"-
     A                                      ,"parent tab panel":"W1551F02_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 5":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W1551F02_SCR02-
     A                                      _BtnHiddenImageQueue","value":"btnI-
     A                                      mgQue","top":"275px","response":{"f-
     A                                      ieldName":"btnImgQue","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id')
     A                                  1  8HTML('":"constant42","field type":"-
     A                                      output field","value":"Cooperation -
     A                                      with","css class":"constant","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "290px","cursor row":"10","parent t-
     A                                      ab panel":"W1551F02_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCMCR-
     A                                      2","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCMCR2","desi-
     A                                      gnValue":"[SCMCR2]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","da-
     A                                      taLength":"25"},"left":"645px","cur-
     A                                      sor column":"54","top":"290px","cur-
     A                                      sor row":"10","width":"176px","read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"parent tab panel":"W1551F0-
     A                                      2_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 5":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W1551F0-
     A                                      2_SCR02_BtnHiddenHelp","value":"btn-
     A                                      Help","top":"300px","response":{"fi-
     A                                      eldName":"btnHelp","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant4-
     A                                      3","field type":"output field","val-
     A                                      ue":"Insurance Carrier","css class"-
     A                                      :"constant","left":"281px","cursor -
     A                                      column":"2","top":"310px","cursor r-
     A                                      ow":"11","parent tab panel":"W1551F-
     A                                      02_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant44","field typ-
     A                                      e":"output field","value":"Manageme-
     A                                      nt - Safety","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"350px","cursor row":"13","p-
     A                                      arent tab panel":"W1551F02_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant45","field type":"output -
     A                                      field","value":"0% to  5%","css cla-
     A                                      ss":"constant","left":"435px","curs-
     A                                      or column":"24","top":"350px","curs-
     A                                      or row":"13","parent tab panel":"W1-
     A                                      551F02_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCMSCA","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCMSCA","designValue":"[SC-
     A                                      MSCA]","refField":"RFP01/RFMSCA *LI-
     A                                      BL/WMRFP","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00","numBlankFill":"true"}-
     A                                      ,"left":"519px","cursor column":"36-
     A                                      ","top":"350px","cursor row":"13","-
     A                                      width":"43px","text align":"right",-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 3":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"css class 4":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"set focus":{"fieldNam-
     A                                      e":"69","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"error message id":"-
     A                                      WCR0807","error message file":"WMES-
     A                                      GG","error message library":"*LIBL"-
     A                                      ,"error condition":{"fieldName":"69-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"1 message","par-
     A                                      ent tab panel":"W1551F02_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 5":"profound-converted"},{"id":"-
     A                                      SCMSDA","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCMSDA",-
     A                                      "designValue":"[SCMSDA]","refField"-
     A                                      :"RFP01/RFMSDA *LIBL/WMRFP","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      true","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00","num-
     A                                      BlankFill":"true"},"left":"589px","-
     A                                      cursor column":"46","top":"350px","-
     A                                      cursor row":"13","width":"43px","te-
     A                                      xt align":"right","read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 3":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"css class-
     A                                       4":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"set-
     A                                       focus":{"fieldName":"88","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"e-
     A                                      rror message id":"WCR0590","error m-
     A                                      essage file":"WMESGG","err')
     A                                  1  9HTML('or message library":"*LIBL","-
     A                                      error condition":{"fieldName":"88",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"2 messages","erro-
     A                                      r message id 2":"WCR0807","error me-
     A                                      ssage file 2":"WMESGG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"89","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"parent ta-
     A                                      b panel":"W1551F02_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 5":-
     A                                      "profound-converted"},{"id":"SCMSR1-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCMSR1","desig-
     A                                      nValue":"[SCMSR1]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","dat-
     A                                      aLength":"25"},"left":"645px","curs-
     A                                      or column":"54","top":"350px","curs-
     A                                      or row":"13","width":"176px","read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 3":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 4":{"fieldName":"N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"set focus":{"fieldName":"37-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"error message id":"WC3240-
     A                                      7","error message file":"WMESGG","e-
     A                                      rror message library":"*LIBL","erro-
     A                                      r condition":{"fieldName":"37","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"1 message","parent ta-
     A                                      b panel":"W1551F02_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 5":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt46","field type":"output field","-
     A                                      value":"Organization","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"370px","cursor row-
     A                                      ":"14","parent tab panel":"W1551F02-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCMSR2","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCMSR2","designValue":"[SCMSR2]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","dataLength":"25"},"le-
     A                                      ft":"645px","cursor column":"54","t-
     A                                      op":"370px","cursor row":"14","widt-
     A                                      h":"176px","read only":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 3":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR",-
     A                                      "customFalse":""},"css class 4":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"parent tab-
     A                                       panel":"W1551F02_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 5":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t47","field type":"output field","v-
     A                                      alue":"Schedule DB/CR factor:","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"490px","c-
     A                                      ursor row":"20","parent tab panel":-
     A                                      "W1551F02_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCDBCR","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCDBCR","designValue":"[SCD-
     A                                      BCR]","dataType":"zoned","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"999-
     A                                      .00","dataLength":"5","decPos":"4"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "449px","cursor column":"26","top":-
     A                                      "490px","cursor row":"20","width":"-
     A                                      42px","text align":"right","parent -
     A                                      tab panel":"W1551F02_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"btnS-
     A                                      ubmit","field type":"button","value-
     A                                      ":"Enter","shortcut key":"Enter","l-
     A                                      eft":"14px","top":"150px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF03","fi-
     A                                      eld type":"button","value":"Exit","-
     A                                      shortcut key":"F3","left":"14px","t-
     A                                      op":"183px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF05","field type":"but-
     A                                      ton","value":"Refresh","shortcut ke-
     A                                      y":"F5","left":"14px","top":"216px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF10","field type":"button","visib-
     A                                      ility":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"value":"F10","shortcut key":"F10-
     A                                      ","left":"14px","top":"249px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF12"-
     A                                      ,"field type":"button","value":"Can-
     A                                      cel","shortcut key":"F12","left":"1-
     A                                      4px","top":"282px","width"')
     A                                  1 10HTML(':"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F21","field type":"button","value":-
     A                                      "Print schedule rating form","short-
     A                                      cut key":"F21","left":"14px","top":-
     A                                      "315px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCDBCR         5S 4H
     A            SCEDN         44A  H
     A            SCMCR1        25A  H
     A            SCMCR2        25A  H
     A            SCMSR1        25A  H
     A            SCMSR2        25A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMCCA    R        H      REFFLD(RFP01/RFMCCA *LIBL/WMRFP)
     A            SCMCDA    R        H      REFFLD(RFP01/RFMCDA *LIBL/WMRFP)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCMSCA    R        H      REFFLD(RFP01/RFMSCA *LIBL/WMRFP)
     A            SCMSDA    R        H      REFFLD(RFP01/RFMSDA *LIBL/WMRFP)
     A            SCNAME    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR03
     A  11 70 71
     A  72 73 74
     A  75 76 77                            CA01(11 'Response Indicator *IN11')
     A  78 79 80
     A  81 82 83
     A  84 85 86                            CA02(70 'Response Indicator *IN70')
     A  87 88 89
     A  09                                  CA03(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                      SETOF(74 'Response Indicator *IN74')
     A                                      SETOF(75 'Response Indicator *IN75')
     A                                      SETOF(76 'Response Indicator *IN76')
     A                                      SETOF(77 'Response Indicator *IN77')
     A                                      SETOF(78 'Response Indicator *IN78')
     A                                      SETOF(79 'Response Indicator *IN79')
     A                                      SETOF(80 'Response Indicator *IN80')
     A                                      SETOF(81 'Response Indicator *IN81')
     A                                      SETOF(82 'Response Indicator *IN82')
     A                                      SETOF(83 'Response Indicator *IN83')
     A                                      SETOF(84 'Response Indicator *IN84')
     A                                      SETOF(85 'Response Indicator *IN85')
     A                                      SETOF(86 'Response Indicator *IN86')
     A                                      SETOF(87 'Response Indicator *IN87')
     A                                      SETOF(88 'Response Indicator *IN88')
     A                                      SETOF(89 'Response Indicator *IN89')
     A                                  1  2HTML('QPUIREC5    RROWS      2    C-
     A                                      1    1C2    24 RERRMSGID  5    C6  -
     A                                        SCLSDTC7    WCR0450C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     70RERRMS-
     A                                      GID  5    C6    SCLSDTC7    WCR0500-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     71RERRMSGID  5    C6    SCPEF-
     A                                      LC7    WC30282C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     73RERRMSGID  5 -
     A                                         C6    SCPEEMC7    WCR0556C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     7-
     A                                      2')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN70","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN71","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN72","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN73","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN74","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN75","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN76","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN77","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN78","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N79","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN8-
     A                                      0","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN81"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN82","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN83","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN84","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 16":{"fieldName":"*IN85","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       17":{"fieldName":"*IN86","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 1-
     A                                      8":{"fieldName":"*IN87","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 19"-
     A                                      :{"fieldName":"*IN88","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 20":{-
     A                                      "fieldName":"*IN89","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"valid command k-
     A                                      ey":{"fieldName":"*IN11","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"overlay ra-
     A                                      nge":"1-24"},"items":[{"id":"W1551F-
     A                                      02_SCR03_avKeys","field type":"outp-
     A                                      ut field","value":{"fieldName":"AV_-
     A                                      KEYS","dataLength":"1134","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[AV_KEYS]"},"left":"0px-
     A                                      ","top":"0px","visibility":"hidden"-
     A                                      },{"id":"W1551F02_SCR03_action","fi-
     A                                      eld type":"html container","white s-
     A                                      pace":"normal","left":"0px","top":"-
     A                                      10px","width":"230px","css class":"-
     A                                      action-panel-converted","height":"7-
     A                                      00px","html":"<div class=\"top\"></-
     A                                      div><div class=\"imagetop\"><img sr-
     A                                      c=\"/profoundui/userdata/images/bar-
     A                                      _top.png\" /></div><div class=\"men-
     A                                      ulinks\"></div><div class=\"imagebo-
     A                                      ttom\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_bottom.png\" /></div-
     A                                      ><div class=\"bottom\"></div>"},{"f-
     A                                      ield type":"icon menu button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"32px","z ind-
     A                                      ex":"20","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1170px","id":"W1551F02-
     A                                      _SCR03_BtnIconMenuSystemTools","too-
     A                                      l tip":"System Tools","icon alignme-
     A                                      nt":"middle left","icon width":"16p-
     A                                      x","icon height":"24px","icon sourc-
     A                                      e":"/profoundui/userdata/images/sys-
     A                                      tool/systools.png","data function":-
     A                                      "SystemToolbarSystools","show down -
     A                                      arrow":"Yes"},{"field type":"panel"-
     A                                      ,"panel style":"TransformButtonBar"-
     A                                      ,"id":"W1551F02_SCR03_ButtonBar","t-
     A                                      op":"35px","left":"1036px","width":-
     A                                      "187px","height":"28px","css class"-
     A                                      :"stationary","visibility":"hidden"-
     A                                      ,"locked in place":"true"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1040px","id":"W1551F0-
     A                                      2_SCR03_BtnSave","tool tip":"Save",-
     A                                      "onclick":"SystemToolbarSave","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/save.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","backgrou')
     A                                  1  4HTML('nd repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1066px","id":"W1551F02_SCR03_Btn-
     A                                      Refresh","tool tip":"Refresh","oncl-
     A                                      ick":"SystemToolbarRefresh","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/refresh.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1092px","id-
     A                                      ":"W1551F02_SCR03_BtnSearch","tool -
     A                                      tip":"Search","onclick":"SystemTool-
     A                                      barSearch","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/search.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1118px","id":"W1551F02_SCR03_-
     A                                      BtnDiaryItems","tool tip":"Diary/Wo-
     A                                      rk Items - IDARTS","onclick":"Syste-
     A                                      mToolbarDiary","background image":{-
     A                                      "fieldName":"DryIcnURL","dataLength-
     A                                      ":"128","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"}},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1144px","id":"W1551F02_SCR03_Btn-
     A                                      SystemMessages","tool tip":"System -
     A                                      Messages","onclick":"SystemToolbarM-
     A                                      essages","background image":{"field-
     A                                      Name":"MsgIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"119-
     A                                      6px","id":"W1551F02_SCR03_BtnHelp",-
     A                                      "tool tip":"Help","onclick":"System-
     A                                      ToolbarHelp","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/help.png'')"},{"id":"W1551F02_-
     A                                      SCR03_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"W1551F02-
     A                                      _SCR03_MainTabPanel","field type":"-
     A                                      tab panel","tab panel style":"Trans-
     A                                      form","tab names":{"fieldName":"SCP-
     A                                      RDS","designValue":"[SCPRDS]","refF-
     A                                      ield":"NAME","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"active tab":"0-
     A                                      ","left":"250px","top":"70px","widt-
     A                                      h":"970px","height":"657px","z inde-
     A                                      x":"8","locked in place":"true","cs-
     A                                      s class":"tab-panel","css class 2":-
     A                                      "stationary"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W1551F02_SCR03_BtnHiddenSave","va-
     A                                      lue":"btnSave","top":"100px","respo-
     A                                      nse":{"fieldName":"btnSave","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant48","field type":"output fi-
     A                                      eld","left":"281px","cursor column"-
     A                                      :"2","top":"110px","cursor row":"1"-
     A                                      ,"css class":"top-line","value":"js-
     A                                      : currentUser()","css class 2":"out-
     A                                      put-field","parent tab panel":"W155-
     A                                      1F02_SCR03_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"SCR03_SCCONM","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCCONM","designValue":"[SC-
     A                                      CONM]","refField":"NAME","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"414-
     A                                      px","cursor column":"21","top":"110-
     A                                      px","cursor row":"1","css class 2":-
     A                                      "top-line","css class 3":"HI","pare-
     A                                      nt tab panel":"W1551F02_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 4":"profound-converted"}')
     A                                  1  5HTML(',{"id":"constant49","field ty-
     A                                      pe":"output field","left":"778px","-
     A                                      cursor column":"73","top":"110px","-
     A                                      cursor row":"1","css class":"top-li-
     A                                      ne","value":"js: currentDate()","cs-
     A                                      s class 2":"output-field","parent t-
     A                                      ab panel":"W1551F02_SCR03_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"W1551-
     A                                      F02_SCR03_fkeyMenu","field type":"m-
     A                                      enu","left":"10px","top":"120px","h-
     A                                      eight":"350px","width":"230px","hov-
     A                                      er background color":"#9AAA61","hov-
     A                                      er text color":"#FFFFFF","border co-
     A                                      lor":"#4C6106","menu option indent"-
     A                                      :"10px","background color":"#758B27-
     A                                      ","css class":"action-menu","css cl-
     A                                      ass 2":"stationary","z index":"101"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W1551F02_S-
     A                                      CR03_BtnHiddenRefresh","value":"btn-
     A                                      Refresh","top":"125px","response":{-
     A                                      "fieldName":"btnRefresh","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"SCR-
     A                                      03_Q1PGM","field type":"output fiel-
     A                                      d","value":{"fieldName":"Q1PGM","de-
     A                                      signValue":"[Q1PGM]","refField":"DS-
     A                                      10","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"281px","cursor column":"-
     A                                      2","top":"130px","cursor row":"2","-
     A                                      parent tab panel":"W1551F02_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCR03_SCPRDS","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCP-
     A                                      RDS","designValue":"[SCPRDS]","refF-
     A                                      ield":"NAME","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"414px","cursor -
     A                                      column":"21","top":"130px","cursor -
     A                                      row":"2","css class 2":"HI","parent-
     A                                       tab panel":"W1551F02_SCR03_MainTab-
     A                                      Panel","parent tab":"0","visibility-
     A                                      ":"hidden","css class 3":"profound--
     A                                      converted"},{"id":"constant50","fie-
     A                                      ld type":"output field","value":"SC-
     A                                      R03","css class":"constant","left":-
     A                                      "799px","cursor column":"76","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"W1551F02_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt51","field type":"output field","-
     A                                      value":"Group:","css class":"consta-
     A                                      nt","left":"281px","cursor column":-
     A                                      "2","top":"150px","cursor row":"3",-
     A                                      "parent tab panel":"W1551F02_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCR03_SCFND","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCF-
     A                                      ND","designValue":"[SCFND]","refFie-
     A                                      ld":"FND","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00"},"css class":"output--
     A                                      field","left":"337px","cursor colum-
     A                                      n":"10","top":"150px","cursor row":-
     A                                      "3","width":"21px","text align":"ri-
     A                                      ght","parent tab panel":"W1551F02_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR03_SCNAME","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCNAME","designValue":"[SCNAME]"-
     A                                      ,"refField":"NAME","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"365px","c-
     A                                      ursor column":"14","top":"150px","c-
     A                                      ursor row":"3","description":"FUND -
     A                                      NAME","parent tab panel":"W1551F02_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCR03_SCMODE","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCMODE","designValue":"[SCMODE]-
     A                                      ","refField":"NM10","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"764px","-
     A                                      cursor column":"71","top":"150px","-
     A                                      cursor row":"3","css class 2":"HI",-
     A                                      "description":"ADD/UPDATE MODE","pa-
     A                                      rent tab panel":"W1551F02_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W1551F02_SCR03_Btn-
     A                                      HiddenSearch","value":"btnSearch","-
     A                                      top":"150px","response":{"fieldName-
     A                                      ":"btnSearch","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant52","f-
     A                                      ield type":"output field","value":"-
     A                                      Emp #:","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"170px","cursor row":"4","parent -
     A                                      tab panel":"W1551F02_SCR03_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCR0-
     A                                      3_SCEDN","field type":"output field-
     A                                      ","value":{"fieldName":"SCEDN","des-
     A                                      ignValue":"[SCEDN]","dataT')
     A                                  1  6HTML('ype":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      ,"dataLength":"44"},"css class":"ou-
     A                                      tput-field","left":"337px","cursor -
     A                                      column":"10","top":"170px","cursor -
     A                                      row":"4","parent tab panel":"W1551F-
     A                                      02_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W1551F-
     A                                      02_SCR03_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W1551F02_SCR03_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant53","field type":"output field",-
     A                                      "value":"Loss prevention survey com-
     A                                      pleted      :","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"210px","cursor row":"6","-
     A                                      parent tab panel":"W1551F02_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCLSCF","field type":"checkbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      checkbox","value":{"fieldName":"SCL-
     A                                      SCF","designValue":"[SCLSCF]","refF-
     A                                      ield":"RFP01/RFLSCF *LIBL/WMRFP","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase"},"text transform":"uppercas-
     A                                      e","left":"568px","top":"210px","wi-
     A                                      dth":"8px","read only":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 3":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR",-
     A                                      "customFalse":""},"css class 4":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"parent tab-
     A                                       panel":"W1551F02_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 5":"-
     A                                      profound-converted","checked value"-
     A                                      :"Y","unchecked value":" "},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W1551F02_SCR03_BtnH-
     A                                      iddenWorkSubmitJob","value":"btnWrk-
     A                                      sbmjob","top":"225px","response":{"-
     A                                      fieldName":"btnWrkJob","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant54","field type":"output field",-
     A                                      "value":"If ''Y'', provide completi-
     A                                      on date     :","css class":"constan-
     A                                      t","left":"295px","cursor column":"-
     A                                      4","top":"230px","cursor row":"7","-
     A                                      parent tab panel":"W1551F02_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCLSDT","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCLSD-
     A                                      T","designValue":"[SCLSDT]","dataTy-
     A                                      pe":"zoned","formatting":"Date","da-
     A                                      taLength":"8","decPos":"0","dateFor-
     A                                      mat":"m/d/Y","locale":"en_US"},"lef-
     A                                      t":"568px","cursor column":"43","to-
     A                                      p":"230px","cursor row":"7","width"-
     A                                      :"71px","read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 3":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"css class 4":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"set focus":{"-
     A                                      fieldName":"74","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"error messa-
     A                                      ge id":"WCR0450","error message fil-
     A                                      e":"WMESGG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"70","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"2 messa-
     A                                      ges","error message id 2":"WCR0500"-
     A                                      ,"error message file 2":"WMESGG","e-
     A                                      rror message library 2":"*LIBL","er-
     A                                      ror condition 2":{"fieldName":"71",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "parent tab panel":"W1551F02_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 5":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W1551F02_SCR03_-
     A                                      BtnHiddenWorkPrinterOutput","value"-
     A                                      :"btnWrkprtout","top":"250px","resp-
     A                                      onse":{"fieldName":"btnWrkPrnt","da-
     A                                      taType":"indicator","forma')
     A                                  1  7HTML('tting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant55","fie-
     A                                      ld type":"output field","value":"Do-
     A                                      es estimated standard premium equal-
     A                                       or exceed current experience ratin-
     A                                      g","css class":"constant","left":"2-
     A                                      81px","cursor column":"2","top":"27-
     A                                      0px","cursor row":"9","parent tab p-
     A                                      anel":"W1551F02_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W1551F02_SCR03_BtnHiddenImag-
     A                                      eQueue","value":"btnImgQue","top":"-
     A                                      275px","response":{"fieldName":"btn-
     A                                      ImgQue","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant56","field t-
     A                                      ype":"output field","value":"eligib-
     A                                      ility level                   :","c-
     A                                      ss class":"constant","left":"295px"-
     A                                      ,"cursor column":"4","top":"290px",-
     A                                      "cursor row":"10","parent tab panel-
     A                                      ":"W1551F02_SCR03_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCPEFL","fiel-
     A                                      d type":"checkbox","css class":"inp-
     A                                      ut","css class 2":"checkbox","value-
     A                                      ":{"fieldName":"SCPEFL","designValu-
     A                                      e":"[SCPEFL]","refField":"RFP01/RFP-
     A                                      EFL *LIBL/WMRFP","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"568px-
     A                                      ","top":"290px","width":"8px","read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"set focus":{"fieldName":"7-
     A                                      3","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"error message id":"WC302-
     A                                      82","error message file":"WMESGG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"73","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"1 message","parent t-
     A                                      ab panel":"W1551F02_SCR03_MainTabPa-
     A                                      nel","parent tab":"0","css class 5"-
     A                                      :"profound-converted","checked valu-
     A                                      e":"Y","unchecked value":" "},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W1551F02_SCR03_Bt-
     A                                      nHiddenHelp","value":"btnHelp","top-
     A                                      ":"300px","response":{"fieldName":"-
     A                                      btnHelp","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"constant57","field -
     A                                      type":"output field","value":"If ''-
     A                                      Y'', experience mod              :"-
     A                                      ,"css class":"constant","left":"295-
     A                                      px","cursor column":"4","top":"310p-
     A                                      x","cursor row":"11","parent tab pa-
     A                                      nel":"W1551F02_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCPEEM","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCPEEM","designVal-
     A                                      ue":"[SCPEEM]","refField":"RFP01/RF-
     A                                      PEEM *LIBL/WMRFP","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"true","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00"},"left":"568px-
     A                                      ","cursor column":"43","top":"310px-
     A                                      ","cursor row":"11","width":"43px",-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 3":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"css class 4":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"set focus":{"fieldNam-
     A                                      e":"72","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"error message id":"-
     A                                      WCR0556","error message file":"WMES-
     A                                      GG","error message library":"*LIBL"-
     A                                      ,"error condition":{"fieldName":"72-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"1 message","par-
     A                                      ent tab panel":"W1551F02_SCR03_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 5":"profound-converted"},{"id":"-
     A                                      constant58","field type":"output fi-
     A                                      eld","value":"Comments:","css class-
     A                                      ":"constant","left":"281px","cursor-
     A                                       column":"2","top":"370px","cursor -
     A                                      row":"14","parent tab panel":"W1551-
     A                                      F02_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCCOM1","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SCCOM1","designValue":"[SCCOM-
     A                                      1]","refField":"RFP01/RFCO')
     A                                  1  8HTML('M1 *LIBL/WMRFP","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue"},"left":"358px","cursor column"-
     A                                      :"13","top":"370px","cursor row":"1-
     A                                      4","width":"421px","read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 3":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"PR","customFalse":""},"css clas-
     A                                      s 4":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"pa-
     A                                      rent tab panel":"W1551F02_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 5":"profound-converted"},{"id":-
     A                                      "SCCOM2","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCCOM2"-
     A                                      ,"designValue":"[SCCOM2]","refField-
     A                                      ":"RFP01/RFCOM2 *LIBL/WMRFP","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true"},"left":"358px","cursor -
     A                                      column":"13","top":"390px","cursor -
     A                                      row":"15","width":"421px","read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 3":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"c-
     A                                      ss class 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"parent tab panel":"W1551F02_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 5":"profound-converted"}-
     A                                      ,{"id":"SCCOM3","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCCOM3","designValue":"[SCCOM3]","r-
     A                                      efField":"RFP01/RFCOM3 *LIBL/WMRFP"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true"},"left":"358px","-
     A                                      cursor column":"13","top":"410px","-
     A                                      cursor row":"16","width":"421px","r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 3":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"css class 4":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"parent tab panel":"W155-
     A                                      1F02_SCR03_MainTabPanel","parent ta-
     A                                      b":"0","css class 5":"profound-conv-
     A                                      erted"},{"id":"btnSubmit","field ty-
     A                                      pe":"button","value":"Enter","short-
     A                                      cut key":"Enter","left":"14px","top-
     A                                      ":"150px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF03","field type":"butto-
     A                                      n","value":"Exit","shortcut key":"F-
     A                                      3","left":"14px","top":"183px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF05-
     A                                      ","field type":"button","value":"Re-
     A                                      fresh","shortcut key":"F5","left":"-
     A                                      14px","top":"216px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF10","field ty-
     A                                      pe":"button","visibility":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"value":"F10",-
     A                                      "shortcut key":"F10","left":"14px",-
     A                                      "top":"249px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF12","field type":"b-
     A                                      utton","value":"Cancel","shortcut k-
     A                                      ey":"F12","left":"14px","top":"282p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF21","field type":"button","val-
     A                                      ue":"Print schedule rating form","s-
     A                                      hortcut key":"F21","left":"14px","t-
     A                                      op":"315px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      }]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCEDN         44A  H
     A            SCLSDT         8S 0H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCOM1    R        H      REFFLD(RFP01/RFCOM1 *LIBL/WMRFP)
     A            SCCOM2    R        H      REFFLD(RFP01/RFCOM2 *LIBL/WMRFP)
     A            SCCOM3    R        H      REFFLD(RFP01/RFCOM3 *LIBL/WMRFP)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFND     R        H      REFFLD(FND)
     A            SCLSCF    R        H      REFFLD(RFP01/RFLSCF *LIBL/WMRFP)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCNAME    R        H      REFFLD(NAME)
     A            SCPEEM    R        H      REFFLD(RFP01/RFPEEM *LIBL/WMRFP)
     A            SCPEFL    R        H      REFFLD(RFP01/RFPEFL *LIBL/WMRFP)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R WDWMSG
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC3    ROVERLAY   0     -
     A                                      RWINDOW    0     RROWS      2    C1-
     A                                          2C1    9 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"WDWMSG","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"show as window":"true","window to-
     A                                      p":"8","window left":"8","overlay":-
     A                                      "true","valid command key":{"fieldN-
     A                                      ame":"*IN11","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"overlay range":"2-9"},-
     A                                      "items":[{"id":"WDWMSG","field type-
     A                                      ":"panel","panel style":"Transform -
     A                                      Dialog","text align":"center","left-
     A                                      ":"5px","top":"5px","height":"363px-
     A                                      ","width":"436px","z index":"8","lo-
     A                                      cked in place":"true"},{"id":"const-
     A                                      ant59","field type":"output field",-
     A                                      "value":"Sum of DB/CR percentages o-
     A                                      f rating form does not equal","css -
     A                                      class":"constant","left":"29px","cu-
     A                                      rsor column":"2","top":"85px","curs-
     A                                      or row":"2","css class 2":"HI","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant60","field type":"outpu-
     A                                      t field","value":"DB/CR factor of e-
     A                                      mployer detail","css class":"consta-
     A                                      nt","left":"29px","cursor column":"-
     A                                      2","top":"105px","cursor row":"3","-
     A                                      css class 2":"HI","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCWPCT","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCWPCT","designValue"-
     A                                      :"[SCWPCT]","dataType":"zoned","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"999.00","dataLength":"5","decPos-
     A                                      ":"4"},"css class":"output-field","-
     A                                      left":"29px","cursor column":"2","t-
     A                                      op":"145px","cursor row":"5","width-
     A                                      ":"42px","text align":"right","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant61","field type":"output-
     A                                       field","value":"Sum of Category DB-
     A                                      /CR percentages","css class":"const-
     A                                      ant","left":"78px","cursor column":-
     A                                      "9","top":"145px","cursor row":"5",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCWDBC","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCWD-
     A                                      BC","designValue":"[SCWDBC]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"999.00","dataLe-
     A                                      ngth":"5","decPos":"4"},"css class"-
     A                                      :"output-field","left":"29px","curs-
     A                                      or column":"2","top":"185px","curso-
     A                                      r row":"7","width":"42px","text ali-
     A                                      gn":"right","css class 2":"profound-
     A                                      -converted"},{"id":"constant62","fi-
     A                                      eld type":"output field","value":"S-
     A                                      chedule DB/CR factor in employer de-
     A                                      tail","css class":"constant","left"-
     A                                      :"78px","cursor column":"9","top":"-
     A                                      185px","cursor row":"7","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant63","field type":"output field-
     A                                      ","value":"Press Enter to continue"-
     A                                      ,"css class":"constant","left":"78p-
     A                                      x","cursor column":"9","top":"225px-
     A                                      ","cursor row":"9","css class 2":"B-
     A                                      LU","css class 3":"profound-convert-
     A                                      ed"},{"id":"btnSubmit","field type"-
     A                                      :"button","value":"Enter","shortcut-
     A                                       key":"Enter","left":"14px","top":"-
     A                                      290px","width":"80px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF03","field type":"button","-
     A                                      value":"Exit","shortcut key":"F3","-
     A                                      left":"104px","top":"290px","width"-
     A                                      :"80px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF05","f-
     A                                      ield type":"button","value":"Refres-
     A                                      h","shortcut key":"F5","left":"194p-
     A                                      x","top":"290px","width":"80px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnCF12","field type":-
     A                                      "button","value":"Cancel","shortcut-
     A                                       key":"F12","left":"284px","top":"2-
     A                                      90px","width":"80px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF21","field type":"button","v-
     A                                      alue":"Print schedule rating form",-
     A                                      "shortcut key":"F21","left":"14px",-
     A                                      "top":"323px","width":"80px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "}]}')
     A            SCWDBC         5S 4H
     A            SCWPCT         5S 4H
