     A                                      REF(*LIBL/WREFP)
     A          R SCR01S                    SFL
     A  09 40 86
     A  91        QPUI000001     1A  O  2  2
     A            SFRRN          5S 0H
     A            SFSEL          1A  H
     A            SFDESC    R        H      REFFLD(DS30)
     A            SFMSG#    R        H      REFFLD(A30)
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  11 20 21
     A  25 26 27
     A  32 09 17                            CA01(11 'Response Indicator *IN11')
     A  18 40 90
     A  71 74 75                            CA02(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                  1  2HTML('QPUICTL1    SCR01S    5    RS-
     A                                      FLDSP    0    E1    3     71RSFLDSP-
     A                                      CTL 0    E1    3     71RSFLCLR    0-
     A                                          E1    3     74RSFLPAG    1    C-
     A                                      1    8 RSFLSIZ    1    C1    9 1   -
     A                                       RSFLNXTCHG 0    E1    3     917   -
     A                                       ROVERLAY   0     RROWS      2    C-
     A                                      1    1C2    21 RSFLMSGID  4    C7  -
     A                                        WCR0898C6    WMESGGC5    *LIBLC0 -
     A                                         E1    3     20RSFLMSGID  4    C7-
     A                                          WCR2365C6    WMESGGC5    *LIBLC-
     A                                      0    E1    3     21RSFLMSGID  4    -
     A                                      C7    CPF5203C7    QCPFMSGC5    *LI-
     A                                      BLC0    E2    6     32 176     32 1-
     A                                      8RERRMSGID  5    C5    SCJSTC7    W-
     A                                      CR0503C6    WMESGGC5    *LIBLC0    -
     A                                      E1    3     25RERRMSGID  5    C5   -
     A                                       SCDN#C7    WCR0502C6    WMESGGC5  -
     A                                        *LIBLC0    E1    3     26')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"description":"Screen 2 Subfile Co-
     A                                      ntrol Record","set off":{"fieldName-
     A                                      ":"*IN20","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 2":{"fieldName":"-
     A                                      *IN21","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 3":{"fieldName":"*IN-
     A                                      25","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 4":{"fieldName":"*IN26"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 5":{"fieldName":"*IN27","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"se-
     A                                      t off 6":{"fieldName":"*IN32","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"overl-
     A                                      ay":"true","return cursor record":{-
     A                                      "fieldName":"SFREC","dataLength":"1-
     A                                      0","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e"},"return cursor field":{"fieldNa-
     A                                      me":"SFFLD","dataLength":"10","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none"},"err-
     A                                      or message id":"WCR0898","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"20","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "3 messages","error message id 2":"-
     A                                      WCR2365","error message file 2":"WM-
     A                                      ESGG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"21","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 3":"CPF52-
     A                                      03","error message file 3":"QCPFMSG-
     A                                      ","error message library 3":"*LIBL"-
     A                                      ,"error condition 3":{"fieldName":"-
     A                                      32 and 17 or 32 and 18","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"valid comm-
     A                                      and key":{"fieldName":"*IN11","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"overl-
     A                                      ay range":"1-21"},"items":[{"id":"#-
     A                                      @$2","field type":"output field","v-
     A                                      isibility":"hidden","value":{"field-
     A                                      Name":"#@$2","designValue":"[#@$2]"-
     A                                      ,"dataType":"zoned","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"true","zeroFill":"true","curSym-
     A                                      ":"","units":"","negNum":"-999.00",-
     A                                      "dataLength":"3","decPos":"0"},"lef-
     A                                      t":"0px","top":"-30px","width":"21p-
     A                                      x","text align":"right","descriptio-
     A                                      n":"Used for screen positioning","c-
     A                                      ss class":"profound-converted"},{"i-
     A                                      d":"SCR01C_SFRRN","field type":"out-
     A                                      put field","visibility":"hidden","v-
     A                                      alue":{"fieldName":"SFRRN","designV-
     A                                      alue":"[SFRRN]","dataType":"zoned",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"true","zeroFill"-
     A                                      :"true","curSym":"","units":"","neg-
     A                                      Num":"-999.00","dataLength":"5","de-
     A                                      cPos":"0"},"left":"0px","top":"-30p-
     A                                      x","width":"35px","text align":"rig-
     A                                      ht","description":"Used to return R-
     A                                      elative Record Number","css class":-
     A                                      "profound-converted"},{"id":"SFFLD"-
     A                                      ,"field type":"output field","visib-
     A                                      ility":"hidden","value":{"fieldName-
     A                                      ":"SFFLD","designValue":"[SFFLD]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none","-
     A                                      dataLength":"10"},"left":"0px","top-
     A                                      ":"-30px","description":"Used to re-
     A                                      turn cursor location","css class":"-
     A                                      profound-converted"},{"id":"SFREC",-
     A                                      "field type":"output field","visibi-
     A                                      lity":"hidden","value":{"fieldName"-
     A                                      :"SFREC","designValue":"[SFREC]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none","d-
     A                                      ataLength":"10"},"left":"0px","top"-
     A                                      :"-30px","description":"Used to ret-
     A                                      urn cursor location","css class":"p-
     A                                      rofound-converted"},{"id":"W2069F03-
     A                                      _SCR01C_avKeys","field type":"outpu-
     A                                      t field","value":{"fieldName":"AV_K-
     A                                      EYS","dataLength":"1134","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none","des-
     A                                      ignValue":"[AV_KEYS]"},"left":"0px"-
     A                                      ,"top":"0px","visibility":"hidden"}-
     A                                      ,{"id":"W2069F03_SCR01C_action","fi-
     A                                      eld type":"html container","white s-
     A                                      pace":"normal","left":"0px","top":"-
     A                                      10px","width":"230px","css class":"-
     A                                      action-panel-converted","height":"7-
     A                                      00px","html":"<div class=\"top\"></-
     A                                      div><div class=\"imagetop\"><img sr-
     A                                      c=\"/profoundui/userdata/images/bar-
     A                                      _top.png\" /></div><div class=\"men-
     A                                      ulinks\"></div><div class=\"imagebo-
     A                                      ttom\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_bottom.png\" /></div-
     A                                      ><div class=\"bottom\"></div>"},{"f-
     A                                      ield type":"icon menu button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"32px","z ind-
     A                                      ex":"20","cursor":"default')
     A                                  1  4HTML('","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1170px"-
     A                                      ,"id":"W2069F03_SCR01C_BtnIconMenuS-
     A                                      ystemTools","tool tip":"System Tool-
     A                                      s","icon alignment":"middle left","-
     A                                      icon width":"16px","icon height":"2-
     A                                      4px","icon source":"/profoundui/use-
     A                                      rdata/images/systool/systools.png",-
     A                                      "data function":"SystemToolbarSysto-
     A                                      ols","show down arrow":"Yes"},{"fie-
     A                                      ld type":"panel","panel style":"Tra-
     A                                      nsformButtonBar","id":"W2069F03_SCR-
     A                                      01C_ButtonBar","top":"35px","left":-
     A                                      "1036px","width":"187px","height":"-
     A                                      28px","css class":"stationary","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1040-
     A                                      px","id":"W2069F03_SCR01C_BtnSave",-
     A                                      "tool tip":"Save","onclick":"System-
     A                                      ToolbarSave","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/save.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1066px","id":"W2069F03_SCR01C-
     A                                      _BtnRefresh","tool tip":"Refresh","-
     A                                      onclick":"SystemToolbarRefresh","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/refresh.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1092px"-
     A                                      ,"id":"W2069F03_SCR01C_BtnSearch","-
     A                                      tool tip":"Search","onclick":"Syste-
     A                                      mToolbarSearch","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/search.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1118px","id":"W2069F03_S-
     A                                      CR01C_BtnDiaryItems","tool tip":"Di-
     A                                      ary/Work Items - IDARTS","onclick":-
     A                                      "SystemToolbarDiary","background im-
     A                                      age":{"fieldName":"DryIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1144px","id":"W2069F03_SCR-
     A                                      01C_BtnSystemMessages","tool tip":"-
     A                                      System Messages","onclick":"SystemT-
     A                                      oolbarMessages","background image":-
     A                                      {"fieldName":"MsgIcnURL","dataLengt-
     A                                      h":"128","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none"}},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1196px","id":"W2069F03_SCR01C_B-
     A                                      tnHelp","tool tip":"Help","onclick"-
     A                                      :"SystemToolbarHelp","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/help.png'')"},{"id":"W-
     A                                      2069F03_SCR01C_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "W2069F03_SCR01C_MainTabPanel","fie-
     A                                      ld type":"tab panel","tab panel sty-
     A                                      le":"Transform","tab names":{"field-
     A                                      Name":"SCPRDS","designValue":"[SCPR-
     A                                      DS]","refField":"NAME","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"acti-
     A                                      ve tab":"0","left":"250px","top":"7-
     A                                      0px","width":"970px","heig')
     A                                  1  5HTML('ht":"657px","z index":"8","lo-
     A                                      cked in place":"true","css class":"-
     A                                      tab-panel","css class 2":"stationar-
     A                                      y"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W2069F03-
     A                                      _SCR01C_BtnHiddenSave","value":"btn-
     A                                      Save","top":"100px","response":{"fi-
     A                                      eldName":"btnSave","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"SCUSER","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCUSER","designValue"-
     A                                      :"[SCUSER]","refField":"USER","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                       2":"top-line","parent tab panel":"-
     A                                      W2069F03_SCR01C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"SCCONM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCCONM","designValue":"[SCC-
     A                                      ONM]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"414p-
     A                                      x","cursor column":"21","top":"110p-
     A                                      x","cursor row":"1","css class 2":"-
     A                                      top-line","description":"COMPANY NA-
     A                                      ME","css class 3":"HI","parent tab -
     A                                      panel":"W2069F03_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 4":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t1","field type":"output field","le-
     A                                      ft":"778px","cursor column":"73","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass":"top-line","value":"js: curre-
     A                                      ntDate()","css class 2":"output-fie-
     A                                      ld","parent tab panel":"W2069F03_SC-
     A                                      R01C_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"W2069F03_SCR01C_fkeyMenu",-
     A                                      "field type":"menu","left":"10px","-
     A                                      top":"120px","height":"350px","widt-
     A                                      h":"230px","hover background color"-
     A                                      :"#9AAA61","hover text color":"#FFF-
     A                                      FFF","border color":"#4C6106","menu-
     A                                       option indent":"10px","background -
     A                                      color":"#758B27","css class":"actio-
     A                                      n-menu","css class 2":"stationary",-
     A                                      "z index":"101"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W2069F03_SCR01C_BtnHiddenRefre-
     A                                      sh","value":"btnRefresh","top":"125-
     A                                      px","response":{"fieldName":"btnRef-
     A                                      resh","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"Q1PGM","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      Q1PGM","designValue":"[Q1PGM]","ref-
     A                                      Field":"PGM","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"281px","cursor -
     A                                      column":"2","top":"130px","cursor r-
     A                                      ow":"2","parent tab panel":"W2069F0-
     A                                      3_SCR01C_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCPRDS","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCPRDS","designValue":"[SCPRDS]","-
     A                                      refField":"NAME","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"414px","cur-
     A                                      sor column":"21","top":"130px","cur-
     A                                      sor row":"2","description":"PROGRAM-
     A                                       NAME","css class 2":"HI","parent t-
     A                                      ab panel":"W2069F03_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","visibility"-
     A                                      :"hidden","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant2","field-
     A                                       type":"output field","value":"SCR0-
     A                                      1","css class":"constant","left":"7-
     A                                      99px","cursor column":"76","top":"1-
     A                                      30px","cursor row":"2","parent tab -
     A                                      panel":"W2069F03_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCMODE"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCMODE","designValu-
     A                                      e":"[SCMODE]","refField":"NM10","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"757px","cursor column":"70","to-
     A                                      p":"150px","cursor row":"3","descri-
     A                                      ption":"Update/Inquiry Mode","css c-
     A                                      lass 2":"HI","visibility":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"hidde-
     A                                      n","customFalse":"visible"},"parent-
     A                                       tab panel":"W2069F03_SCR01C_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"W2069F03_SCR01C_BtnHi-
     A                                      ddenSearch","value":"btnSearch","to-
     A                                      p":"150px","response":{"fieldName":-
     A                                      "btnSearch","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constan')
     A                                  1  6HTML('t3","field type":"output fiel-
     A                                      d","value":"Jurisdiction state     -
     A                                                  :","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"170px","cursor row":"4","-
     A                                      parent tab panel":"W2069F03_SCR01C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCJST","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCJST-
     A                                      ","designValue":"[SCJST]","refField-
     A                                      ":"ST *LIBL/WREFP","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase"},"text-
     A                                       transform":"uppercase","left":"547-
     A                                      px","cursor column":"40","top":"170-
     A                                      px","cursor row":"4","width":"15px"-
     A                                      ,"description":"Jurisdiction State"-
     A                                      ,"set focus":{"fieldName":"40 and N-
     A                                      90","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 3":{"fieldNam-
     A                                      e":"40","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"40","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"read only":{"-
     A                                      fieldName":"N40","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"N40","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"erro-
     A                                      r message id":"WCR0503","error mess-
     A                                      age file":"WMESGG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"25","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      1 message","parent tab panel":"W206-
     A                                      9F03_SCR01C_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W20-
     A                                      69F03_SCR01C_BtnHiddenDiaryItems","-
     A                                      value":"btnDiary","top":"175px","re-
     A                                      sponse":{"fieldName":"btnDiary","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant4","field type":"output-
     A                                       field","value":"Transaction set ID-
     A                                      /maintenance code:","css class":"co-
     A                                      nstant","left":"281px","cursor colu-
     A                                      mn":"2","top":"190px","cursor row":-
     A                                      "5","parent tab panel":"W2069F03_SC-
     A                                      R01C_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCTSET","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCTSET","designValue":"[SCTSET]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se","dataLength":"3"},"text transfo-
     A                                      rm":"uppercase","left":"547px","cur-
     A                                      sor column":"40","top":"190px","cur-
     A                                      sor row":"5","width":"22px","css cl-
     A                                      ass 3":{"fieldName":"40","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"N40","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 4":{"fieldName":"N40","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"parent tab panel":"W2069F03-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 5":"profound-convert-
     A                                      ed"},{"id":"SCMTC","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCMTC","designValue":"[SCMTC]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se","dataLength":"2"},"text transfo-
     A                                      rm":"uppercase","left":"582px","cur-
     A                                      sor column":"45","top":"190px","cur-
     A                                      sor row":"5","width":"15px","css cl-
     A                                      ass 3":{"fieldName":"40","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"N40","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 4":{"fieldName":"N40","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"parent tab panel":"W2069F03-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 5":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W2069F0-
     A                                      3_SCR01C_BtnHiddenSystemMessages","-
     A                                      value":"btnMessage","top":"200px","-
     A                                      response":{"fieldName":"btnMessage"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant5","field type":"ou-
     A                                      tput field","value":"Data element n-
     A                                      umber                :","c')
     A                                  1  7HTML('ss class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"2-
     A                                      10px","cursor row":"6","parent tab -
     A                                      panel":"W2069F03_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCDN#",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCDN#","designVa-
     A                                      lue":"[SCDN#]","refField":"A50 *LIB-
     A                                      L/WREFP","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00"},"left":"547px","curs-
     A                                      or column":"40","top":"210px","curs-
     A                                      or row":"6","width":"36px","css cla-
     A                                      ss 3":{"fieldName":"40","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"cs-
     A                                      s class 4":{"fieldName":"40","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"read only":{"fieldName":"N40","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"css class 5":{"fieldName":"N4-
     A                                      0","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"error message id":"WCR0-
     A                                      502","error message file":"WMESGG",-
     A                                      "error message library":"*LIBL","er-
     A                                      ror condition":{"fieldName":"26","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"1 message","descrip-
     A                                      tion":"Data Element Number","parent-
     A                                       tab panel":"W2069F03_SCR01C_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"SC-
     A                                      ECDS","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCECDS","d-
     A                                      esignValue":"[SCECDS]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase","dataLe-
     A                                      ngth":"24"},"text transform":"upper-
     A                                      case","left":"596px","cursor column-
     A                                      ":"47","top":"210px","cursor row":"-
     A                                      6","width":"169px","css class 3":{"-
     A                                      fieldName":"40","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"css class -
     A                                      4":{"fieldName":"40","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"read -
     A                                      only":{"fieldName":"N40","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 5":{"fieldName":"N40","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"parent tab panel":"W2069F03_SCR-
     A                                      01C_MainTabPanel","parent tab":"0",-
     A                                      "css class 6":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W2069F03_SC-
     A                                      R01C_BtnHiddenWorkSubmitJob","value-
     A                                      ":"btnWrksbmjob","top":"225px","res-
     A                                      ponse":{"fieldName":"btnWrkJob","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant6","field type":"output-
     A                                       field","value":"Position to . . ."-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"250p-
     A                                      x","cursor row":"8","parent tab pan-
     A                                      el":"W2069F03_SCR01C_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCMSG#","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCMSG#","designVal-
     A                                      ue":"[SCMSG#]","refField":"DPT *LIB-
     A                                      L/WREFP","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00","numBlankFill":"true"}-
     A                                      ,"left":"414px","cursor column":"21-
     A                                      ","top":"250px","cursor row":"8","w-
     A                                      idth":"22px","description":"Error M-
     A                                      essage Number","text align":"right"-
     A                                      ,"css class 3":"UL","set focus":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"parent tab p-
     A                                      anel":"W2069F03_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 4":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W2069F03_SCR01C_BtnHiddenWo-
     A                                      rkPrinterOutput","value":"btnWrkprt-
     A                                      out","top":"250px","response":{"fie-
     A                                      ldName":"btnWrkPrnt","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W2069F03_SCR01C_BtnHiddenI-
     A                                      mageQueue","value":"btnImgQue","top-
     A                                      ":"275px","response":{"fieldName":"-
     A                                      btnImgQue","dataType":"indicator","-
     A                                      formatting":"Indicator","i')
     A                                  1  8HTML('ndFormat":"1 / 0"}},{"id":"co-
     A                                      nstant7","field type":"output field-
     A                                      ","value":"Type options or error nu-
     A                                      mbers, press Enter.","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "N09 and N40","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"28-
     A                                      1px","cursor column":"2","top":"290-
     A                                      px","cursor row":"10","css class 2"-
     A                                      :"BLU","parent tab panel":"W2069F03-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W2069F0-
     A                                      3_SCR01C_BtnHiddenHelp","value":"bt-
     A                                      nHelp","top":"300px","response":{"f-
     A                                      ieldName":"btnHelp","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      8","field type":"output field","val-
     A                                      ue":"4=Delete","css class":"constan-
     A                                      t","visibility":{"fieldName":"N09 a-
     A                                      nd N40","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"295px","-
     A                                      cursor column":"4","top":"310px","c-
     A                                      ursor row":"11","css class 2":"BLU"-
     A                                      ,"parent tab panel":"W2069F03_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant9","field type":"outp-
     A                                      ut field","value":"Opt","css class"-
     A                                      :"constant","visibility":{"fieldNam-
     A                                      e":"N09 and N40","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "274px","cursor column":"1","top":"-
     A                                      350px","cursor row":"13","css class-
     A                                       2":"HI","parent tab panel":"W2069F-
     A                                      03_SCR01C_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted","css class 4":"subfile-headin-
     A                                      g"},{"id":"constant10","field type"-
     A                                      :"output field","value":"Err#","css-
     A                                       class":"constant","left":"302px","-
     A                                      cursor column":"5","top":"350px","c-
     A                                      ursor row":"13","css class 2":"HI",-
     A                                      "parent tab panel":"W2069F03_SCR01C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted","cs-
     A                                      s class 4":"subfile-heading"},{"id"-
     A                                      :"constant11","field type":"output -
     A                                      field","value":"Description","css c-
     A                                      lass":"constant","left":"337px","cu-
     A                                      rsor column":"10","top":"350px","cu-
     A                                      rsor row":"13","css class 2":"HI","-
     A                                      parent tab panel":"W2069F03_SCR01C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted","css-
     A                                       class 4":"subfile-heading"},{"id":-
     A                                      "SCR01S","field type":"grid","numbe-
     A                                      r of columns":"3","record format na-
     A                                      me":"SCR01S","description":"Screen -
     A                                      2 Subfile Record","subfile next cha-
     A                                      nged":{"fieldName":"91","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"dis-
     A                                      play subfile":{"fieldName":"71","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"display control record":{"fiel-
     A                                      dName":"71","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"clear subfile":-
     A                                      {"fieldName":"74","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"subfile s-
     A                                      ize":"9","place cursor":"true","hea-
     A                                      der height":"20","row height":"20",-
     A                                      "css class":"subfilegrid","css clas-
     A                                      s 2":"profound-converted","parent t-
     A                                      ab panel":"W2069F03_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","subfile end-
     A                                      ":{"fieldName":"75","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"sortabl-
     A                                      e columns":"true","number of rows":-
     A                                      "9","top":"350px","left":"274px","c-
     A                                      olumn widths":"23,35,502","cursor r-
     A                                      ecord number":{"fieldName":"SFRRN",-
     A                                      "dataLength":"5","decPos":"0","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"units":"","negNum":"-999.00"},"su-
     A                                      bfile record number":{"fieldName":"-
     A                                      #@$2","designValue":"[#@$2]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"true","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","dataLe-
     A                                      ngth":"3","decPos":"0"}},{"id":"btn-
     A                                      Submit","field type":"button","valu-
     A                                      e":"Enter","shortcut key":"Enter","-
     A                                      left":"14px","top":"150px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF03","f-
     A                                      ield type":"button","value":"Exit",-
     A                                      "shortcut key":"F3","left":"14px","-
     A                                      top":"183px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF10","field type":"bu-
     A                                      tton","visibility":{"fieldName":"N0-
     A                                      9 and N40","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"value":"Sear-
     A                                      ch","shortcut key":"F10","left":"14-
     A                                      px","top":"216px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF12","field type-
     A                                      ":"button","value":"Cancel","shortc-
     A                                      ut key":"F12","left":"14px')
     A                                  1  9HTML('","top":"249px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"SFRRN","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"SFRRN",-
     A                                      "designValue":"[SFRRN]","dataType":-
     A                                      "zoned","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"true","curSym":"","units"-
     A                                      :"","negNum":"-999.00","dataLength"-
     A                                      :"5","decPos":"0"},"left":"-30px","-
     A                                      top":"-399px","width":"35px","text -
     A                                      align":"right","css class":"profoun-
     A                                      d-converted","grid":"SCR01S","colum-
     A                                      n":"0"},{"id":"SFSEL","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SFSEL","designValue":"[SFSEL]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase","dataLength":"1"},"text tran-
     A                                      sform":"uppercase","left":"7px","cu-
     A                                      rsor column":"2","top":"1px","curso-
     A                                      r row":"14","width":"8px","css clas-
     A                                      s 3":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"se-
     A                                      t focus":{"fieldName":"N09 and N40"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"read only":{"fieldName":"0-
     A                                      9 or 40","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 4":{"fie-
     A                                      ldName":"09 or 40","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"PR","customFalse":""},"visibil-
     A                                      ity":{"fieldName":"09 or 40","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"hidden","customFalse-
     A                                      ":"visible"},"css class 5":"profoun-
     A                                      d-converted","grid":"SCR01S","colum-
     A                                      n":"0"},{"id":"SFMSG#","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SFMSG#","designValue":"[SFMS-
     A                                      G#]","refField":"A30","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"999.00","numBlank-
     A                                      Fill":"true"},"left":"5px","cursor -
     A                                      column":"5","top":"1px","cursor row-
     A                                      ":"14","width":"22px","description"-
     A                                      :"Subfile Message Number","read onl-
     A                                      y":{"fieldName":"86 or 09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 3":{"fieldName":"86 or 09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"css class 4":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"text align":"right-
     A                                      ","css class 5":"profound-converted-
     A                                      ","grid":"SCR01S","column":"1"},{"i-
     A                                      d":"SFDESC","field type":"output fi-
     A                                      eld","value":{"fieldName":"SFDESC",-
     A                                      "designValue":"[SFDESC]","refField"-
     A                                      :"DS30","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"5px","cursor column"-
     A                                      :"10","top":"1px","cursor row":"14"-
     A                                      ,"description":"Subfile Error Messa-
     A                                      ge Description","css class 2":"prof-
     A                                      ound-converted","grid":"SCR01S","co-
     A                                      lumn":"2"}]}')
     A            #@$2           3S 0H
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCECDS        24A  H
     A            SCMTC          2A  H
     A            SCTSET         3A  H
     A            SFFLD         10A  H
     A            SFREC         10A  H
     A            SFRRN          5S 0H
     A            Q1PGM     R        H      REFFLD(PGM)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDN#     R        H      REFFLD(A50 *LIBL/WREFP)
     A            SCJST     R        H      REFFLD(ST *LIBL/WREFP)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCMSG#    R        H      REFFLD(DPT *LIBL/WREFP)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR01
     A  11 09                               CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "description":"Subfile Control Over-
     A                                      lay Record","overlay":"true","valid-
     A                                       command key":{"fieldName":"*IN11",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      overlay range":"23-23"},"items":[{"-
     A                                      id":"W2069F03_SCR01_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"W2069F03_SCR01_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W2069F03_SCR01_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"W2069F03_SCR01_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"W2069F03_SCR01_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"W2069F03_SCR01_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"W-
     A                                      2069F03_SCR01_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"W2069F03_SCR01_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"W2069F03_SCR01_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToo')
     A                                  1  4HTML('lbarMessages","background ima-
     A                                      ge":{"fieldName":"MsgIcnURL","dataL-
     A                                      ength":"128","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"W2069F03_SCR0-
     A                                      1_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"W2069F03_SCR01_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"W2069F03_SCR01_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":"Tab 1-
     A                                      ","active tab":"0","left":"250px","-
     A                                      top":"70px","width":"970px","height-
     A                                      ":"657px","z index":"8","locked in -
     A                                      place":"true","css class":"tab-pane-
     A                                      l","css class 2":"stationary"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W2069F03_SCR01_B-
     A                                      tnHiddenSave","value":"btnSave","to-
     A                                      p":"100px","response":{"fieldName":-
     A                                      "btnSave","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"W2069F03_SCR01_fke-
     A                                      yMenu","field type":"menu","left":"-
     A                                      10px","top":"120px","height":"350px-
     A                                      ","width":"230px","hover background-
     A                                       color":"#9AAA61","hover text color-
     A                                      ":"#FFFFFF","border color":"#4C6106-
     A                                      ","menu option indent":"10px","back-
     A                                      ground color":"#758B27","css class"-
     A                                      :"action-menu","css class 2":"stati-
     A                                      onary","z index":"101"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W2069F03_SCR01_BtnHidde-
     A                                      nRefresh","value":"btnRefresh","top-
     A                                      ":"125px","response":{"fieldName":"-
     A                                      btnRefresh","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W2069F03_SCR01_BtnHiddenSearch","va-
     A                                      lue":"btnSearch","top":"150px","res-
     A                                      ponse":{"fieldName":"btnSearch","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W2069F03_SCR01_-
     A                                      BtnHiddenDiaryItems","value":"btnDi-
     A                                      ary","top":"175px","response":{"fie-
     A                                      ldName":"btnDiary","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W2069F03_SCR01_BtnHiddenSyst-
     A                                      emMessages","value":"btnMessage","t-
     A                                      op":"200px","response":{"fieldName"-
     A                                      :"btnMessage","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W2069F03_SCR01_BtnHiddenWorkSubmi-
     A                                      tJob","value":"btnWrksbmjob","top":-
     A                                      "225px","response":{"fieldName":"bt-
     A                                      nWrkJob","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W20-
     A                                      69F03_SCR01_BtnHiddenWorkPrinterOut-
     A                                      put","value":"btnWrkprtout","top":"-
     A                                      250px","response":{"fieldName":"btn-
     A                                      WrkPrnt","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W20-
     A                                      69F03_SCR01_BtnHiddenImageQueue","v-
     A                                      alue":"btnImgQue","top":"275px","re-
     A                                      sponse":{"fieldName":"btnImgQue","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W2069F03_SCR01-
     A                                      _BtnHiddenHelp","value":"b')
     A                                  1  5HTML('tnHelp","top":"300px","respon-
     A                                      se":{"fieldName":"btnHelp","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant14","field type":"output fie-
     A                                      ld","value":" ","css class":"consta-
     A                                      nt","visibility":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"351px","cursor c-
     A                                      olumn":"12","top":"550px","cursor r-
     A                                      ow":"23","css class 2":"BLU","paren-
     A                                      t tab panel":"W2069F03_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant12","field type":"output fiel-
     A                                      d","value":" ","css class":"constan-
     A                                      t","visibility":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"351px","cursor c-
     A                                      olumn":"12","top":"550px","cursor r-
     A                                      ow":"23","css class 2":"BLU","paren-
     A                                      t tab panel":"W2069F03_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant13","field type":"output fiel-
     A                                      d","value":" ","css class":"constan-
     A                                      t","visibility":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"442px","cursor c-
     A                                      olumn":"25","top":"550px","cursor r-
     A                                      ow":"23","css class 2":"BLU","paren-
     A                                      t tab panel":"W2069F03_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"bt-
     A                                      nSubmit","field type":"button","val-
     A                                      ue":"Enter","shortcut key":"Enter",-
     A                                      "left":"14px","top":"150px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
