     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(01)
     A*PUI                                  SFLDEFINE(02)
     A          R SCR01S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A  05 07 08  QPUI000001     1A  O  2  2
     A            SCDATA         5A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCKEY     R        H      REFFLD(KEY)
     A            SCSTAT    R        H      REFFLD(FLAG)
     A            SCZIP     R        H      REFFLD(ZIP1)
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  01 02 03
     A  04 22 23
     A  24 25 26                            CA01(01 'Response Indicator *IN01')
     A  27 28 29
     A  91 92 93
     A  94 95 06                            CA02(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR01S    5    RS-
     A                                      FLDSP    0    E1    3     04RSFLDSP-
     A                                      CTL 0    E1    3    N03RSFLCLR    0-
     A                                          E1    3     03RSFLPAG    1    C-
     A                                      2    12 RSFLSIZ    1    C2    13 1 -
     A                                         RSFLNXTCHG 0    E1    3     087 -
     A                                         ROVERLAY   0     RROWS      2   -
     A                                       C1    1C2    20 RSFLMSGID  4    C7-
     A                                          CPD6A81C7    QCPFMSGC5    *LIBL-
     A                                      C0    E1    3     92RSFLMSGID  4   -
     A                                       C7    CPD6A7CC7    QCPFMSGC5    *L-
     A                                      IBLC0    E1    3     93RERRMSGID  5-
     A                                          C6    SCUSERC7    CPF5203C7    -
     A                                      QCPFMSGC5    *LIBLC0    E1    3    -
     A                                       91RERRMSGID  5    C6    SCUSERC7  -
     A                                        CPF5204C7    QCPFMSGC5    *LIBLC0-
     A                                          E1    3     94FSCPST1    INPUTO-
     A                                      NLY 0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","error message id-
     A                                      ":"CPD6A81","error message file":"Q-
     A                                      CPFMSG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"92","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"2 messages"-
     A                                      ,"error message id 2":"CPD6A7C","er-
     A                                      ror message file 2":"QCPFMSG","erro-
     A                                      r message library 2":"*LIBL","error-
     A                                       condition 2":{"fieldName":"93","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"ov-
     A                                      erlay range":"1-20"},"items":[{"id"-
     A                                      :"SCPST6","field type":"output fiel-
     A                                      d","visibility":{"fieldName":"26","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"value":{"fieldName":"SCP-
     A                                      ST6","designValue":"[SCPST6]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none","data-
     A                                      Length":"1"},"left":"0px","top":"-3-
     A                                      0px","css class":"profound-converte-
     A                                      d"},{"id":"SCPST7","field type":"ou-
     A                                      tput field","visibility":{"fieldNam-
     A                                      e":"27","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"value":{"fieldN-
     A                                      ame":"SCPST7","designValue":"[SCPST-
     A                                      7]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"no-
     A                                      ne","dataLength":"1"},"left":"0px",-
     A                                      "top":"-30px","css class":"profound-
     A                                      -converted"},{"id":"SCPST9","field -
     A                                      type":"output field","visibility":{-
     A                                      "fieldName":"29","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"value"-
     A                                      :{"fieldName":"SCPST9","designValue-
     A                                      ":"[SCPST9]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"none","dataLength":"1"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SCPST8-
     A                                      ","field type":"output field","visi-
     A                                      bility":{"fieldName":"28","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"value":{"fieldName":"SCPST8","de-
     A                                      signValue":"[SCPST8]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "1"},"left":"0px","top":"-30px","cs-
     A                                      s class":"profound-converted"},{"id-
     A                                      ":"SCOPL2","field type":"output fie-
     A                                      ld","visibility":"hidden","value":{-
     A                                      "fieldName":"SCOPL2","designValue":-
     A                                      "[SCOPL2]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"none","dataLengt')
     A                                  1  2HTML('h":"76"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"SCPST3","field type":"-
     A                                      output field","visibility":{"fieldN-
     A                                      ame":"23","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"value":{"fiel-
     A                                      dName":"SCPST3","designValue":"[SCP-
     A                                      ST3]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none","dataLength":"1"},"left":"0px-
     A                                      ","top":"-30px","css class":"profou-
     A                                      nd-converted"},{"id":"SCPST5","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :{"fieldName":"25","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"valu-
     A                                      e":{"fieldName":"SCPST5","designVal-
     A                                      ue":"[SCPST5]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none","dataLength":"1"},"l-
     A                                      eft":"0px","top":"-30px","css class-
     A                                      ":"profound-converted"},{"id":"SFLM-
     A                                      OD","field type":"output field","vi-
     A                                      sibility":"hidden","value":{"fieldN-
     A                                      ame":"SFLMOD","designValue":"[SFLMO-
     A                                      D]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"no-
     A                                      ne","dataLength":"1"},"left":"0px",-
     A                                      "top":"-30px","css class":"profound-
     A                                      -converted"},{"id":"SCRRN1","field -
     A                                      type":"output field","visibility":"-
     A                                      hidden","value":{"fieldName":"SCRRN-
     A                                      1","designValue":"[SCRRN1]","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"true","curSym":"","un-
     A                                      its":"","negNum":"-999.00","dataLen-
     A                                      gth":"4","decPos":"0"},"left":"0px"-
     A                                      ,"top":"-30px","width":"28px","text-
     A                                       align":"right","css class":"profou-
     A                                      nd-converted"},{"id":"SCPST2","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :{"fieldName":"22","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"valu-
     A                                      e":{"fieldName":"SCPST2","designVal-
     A                                      ue":"[SCPST2]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none","dataLength":"1"},"l-
     A                                      eft":"0px","top":"-30px","css class-
     A                                      ":"profound-converted"},{"id":"SCPS-
     A                                      T4","field type":"output field","vi-
     A                                      sibility":{"fieldName":"24","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"value":{"fieldName":"SCPST4","-
     A                                      designValue":"[SCPST4]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"none","dataLength-
     A                                      ":"1"},"left":"0px","top":"-30px","-
     A                                      css class":"profound-converted"},{"-
     A                                      id":"W2216F_SCR01C_avKeys","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"AV_KEYS","dataLength":"1134"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill"')
     A                                  1  2HTML(':"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"W2216F_SCR01C_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"W2216F_SCR01C_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"W2-
     A                                      216F_SCR01C_ButtonBar","top":"35px"-
     A                                      ,"left":"1036px","width":"187px","h-
     A                                      eight":"28px","css class":"stationa-
     A                                      ry","visibility":"hidden","locked i-
     A                                      n place":"true"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1040px","id":"W2216F_SCR01C_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"W2216F_SC-
     A                                      R01C_BtnRefresh","tool tip":"Refres-
     A                                      h","onclick":"SystemToolbarRefresh"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/refresh-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":')
     A                                  1  2HTML('"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1092px","id":"W221-
     A                                      6F_SCR01C_BtnSearch","tool tip":"Se-
     A                                      arch","onclick":"SystemToolbarSearc-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/searc-
     A                                      h.png'')"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      18px","id":"W2216F_SCR01C_BtnDiaryI-
     A                                      tems","tool tip":"Diary/Work Items -
     A                                      - IDARTS","onclick":"SystemToolbarD-
     A                                      iary","background image":{"fieldNam-
     A                                      e":"DryIcnURL","dataLength":"128","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1144px-
     A                                      ","id":"W2216F_SCR01C_BtnSystemMess-
     A                                      ages","tool tip":"System Messages",-
     A                                      "onclick":"SystemToolbarMessages","-
     A                                      background image":{"fieldName":"Msg-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1196px","id":-
     A                                      "W2216F_SCR01C_BtnHelp","tool tip":-
     A                                      "Help","onclick":"SystemToolbarHelp-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/help.p-
     A                                      ng'')"},{"id":"W2216F_SCR01C_ImgSys-
     A                                      ToolBottom","field type":"image","i-
     A                                      mage source":"/profoundui/userdata/-
     A                                      images/systool/butbarbot.png","left-
     A                                      ":"1036px","top":"64px","width":"18-
     A                                      7px","locked in place":"true","css -
     A                                      class":"stationary","visibility":"h-
     A                                      idden"},{"id":"W2216F_SCR01C_MainTa-
     A                                      bPanel","field type":"tab panel","t-
     A                                      ab panel style":"Transform","tab na-
     A                                      mes":{"fieldName":"SCPRDS","designV-
     A                                      alue":"[SCPRDS]","refField":"NAME",-
     A                                      "dataType":"reference')
     A                                  1  2HTML('","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"active -
     A                                      tab":"0","left":"250px","top":"70px-
     A                                      ","width":"970px","height":"657px",-
     A                                      "z index":"8","locked in place":"tr-
     A                                      ue","css class":"tab-panel","css cl-
     A                                      ass 2":"stationary"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W2216F_SCR01C_BtnHiddenSav-
     A                                      e","value":"btnSave","top":"100px",-
     A                                      "response":{"fieldName":"btnSave","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"SCUSER","field type":"output -
     A                                      field","value":{"fieldName":"SCUSER-
     A                                      ","designValue":"[SCUSER]","refFiel-
     A                                      d":"USER","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"281px","cursor col-
     A                                      umn":"2","top":"110px","cursor row"-
     A                                      :"1","css class 2":"top-line","erro-
     A                                      r message id":"CPF5203","error mess-
     A                                      age file":"QCPFMSG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"91","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "2 messages","error message id 2":"-
     A                                      CPF5204","error message file 2":"QC-
     A                                      PFMSG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"94","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"parent tab panel":"W2216F-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"SCCONM","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCCONM","designValue":"[SCCONM]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"414px","curs-
     A                                      or column":"21","top":"110px","curs-
     A                                      or row":"1","css class 2":"top-line-
     A                                      ","css class 3":"HI","parent tab pa-
     A                                      nel":"W2216F_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 4":"prof-
     A                                      ound-converted"},{"id":"constant1",-
     A                                      "field type":"output field","left":-
     A                                      "778px","cursor column":"73","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                      ":"top-line","value":"js: currentDa-
     A                                      te()","css class 2":"output-field",-
     A                                      "parent tab panel":"W2216F_SCR01C_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"W2216F_SCR01C_fkeyMenu","field t-
     A                                      ype":"menu","left":"10px","top":"12-
     A                                      0px","height":"350px","width":"230p-
     A                                      x","hover background color":"#9AAA6-
     A                                      1","hover text color":"#FFFFFF","bo-
     A                                      rder color":"#4C6106","menu option -
     A                                      indent":"10px","background color":"-
     A                                      #758B27","css class":')
     A                                  1  2HTML('"action-menu","css class 2":"-
     A                                      stationary","z index":"101"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W2216F_SCR01C_BtnH-
     A                                      iddenRefresh","value":"btnRefresh",-
     A                                      "top":"125px","response":{"fieldNam-
     A                                      e":"btnRefresh","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"Q1PGM","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"Q1PGM","designValue":"[Q1-
     A                                      PGM]","refField":"DS10","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"281p-
     A                                      x","cursor column":"2","top":"130px-
     A                                      ","cursor row":"2","parent tab pane-
     A                                      l":"W2216F_SCR01C_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCPRDS","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCPRDS","designValue":"[S-
     A                                      CPRDS]","refField":"NAME","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"41-
     A                                      4px","cursor column":"21","top":"13-
     A                                      0px","cursor row":"2","css class 2"-
     A                                      :"HI","parent tab panel":"W2216F_SC-
     A                                      R01C_MainTabPanel","parent tab":"0"-
     A                                      ,"visibility":"hidden","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant2","field type":"output field",-
     A                                      "value":"SCR01","css class":"consta-
     A                                      nt","left":"799px","cursor column":-
     A                                      "76","top":"130px","cursor row":"2"-
     A                                      ,"parent tab panel":"W2216F_SCR01C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W2216F_SCR01C_B-
     A                                      tnHiddenSearch","value":"btnSearch"-
     A                                      ,"top":"150px","response":{"fieldNa-
     A                                      me":"btnSearch","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant3","-
     A                                      field type":"output field","value":-
     A                                      "State:","css class":"constant","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"170px","cursor row":"4","parent-
     A                                       tab panel":"W2216F_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCPS-
     A                                      TA","field type":"output field","va-
     A                                      lue":{"fieldName":"SCPSTA","designV-
     A                                      alue":"[SCPSTA]","refField":"ST","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"330px","cursor column":"9","to-
     A                                      p":"170px","cursor row":"4","parent-
     A                                       tab panel":"W2216F_SCR01C_MainTabP-
     A                                      anel","parent tab":"0')
     A                                  1  2HTML('","css class 2":"profound-con-
     A                                      verted"},{"id":"constant4","field t-
     A                                      ype":"output field","value":"County-
     A                                      :","css class":"constant","left":"3-
     A                                      65px","cursor column":"14","top":"1-
     A                                      70px","cursor row":"4","parent tab -
     A                                      panel":"W2216F_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCPCTY","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCPCTY","designValue"-
     A                                      :"[SCPCTY]","refField":"CODE","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"421px","cursor column":"22","top"-
     A                                      :"170px","cursor row":"4","parent t-
     A                                      ab panel":"W2216F_SCR01C_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPDES-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCPDES","designVal-
     A                                      ue":"[SCPDES]","refField":"DS30","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"449px","cursor column":"26","t-
     A                                      op":"170px","cursor row":"4","paren-
     A                                      t tab panel":"W2216F_SCR01C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant5","field type":"output field"-
     A                                      ,"value":"Status:","css class":"con-
     A                                      stant","left":"764px","cursor colum-
     A                                      n":"71","top":"170px","cursor row":-
     A                                      "4","parent tab panel":"W2216F_SCR0-
     A                                      1C_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCCSTS","field type":"output-
     A                                       field","value":{"fieldName":"SCCST-
     A                                      S","designValue":"[SCCSTS]","refFie-
     A                                      ld":"STAT","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"820px","cursor co-
     A                                      lumn":"79","top":"170px","cursor ro-
     A                                      w":"4","parent tab panel":"W2216F_S-
     A                                      CR01C_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W2216F_SC-
     A                                      R01C_BtnHiddenDiaryItems","value":"-
     A                                      btnDiary","top":"175px","response":-
     A                                      {"fieldName":"btnDiary","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W2216F_SCR01C_BtnHidden-
     A                                      SystemMessages","value":"btnMessage-
     A                                      ","top":"200px","response":{"fieldN-
     A                                      ame":"btnMessage","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"i')
     A                                  1  2HTML('d":"constant6","field type":"-
     A                                      output field","value":"Position to -
     A                                      . . .","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"210px","cursor row":"6","parent t-
     A                                      ab panel":"W2216F_SCR01C_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPST1-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      input only":"true","value":{"fieldN-
     A                                      ame":"SCPST1","designValue":"[SCPST-
     A                                      1]","refField":"DS5","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"4-
     A                                      14px","cursor column":"21","top":"2-
     A                                      10px","cursor row":"6","width":"36p-
     A                                      x","set focus":{"fieldName":"N06","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"parent tab panel":"W2216F_SC-
     A                                      R01C_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W2216F_SCR-
     A                                      01C_BtnHiddenWorkSubmitJob","value"-
     A                                      :"btnWrksbmjob","top":"225px","resp-
     A                                      onse":{"fieldName":"btnWrkJob","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant7","field type":"output -
     A                                      field","value":"Type options, press-
     A                                       Enter.","css class":"constant","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"250px","cursor row":"8","css cl-
     A                                      ass 2":"BLU","parent tab panel":"W2-
     A                                      216F_SCR01C_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W22-
     A                                      16F_SCR01C_BtnHiddenWorkPrinterOutp-
     A                                      ut","value":"btnWrkprtout","top":"2-
     A                                      50px","response":{"fieldName":"btnW-
     A                                      rkPrnt","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"SCOPL1","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCOPL1","designValue":"[SCOPL1]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      ,"dataLength":"76"},"left":"295px",-
     A                                      "cursor column":"4","top":"270px","-
     A                                      cursor row":"9","css class":"BLU","-
     A                                      parent tab panel":"W2216F_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W2216F_SCR01C_Btn-
     A                                      HiddenImageQueue","value":"btnImgQu-
     A                                      e","top":"275px","res')
     A                                  1  2HTML('ponse":{"fieldName":"btnImgQu-
     A                                      e","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W2216F_SC-
     A                                      R01C_BtnHiddenHelp","value":"btnHel-
     A                                      p","top":"300px","response":{"field-
     A                                      Name":"btnHelp","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant8","-
     A                                      field type":"output field","value":-
     A                                      "Opt","css class":"constant","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "310px","cursor row":"11","css clas-
     A                                      s 2":"HI","parent tab panel":"W2216-
     A                                      F_SCR01C_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted","css class 4":"subfile-heading-
     A                                      "},{"id":"SCHDL1","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      HDL1","designValue":"[SCHDL1]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"74"},"left":"309px","curs-
     A                                      or column":"6","top":"310px","curso-
     A                                      r row":"11","css class":"HI","paren-
     A                                      t tab panel":"W2216F_SCR01C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted","css class -
     A                                      3":"subfile-heading"},{"id":"SCR01S-
     A                                      ","field type":"grid","number of co-
     A                                      lumns":"3","record format name":"SC-
     A                                      R01S","subfile next changed":{"fiel-
     A                                      dName":"08","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"display subfile-
     A                                      ":{"fieldName":"04","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"display-
     A                                       control record":{"fieldName":"N03"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"clear subfile":{"fieldName-
     A                                      ":"03","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"subfile size":"13","-
     A                                      place cursor":"true","header height-
     A                                      ":"20","row height":"20","css class-
     A                                      ":"subfilegrid","css class 2":"prof-
     A                                      ound-converted","parent tab panel":-
     A                                      "W2216F_SCR01C_MainTabPanel","paren-
     A                                      t tab":"0","subfile end":{"fieldNam-
     A                                      e":"95","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"page down response"-
     A                                      :{"fieldName":"*IN01","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"page up respo-
     A                                      nse":{"fieldName":"*IN02","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"show pagi-
     A                                      ng controls":"true","scrollbar":"no-
     A                                      ne","number of rows":"13","top":"31-
     A                                      0px","left":"275px","column widths"-
     A                                      :"28,63,467","return mode":{"fieldN-
     A                                      ame":"SFLMOD","dataLength":"1","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false",')
     A                                  1  2HTML('"trimTrailing":"true","textTr-
     A                                      ansform":"none"},"subfile record nu-
     A                                      mber":{"fieldName":"SCRRN1","design-
     A                                      Value":"[SCRRN1]","dataType":"zoned-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"true","zeroFil-
     A                                      l":"true","curSym":"","units":"","n-
     A                                      egNum":"-999.00","dataLength":"4","-
     A                                      decPos":"0"},"height":"260px","widt-
     A                                      h":"559px"},{"id":"btnSubmit","fiel-
     A                                      d type":"button","value":"Enter","s-
     A                                      hortcut key":"Enter","left":"14px",-
     A                                      "top":"150px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF03","field type":"b-
     A                                      utton","value":"F3","shortcut key":-
     A                                      "F3","left":"14px","top":"183px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnCF-
     A                                      05","field type":"button","value":"-
     A                                      F5","shortcut key":"F5","left":"14p-
     A                                      x","top":"216px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnCF06","field type"-
     A                                      :"button","value":"F6","shortcut ke-
     A                                      y":"F6","left":"14px","top":"249px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF11","field type":"button","value-
     A                                      ":"F11","shortcut key":"F11","left"-
     A                                      :"14px","top":"282px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF12","field -
     A                                      type":"button","value":"Cancel","sh-
     A                                      ortcut key":"F12","left":"14px","to-
     A                                      p":"315px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF17","field type":"butt-
     A                                      on","value":"F17","shortcut key":"F-
     A                                      17","left":"14px","top":"348px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF2-
     A                                      3","field type":"button","value":"F-
     A                                      23","shortcut key":"F23","left":"14-
     A                                      px","top":"381px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF24","field type-
     A                                      ":"button","value":"F24","shortcut -
     A                                      key":"F24","left":"14px","top":"414-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "SCDBRR","field type":"output field-
     A                                      ","visibility":"hidden","value":{"f-
     A                                      ieldName":"SCDBRR","designValue":"[-
     A                                      SCDBRR]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","dataLength":"9","decPos":"-
     A                                      0"},"left":"-58px","top":"-359px","-
     A                                      width":"63px","text align":"right",-
     A                                      "css class":"profound-converted","g-
     A                                      rid":"SCR01S","column')
     A                                  1  2HTML('":"0"},{"id":"SCKEY","field t-
     A                                      ype":"output field","visibility":"h-
     A                                      idden","value":{"fieldName":"SCKEY"-
     A                                      ,"designValue":"[SCKEY]","refField"-
     A                                      :"KEY","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none"},"left":"-45px","top":"-
     A                                      -359px","css class":"profound-conve-
     A                                      rted","grid":"SCR01S","column":"0"}-
     A                                      ,{"id":"SCZIP","field type":"output-
     A                                       field","visibility":"hidden","valu-
     A                                      e":{"fieldName":"SCZIP","designValu-
     A                                      e":"[SCZIP]","refField":"ZIP1","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"true","curSym"-
     A                                      :"","units":"","negNum":"-999.00"},-
     A                                      "left":"-30px","top":"-359px","widt-
     A                                      h":"35px","text align":"right","css-
     A                                       class":"profound-converted","grid"-
     A                                      :"SCR01S","column":"0"},{"id":"SCSE-
     A                                      L","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCSEL","desig-
     A                                      nValue":"[SCSEL]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase","dataLength"-
     A                                      :"2"},"text transform":"uppercase",-
     A                                      "left":"5px","cursor column":"2","t-
     A                                      op":"1px","cursor row":"12","width"-
     A                                      :"15px","set focus":{"fieldName":"0-
     A                                      7","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 3":{"fieldName-
     A                                      ":"05","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"RI","cu-
     A                                      stomFalse":""},"description":"Selec-
     A                                      tion Field","css class 4":"profound-
     A                                      -converted","grid":"SCR01S","column-
     A                                      ":"0"},{"id":"SCDATA","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCDATA","designValue":"[SCDATA]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      ,"dataLength":"5"},"css class":"out-
     A                                      put-field","left":"5px","cursor col-
     A                                      umn":"6","top":"1px","cursor row":"-
     A                                      12","css class 2":"profound-convert-
     A                                      ed","grid":"SCR01S","column":"1"},{-
     A                                      "id":"SCSTAT","field type":"output -
     A                                      field","value":{"fieldName":"SCSTAT-
     A                                      ","designValue":"[SCSTAT]","refFiel-
     A                                      d":"FLAG","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"5px","cursor colum-
     A                                      n":"15","top":"1px","cursor row":"1-
     A                                      2","css class 2":"profound-converte-
     A                                      d","grid":"SCR01S","column":"2"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCHDL1        74A  H
     A            SCOPL1        76A  H
     A            SCOPL2        76A  H
     A            SCPST2         1A  H
     A            SCPST3         1A  H
     A            SCPST4         1A  H
     A            SCPST5         1A  H
     A            SCPST6         1A  H
     A            SCPST7         1A  H
     A            SCPST8         1A  H
     A            SCPST9         1A  H
     A            SCRRN1         4S 0H
     A            SFLMOD         1A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCSTS    R        H      REFFLD(STAT)
     A            SCPCTY    R        H      REFFLD(CODE)
     A            SCPDES    R        H      REFFLD(DS30)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPST1    R        H      REFFLD(DS5)
     A            SCPSTA    R        H      REFFLD(ST)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR01
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    22C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","overlay range":"2-
     A                                      2-23"},"items":[{"id":"W2216F_SCR01-
     A                                      _avKeys","field type":"output field-
     A                                      ","value":{"fieldName":"AV_KEYS","d-
     A                                      ataLength":"1134","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[AV_KEYS]"},"left":"0px","top":-
     A                                      "0px","visibility":"hidden"},{"id":-
     A                                      "W2216F_SCR01_action","field type":-
     A                                      "html container","white space":"nor-
     A                                      mal","left":"0px","top":"10px","wid-
     A                                      th":"230px","css class":"action-pan-
     A                                      el-converted","height":"700px","htm-
     A                                      l":"<div class=\"top\"></div><div c-
     A                                      lass=\"imagetop\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_top.png\"-
     A                                       /></div><div class=\"menulinks\"><-
     A                                      /div><div class=\"imagebottom\"><im-
     A                                      g src=\"/profoundui/userdata/images-
     A                                      /bar_bottom.png\" /></div><div clas-
     A                                      s=\"bottom\"></div>"},{"field type"-
     A                                      :"icon menu button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"32px","z index":"20","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1170px","id":"W2216F_SCR01_BtnIc-
     A                                      onMenuSystemTools","tool tip":"Syst-
     A                                      em Tools","icon source":"/profoundu-
     A                                      i/userdata/images/systool/systools.-
     A                                      png","data function":"SystemToolbar-
     A                                      Systools","show down arrow":"Yes"},-
     A                                      {"field type":"panel","panel style"-
     A                                      :"TransformButtonBar","id":"W2216F_-
     A                                      SCR01_ButtonBar","top":"35px","left-
     A                                      ":"1036px","width":"187px","height"-
     A                                      :"28px","css class":"stationary","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"10-
     A                                      40px","id":"W2216F_SCR01_BtnSave","-
     A                                      tool tip":"Save","onclick":"SystemT-
     A                                      oolbarSave","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/save.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1066px","id":"W2')
     A                                  1  2HTML('216F_SCR01_BtnRefresh","tool -
     A                                      tip":"Refresh","onclick":"SystemToo-
     A                                      lbarRefresh","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/refresh.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1092px","id":"W2216F_SCR01-
     A                                      _BtnSearch","tool tip":"Search","on-
     A                                      click":"SystemToolbarSearch","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/search.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1118px","id-
     A                                      ":"W2216F_SCR01_BtnDiaryItems","too-
     A                                      l tip":"Diary/Work Items - IDARTS",-
     A                                      "onclick":"SystemToolbarDiary","bac-
     A                                      kground image":{"fieldName":"DryIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1144px","id":"W2-
     A                                      216F_SCR01_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"W2216F_SCR-
     A                                      01_BtnHelp","tool tip":"Help","oncl-
     A                                      ick":"SystemToolbarHelp","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/help.png'')"},{"id-
     A                                      ":"W2216F_SCR01_ImgSy')
     A                                  1  2HTML('sToolBottom","field type":"im-
     A                                      age","image source":"/profoundui/us-
     A                                      erdata/images/systool/butbarbot.png-
     A                                      ","left":"1036px","top":"64px","wid-
     A                                      th":"187px","locked in place":"true-
     A                                      ","css class":"stationary","visibil-
     A                                      ity":"hidden"},{"id":"W2216F_SCR01_-
     A                                      MainTabPanel","field type":"tab pan-
     A                                      el","tab panel style":"Transform","-
     A                                      tab names":"Tab 1","active tab":"0"-
     A                                      ,"left":"250px","top":"70px","width-
     A                                      ":"970px","height":"657px","z index-
     A                                      ":"8","locked in place":"true","css-
     A                                       class":"tab-panel","css class 2":"-
     A                                      stationary"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W2216F_SCR01_BtnHiddenSave","value-
     A                                      ":"btnSave","top":"100px","response-
     A                                      ":{"fieldName":"btnSave","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"W22-
     A                                      16F_SCR01_fkeyMenu","field type":"m-
     A                                      enu","left":"10px","top":"120px","h-
     A                                      eight":"350px","width":"230px","hov-
     A                                      er background color":"#9AAA61","hov-
     A                                      er text color":"#FFFFFF","border co-
     A                                      lor":"#4C6106","menu option indent"-
     A                                      :"10px","background color":"#758B27-
     A                                      ","css class":"action-menu","css cl-
     A                                      ass 2":"stationary","z index":"101"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W2216F_SCR-
     A                                      01_BtnHiddenRefresh","value":"btnRe-
     A                                      fresh","top":"125px","response":{"f-
     A                                      ieldName":"btnRefresh","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W2216F_SCR01_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W2216F-
     A                                      _SCR01_BtnHiddenDiaryItems","value"-
     A                                      :"btnDiary","top":"175px","response-
     A                                      ":{"fieldName":"btnDiary","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"W2216F_SCR01_BtnHidde-
     A                                      nSystemMessages","value":"btnMessag-
     A                                      e","top":"200px","response":{"field-
     A                                      Name":"btnMessage","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"')
     A                                  1  2HTML('field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W2216F_S-
     A                                      CR01_BtnHiddenWorkSubmitJob","value-
     A                                      ":"btnWrksbmjob","top":"225px","res-
     A                                      ponse":{"fieldName":"btnWrkJob","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W2216F_SCR01_Bt-
     A                                      nHiddenWorkPrinterOutput","value":"-
     A                                      btnWrkprtout","top":"250px","respon-
     A                                      se":{"fieldName":"btnWrkPrnt","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W2216F_SCR01_BtnH-
     A                                      iddenImageQueue","value":"btnImgQue-
     A                                      ","top":"275px","response":{"fieldN-
     A                                      ame":"btnImgQue","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W2216F_SCR01_BtnHiddenHelp","v-
     A                                      alue":"btnHelp","top":"300px","resp-
     A                                      onse":{"fieldName":"btnHelp","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCFKL1","field type":"output field-
     A                                      ","value":{"fieldName":"SCFKL1","de-
     A                                      signValue":"[SCFKL1]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "78"},"left":"281px","cursor column-
     A                                      ":"2","top":"530px","cursor row":"2-
     A                                      2","css class":"BLU","parent tab pa-
     A                                      nel":"W2216F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCFKL2","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      FKL2","designValue":"[SCFKL2]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"78"},"left":"281px","curs-
     A                                      or column":"2","top":"550px","curso-
     A                                      r row":"23","css class":"BLU","pare-
     A                                      nt tab panel":"W2216F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","visibility-
     A                                      ":"hidden","css class 2":"profound--
     A                                      converted"},{"id":"btnSubmit","fiel-
     A                                      d type":"button","value":"Enter","s-
     A                                      hortcut key":"Enter","left":"14px",-
     A                                      "top":"150px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnPAGEDOWN","field type-
     A                                      ":"button","value":"Page Down","sho-
     A                                      rtcut key":"PageDown"')
     A                                  1  2HTML(',"response":{"fieldName":"*IN-
     A                                      01","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"left":"14px","top":"183px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnPAGE-
     A                                      UP","field type":"button","value":"-
     A                                      Page Up","shortcut key":"PageUp","r-
     A                                      esponse":{"fieldName":"*IN02","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"left"-
     A                                      :"14px","top":"216px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFKL1        78A  H
     A            SCFKL2        78A  H
     A          R SCR02S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI000001     1A  O  2  2
     A            SCDATA         5A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCSF1R         4S 0H
     A            SCSTAT    R        H      REFFLD(FLAG)
     A          R QSFLCTL002                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  01 02 13
     A  14 15                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR02S    5    RS-
     A                                      FLDSP    0    E1    3     14RSFLDSP-
     A                                      CTL 0    E1    3    N13RSFLCLR    0-
     A                                          E1    3     13RSFLPAG    1    C-
     A                                      1    9 RSFLSIZ    1    C2    11 1  -
     A                                        RSFLNXTCHG 0     2    ROVERLAY   -
     A                                      0     RROWS      2    C1    1C2    -
     A                                      20 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","overlay range":"-
     A                                      1-20"},"items":[{"id":"SCRRN2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      RRN2","designValue":"[SCRRN2]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"4","decPos":"0"},"left":"0-
     A                                      px","top":"-30px","width":"28px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted"},{"id":"W2216F_SCR-
     A                                      02C_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"W2216F_SCR02C_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"W2216F_SCR02C_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"W2-
     A                                      216F_SCR02C_ButtonBar","top":"35px"-
     A                                      ,"left":"1036px","width":"187px","h-
     A                                      eight":"28px","css class":"stationa-
     A                                      ry","visibility":"hidden","locked i-
     A                                      n place":"true"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1040px","id":"W2216F_SCR02C_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui')
     A                                  1  2HTML('/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"W2216F_SCR02C_BtnRefresh-
     A                                      ","tool tip":"Refresh","onclick":"S-
     A                                      ystemToolbarRefresh","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/refresh.png'')"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1092px","id":"W221-
     A                                      6F_SCR02C_BtnSearch","tool tip":"Se-
     A                                      arch","onclick":"SystemToolbarSearc-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/searc-
     A                                      h.png'')"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      18px","id":"W2216F_SCR02C_BtnDiaryI-
     A                                      tems","tool tip":"Diary/Work Items -
     A                                      - IDARTS","onclick":"SystemToolbarD-
     A                                      iary","background image":{"fieldNam-
     A                                      e":"DryIcnURL","dataLength":"128","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1144px-
     A                                      ","id":"W2216F_SCR02C_BtnSystemMess-
     A                                      ages","tool tip":"System Messages",-
     A                                      "onclick":"SystemToolbarMessages","-
     A                                      background image":{"fieldName":"Msg-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","back')
     A                                  1  2HTML('ground repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1196px","id":"W2216F_SCR02C_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      W2216F_SCR02C_ImgSysToolBottom","fi-
     A                                      eld type":"image","image source":"/-
     A                                      profoundui/userdata/images/systool/-
     A                                      butbarbot.png","left":"1036px","top-
     A                                      ":"64px","width":"187px","locked in-
     A                                       place":"true","css class":"station-
     A                                      ary","visibility":"hidden"},{"id":"-
     A                                      W2216F_SCR02C_MainTabPanel","field -
     A                                      type":"tab panel","tab panel style"-
     A                                      :"Transform","tab names":{"fieldNam-
     A                                      e":"SCPRD2","designValue":"[SCPRD2]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"active -
     A                                      tab":"0","left":"250px","top":"70px-
     A                                      ","width":"970px","height":"657px",-
     A                                      "z index":"8","locked in place":"tr-
     A                                      ue","css class":"tab-panel","css cl-
     A                                      ass 2":"stationary"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W2216F_SCR02C_BtnHiddenSav-
     A                                      e","value":"btnSave","top":"100px",-
     A                                      "response":{"fieldName":"btnSave","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"SCR02C_SCUSER","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCUSER","designValue":"[SCUSER]","-
     A                                      refField":"USER","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class 2":"top-line-
     A                                      ","parent tab panel":"W2216F_SCR02C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"SCR02C_SCCONM","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCCONM","designValue":"[SCCONM]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"414px","curs-
     A                                      or column":"21","top":"110px","curs-
     A                                      or row":"1","css class 2":"top-line-
     A                                      ","css class 3":"HI","parent tab pa-
     A                                      nel":"W2216F_SCR02C_MainTabPanel","-
     A                                      parent tab":"0","css class 4":"prof-
     A                                      ound-converted"},{"id":"constant9",-
     A                                      "field type":"output field","left":-
     A                                      "778px","cursor column":"73","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                      ":"top-line","value":"js: currentDa-
     A                                      te()","css class 2":"')
     A                                  1  2HTML('output-field","parent tab pan-
     A                                      el":"W2216F_SCR02C_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"W2216F_SCR02-
     A                                      C_fkeyMenu","field type":"menu","le-
     A                                      ft":"10px","top":"120px","height":"-
     A                                      350px","width":"230px","hover backg-
     A                                      round color":"#9AAA61","hover text -
     A                                      color":"#FFFFFF","border color":"#4-
     A                                      C6106","menu option indent":"10px",-
     A                                      "background color":"#758B27","css c-
     A                                      lass":"action-menu","css class 2":"-
     A                                      stationary","z index":"101"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W2216F_SCR02C_BtnH-
     A                                      iddenRefresh","value":"btnRefresh",-
     A                                      "top":"125px","response":{"fieldNam-
     A                                      e":"btnRefresh","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"SCR02C_Q1PGM-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"Q1PGM","designValu-
     A                                      e":"[Q1PGM]","refField":"DS10","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"130px","cursor row":"2","parent t-
     A                                      ab panel":"W2216F_SCR02C_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPRD2-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCPRD2","designVal-
     A                                      ue":"[SCPRD2]","refField":"NAME","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"414px","cursor column":"21","t-
     A                                      op":"130px","cursor row":"2","css c-
     A                                      lass 2":"HI","parent tab panel":"W2-
     A                                      216F_SCR02C_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"constant10","field -
     A                                      type":"output field","value":"SCR02-
     A                                      ","css class":"constant","left":"79-
     A                                      9px","cursor column":"76","top":"13-
     A                                      0px","cursor row":"2","parent tab p-
     A                                      anel":"W2216F_SCR02C_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W2216F_SCR02C_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant11","field type":"-
     A                                      output field","value":"Press Enter -
     A                                      to confirm your choices for 4=Delet-
     A                                      e.","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      70px","cursor row":"4","css class 2-
     A                                      ":"BLU","parent tab panel":"W2216F_-
     A                                      SCR02C_MainTabPanel",')
     A                                  1  2HTML('"parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W2216F_SCR02C_BtnHidden-
     A                                      DiaryItems","value":"btnDiary","top-
     A                                      ":"175px","response":{"fieldName":"-
     A                                      btnDiary","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant12","field-
     A                                       type":"output field","value":"Pres-
     A                                      s F12 to return to change your choi-
     A                                      ces.","css class":"constant","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "190px","cursor row":"5","css class-
     A                                       2":"BLU","parent tab panel":"W2216-
     A                                      F_SCR02C_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W2216F-
     A                                      _SCR02C_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W2216F_SCR02-
     A                                      C_BtnHiddenWorkSubmitJob","value":"-
     A                                      btnWrksbmjob","top":"225px","respon-
     A                                      se":{"fieldName":"btnWrkJob","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCR02C_SCHDL1","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCHD-
     A                                      L1","designValue":"[SCHDL1]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none","dataL-
     A                                      ength":"74"},"left":"281px","cursor-
     A                                       column":"2","top":"230px","cursor -
     A                                      row":"7","css class":"HI","parent t-
     A                                      ab panel":"W2216F_SCR02C_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W2216F_SCR02C_BtnHiddenWo-
     A                                      rkPrinterOutput","value":"btnWrkprt-
     A                                      out","top":"250px","response":{"fie-
     A                                      ldName":"btnWrkPrnt","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W2216F_SCR02C_BtnHiddenIma-
     A                                      geQueue","value":"btnImgQue","top":-
     A                                      "275px","response":{"fieldName":"bt-
     A                                      nImgQue","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type')
     A                                  1  2HTML('":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W2216F_SCR02C_BtnH-
     A                                      iddenHelp","value":"btnHelp","top":-
     A                                      "300px","response":{"fieldName":"bt-
     A                                      nHelp","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"SCR02S","field type":-
     A                                      "grid","number of columns":"3","rec-
     A                                      ord format name":"SCR02S","subfile -
     A                                      next changed":"true","display subfi-
     A                                      le":{"fieldName":"14","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"displ-
     A                                      ay control record":{"fieldName":"N1-
     A                                      3","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"clear subfile":{"fieldNa-
     A                                      me":"13","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"subfile size":"11"-
     A                                      ,"row height":"20","css class":"sub-
     A                                      filegrid","css class 2":"profound-c-
     A                                      onverted","parent tab panel":"W2216-
     A                                      F_SCR02C_MainTabPanel","parent tab"-
     A                                      :"0","subfile end":{"fieldName":"N1-
     A                                      5","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"page down response":{"fi-
     A                                      eldName":"*IN01","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"page up response":-
     A                                      {"fieldName":"*IN02","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"show paging co-
     A                                      ntrols":"true","scrollbar":"none","-
     A                                      number of rows":"9","has header":"f-
     A                                      alse","top":"330px","left":"276px",-
     A                                      "column widths":"28,63,467","subfil-
     A                                      e record number":{"fieldName":"SCRR-
     A                                      N2","designValue":"[SCRRN2]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"true","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","dataLe-
     A                                      ngth":"4","decPos":"0"}},{"id":"btn-
     A                                      Submit","field type":"button","valu-
     A                                      e":"Enter","shortcut key":"Enter","-
     A                                      left":"14px","top":"150px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF12","f-
     A                                      ield type":"button","value":"Cancel-
     A                                      ","shortcut key":"F12","left":"14px-
     A                                      ","top":"183px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"SCR02S_SCDBRR","field -
     A                                      type":"output field","visibility":"-
     A                                      hidden","value":{"fieldName":"SCDBR-
     A                                      R","designValue":"[SCDBRR]","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"true","curSym":"","un-
     A                                      its":"","negNum":"-999.00","dataLen-
     A                                      gth":"9","decPos":"0"},"left":"-58p-
     A                                      x","top":"-359px","width":"63px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted","grid":"SCR02S","c-
     A                                      olumn":"0"},{"id":"SC')
     A                                  1  2HTML('SF1R","field type":"output fi-
     A                                      eld","visibility":"hidden","value":-
     A                                      {"fieldName":"SCSF1R","designValue"-
     A                                      :"[SCSF1R]","dataType":"zoned","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00","dataLength":"4","decPos-
     A                                      ":"0"},"left":"-23px","top":"-359px-
     A                                      ","width":"28px","text align":"righ-
     A                                      t","css class":"profound-converted"-
     A                                      ,"grid":"SCR02S","column":"0"},{"id-
     A                                      ":"SCR02S_SCSEL","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCS-
     A                                      EL","designValue":"[SCSEL]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none","dataL-
     A                                      ength":"2"},"css class":"output-fie-
     A                                      ld","left":"5px","cursor column":"2-
     A                                      ","top":"1px","cursor row":"12","de-
     A                                      scription":"Selection Field","css c-
     A                                      lass 2":"profound-converted","grid"-
     A                                      :"SCR02S","column":"0"},{"id":"SCR0-
     A                                      2S_SCDATA","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCDATA","-
     A                                      designValue":"[SCDATA]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"5"},"css class":"output-field",-
     A                                      "left":"5px","cursor column":"6","t-
     A                                      op":"1px","cursor row":"12","css cl-
     A                                      ass 2":"profound-converted","grid":-
     A                                      "SCR02S","column":"1"},{"id":"SCR02-
     A                                      S_SCSTAT","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCSTAT","d-
     A                                      esignValue":"[SCSTAT]","refField":"-
     A                                      FLAG","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"5px","cursor column":"-
     A                                      15","top":"1px","cursor row":"12","-
     A                                      css class 2":"profound-converted","-
     A                                      grid":"SCR02S","column":"2"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCHDL1        74A  H
     A            SCRRN2         4S 0H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRD2    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR02
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      2    23C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"23-23"},"items":[{-
     A                                      "id":"W2216F_SCR02_avKeys","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"AV_KEYS","dataLength":"1134"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[AV_KEYS]"},"-
     A                                      left":"0px","top":"0px","visibility-
     A                                      ":"hidden"},{"id":"W2216F_SCR02_act-
     A                                      ion","field type":"html container",-
     A                                      "white space":"normal","left":"0px"-
     A                                      ,"top":"10px","width":"230px","css -
     A                                      class":"action-panel-converted","he-
     A                                      ight":"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_bottom.png\"-
     A                                       /></div><div class=\"bottom\"></di-
     A                                      v>"},{"field type":"icon menu butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"32px-
     A                                      ","z index":"20","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1170px","id":"-
     A                                      W2216F_SCR02_BtnIconMenuSystemTools-
     A                                      ","tool tip":"System Tools","icon s-
     A                                      ource":"/profoundui/userdata/images-
     A                                      /systool/systools.png","data functi-
     A                                      on":"SystemToolbarSystools","show d-
     A                                      own arrow":"Yes"},{"field type":"pa-
     A                                      nel","panel style":"TransformButton-
     A                                      Bar","id":"W2216F_SCR02_ButtonBar",-
     A                                      "top":"35px","left":"1036px","width-
     A                                      ":"187px","height":"28px","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n","locked in place":"true"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1040px","id":"W2216-
     A                                      F_SCR02_BtnSave","tool tip":"Save",-
     A                                      "onclick":"SystemToolbarSave","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/save.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1066px","id"-
     A                                      :"W2216F_SCR02_BtnRef')
     A                                  1  2HTML('resh","tool tip":"Refresh","o-
     A                                      nclick":"SystemToolbarRefresh","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/refresh.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1092px",-
     A                                      "id":"W2216F_SCR02_BtnSearch","tool-
     A                                       tip":"Search","onclick":"SystemToo-
     A                                      lbarSearch","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/search.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1118px","id":"W2216F_SCR02_B-
     A                                      tnDiaryItems","tool tip":"Diary/Wor-
     A                                      k Items - IDARTS","onclick":"System-
     A                                      ToolbarDiary","background image":{"-
     A                                      fieldName":"DryIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1144px","id":"W2216F_SCR02_BtnSys-
     A                                      temMessages","tool tip":"System Mes-
     A                                      sages","onclick":"SystemToolbarMess-
     A                                      ages","background image":{"fieldNam-
     A                                      e":"MsgIcnURL","dataLength":"128","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"W2216F_SCR02_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"W2216F_SCR02_I-
     A                                      mgSysToolBottom","fie')
     A                                  1  2HTML('ld type":"image","image sourc-
     A                                      e":"/profoundui/userdata/images/sys-
     A                                      tool/butbarbot.png","left":"1036px"-
     A                                      ,"top":"64px","width":"187px","lock-
     A                                      ed in place":"true","css class":"st-
     A                                      ationary","visibility":"hidden"},{"-
     A                                      id":"W2216F_SCR02_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":"Tab 1-
     A                                      ","active tab":"0","left":"250px","-
     A                                      top":"70px","width":"970px","height-
     A                                      ":"657px","z index":"8","locked in -
     A                                      place":"true","css class":"tab-pane-
     A                                      l","css class 2":"stationary"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W2216F_SCR02_Btn-
     A                                      HiddenSave","value":"btnSave","top"-
     A                                      :"100px","response":{"fieldName":"b-
     A                                      tnSave","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"W2216F_SCR02_fkeyMen-
     A                                      u","field type":"menu","left":"10px-
     A                                      ","top":"120px","height":"350px","w-
     A                                      idth":"230px","hover background col-
     A                                      or":"#9AAA61","hover text color":"#-
     A                                      FFFFFF","border color":"#4C6106","m-
     A                                      enu option indent":"10px","backgrou-
     A                                      nd color":"#758B27","css class":"ac-
     A                                      tion-menu","css class 2":"stationar-
     A                                      y","z index":"101"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W2216F_SCR02_BtnHiddenRefre-
     A                                      sh","value":"btnRefresh","top":"125-
     A                                      px","response":{"fieldName":"btnRef-
     A                                      resh","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W2216F-
     A                                      _SCR02_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W2216F_SCR02_BtnHiddenD-
     A                                      iaryItems","value":"btnDiary","top"-
     A                                      :"175px","response":{"fieldName":"b-
     A                                      tnDiary","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W22-
     A                                      16F_SCR02_BtnHiddenSystemMessages",-
     A                                      "value":"btnMessage","top":"200px",-
     A                                      "response":{"fieldName":"btnMessage-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"butt')
     A                                  1  2HTML('on","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W2216F_SCR02_BtnHiddenWor-
     A                                      kSubmitJob","value":"btnWrksbmjob",-
     A                                      "top":"225px","response":{"fieldNam-
     A                                      e":"btnWrkJob","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W2216F_SCR02_BtnHiddenWorkPrinte-
     A                                      rOutput","value":"btnWrkprtout","to-
     A                                      p":"250px","response":{"fieldName":-
     A                                      "btnWrkPrnt","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W2216F_SCR02_BtnHiddenImageQueue",-
     A                                      "value":"btnImgQue","top":"275px","-
     A                                      response":{"fieldName":"btnImgQue",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W2216F_SCR02-
     A                                      _BtnHiddenHelp","value":"btnHelp","-
     A                                      top":"300px","response":{"fieldName-
     A                                      ":"btnHelp","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"btnSubmit","fiel-
     A                                      d type":"button","value":"Enter","s-
     A                                      hortcut key":"Enter","left":"14px",-
     A                                      "top":"150px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnPAGEDOWN","field type-
     A                                      ":"button","value":"Page Down","sho-
     A                                      rtcut key":"PageDown","response":{"-
     A                                      fieldName":"*IN01","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"left":"14px","to-
     A                                      p":"183px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnPAGEUP","field type":"bu-
     A                                      tton","value":"Page Up","shortcut k-
     A                                      ey":"PageUp","response":{"fieldName-
     A                                      ":"*IN02","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"left":"14px","top":"216px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR03
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    RWINDOW    0     -
     A                                      RROWS      2    C1    1C1    9 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"4","overlay ra-
     A                                      nge":"1-9"},"items":[{"id":"SCR03",-
     A                                      "field type":"panel","panel style":-
     A                                      "Transform Dialog","text align":"ce-
     A                                      nter","left":"5px","top":"5px","hei-
     A                                      ght":"330px","width":"534px","z ind-
     A                                      ex":"8","locked in place":"true"},{-
     A                                      "id":"SCR03_SCUSER","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCUSER","designValue":"[SCUSER]","r-
     A                                      efField":"USER","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"29px","curso-
     A                                      r column":"2","top":"65px","cursor -
     A                                      row":"1","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCPRD3","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCPRD3","designValue":"[SCPRD3-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"127px",-
     A                                      "cursor column":"16","top":"65px","-
     A                                      cursor row":"1","css class 2":"HI",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant13","field type":"o-
     A                                      utput field","value":"SCR03","css c-
     A                                      lass":"constant","left":"477px","cu-
     A                                      rsor column":"66","top":"65px","cur-
     A                                      sor row":"1","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant14","f-
     A                                      ield type":"output field","value":"-
     A                                      Type choices, press Enter.","css cl-
     A                                      ass":"constant","left":"29px","curs-
     A                                      or column":"2","top":"105px","curso-
     A                                      r row":"3","css class 2":"BLU","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"btnSubmit","field type":"button-
     A                                      ","value":"Enter","shortcut key":"E-
     A                                      nter","left":"14px","top":"290px","-
     A                                      width":"80px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnCF-
     A                                      12","field type":"button","value":"-
     A                                      Cancel","shortcut key":"F12","left"-
     A                                      :"104px","top":"290px","width":"80p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnPAGEDOWN","fi-
     A                                      eld type":"button","value":"Page Do-
     A                                      wn","shortcut key":"PageDown","resp-
     A                                      onse":{"fieldName":"*IN01","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"left":"1-
     A                                      94px","top":"290px","width":"80px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","visibility-
     A                                      ":"hidden","cursor":"default"},{"id-
     A                                      ":"btnPAGEUP","field type":"button"-
     A                                      ,"value":"Page Up","shortcut key":"-
     A                                      PageUp","response":{"fieldName":"*I-
     A                                      N02","dataType":"indi')
     A                                  1  2HTML('cator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"left":"284-
     A                                      px","top":"290px","width":"80px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","visibility":-
     A                                      "hidden","cursor":"default"}]}')
     A            SCPRD3    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A          R MSGSFL                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI000001     1A  O  2  2
     A            MSGKEY         4A  H
     A            Q1PGM         10A  H
     A          R QSFLCTL003                SFLCTL(MSGSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLMSGSFLC')
     A          R MSGSFLC
     A  01 02 10                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    MSGSFL    6    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LINZ    0     RSFLPAG    1    C1   -
     A                                       1 RSFLSIZ    1    C1    5 FQ1PGM  -
     A                                         SFLPGMQ   0     2    FMSGKEY    -
     A                                      SFLMSGKEY 0     FQ1PGM     SFLPGMQ -
     A                                        0     1    RROWS      2    C2    -
     A                                      24C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"MSGSFLC","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","overlay range":"24-24"},"items":-
     A                                      [{"id":"W2216F_MSGSFLC_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"W2216F_MSGSF-
     A                                      LC_action","field type":"html conta-
     A                                      iner","white space":"normal","left"-
     A                                      :"0px","top":"10px","width":"230px"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","height":"700px","html":"<div cl-
     A                                      ass=\"top\"></div><div class=\"imag-
     A                                      etop\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_top.png\" /></div><d-
     A                                      iv class=\"menulinks\"></div><div c-
     A                                      lass=\"imagebottom\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_bottom-
     A                                      .png\" /></div><div class=\"bottom\-
     A                                      "></div>"},{"field type":"icon menu-
     A                                       button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"32px","z index":"20","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1170px",-
     A                                      "id":"W2216F_MSGSFLC_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon source":"/profoundui/userdat-
     A                                      a/images/systool/systools.png","dat-
     A                                      a function":"SystemToolbarSystools"-
     A                                      ,"show down arrow":"Yes"},{"field t-
     A                                      ype":"panel","panel style":"Transfo-
     A                                      rmButtonBar","id":"W2216F_MSGSFLC_B-
     A                                      uttonBar","top":"35px","left":"1036-
     A                                      px","width":"187px","height":"28px"-
     A                                      ,"css class":"stationary","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1040px","-
     A                                      id":"W2216F_MSGSFLC_BtnSave","tool -
     A                                      tip":"Save","onclick":"SystemToolba-
     A                                      rSave","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      ave.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1066px","id":"W2216F_')
     A                                  1  2HTML('MSGSFLC_BtnRefresh","tool tip-
     A                                      ":"Refresh","onclick":"SystemToolba-
     A                                      rRefresh","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/refresh.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1092px","id":"W2216F_MSGSFLC_-
     A                                      BtnSearch","tool tip":"Search","onc-
     A                                      lick":"SystemToolbarSearch","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/search.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1118px","id"-
     A                                      :"W2216F_MSGSFLC_BtnDiaryItems","to-
     A                                      ol tip":"Diary/Work Items - IDARTS"-
     A                                      ,"onclick":"SystemToolbarDiary","ba-
     A                                      ckground image":{"fieldName":"DryIc-
     A                                      nURL","dataLength":"128","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"}},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1144px","id":"W-
     A                                      2216F_MSGSFLC_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"}},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1196px","id":"W2216F_-
     A                                      MSGSFLC_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemToolbarHelp","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/help.png'')"}-
     A                                      ,{"id":"W2216F_MSGSFL')
     A                                  1  2HTML('C_ImgSysToolBottom","field ty-
     A                                      pe":"image","image source":"/profou-
     A                                      ndui/userdata/images/systool/butbar-
     A                                      bot.png","left":"1036px","top":"64p-
     A                                      x","width":"187px","locked in place-
     A                                      ":"true","css class":"stationary","-
     A                                      visibility":"hidden"},{"id":"W2216F-
     A                                      _MSGSFLC_MainTabPanel","field type"-
     A                                      :"tab panel","tab panel style":"Tra-
     A                                      nsform","tab names":"Tab 1","active-
     A                                       tab":"0","left":"250px","top":"70p-
     A                                      x","width":"970px","height":"657px"-
     A                                      ,"z index":"8","locked in place":"t-
     A                                      rue","css class":"tab-panel","css c-
     A                                      lass 2":"stationary"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W2216F_MSGSFLC_BtnHiddenS-
     A                                      ave","value":"btnSave","top":"100px-
     A                                      ","response":{"fieldName":"btnSave"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"W2216F_MSGSFLC_fkeyMenu","f-
     A                                      ield type":"menu","left":"10px","to-
     A                                      p":"120px","height":"350px","width"-
     A                                      :"230px","hover background color":"-
     A                                      #9AAA61","hover text color":"#FFFFF-
     A                                      F","border color":"#4C6106","menu o-
     A                                      ption indent":"10px","background co-
     A                                      lor":"#758B27","css class":"action--
     A                                      menu","css class 2":"stationary","z-
     A                                       index":"101"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W2216F_MSGSFLC_BtnHiddenRefresh"-
     A                                      ,"value":"btnRefresh","top":"125px"-
     A                                      ,"response":{"fieldName":"btnRefres-
     A                                      h","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W2216F_MS-
     A                                      GSFLC_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W2216F_MSGSFLC_BtnHidden-
     A                                      DiaryItems","value":"btnDiary","top-
     A                                      ":"175px","response":{"fieldName":"-
     A                                      btnDiary","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W2-
     A                                      216F_MSGSFLC_BtnHiddenSystemMessage-
     A                                      s","value":"btnMessage","top":"200p-
     A                                      x","response":{"fieldName":"btnMess-
     A                                      age","dataType":"indicator","format-
     A                                      ting":"Indicator","in')
     A                                  1  2HTML('dFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W2216F_MSGSFLC_BtnHidd-
     A                                      enWorkSubmitJob","value":"btnWrksbm-
     A                                      job","top":"225px","response":{"fie-
     A                                      ldName":"btnWrkJob","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W2216F_MSGSFLC_BtnHiddenWor-
     A                                      kPrinterOutput","value":"btnWrkprto-
     A                                      ut","top":"250px","response":{"fiel-
     A                                      dName":"btnWrkPrnt","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W2216F_MSGSFLC_BtnHiddenIma-
     A                                      geQueue","value":"btnImgQue","top":-
     A                                      "275px","response":{"fieldName":"bt-
     A                                      nImgQue","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W22-
     A                                      16F_MSGSFLC_BtnHiddenHelp","value":-
     A                                      "btnHelp","top":"300px","response":-
     A                                      {"fieldName":"btnHelp","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"MSGSF-
     A                                      L","field type":"grid","number of c-
     A                                      olumns":"1","record format name":"M-
     A                                      SGSFL","display subfile":"true","di-
     A                                      splay control record":"true","subfi-
     A                                      le size":"5","initialize subfile":"-
     A                                      true","row height":"20","css class"-
     A                                      :"subfilegrid","css class 2":"profo-
     A                                      und-converted","parent tab panel":"-
     A                                      W2216F_MSGSFLC_MainTabPanel","paren-
     A                                      t tab":"0","subfile end":{"fieldNam-
     A                                      e":"N10","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"number of rows":"1-
     A                                      ","has header":"false","subfile pro-
     A                                      gram message queue":{"fieldName":"Q-
     A                                      1PGM","dataLength":"10","trimLeadin-
     A                                      g":"false","trimTrailing":"true","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"},"subfile c-
     A                                      ontrol program message queue":{"fie-
     A                                      ldName":"Q1PGM","dataLength":"10","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none"},-
     A                                      "subfile message key":{"fieldName":-
     A                                      "MSGKEY","dataLength":"4","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none"},"top":"5-
     A                                      70px","left":"269px","column widths-
     A                                      ":"595"},{"id":"btnSubmit","field t-
     A                                      ype":"button","value"')
     A                                  1  2HTML(':"Enter","shortcut key":"Ente-
     A                                      r","left":"14px","top":"150px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnPAGE-
     A                                      DOWN","field type":"button","value"-
     A                                      :"Page Down","shortcut key":"PageDo-
     A                                      wn","response":{"fieldName":"*IN01"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "left":"14px","top":"183px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnPAGEUP"-
     A                                      ,"field type":"button","value":"Pag-
     A                                      e Up","shortcut key":"PageUp","resp-
     A                                      onse":{"fieldName":"*IN02","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"left":"1-
     A                                      4px","top":"216px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A          R SCR99
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C1    1 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-1"},"items":[{"i-
     A                                      d":"W2216F_SCR99_avKeys","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"AV_KEYS","dataLength":"1134","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[AV_KEYS]"},"le-
     A                                      ft":"0px","top":"0px","visibility":-
     A                                      "hidden"},{"id":"W2216F_SCR99_actio-
     A                                      n","field type":"html container","w-
     A                                      hite space":"normal","left":"0px","-
     A                                      top":"10px","width":"230px","css cl-
     A                                      ass":"action-panel-converted","heig-
     A                                      ht":"700px","html":"<div class=\"to-
     A                                      p\"></div><div class=\"imagetop\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_top.png\" /></div><div class-
     A                                      =\"menulinks\"></div><div class=\"i-
     A                                      magebottom\"><img src=\"/profoundui-
     A                                      /userdata/images/bar_bottom.png\" /-
     A                                      ></div><div class=\"bottom\"></div>-
     A                                      "},{"field type":"icon menu button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"32px",-
     A                                      "z index":"20","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1170px","id":"W2-
     A                                      216F_SCR99_BtnIconMenuSystemTools",-
     A                                      "tool tip":"System Tools","icon sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/systools.png","data function-
     A                                      ":"SystemToolbarSystools","show dow-
     A                                      n arrow":"Yes"},{"field type":"pane-
     A                                      l","panel style":"TransformButtonBa-
     A                                      r","id":"W2216F_SCR99_ButtonBar","t-
     A                                      op":"35px","left":"1036px","width":-
     A                                      "187px","height":"28px","css class"-
     A                                      :"stationary","visibility":"hidden"-
     A                                      ,"locked in place":"true"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1040px","id":"W2216F_-
     A                                      SCR99_BtnSave","tool tip":"Save","o-
     A                                      nclick":"SystemToolbarSave","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/save.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1066px","id":"-
     A                                      W2216F_SCR99_BtnRefre')
     A                                  1  2HTML('sh","tool tip":"Refresh","onc-
     A                                      lick":"SystemToolbarRefresh","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/refresh.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1092px","i-
     A                                      d":"W2216F_SCR99_BtnSearch","tool t-
     A                                      ip":"Search","onclick":"SystemToolb-
     A                                      arSearch","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/search.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1118px","id":"W2216F_SCR99_Btn-
     A                                      DiaryItems","tool tip":"Diary/Work -
     A                                      Items - IDARTS","onclick":"SystemTo-
     A                                      olbarDiary","background image":{"fi-
     A                                      eldName":"DryIcnURL","dataLength":"-
     A                                      128","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"}},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1144px","id":"W2216F_SCR99_BtnSyste-
     A                                      mMessages","tool tip":"System Messa-
     A                                      ges","onclick":"SystemToolbarMessag-
     A                                      es","background image":{"fieldName"-
     A                                      :"MsgIcnURL","dataLength":"128","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"}},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1196px",-
     A                                      "id":"W2216F_SCR99_BtnHelp","tool t-
     A                                      ip":"Help","onclick":"SystemToolbar-
     A                                      Help","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/he-
     A                                      lp.png'')"},{"id":"W2216F_SCR99_Img-
     A                                      SysToolBottom","field')
     A                                  1  2HTML(' type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"W2216F_SCR99_MainTabPanel","fiel-
     A                                      d type":"tab panel","tab panel styl-
     A                                      e":"Transform","tab names":"Tab 1",-
     A                                      "active tab":"0","left":"250px","to-
     A                                      p":"70px","width":"970px","height":-
     A                                      "657px","z index":"8","locked in pl-
     A                                      ace":"true","css class":"tab-panel"-
     A                                      ,"css class 2":"stationary"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W2216F_SCR99_BtnHi-
     A                                      ddenSave","value":"btnSave","top":"-
     A                                      100px","response":{"fieldName":"btn-
     A                                      Save","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"SCFL01","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCFL01","designValue":"[SCFL01]","-
     A                                      refField":"FLAG","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class 2":"top-line-
     A                                      ","visibility":"hidden","descriptio-
     A                                      n":"DUMMY FIELD","parent tab panel"-
     A                                      :"W2216F_SCR99_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"W2216F_SCR99_fke-
     A                                      yMenu","field type":"menu","left":"-
     A                                      10px","top":"120px","height":"350px-
     A                                      ","width":"230px","hover background-
     A                                       color":"#9AAA61","hover text color-
     A                                      ":"#FFFFFF","border color":"#4C6106-
     A                                      ","menu option indent":"10px","back-
     A                                      ground color":"#758B27","css class"-
     A                                      :"action-menu","css class 2":"stati-
     A                                      onary","z index":"101"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W2216F_SCR99_BtnHiddenR-
     A                                      efresh","value":"btnRefresh","top":-
     A                                      "125px","response":{"fieldName":"bt-
     A                                      nRefresh","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W2-
     A                                      216F_SCR99_BtnHiddenSearch","value"-
     A                                      :"btnSearch","top":"150px","respons-
     A                                      e":{"fieldName":"btnSearch","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W2216F_SCR99_BtnHid-
     A                                      denDiaryItems","value')
     A                                  1  2HTML('":"btnDiary","top":"175px","r-
     A                                      esponse":{"fieldName":"btnDiary","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W2216F_SCR99_B-
     A                                      tnHiddenSystemMessages","value":"bt-
     A                                      nMessage","top":"200px","response":-
     A                                      {"fieldName":"btnMessage","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"W2216F_SCR99_BtnHidde-
     A                                      nWorkSubmitJob","value":"btnWrksbmj-
     A                                      ob","top":"225px","response":{"fiel-
     A                                      dName":"btnWrkJob","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W2216F_SCR99_BtnHiddenWorkPr-
     A                                      interOutput","value":"btnWrkprtout"-
     A                                      ,"top":"250px","response":{"fieldNa-
     A                                      me":"btnWrkPrnt","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W2216F_SCR99_BtnHiddenImageQue-
     A                                      ue","value":"btnImgQue","top":"275p-
     A                                      x","response":{"fieldName":"btnImgQ-
     A                                      ue","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W2216F_S-
     A                                      CR99_BtnHiddenHelp","value":"btnHel-
     A                                      p","top":"300px","response":{"field-
     A                                      Name":"btnHelp","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"btnSubmit","-
     A                                      field type":"button","value":"Enter-
     A                                      ","shortcut key":"Enter","left":"14-
     A                                      px","top":"150px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnPAGEDOWN","field -
     A                                      type":"button","value":"Page Down",-
     A                                      "shortcut key":"PageDown","response-
     A                                      ":{"fieldName":"*IN01","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"left":"14px"-
     A                                      ,"top":"183px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnPAGEUP","field type"-
     A                                      :"button","value":"Page Up","shortc-
     A                                      ut key":"PageUp","response":{"field-
     A                                      Name":"*IN02","dataType":"indicator-
     A                                      ","formatting":"Indic')
     A                                  1  2HTML('ator","indFormat":"1 / 0"},"l-
     A                                      eft":"14px","top":"216px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFL01    R        H      REFFLD(FLAG)
