     A                                      REF(*LIBL/WREFP)
     A          R SCR01
     A  71 72 73
     A  74                                  CA01
     A                                  1  2HTML('QPUIREC8    RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C6    SCFRDTC7    WCR0-
     A                                      500C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     71RERRMSGID  5    C6    SC-
     A                                      FRDTC7    WCR0529C6    WMESGGC5    -
     A                                      *LIBLC0    E1    3     74RERRMSGID -
     A                                       5    C6    SCTODTC7    WCR0500C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        72RERRMSGID  5    C6    SCTODTC7 -
     A                                         WCR0529C6    WMESGGC5    *LIBLC0-
     A                                          E1    3     74RERRMSGID  5    C-
     A                                      6    SCMEDTC7    WCR0500C6    WMESG-
     A                                      GC5    *LIBLC0    E1    3     73RER-
     A                                      RMSGID  5    C6    SCMEDTC7    WCR0-
     A                                      529C6    WMESGGC5    *LIBLC0    E1 -
     A                                         3     74')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","overlay range":"1--
     A                                      23"},"items":[{"id":"W3001F_SCR01_a-
     A                                      vKeys","field type":"output field",-
     A                                      "value":{"fieldName":"AV_KEYS","dat-
     A                                      aLength":"1134","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[AV_KEYS]"},"left":"0px","top":"0-
     A                                      px","visibility":"hidden"},{"id":"W-
     A                                      3001F_SCR01_action","field type":"h-
     A                                      tml container","white space":"norma-
     A                                      l","left":"0px","top":"10px","width-
     A                                      ":"230px","css class":"action-panel-
     A                                      -converted","height":"700px","html"-
     A                                      :"<div class=\"top\"></div><div cla-
     A                                      ss=\"imagetop\"><img src=\"/profoun-
     A                                      dui/userdata/images/bar_top.png\" /-
     A                                      ></div><div class=\"menulinks\"></d-
     A                                      iv><div class=\"imagebottom\"><img -
     A                                      src=\"/profoundui/userdata/images/b-
     A                                      ar_bottom.png\" /></div><div class=-
     A                                      \"bottom\"></div>"},{"field type":"-
     A                                      icon menu button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"32px","z index":"20","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1170px","id":"W3001F_SCR01_BtnIcon-
     A                                      MenuSystemTools","tool tip":"System-
     A                                       Tools","icon alignment":"middle le-
     A                                      ft","icon width":"16px","icon heigh-
     A                                      t":"24px","icon source":"/profoundu-
     A                                      i/userdata/images/systool/systools.-
     A                                      png","data function":"SystemToolbar-
     A                                      Systools","show down arrow":"Yes"},-
     A                                      {"field type":"panel","panel style"-
     A                                      :"TransformButtonBar","id":"W3001F_-
     A                                      SCR01_ButtonBar","top":"35px","left-
     A                                      ":"1036px","width":"187px","height"-
     A                                      :"28px","css class":"stationary","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"10-
     A                                      40px","id":"W3001F_SCR01_BtnSave","-
     A                                      tool tip":"Save","onclick":"SystemT-
     A                                      oolbarSave","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/save.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1066px","id":"W3001F_SCR01_Btn-
     A                                      Refresh","tool tip":"Refresh","oncl-
     A                                      ick":"SystemToolbarRefresh","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/refresh.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1092px","id-
     A                                      ":"W3001F_SCR01_BtnSearch","tool ti-
     A                                      p":"Search","onclick":"SystemToolba-
     A                                      rSearch","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /search.png'')"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1118px","id":"W3001F_SCR01_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"W3001F_SCR01_BtnSystem-
     A                                      Messages","tool tip":"System Messag-
     A                                      es","onclick":"SystemToolbarMessage-
     A                                      s","background image":{"fieldName":-
     A                                      "MsgIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"cha')
     A                                  1  4HTML('r","formatting":"Text","textT-
     A                                      ransform":"none"}},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1196px","id":"W3001F_SCR01_Bt-
     A                                      nHelp","tool tip":"Help","onclick":-
     A                                      "SystemToolbarHelp","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/help.png'')"},{"id":"W3-
     A                                      001F_SCR01_ImgSysToolBottom","field-
     A                                       type":"image","image source":"/pro-
     A                                      foundui/userdata/images/systool/but-
     A                                      barbot.png","left":"1036px","top":"-
     A                                      64px","width":"187px","locked in pl-
     A                                      ace":"true","css class":"stationary-
     A                                      ","visibility":"hidden"},{"id":"W30-
     A                                      01F_SCR01_MainTabPanel","field type-
     A                                      ":"tab panel","tab panel style":"Tr-
     A                                      ansform","tab names":{"fieldName":"-
     A                                      SCPRDS","designValue":"[SCPRDS]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"active tab"-
     A                                      :"0","left":"250px","top":"70px","w-
     A                                      idth":"970px","height":"657px","z i-
     A                                      ndex":"8","locked in place":"true",-
     A                                      "css class":"tab-panel","css class -
     A                                      2":"stationary"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W3001F_SCR01_BtnHiddenSave","v-
     A                                      alue":"btnSave","top":"100px","resp-
     A                                      onse":{"fieldName":"btnSave","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "constant1","field type":"output fi-
     A                                      eld","left":"281px","cursor column"-
     A                                      :"2","top":"110px","cursor row":"1"-
     A                                      ,"css class":"top-line","value":"js-
     A                                      : currentUser()","css class 2":"out-
     A                                      put-field","parent tab panel":"W300-
     A                                      1F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"SCCONM","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCCONM","designValue":"[SCCONM]","-
     A                                      refField":"NAME","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"414px","cur-
     A                                      sor column":"21","top":"110px","cur-
     A                                      sor row":"1","css class 2":"top-lin-
     A                                      e","css class 3":"HI","parent tab p-
     A                                      anel":"W3001F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 4":"prof-
     A                                      ound-converted"},{"id":"constant2",-
     A                                      "field type":"output field","left":-
     A                                      "778px","cursor column":"73","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                      ":"top-line","value":"js: currentDa-
     A                                      te()","css class 2":"output-field",-
     A                                      "parent tab panel":"W3001F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"W3001F_SCR01_fkeyMenu","field typ-
     A                                      e":"menu","left":"10px","top":"120p-
     A                                      x","height":"350px","width":"230px"-
     A                                      ,"hover background color":"#9AAA61"-
     A                                      ,"hover text color":"#FFFFFF","bord-
     A                                      er color":"#4C6106","menu option in-
     A                                      dent":"10px","background color":"#7-
     A                                      58B27","css class":"action-menu","c-
     A                                      ss class 2":"stationary","z index":-
     A                                      "101"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W3001-
     A                                      F_SCR01_BtnHiddenRefresh","value":"-
     A                                      btnRefresh","top":"125px","response-
     A                                      ":{"fieldName":"btnRefresh","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      Q1PGM","field type":"output field",-
     A                                      "value":{"fieldName":"Q1PGM","desig-
     A                                      nValue":"[Q1PGM]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none","dataLength":"10-
     A                                      "},"css class":"output-field","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"130px","cursor row":"2","parent t-
     A                                      ab panel":"W3001F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCPRDS"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCPRDS","designValu-
     A                                      e":"[SCPRDS]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"414px","cursor column":"21","to-
     A                                      p":"130px","cursor row":"2","css cl-
     A                                      ass 2":"HI","parent tab panel":"W30-
     A                                      01F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","visibility":"hidden","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant3","field type":"output fi-
     A                                      eld","value":"SCR01","css class":"c-
     A                                      onstant","left":"799px","cursor col-
     A                                      umn":"76","top":"130px","cursor row-
     A                                      ":"2","parent tab panel":"W3001F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCMODE","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCMO-
     A                                      DE","designValue":"[SCMODE')
     A                                  1  5HTML(']","refField":"PGM","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"76-
     A                                      4px","cursor column":"71","top":"15-
     A                                      0px","cursor row":"3","css class 2"-
     A                                      :"HI","parent tab panel":"W3001F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W3001F_SCR0-
     A                                      1_BtnHiddenSearch","value":"btnSear-
     A                                      ch","top":"150px","response":{"fiel-
     A                                      dName":"btnSearch","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W3001F_SCR01_BtnHiddenDiaryI-
     A                                      tems","value":"btnDiary","top":"175-
     A                                      px","response":{"fieldName":"btnDia-
     A                                      ry","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant4","field type":-
     A                                      "output field","value":"Type inform-
     A                                      ation, press Enter.","css class":"c-
     A                                      onstant","left":"281px","cursor col-
     A                                      umn":"2","top":"190px","cursor row"-
     A                                      :"5","css class 2":"BLU","parent ta-
     A                                      b panel":"W3001F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W3001F_SCR01_BtnHiddenSyste-
     A                                      mMessages","value":"btnMessage","to-
     A                                      p":"200px","response":{"fieldName":-
     A                                      "btnMessage","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W3001F_SCR01_BtnHiddenWorkSubmitJo-
     A                                      b","value":"btnWrksbmjob","top":"22-
     A                                      5px","response":{"fieldName":"btnWr-
     A                                      kJob","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant5","field type-
     A                                      ":"output field","value":"Policy ef-
     A                                      fective date range:","css class":"c-
     A                                      onstant","left":"295px","cursor col-
     A                                      umn":"4","top":"250px","cursor row"-
     A                                      :"8","parent tab panel":"W3001F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCFRDT","field type":"date f-
     A                                      ield","css class":"input","css clas-
     A                                      s 2":"date-field","value":{"fieldNa-
     A                                      me":"SCFRDT","designValue":"[SCFRDT-
     A                                      ]","refField":"DT8","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","numBlankF-
     A                                      ill":"true","edtWrd":"''  /  /    '-
     A                                      '","dateFormat":"m/d/Y"},"left":"49-
     A                                      8px","cursor column":"33","top":"25-
     A                                      0px","cursor row":"8","width":"71px-
     A                                      ","text align":"right","css class 3-
     A                                      ":"HI","error message id":"WCR0500"-
     A                                      ,"error message file":"WMESGG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"71","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"2 messages","error mess-
     A                                      age id 2":"WCR0529","error message -
     A                                      file 2":"WMESGG","error message lib-
     A                                      rary 2":"*LIBL","error condition 2"-
     A                                      :{"fieldName":"74","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"parent tab pane-
     A                                      l":"W3001F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 4":"profoun-
     A                                      d-converted"},{"id":"constant6","fi-
     A                                      eld type":"output field","value":"--
     A                                      ","css class":"constant","left":"57-
     A                                      5px","cursor column":"44","top":"25-
     A                                      0px","cursor row":"8","parent tab p-
     A                                      anel":"W3001F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCTODT","fi-
     A                                      eld type":"date field","css class":-
     A                                      "input","css class 2":"date-field",-
     A                                      "value":{"fieldName":"SCTODT","desi-
     A                                      gnValue":"[SCTODT]","refField":"DT8-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","numBlankFill":"true","edtWr-
     A                                      d":"''  /  /    ''","dateFormat":"m-
     A                                      /d/Y"},"left":"611px","cursor colum-
     A                                      n":"46","top":"250px","cursor row":-
     A                                      "8","width":"71px","text align":"ri-
     A                                      ght","css class 3":"HI","error mess-
     A                                      age id":"WCR0500","error message fi-
     A                                      le":"WMESGG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"72","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"2 mess-
     A                                      ages","error message id 2":"WCR0529-
     A                                      ","error message file 2":"WMESGG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"74"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"parent tab panel":"W3001')
     A                                  1  6HTML('F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 4":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      3001F_SCR01_BtnHiddenWorkPrinterOut-
     A                                      put","value":"btnWrkprtout","top":"-
     A                                      250px","response":{"fieldName":"btn-
     A                                      WrkPrnt","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W30-
     A                                      01F_SCR01_BtnHiddenImageQueue","val-
     A                                      ue":"btnImgQue","top":"275px","resp-
     A                                      onse":{"fieldName":"btnImgQue","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant7","field type":"output -
     A                                      field","value":"Month end date     -
     A                                              :","css class":"constant","-
     A                                      left":"295px","cursor column":"4","-
     A                                      top":"290px","cursor row":"10","par-
     A                                      ent tab panel":"W3001F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      MEDT","field type":"date field","cs-
     A                                      s class":"input","css class 2":"dat-
     A                                      e-field","value":{"fieldName":"SCME-
     A                                      DT","designValue":"[SCMEDT]","refFi-
     A                                      eld":"DT8","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"-999.00","numBlankFill":"tru-
     A                                      e","edtWrd":"''  /  /    ''","dateF-
     A                                      ormat":"m/d/Y"},"left":"498px","cur-
     A                                      sor column":"33","top":"290px","cur-
     A                                      sor row":"10","width":"71px","text -
     A                                      align":"right","css class 3":"HI","-
     A                                      error message id":"WCR0500","error -
     A                                      message file":"WMESGG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"73","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"2 messages","error message id 2-
     A                                      ":"WCR0529","error message file 2":-
     A                                      "WMESGG","error message library 2":-
     A                                      "*LIBL","error condition 2":{"field-
     A                                      Name":"74","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"parent tab panel":"W300-
     A                                      1F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 4":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W3001F-
     A                                      _SCR01_BtnHiddenHelp","value":"btnH-
     A                                      elp","top":"300px","response":{"fie-
     A                                      ldName":"btnHelp","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"btnSubmit"-
     A                                      ,"field type":"button","value":"Ent-
     A                                      er","shortcut key":"Enter","left":"-
     A                                      14px","top":"150px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF03","field ty-
     A                                      pe":"button","value":"Exit","shortc-
     A                                      ut key":"F3","left":"14px","top":"1-
     A                                      83px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFRDT    R        H      REFFLD(DT8)
     A            SCMEDT    R        H      REFFLD(DT8)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCTODT    R        H      REFFLD(DT8)
