     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20
     A  21 22 23
     A  24 25 27                            CA01(10 'Response Indicator *IN10')
     A  28 90 30
     A  31 32 33                            CA02(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(90 'Response Indicator *IN90')
     A                                  1  2HTML('QPUIREC10   RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C5  -
     A                                        SCFNDC7    WCR0498C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     33RERRMSG-
     A                                      ID  5    C6    SCFRDTC7    WC30610C-
     A                                      6    WMESGGC5    *LIBLC0    E1    3-
     A                                           90RERRMSGID  5    C6    SCFRDT-
     A                                      C7    WCR0500C6    WMESGGC5    *LIB-
     A                                      LC0    E1    3     20RERRMSGID  5  -
     A                                        C6    SCFRDTC7    WCR0529C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     27-
     A                                      RERRMSGID  5    C6    SCTODTC7    W-
     A                                      CR0500C6    WMESGGC5    *LIBLC0    -
     A                                      E1    3     21RERRMSGID  5    C6   -
     A                                       SCTODTC7    WCR0529C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     27RERRMSG-
     A                                      ID  5    C6    SCCOCDC7    WCR0604C-
     A                                      6    WMESGGC5    *LIBLC0    E1    3-
     A                                           22RERRMSGID  5    C6    SCCOCD-
     A                                      C7    WCR0605C6    WMESGGC5    *LIB-
     A                                      LC0    E1    3     23RERRMSGID  5  -
     A                                        C6    SCCOCDC7    WCR0620C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     24-
     A                                      ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN27","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN28","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN90","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"return cursor record":{"fiel-
     A                                      dName":"HREC","dataLength":"10","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"none"},"r-
     A                                      eturn cursor field":{"fieldName":"H-
     A                                      FLD","dataLength":"10","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"none"},"valid comm-
     A                                      and key":{"fieldName":"*IN11","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"overl-
     A                                      ay range":"1-23"},"items":[{"id":"H-
     A                                      FLD","field type":"output field","v-
     A                                      isibility":"hidden","value":{"field-
     A                                      Name":"HFLD","designValue":"[HFLD]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      ,"dataLength":"10"},"left":"0px","t-
     A                                      op":"-30px","css class":"profound-c-
     A                                      onverted"},{"id":"HREC","field type-
     A                                      ":"output field","visibility":"hidd-
     A                                      en","value":{"fieldName":"HREC","de-
     A                                      signValue":"[HREC]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"left":"0px","top":"-30px","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"W3010F_SCR01_avKeys","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"AV_KEYS","dataLength":"1134","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[AV_KEYS]"},"left-
     A                                      ":"0px","top":"0px","visibility":"h-
     A                                      idden"},{"id":"W3010F_SCR01_action"-
     A                                      ,"field type":"html container","whi-
     A                                      te space":"normal","left":"0px","to-
     A                                      p":"10px","width":"230px","css clas-
     A                                      s":"action-panel-converted","height-
     A                                      ":"700px","html":"<div class=\"top\-
     A                                      "></div><div class=\"imagetop\"><im-
     A                                      g src=\"/profoundui/userdata/images-
     A                                      /bar_top.png\" /></div><div class=\-
     A                                      "menulinks\"></div><div class=\"ima-
     A                                      gebottom\"><img src=\"/profoundui/u-
     A                                      serdata/images/bar_bottom.png\" /><-
     A                                      /div><div class=\"bottom\"></div>"}-
     A                                      ,{"field type":"icon menu button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"32px","z-
     A                                       index":"20","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1170px","id":"W301-
     A                                      0F_SCR01_BtnIconMenuSystemTools","t-
     A                                      ool tip":"System Tools","icon align-
     A                                      ment":"middle left","icon width":"1-
     A                                      6px","icon height":"24px","icon sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/systools.png","data function-
     A                                      ":"SystemToolbarSystools","show dow-
     A                                      n arrow":"Yes"},{"field type":"pane-
     A                                      l","panel style":"TransformButtonBa-
     A                                      r","id":"W3010F_SCR01_ButtonBar","t-
     A                                      op":"35px","left":"1036px","width":-
     A                                      "187px","height":"28px","css class"-
     A                                      :"stationary","visibility":"hidden"-
     A                                      ,"locked in place":"true"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1040px","id":"W3010F_-
     A                                      SCR01_BtnSave","tool tip":"Save","o-
     A                                      nclick":"SystemToolbarSave","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/save.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1066p')
     A                                  1  4HTML('x","id":"W3010F_SCR01_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"W-
     A                                      3010F_SCR01_BtnSearch","tool tip":"-
     A                                      Search","onclick":"SystemToolbarSea-
     A                                      rch","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sea-
     A                                      rch.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1118px","id":"W3010F_SCR01_BtnDiary-
     A                                      Items","tool tip":"Diary/Work Items-
     A                                       - IDARTS","onclick":"SystemToolbar-
     A                                      Diary","background image":{"fieldNa-
     A                                      me":"DryIcnURL","dataLength":"128",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"}},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1144p-
     A                                      x","id":"W3010F_SCR01_BtnSystemMess-
     A                                      ages","tool tip":"System Messages",-
     A                                      "onclick":"SystemToolbarMessages","-
     A                                      background image":{"fieldName":"Msg-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1196px","id":-
     A                                      "W3010F_SCR01_BtnHelp","tool tip":"-
     A                                      Help","onclick":"SystemToolbarHelp"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/help.pn-
     A                                      g'')"},{"id":"W3010F_SCR01_ImgSysTo-
     A                                      olBottom","field type":"image","ima-
     A                                      ge source":"/profoundui/userdata/im-
     A                                      ages/systool/butbarbot.png","left":-
     A                                      "1036px","top":"64px","width":"187p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"stationary","visibility":"hid-
     A                                      den"},{"id":"W3010F_SCR01_MainTabPa-
     A                                      nel","field type":"tab panel","tab -
     A                                      panel style":"Transform","tab names-
     A                                      ":{"fieldName":"SCPRDS","designValu-
     A                                      e":"[SCPRDS]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"active tab":"0","left":"250px"-
     A                                      ,"top":"70px","width":"970px","heig-
     A                                      ht":"657px","z index":"8","locked i-
     A                                      n place":"true","css class":"tab-pa-
     A                                      nel","css class 2":"stationary"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W3010F_SCR01_B-
     A                                      tnHiddenSave","value":"btnSave","to-
     A                                      p":"100px","response":{"fieldName":-
     A                                      "btnSave","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"SCUSER","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCUSER","designValue":"[SCUSER-
     A                                      ]","refField":"USER","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"281px",-
     A                                      "cursor column":"2","top":"110px","-
     A                                      cursor row":"1","css class 2":"top--
     A                                      line","parent tab panel":"W3010F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"SCCONM","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCCO-
     A                                      NM","designValue":"[SCCONM]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"414px","cursor c-
     A                                      olumn":"21","top":"110px","cursor r-
     A                                      ow":"1","css class 2":"top-line","c-
     A                                      ss class 3":"HI","description":"COM-
     A                                      PANY NAME","parent tab panel":"W301-
     A                                      0F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 4":"profound-conver-
     A                                      ted"},{"id":"constant1","field type-
     A                                      ":"output field","left":"7')
     A                                  1  5HTML('78px","cursor column":"73","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass":"top-line","value":"js: curre-
     A                                      ntDate()","css class 2":"output-fie-
     A                                      ld","parent tab panel":"W3010F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"W3010F_SCR01_fkeyMenu","field-
     A                                       type":"menu","left":"10px","top":"-
     A                                      120px","height":"350px","width":"23-
     A                                      0px","hover background color":"#9AA-
     A                                      A61","hover text color":"#FFFFFF","-
     A                                      border color":"#4C6106","menu optio-
     A                                      n indent":"10px","background color"-
     A                                      :"#758B27","css class":"action-menu-
     A                                      ","css class 2":"stationary","z ind-
     A                                      ex":"101"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      3010F_SCR01_BtnHiddenRefresh","valu-
     A                                      e":"btnRefresh","top":"125px","resp-
     A                                      onse":{"fieldName":"btnRefresh","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"Q1PGM","field type":"output fie-
     A                                      ld","value":{"fieldName":"Q1PGM","d-
     A                                      esignValue":"[Q1PGM]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"10"},"css class":"output-field","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"130px","cursor row":"2","pare-
     A                                      nt tab panel":"W3010F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCP-
     A                                      RDS","field type":"output field","v-
     A                                      alue":{"fieldName":"SCPRDS","design-
     A                                      Value":"[SCPRDS]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"130px","cursor row":"2","cs-
     A                                      s class 2":"HI","description":"PROG-
     A                                      RAM NAME","parent tab panel":"W3010-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","visibility":"hidden","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant2","field type":"output fiel-
     A                                      d","value":"SCR01","css class":"con-
     A                                      stant","left":"799px","cursor colum-
     A                                      n":"76","top":"130px","cursor row":-
     A                                      "2","parent tab panel":"W3010F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W3010F_SCR01_-
     A                                      BtnHiddenSearch","value":"btnSearch-
     A                                      ","top":"150px","response":{"fieldN-
     A                                      ame":"btnSearch","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant3",-
     A                                      "field type":"output field","value"-
     A                                      :"Group:","css class":"constant","l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"170px","cursor row":"4","paren-
     A                                      t tab panel":"W3010F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCFN-
     A                                      D","field type":"output field","val-
     A                                      ue":{"fieldName":"SCFND","designVal-
     A                                      ue":"[SCFND]","refField":"FND","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"false","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"999.00"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "330px","cursor column":"9","top":"-
     A                                      170px","cursor row":"4","width":"21-
     A                                      px","text align":"right","error mes-
     A                                      sage id":"WCR0498","error message f-
     A                                      ile":"WMESGG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"33","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"1 mes-
     A                                      sage","parent tab panel":"W3010F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCNAME","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCNA-
     A                                      ME","designValue":"[SCNAME]","refFi-
     A                                      eld":"NM60","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"372px","cursor c-
     A                                      olumn":"15","top":"170px","cursor r-
     A                                      ow":"4","description":"FUND NAME","-
     A                                      parent tab panel":"W3010F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W3010F_SCR01_BtnHi-
     A                                      ddenDiaryItems","value":"btnDiary",-
     A                                      "top":"175px","response":{"fieldNam-
     A                                      e":"btnDiary","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W3010F_SCR01_BtnHiddenSystemMessa-
     A                                      ges","value":"btnMessage","top":"20-
     A                                      0px","response":{"fieldName":"btnMe-
     A                                      ssage","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant4","')
     A                                  1  6HTML('field type":"output field","v-
     A                                      alue":"Type information, press Ente-
     A                                      r.","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"2-
     A                                      10px","cursor row":"6","css class 2-
     A                                      ":"BLU","parent tab panel":"W3010F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W3010F_SC-
     A                                      R01_BtnHiddenWorkSubmitJob","value"-
     A                                      :"btnWrksbmjob","top":"225px","resp-
     A                                      onse":{"fieldName":"btnWrkJob","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant5","field type":"output -
     A                                      field","value":"From date          -
     A                                         :","css class":"constant","left"-
     A                                      :"295px","cursor column":"4","top":-
     A                                      "250px","cursor row":"8","parent ta-
     A                                      b panel":"W3010F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCFRDT",-
     A                                      "field type":"date field","css clas-
     A                                      s":"input","css class 2":"date-fiel-
     A                                      d","value":{"fieldName":"SCFRDT","d-
     A                                      esignValue":"[SCFRDT]","refField":"-
     A                                      DT8","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00","numBlankFill":"true","ed-
     A                                      tWrd":"''  /  /    ''","dateFormat"-
     A                                      :"m/d/Y"},"left":"463px","cursor co-
     A                                      lumn":"28","top":"250px","cursor ro-
     A                                      w":"8","width":"71px","text align":-
     A                                      "right","css class 3":"UL","css cla-
     A                                      ss 4":"HI","error message id":"WC30-
     A                                      610","error message file":"WMESGG",-
     A                                      "error message library":"*LIBL","er-
     A                                      ror condition":{"fieldName":"90","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"3 messages","error -
     A                                      message id 2":"WCR0500","error mess-
     A                                      age file 2":"WMESGG","error message-
     A                                       library 2":"*LIBL","error conditio-
     A                                      n 2":{"fieldName":"20","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ge id 3":"WCR0529","error message f-
     A                                      ile 3":"WMESGG","error message libr-
     A                                      ary 3":"*LIBL","error condition 3":-
     A                                      {"fieldName":"27","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"description":"DA-
     A                                      TE","parent tab panel":"W3010F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 5":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W3010F_SCR01_-
     A                                      BtnHiddenWorkPrinterOutput","value"-
     A                                      :"btnWrkprtout","top":"250px","resp-
     A                                      onse":{"fieldName":"btnWrkPrnt","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W3010F_SCR01_Bt-
     A                                      nHiddenImageQueue","value":"btnImgQ-
     A                                      ue","top":"275px","response":{"fiel-
     A                                      dName":"btnImgQue","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant6-
     A                                      ","field type":"output field","valu-
     A                                      e":"To date               :","css c-
     A                                      lass":"constant","left":"295px","cu-
     A                                      rsor column":"4","top":"290px","cur-
     A                                      sor row":"10","parent tab panel":"W-
     A                                      3010F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCTODT","field type-
     A                                      ":"date field","css class":"input",-
     A                                      "css class 2":"date-field","value":-
     A                                      {"fieldName":"SCTODT","designValue"-
     A                                      :"[SCTODT]","refField":"DT8","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      numBlankFill":"true","edtWrd":"''  -
     A                                      /  /    ''","dateFormat":"m/d/Y"},"-
     A                                      left":"463px","cursor column":"28",-
     A                                      "top":"290px","cursor row":"10","wi-
     A                                      dth":"71px","text align":"right","c-
     A                                      ss class 3":"UL","css class 4":"HI"-
     A                                      ,"error message id":"WCR0500","erro-
     A                                      r message file":"WMESGG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"21","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"2 messages","error message id-
     A                                       2":"WCR0529","error message file 2-
     A                                      ":"WMESGG","error message library 2-
     A                                      ":"*LIBL","error condition 2":{"fie-
     A                                      ldName":"27","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"description":"DATE","-
     A                                      parent tab panel":"W3010F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 5":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W3010F_SCR01_BtnHi-
     A                                      ddenHelp","value":"btnHelp","top":"-
     A                                      300px","response":{"fieldName":"btn-
     A                                      Help","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFor')
     A                                  1  7HTML('mat":"1 / 0"}},{"id":"constan-
     A                                      t7","field type":"output field","va-
     A                                      lue":"Commission earned code:","css-
     A                                       class":"constant","left":"295px","-
     A                                      cursor column":"4","top":"330px","c-
     A                                      ursor row":"12","parent tab panel":-
     A                                      "W3010F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCCOCD","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCCOCD","designValue":"[S-
     A                                      CCOCD]","refField":"CODE","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"463px","cursor column":"28","to-
     A                                      p":"330px","cursor row":"12","width-
     A                                      ":"15px","css class 3":"HI","set fo-
     A                                      cus":{"fieldName":"28","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"erro-
     A                                      r message id":"WCR0604","error mess-
     A                                      age file":"WMESGG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"22","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      3 messages","error message id 2":"W-
     A                                      CR0605","error message file 2":"WME-
     A                                      SGG","error message library 2":"*LI-
     A                                      BL","error condition 2":{"fieldName-
     A                                      ":"23","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error message id 3":"WCR062-
     A                                      0","error message file 3":"WMESGG",-
     A                                      "error message library 3":"*LIBL","-
     A                                      error condition 3":{"fieldName":"24-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"description":"CODE","parent tab -
     A                                      panel":"W3010F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 4":"pro-
     A                                      found-converted"},{"id":"constant8"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Commission earning records alrea-
     A                                      dy exist for the date range specifi-
     A                                      ed","css class":"constant","visibil-
     A                                      ity":{"fieldName":"32","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"295px","cursor column":"4","-
     A                                      top":"370px","cursor row":"14","css-
     A                                       class 2":"BLU","parent tab panel":-
     A                                      "W3010F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant9","field-
     A                                       type":"output field","value":"Pres-
     A                                      s Enter to continue or F3 to Exit."-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"32","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"295px","cursor column":"4","top-
     A                                      ":"390px","cursor row":"15","css cl-
     A                                      ass 2":"BLU","parent tab panel":"W3-
     A                                      010F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant11","field t-
     A                                      ype":"output field","value":"Paymen-
     A                                      ts have been posted on or after the-
     A                                       TO DATE","css class":"constant","v-
     A                                      isibility":{"fieldName":"31","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"295px","cursor column"-
     A                                      :"4","top":"430px","cursor row":"17-
     A                                      ","css class 2":"BLU","parent tab p-
     A                                      anel":"W3010F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant10"-
     A                                      ,"field type":"output field","value-
     A                                      ":"FROM DATE is more than 1 month b-
     A                                      efore current system date.","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"30 and N31","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"295px","cursor column":"4","top-
     A                                      ":"430px","cursor row":"17","css cl-
     A                                      ass 2":"BLU","parent tab panel":"W3-
     A                                      010F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant12","field t-
     A                                      ype":"output field","value":"Verify-
     A                                       that entry is correct and press EN-
     A                                      TER to continue.","css class":"cons-
     A                                      tant","visibility":{"fieldName":"30-
     A                                       or 31","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"295px","-
     A                                      cursor column":"4","top":"450px","c-
     A                                      ursor row":"18","parent tab panel":-
     A                                      "W3010F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"150px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF03","field type":"bu-
     A                                      tton","value":"Exit","shortcut key"-
     A                                      :"F3","left":"14px","top":"183px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F10","field type":"button","value":-
     A                                      "Search","shortcut key":"F10","left-
     A                                      ":"14px","top":"216px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF13","field-
     A                                       type":"button","value":"Chg user p-
     A                                      arms","shortcut key":"F13","left":"-
     A                                      14px","top":"249px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","')
     A                                  1  8HTML('cursor":"default"},{"id":"btn-
     A                                      HELP","field type":"button","shortc-
     A                                      ut key":"Alt-F1","bypass validation-
     A                                      ":"true","value":"HELP","response":-
     A                                      {"fieldName":"*IN10","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"left":"14px","-
     A                                      top":"282px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCOCD    R        H      REFFLD(CODE)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFRDT    R        H      REFFLD(DT8)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCTODT    R        H      REFFLD(DT8)
     A            SCUSER    R        H      REFFLD(USER)
