     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 21
     A  22 23 24
     A  25 26 90                            CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(90 'Response Indicator *IN90')
     A                                  1  2HTML('QPUIREC7    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C5  -
     A                                        SCFNDC7    WC30090C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     25RERRMSG-
     A                                      ID  5    C6    SCDATEC7    WCR0500C-
     A                                      6    WMESGGC5    *LIBLC0    E1    3-
     A                                           21RERRMSGID  5    C6    SCDATE-
     A                                      C7    WCR1058C6    WMESGGC5    *LIB-
     A                                      LC0    E1    3     90RERRMSGID  5  -
     A                                        C6    SCCODEC7    WCR0604C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     22-
     A                                      RERRMSGID  5    C6    SCCODEC7    W-
     A                                      CR0605C6    WMESGGC5    *LIBLC0    -
     A                                      E1    3     23RERRMSGID  5    C6   -
     A                                       SCCODEC7    WCR0518C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     24')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN21","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN22","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN23","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN24","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN25","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN26","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN90","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"return cursor record":-
     A                                      {"fieldName":"HREC","dataLength":"1-
     A                                      0","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e"},"return cursor field":{"fieldNa-
     A                                      me":"HFLD","dataLength":"10","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none"},"vali-
     A                                      d command key":{"fieldName":"*IN11"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"HREC","field type":"output fie-
     A                                      ld","visibility":"hidden","value":{-
     A                                      "fieldName":"HREC","designValue":"[-
     A                                      HREC]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none","dataLength":"10"},"left":"0-
     A                                      px","top":"-30px","css class":"prof-
     A                                      ound-converted"},{"id":"HFLD","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :"hidden","value":{"fieldName":"HFL-
     A                                      D","designValue":"[HFLD]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"left":"0px","top":"-30px-
     A                                      ","css class":"profound-converted"}-
     A                                      ,{"id":"W3020F_SCR01_avKeys","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"AV_KEYS","dataLength":"113-
     A                                      4","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none","designValue":"[AV_KEYS]"}-
     A                                      ,"left":"0px","top":"0px","visibili-
     A                                      ty":"hidden"},{"id":"W3020F_SCR01_a-
     A                                      ction","field type":"html container-
     A                                      ","white space":"normal","left":"0p-
     A                                      x","top":"10px","width":"230px","cs-
     A                                      s class":"action-panel-converted","-
     A                                      height":"700px","html":"<div class=-
     A                                      \"top\"></div><div class=\"imagetop-
     A                                      \"><img src=\"/profoundui/userdata/-
     A                                      images/bar_top.png\" /></div><div c-
     A                                      lass=\"menulinks\"></div><div class-
     A                                      =\"imagebottom\"><img src=\"/profou-
     A                                      ndui/userdata/images/bar_bottom.png-
     A                                      \" /></div><div class=\"bottom\"></-
     A                                      div>"},{"field type":"icon menu but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"32-
     A                                      px","z index":"20","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1170px","id"-
     A                                      :"W3020F_SCR01_BtnIconMenuSystemToo-
     A                                      ls","tool tip":"System Tools","icon-
     A                                       alignment":"middle left","icon wid-
     A                                      th":"16px","icon height":"24px","ic-
     A                                      on source":"/profoundui/userdata/im-
     A                                      ages/systool/systools.png","data fu-
     A                                      nction":"SystemToolbarSystools","sh-
     A                                      ow down arrow":"Yes"},{"field type"-
     A                                      :"panel","panel style":"TransformBu-
     A                                      ttonBar","id":"W3020F_SCR01_ButtonB-
     A                                      ar","top":"35px","left":"1036px","w-
     A                                      idth":"187px","height":"28px","css -
     A                                      class":"stationary","visibility":"h-
     A                                      idden","locked in place":"true"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1040px","id":"W-
     A                                      3020F_SCR01_BtnSave","tool tip":"Sa-
     A                                      ve","onclick":"SystemToolbarSave","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/save.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1066px",-
     A                                      "id":"W3020F_SCR01_BtnRefresh","too-
     A                                      l tip":"Refresh","onclick":"SystemT-
     A                                      oolbarRefresh","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/refresh.png'')"},{"field typ-
     A                                      e":"button","css class":"s')
     A                                  1  4HTML('tationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1092px","-
     A                                      id":"W3020F_SCR01_BtnSearch","tool -
     A                                      tip":"Search","onclick":"SystemTool-
     A                                      barSearch","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/search.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1118px","id":"W3020F_SCR01_Bt-
     A                                      nDiaryItems","tool tip":"Diary/Work-
     A                                       Items - IDARTS","onclick":"SystemT-
     A                                      oolbarDiary","background image":{"f-
     A                                      ieldName":"DryIcnURL","dataLength":-
     A                                      "128","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"}},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1144px","id":"W3020F_SCR01_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"}},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1196px"-
     A                                      ,"id":"W3020F_SCR01_BtnHelp","tool -
     A                                      tip":"Help","onclick":"SystemToolba-
     A                                      rHelp","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/h-
     A                                      elp.png'')"},{"id":"W3020F_SCR01_Im-
     A                                      gSysToolBottom","field type":"image-
     A                                      ","image source":"/profoundui/userd-
     A                                      ata/images/systool/butbarbot.png","-
     A                                      left":"1036px","top":"64px","width"-
     A                                      :"187px","locked in place":"true","-
     A                                      css class":"stationary","visibility-
     A                                      ":"hidden"},{"id":"W3020F_SCR01_Mai-
     A                                      nTabPanel","field type":"tab panel"-
     A                                      ,"tab panel style":"Transform","tab-
     A                                       names":{"fieldName":"SCPRDS","desi-
     A                                      gnValue":"[SCPRDS]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"active tab":"0","left":"-
     A                                      250px","top":"70px","width":"970px"-
     A                                      ,"height":"657px","z index":"8","lo-
     A                                      cked in place":"true","css class":"-
     A                                      tab-panel","css class 2":"stationar-
     A                                      y"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W3020F_S-
     A                                      CR01_BtnHiddenSave","value":"btnSav-
     A                                      e","top":"100px","response":{"field-
     A                                      Name":"btnSave","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"SCUSER","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCUSER","designValue":"[-
     A                                      SCUSER]","refField":"USER","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"2-
     A                                      81px","cursor column":"2","top":"11-
     A                                      0px","cursor row":"1","css class 2"-
     A                                      :"top-line","parent tab panel":"W30-
     A                                      20F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"SCCONM","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCCONM","designValue":"[SCCONM]",-
     A                                      "refField":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"414px","cu-
     A                                      rsor column":"21","top":"110px","cu-
     A                                      rsor row":"1","css class 2":"top-li-
     A                                      ne","css class 3":"HI","description-
     A                                      ":"COMPANY NAME","parent tab panel"-
     A                                      :"W3020F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 4":"profound--
     A                                      converted"},{"id":"constant1","fiel-
     A                                      d type":"output field","left":"778p-
     A                                      x","cursor column":"73","top":"110p-
     A                                      x","cursor row":"1","css class":"to-
     A                                      p-line","value":"js: currentDate()"-
     A                                      ,"css class 2":"output-field","pare-
     A                                      nt tab panel":"W3020F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","c')
     A                                  1  5HTML('ss class 3":"profound-convert-
     A                                      ed"},{"id":"W3020F_SCR01_fkeyMenu",-
     A                                      "field type":"menu","left":"10px","-
     A                                      top":"120px","height":"350px","widt-
     A                                      h":"230px","hover background color"-
     A                                      :"#9AAA61","hover text color":"#FFF-
     A                                      FFF","border color":"#4C6106","menu-
     A                                       option indent":"10px","background -
     A                                      color":"#758B27","css class":"actio-
     A                                      n-menu","css class 2":"stationary",-
     A                                      "z index":"101"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W3020F_SCR01_BtnHiddenRefresh"-
     A                                      ,"value":"btnRefresh","top":"125px"-
     A                                      ,"response":{"fieldName":"btnRefres-
     A                                      h","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"Q1PGM","field type":"outp-
     A                                      ut field","value":{"fieldName":"Q1P-
     A                                      GM","designValue":"[Q1PGM]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none","dataL-
     A                                      ength":"10"},"css class":"output-fi-
     A                                      eld","left":"281px","cursor column"-
     A                                      :"2","top":"130px","cursor row":"2"-
     A                                      ,"parent tab panel":"W3020F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCPRDS","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCPRDS","-
     A                                      designValue":"[SCPRDS]","refField":-
     A                                      "NAME","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"414px","cursor column-
     A                                      ":"21","top":"130px","cursor row":"-
     A                                      2","css class 2":"HI","description"-
     A                                      :"PROGRAM NAME","parent tab panel":-
     A                                      "W3020F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","visibility":"hidden","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"constant2","field type":"outpu-
     A                                      t field","value":"SCR01","css class-
     A                                      ":"constant","left":"799px","cursor-
     A                                       column":"76","top":"130px","cursor-
     A                                       row":"2","parent tab panel":"W3020-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W3020F_-
     A                                      SCR01_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant3","field type":"output field","-
     A                                      value":"Group:","css class":"consta-
     A                                      nt","left":"281px","cursor column":-
     A                                      "2","top":"170px","cursor row":"4",-
     A                                      "parent tab panel":"W3020F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCFND","field type":"output field-
     A                                      ","value":{"fieldName":"SCFND","des-
     A                                      ignValue":"[SCFND]","refField":"FND-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"99-
     A                                      9.00"},"css class":"output-field","-
     A                                      left":"330px","cursor column":"9","-
     A                                      top":"170px","cursor row":"4","widt-
     A                                      h":"21px","text align":"right","err-
     A                                      or message id":"WC30090","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"25","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","parent tab panel":"W30-
     A                                      20F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCNAME","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCNAME","designValue":"[SCNAME]",-
     A                                      "refField":"NM60","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"372px","cu-
     A                                      rsor column":"15","top":"170px","cu-
     A                                      rsor row":"4","description":"FUND N-
     A                                      AME","parent tab panel":"W3020F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W3020F_SCR01-
     A                                      _BtnHiddenDiaryItems","value":"btnD-
     A                                      iary","top":"175px","response":{"fi-
     A                                      eldName":"btnDiary","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W3020F_SCR01_BtnHiddenSyste-
     A                                      mMessages","value":"btnMessage","to-
     A                                      p":"200px","response":{"fieldName":-
     A                                      "btnMessage","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant4","fie-
     A                                      ld type":"output field","value":"Ty-
     A                                      pe information, press Enter.","css -
     A                                      class":"constant","left":"281px","c-
     A                                      ursor column":"2","top":"210px","cu-
     A                                      rsor row":"6","css class 2":"BLU","-
     A                                      parent tab panel":"W3020F_')
     A                                  1  6HTML('SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W30-
     A                                      20F_SCR01_BtnHiddenWorkSubmitJob","-
     A                                      value":"btnWrksbmjob","top":"225px"-
     A                                      ,"response":{"fieldName":"btnWrkJob-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant5","field type":"o-
     A                                      utput field","value":"Commission pe-
     A                                      riod ending date:","css class":"con-
     A                                      stant","left":"295px","cursor colum-
     A                                      n":"4","top":"250px","cursor row":"-
     A                                      8","parent tab panel":"W3020F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCDATE","field type":"date fie-
     A                                      ld","css class":"input","css class -
     A                                      2":"date-field","value":{"fieldName-
     A                                      ":"SCDATE","designValue":"[SCDATE]"-
     A                                      ,"refField":"DT8","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"false","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"-999.00","numBlankFil-
     A                                      l":"true","edtWrd":"''  /  /    ''"-
     A                                      ,"dateFormat":"m/d/Y"},"left":"512p-
     A                                      x","cursor column":"35","top":"250p-
     A                                      x","cursor row":"8","width":"71px",-
     A                                      "text align":"right","css class 3":-
     A                                      "HI","error message id":"WCR0500","-
     A                                      error message file":"WMESGG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"21","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"2 messages","error messag-
     A                                      e id 2":"WCR1058","error message fi-
     A                                      le 2":"WMESGG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"90","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"description":"DAT-
     A                                      E","parent tab panel":"W3020F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 4":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W3020F_SCR01_B-
     A                                      tnHiddenWorkPrinterOutput","value":-
     A                                      "btnWrkprtout","top":"250px","respo-
     A                                      nse":{"fieldName":"btnWrkPrnt","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W3020F_SCR01_Btn-
     A                                      HiddenImageQueue","value":"btnImgQu-
     A                                      e","top":"275px","response":{"field-
     A                                      Name":"btnImgQue","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"constant6"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Commission payment code      :",-
     A                                      "css class":"constant","left":"295p-
     A                                      x","cursor column":"4","top":"290px-
     A                                      ","cursor row":"10","parent tab pan-
     A                                      el":"W3020F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCCODE","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCCODE","designValue"-
     A                                      :"[SCCODE]","refField":"CODE","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "left":"512px","cursor column":"35"-
     A                                      ,"top":"290px","cursor row":"10","w-
     A                                      idth":"15px","css class 3":"UL","cs-
     A                                      s class 4":"HI","set focus":{"field-
     A                                      Name":"26","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error message id-
     A                                      ":"WCR0604","error message file":"W-
     A                                      MESGG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "22","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"3 messages",-
     A                                      "error message id 2":"WCR0605","err-
     A                                      or message file 2":"WMESGG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"23","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r message id 3":"WCR0518","error me-
     A                                      ssage file 3":"WMESGG","error messa-
     A                                      ge library 3":"*LIBL","error condit-
     A                                      ion 3":{"fieldName":"24","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"parent ta-
     A                                      b panel":"W3020F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 5":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W3020F_SCR01_BtnHiddenHelp"-
     A                                      ,"value":"btnHelp","top":"300px","r-
     A                                      esponse":{"fieldName":"btnHelp","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"btnSubmit","field type":"button-
     A                                      ","value":"Enter","shortcut key":"E-
     A                                      nter","left":"14px","top":"150px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"')
     A                                  1  7HTML('id":"btnCF03","field type":"b-
     A                                      utton","value":"Exit","shortcut key-
     A                                      ":"F3","left":"14px","top":"183px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF10","field type":"button","value"-
     A                                      :"Search","shortcut key":"F10","lef-
     A                                      t":"14px","top":"216px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnCF13","fiel-
     A                                      d type":"button","value":"Chg user -
     A                                      parms","shortcut key":"F13","left":-
     A                                      "14px","top":"249px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnHELP","field t-
     A                                      ype":"button","shortcut key":"Alt-F-
     A                                      1","bypass validation":"true","valu-
     A                                      e":"HELP","response":{"fieldName":"-
     A                                      *IN10","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"left":"14px","top":"282px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCODE    R        H      REFFLD(CODE)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDATE    R        H      REFFLD(DT8)
     A            SCFND     R        H      REFFLD(FND)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
