     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20
     A  22 37 38
     A  23 24                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(37 'Response Indicator *IN37')
     A                                      SETOF(38 'Response Indicator *IN38')
     A                                  1  2HTML('QPUIREC5    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C5  -
     A                                        SCFYRC7    WCR0517C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     22RERRMSG-
     A                                      ID  5    C5    SCDTEC7    WCR0500C6-
     A                                          WMESGGC5    *LIBLC0    E1    3 -
     A                                          20RERRMSGID  5    C6    SCLPCTC-
     A                                      7    WCR0547C6    WMESGGC5    *LIBL-
     A                                      C0    E1    3     23RERRMSGID  5   -
     A                                       C6    SCFPCTC7    WCR0547C6    WME-
     A                                      SGGC5    *LIBLC0    E1    3     24')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN22","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN37","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN38","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"valid command-
     A                                       key":{"fieldName":"*IN11","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"overlay -
     A                                      range":"1-23"},"items":[{"id":"W401-
     A                                      0F_SCR01_avKeys","field type":"outp-
     A                                      ut field","value":{"fieldName":"AV_-
     A                                      KEYS","dataLength":"1134","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[AV_KEYS]"},"left":"0px-
     A                                      ","top":"0px","visibility":"hidden"-
     A                                      },{"id":"W4010F_SCR01_action","fiel-
     A                                      d type":"html container","white spa-
     A                                      ce":"normal","left":"0px","top":"10-
     A                                      px","width":"230px","css class":"ac-
     A                                      tion-panel-converted","height":"700-
     A                                      px","html":"<div class=\"top\"></di-
     A                                      v><div class=\"imagetop\"><img src=-
     A                                      \"/profoundui/userdata/images/bar_t-
     A                                      op.png\" /></div><div class=\"menul-
     A                                      inks\"></div><div class=\"imagebott-
     A                                      om\"><img src=\"/profoundui/userdat-
     A                                      a/images/bar_bottom.png\" /></div><-
     A                                      div class=\"bottom\"></div>"},{"fie-
     A                                      ld type":"icon menu button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"32px","z index-
     A                                      ":"20","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1170px","id":"W4010F_SCR-
     A                                      01_BtnIconMenuSystemTools","tool ti-
     A                                      p":"System Tools","icon alignment":-
     A                                      "middle left","icon width":"16px","-
     A                                      icon height":"24px","icon source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /systools.png","data function":"Sys-
     A                                      temToolbarSystools","show down arro-
     A                                      w":"Yes"},{"field type":"panel","pa-
     A                                      nel style":"TransformButtonBar","id-
     A                                      ":"W4010F_SCR01_ButtonBar","top":"3-
     A                                      5px","left":"1036px","width":"187px-
     A                                      ","height":"28px","css class":"stat-
     A                                      ionary","visibility":"hidden","lock-
     A                                      ed in place":"true"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1040px","id":"W4010F_SCR01_-
     A                                      BtnSave","tool tip":"Save","onclick-
     A                                      ":"SystemToolbarSave","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/save.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1066px","id":"W4010F-
     A                                      _SCR01_BtnRefresh","tool tip":"Refr-
     A                                      esh","onclick":"SystemToolbarRefres-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/refre-
     A                                      sh.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      092px","id":"W4010F_SCR01_BtnSearch-
     A                                      ","tool tip":"Search","onclick":"Sy-
     A                                      stemToolbarSearch","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/search.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1118px","id":"W4010F_-
     A                                      SCR01_BtnDiaryItems","tool tip":"Di-
     A                                      ary/Work Items - IDARTS","onclick":-
     A                                      "SystemToolbarDiary","background im-
     A                                      age":{"fieldName":"DryIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color')
     A                                  1  4HTML('":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"W4010F_SCR01_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"W4010-
     A                                      F_SCR01_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemToolbarHelp","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/help.png'')"}-
     A                                      ,{"id":"W4010F_SCR01_ImgSysToolBott-
     A                                      om","field type":"image","image sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/butbarbot.png","left":"1036p-
     A                                      x","top":"64px","width":"187px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      stationary","visibility":"hidden"},-
     A                                      {"id":"W4010F_SCR01_MainTabPanel","-
     A                                      field type":"tab panel","tab panel -
     A                                      style":"Transform","tab names":{"fi-
     A                                      eldName":"SCPRDS","designValue":"[S-
     A                                      CPRDS]","refField":"NAME","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"a-
     A                                      ctive tab":"0","left":"250px","top"-
     A                                      :"70px","width":"970px","height":"6-
     A                                      57px","z index":"8","locked in plac-
     A                                      e":"true","css class":"tab-panel","-
     A                                      css class 2":"stationary"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W4010F_SCR01_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"SCUSER","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CUSER","designValue":"[SCUSER]","re-
     A                                      fField":"USER","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"281px","curso-
     A                                      r column":"2","top":"110px","cursor-
     A                                       row":"1","css class 2":"top-line",-
     A                                      "parent tab panel":"W4010F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"SCCONM","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCCONM","d-
     A                                      esignValue":"[SCCONM]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"414px","cursor column"-
     A                                      :"21","top":"110px","cursor row":"1-
     A                                      ","css class 2":"top-line","css cla-
     A                                      ss 3":"HI","description":"COMPANY N-
     A                                      AME","parent tab panel":"W4010F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 4":"profound-converted"},-
     A                                      {"id":"constant1","field type":"out-
     A                                      put field","left":"778px","cursor c-
     A                                      olumn":"73","top":"110px","cursor r-
     A                                      ow":"1","css class":"top-line","val-
     A                                      ue":"js: currentDate()","css class -
     A                                      2":"output-field","parent tab panel-
     A                                      ":"W4010F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"W4010F_SCR01_fk-
     A                                      eyMenu","field type":"menu","left":-
     A                                      "10px","top":"120px","height":"350p-
     A                                      x","width":"230px","hover backgroun-
     A                                      d color":"#9AAA61","hover text colo-
     A                                      r":"#FFFFFF","border color":"#4C610-
     A                                      6","menu option indent":"10px","bac-
     A                                      kground color":"#758B27","css class-
     A                                      ":"action-menu","css class 2":"stat-
     A                                      ionary","z index":"101"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W4010F_SCR01_BtnHidden-
     A                                      Refresh","value":"btnRefresh","top"-
     A                                      :"125px","response":{"fieldName":"b-
     A                                      tnRefresh","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant2","field-
     A                                       type":"output field","value":"W401-
     A                                      0F","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      30px","cursor row":"2","parent tab -
     A                                      panel":"W4010F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCPRDS","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCPRDS","designValue":-
     A                                      "[SCPRDS]","refField":"NAME","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "414px","cursor column":"2')
     A                                  1  5HTML('1","top":"130px","cursor row"-
     A                                      :"2","css class 2":"HI","descriptio-
     A                                      n":"PROGRAM NAME","parent tab panel-
     A                                      ":"W4010F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","visibility":"hidden","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"constant3","field type":"out-
     A                                      put field","value":"SCR01","css cla-
     A                                      ss":"constant","left":"799px","curs-
     A                                      or column":"76","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"W40-
     A                                      10F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W4010-
     A                                      F_SCR01_BtnHiddenSearch","value":"b-
     A                                      tnSearch","top":"150px","response":-
     A                                      {"fieldName":"btnSearch","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant4","field type":"output field"-
     A                                      ,"value":"Group:","css class":"cons-
     A                                      tant","left":"281px","cursor column-
     A                                      ":"2","top":"170px","cursor row":"4-
     A                                      ","parent tab panel":"W4010F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCFND","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCFND","d-
     A                                      esignValue":"[SCFND]","refField":"F-
     A                                      ND","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"337px","cursor column":"10-
     A                                      ","top":"170px","cursor row":"4","w-
     A                                      idth":"21px","text align":"right","-
     A                                      parent tab panel":"W4010F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCNAME","field type":"output field-
     A                                      ","value":{"fieldName":"SCNAME","de-
     A                                      signValue":"[SCNAME]","refField":"N-
     A                                      M60","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"372px","cursor column":-
     A                                      "15","top":"170px","cursor row":"4"-
     A                                      ,"description":"FUND NAME","parent -
     A                                      tab panel":"W4010F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W4010F_SCR01_BtnHiddenDia-
     A                                      ryItems","value":"btnDiary","top":"-
     A                                      175px","response":{"fieldName":"btn-
     A                                      Diary","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W4010-
     A                                      F_SCR01_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant5","field type":"out-
     A                                      put field","value":"Type informatio-
     A                                      n, press Enter.","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"210px","cursor row":"6"-
     A                                      ,"css class 2":"BLU","parent tab pa-
     A                                      nel":"W4010F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W4010F_SCR01_BtnHiddenWorkSubmi-
     A                                      tJob","value":"btnWrksbmjob","top":-
     A                                      "225px","response":{"fieldName":"bt-
     A                                      nWrkJob","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"constant6","field t-
     A                                      ype":"output field","value":"Policy-
     A                                       year               :","css class":-
     A                                      "constant","left":"295px","cursor c-
     A                                      olumn":"4","top":"250px","cursor ro-
     A                                      w":"8","parent tab panel":"W4010F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCFYR","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCFYR","designValue":"[SCFYR]","ref-
     A                                      Field":"FYR","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00","numBlankFill":"tr-
     A                                      ue"},"left":"491px","cursor column"-
     A                                      :"32","top":"250px","cursor row":"8-
     A                                      ","width":"22px","text align":"righ-
     A                                      t","css class 3":"HI","error messag-
     A                                      e id":"WCR0517","error message file-
     A                                      ":"WMESGG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"22","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"1 messag-
     A                                      e","description":"FUND CENTURY AND -
     A                                      YEAR","parent tab panel":"W4010F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 4":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"defa')
     A                                  1  6HTML('ult","visibility":"hidden","i-
     A                                      d":"W4010F_SCR01_BtnHiddenWorkPrint-
     A                                      erOutput","value":"btnWrkprtout","t-
     A                                      op":"250px","response":{"fieldName"-
     A                                      :"btnWrkPrnt","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W4010F_SCR01_BtnHiddenImageQueue"-
     A                                      ,"value":"btnImgQue","top":"275px",-
     A                                      "response":{"fieldName":"btnImgQue"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant7","field type":"ou-
     A                                      tput field","value":"Run date      -
     A                                                  :","css class":"constan-
     A                                      t","left":"295px","cursor column":"-
     A                                      4","top":"290px","cursor row":"10",-
     A                                      "parent tab panel":"W4010F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCDTE","field type":"date field",-
     A                                      "css class":"input","css class 2":"-
     A                                      date-field","value":{"fieldName":"S-
     A                                      CDTE","designValue":"[SCDTE]","refF-
     A                                      ield":"DT8","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"-999.00","numBlankFill":"tr-
     A                                      ue","edtWrd":"''  /  /    ''","date-
     A                                      Format":"m/d/Y"},"left":"491px","cu-
     A                                      rsor column":"32","top":"290px","cu-
     A                                      rsor row":"10","width":"71px","text-
     A                                       align":"right","css class 3":"HI",-
     A                                      "error message id":"WCR0500","error-
     A                                       message file":"WMESGG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"20","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"1 message","parent tab panel":-
     A                                      "W4010F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 4":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      4010F_SCR01_BtnHiddenHelp","value":-
     A                                      "btnHelp","top":"300px","response":-
     A                                      {"fieldName":"btnHelp","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant8","field type":"output field","-
     A                                      value":"Loss ratio percentage     :-
     A                                      ","css class":"constant","left":"29-
     A                                      5px","cursor column":"4","top":"330-
     A                                      px","cursor row":"12","parent tab p-
     A                                      anel":"W4010F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCLPCT","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCLPCT","designValu-
     A                                      e":"[SCLPCT]","refField":"PC32 7 02-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00","numBlankFill":"true"},"left"-
     A                                      :"491px","cursor column":"32","top"-
     A                                      :"330px","cursor row":"12","width":-
     A                                      "64px","text align":"right","error -
     A                                      message id":"WCR0547","error messag-
     A                                      e file":"WMESGG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"23","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"1 -
     A                                      message","description":"PERCENTAGE"-
     A                                      ,"parent tab panel":"W4010F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant9","field type":"output -
     A                                      field","value":"Frequency ratio per-
     A                                      centage:","css class":"constant","l-
     A                                      eft":"295px","cursor column":"4","t-
     A                                      op":"370px","cursor row":"14","pare-
     A                                      nt tab panel":"W4010F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCF-
     A                                      PCT","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SCFPCT","de-
     A                                      signValue":"[SCFPCT]","refField":"P-
     A                                      C32 7 02","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00","numBlankFill":"true"-
     A                                      },"left":"491px","cursor column":"3-
     A                                      2","top":"370px","cursor row":"14",-
     A                                      "width":"64px","text align":"right"-
     A                                      ,"error message id":"WCR0547","erro-
     A                                      r message file":"WMESGG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"24","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"1 message","description":"PER-
     A                                      CENTAGE","parent tab panel":"W4010F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px","top":"1-
     A                                      50px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF03","field type":"button","-
     A                                      value":"Exit","shortcut key":"F3","-
     A                                      left":"14px","top":"183px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"bt')
     A                                  1  7HTML('nCF13","field type":"button",-
     A                                      "value":"Chg user parms","shortcut -
     A                                      key":"F13","left":"14px","top":"216-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnHELP","field type":"button","sh-
     A                                      ortcut key":"Alt-F1","bypass valida-
     A                                      tion":"true","value":"HELP","respon-
     A                                      se":{"fieldName":"*IN10","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"left":"14p-
     A                                      x","top":"249px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDTE     R        H      REFFLD(DT8)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFPCT    R    7 02H      REFFLD(PC32)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCLPCT    R    7 02H      REFFLD(PC32)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
