     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01S                    SFL
     A                                      SETOF(10)
     A  20 24 06  QPUI000001     1A  O  2  2
     A            SCDPCD         5A  H
     A            SCSEL1         1A  H
     A            SCDPNM    R        H      REFFLD(DS40)
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  10 11 18
     A  19 20 21
     A  22 23 24                            CA01(10 'Response Indicator *IN10')
     A  25 26 27
     A  28 29 30
     A  31 35 36                            CA02(11 'Response Indicator *IN11')
     A  37 38 39
     A  41 01 02
     A  03 04 05                            CA03(18 'Response Indicator *IN18')
     A  32 33 70                            CA04(19 'Response Indicator *IN19')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(36 'Response Indicator *IN36')
     A                                      SETOF(37 'Response Indicator *IN37')
     A                                      SETOF(38 'Response Indicator *IN38')
     A                                      SETOF(39 'Response Indicator *IN39')
     A                                      SETOF(41 'Response Indicator *IN41')
     A                                  1  2HTML('QPUICTL1    SCR01S    7    RS-
     A                                      FLDSP    0    E1    3     01RSFLDSP-
     A                                      CTL 0    E1    3     01RSFLINZ    0-
     A                                          E1    3     02RSFLDLT    0    E-
     A                                      1    3     03RSFLCLR    0    E1    -
     A                                      3     04RSFLPAG    1    C2    10 RS-
     A                                      FLSIZ    1    C3    999 0    28   R-
     A                                      OVERLAY   0     RROWS      2    C1 -
     A                                         1C2    21 RSFLMSGID  4    C7    -
     A                                      SCM0510C6    SCMESGC5    *LIBLC0   -
     A                                       E1    3     24RSFLMSGID  4    C7  -
     A                                        CPF5203C7    QCPFMSGC5    *LIBLC0-
     A                                          E1    6     32 18RSFLMSGID  4  -
     A                                        C7    CPF5203C7    QCPFMSGC5    *-
     A                                      LIBLC0    E1    6     33 19RERRMSGI-
     A                                      D  5    C6    SCFEMPC7    WCR0694C6-
     A                                          WMESGGC5    *LIBLC0    E1    3 -
     A                                          21RERRMSGID  5    C6    SCFEMPC-
     A                                      7    WCR0835C6    WMESGGC5    *LIBL-
     A                                      C0    E1    3     27RERRMSGID  5   -
     A                                       C6    SCFEMPC7    WCR0728C6    WME-
     A                                      SGGC5    *LIBLC0    E1    3     28R-
     A                                      ERRMSGID  5    C6    SCFEMPC7    WC-
     A                                      R0538C6    WMESGGC5    *LIBLC0    E-
     A                                      1    3     38RERRMSGID  5    C6    -
     A                                      SCFEMPC7    WCR0947C6    WMESGGC5  -
     A                                        *LIBLC0    E1    3     39RERRMSGI-
     A                                      D  5    C6    SCFDIVC7    WCR0694C6-
     A                                          WMESGGC5    *LIBLC0    E1    3 -
     A                                          21RERRMSGID  5    C6    SCFDIVC-
     A                                      7    WCR0835C6    WMESGGC5    *LIBL-
     A                                      C0    E1    3     27RERRMSGID  5   -
     A                                       C6    SCFDIVC7    WCR0728C6    WME-
     A                                      SGGC5    *LIBLC0    E1    3     28R-
     A                                      ERRMSGID  5    C6    SCFDIVC7    WC-
     A                                      R0538C6    WMESGGC5    *LIBLC0    E-
     A                                      1    3     38RERRMSGID  5    C6    -
     A                                      SCFDIVC7    WCR0947C6    WMESGGC5  -
     A                                        *LIBLC0    E1    3     39RERRMSGI-
     A                                      D  5    C6    SCTEMPC7    WCR0694C6-
     A                                          WMESGGC5    *LIBLC0    E1    3 -
     A                                          22RERRMSGID  5    C6    SCTEMPC-
     A                                      7    WCR0835C6    WMESGGC5    *LIBL-
     A                                      C0    E1    3     27RERRMSGID  5   -
     A                                       C6    SCTEMPC7    WCR0728C6    WME-
     A                                      SGGC5    *LIBLC0    E1    3     28R-
     A                                      ERRMSGID  5    C6    SCTEMPC7    WC-
     A                                      R0947C6    WMESGGC5    *LIBLC0    E-
     A                                      1    3     41RERRMSGID  5    C6    -
     A                                      SCTDIVC7    WCR0694C6    WMESGGC5  -
     A                                        *LIBLC0    E1    3     22RERRMSGI-
     A                                      D  5    C6    SCTDIVC7    WCR0835C6-
     A                                          WMESGGC5    *LIBLC0    E1    3 -
     A                                          27RERRMSGID  5    C6    SCTDIVC-
     A                                      7    WCR0728C6    WMESGGC5    *LIBL-
     A                                      C0    E1    3     28RERRMSGID  5   -
     A                                       C6    SCTDIVC7    WCR0947C6    WME-
     A                                      SGGC5    *LIBLC0    E1    3     41R-
     A                                      ERRMSGID  5    C6    SCAEFLC7    WC-
     A                                      R0501C6    WMESGGC5    *LIBLC0    E-
     A                                      1    3     25RERRMSGID  5    C5    -
     A                                      SCFYRC7    WCR0517C6    WMESGGC5   -
     A                                       *LIBLC0    E1    3     20RERRMSGID-
     A                                        5    C5    SCFYRC7    WCR0947C6  -
     A                                        WMESGGC5    *LIBLC0    E2    3   -
     A                                        393     41RERRMSGID  5    C6    F-
     A                                      LD001C7    WCR0833C6    WMESGGC5   -
     A                                       *LIBLC0    E1    3     26RERRMSGID-
     A                                        5    C5    SCERRC7    WCR0833C6  -
     A                                        WMESGGC5    *LIBLC0    E1    3   -
     A                                        26')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"description":"Subfile Control for-
     A                                       GENERATE POLICY DEPT LETTERS","set-
     A                                       off":{"fieldName":"*IN20","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"set off -
     A                                      2":{"fieldName":"*IN21","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 3":-
     A                                      {"fieldName":"*IN22","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"set off 4":{"f-
     A                                      ieldName":"*IN23","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 5":{"fiel-
     A                                      dName":"*IN24","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"set off 6":{"fieldNa-
     A                                      me":"*IN25","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 7":{"fieldName"-
     A                                      :"*IN26","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"set off 8":{"fieldName":"*-
     A                                      IN27","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 9":{"fieldName":"*IN2-
     A                                      8","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 10":{"fieldName":"*IN29"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 11":{"fieldName":"*IN30","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 12":{"fieldName":"*IN31","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 13":{"fieldName":"*IN35","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 14":{"fieldName":"*IN36","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       15":{"fieldName":"*IN37","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 1-
     A                                      6":{"fieldName":"*IN38","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 17"-
     A                                      :{"fieldName":"*IN39","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 18":{-
     A                                      "fieldName":"*IN41","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"return cursor r-
     A                                      ecord":{"fieldName":"HREC","dataLen-
     A                                      gth":"10","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"none"},"return cursor field":{"-
     A                                      fieldName":"HFLD","dataLength":"10"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      },"overlay":"true","error message i-
     A                                      d":"SCM0510","error message file":"-
     A                                      SCMESG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"24","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"3 messages"-
     A                                      ,"error message id 2":"CPF5203","er-
     A                                      ror message file 2":"QCPFMSG","erro-
     A                                      r message library 2":"*LIBL","error-
     A                                       condition 2":{"fieldName":"32 and -
     A                                      18","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error message id 3":"CPF5203",-
     A                                      "error message file 3":"QCPFMSG","e-
     A                                      rror message library 3":"*LIBL","er-
     A                                      ror condition 3":{"fieldName":"33 a-
     A                                      nd 19","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"valid command key":{"fieldN-
     A                                      ame":"*IN11","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"overlay range":"1-21"}-
     A                                      ,"items":[{"id":"#@$1","field type"-
     A                                      :"output field","visibility":"hidde-
     A                                      n","value":{"fieldName":"#@$1","des-
     A                                      ignValue":"[#@$1]","dataType":"zone-
     A                                      d","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"true","curSym":"","units":"","-
     A                                      negNum":"-999.00","dataLength":"3",-
     A                                      "decPos":"0"},"left":"0px","top":"--
     A                                      30px","width":"21px","text align":"-
     A                                      right","css class":"profound-conver-
     A                                      ted"},{"id":"HREC","field type":"ou-
     A                                      tput field","visibility":"hidden","-
     A                                      value":{"fieldName":"HREC","designV-
     A                                      alue":"[HREC]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none","dataLength":"10"},"-
     A                                      left":"0px","top":"-30px","css clas-
     A                                      s":"profound-converted"},{"id":"HFL-
     A                                      D","field type":"output field","vis-
     A                                      ibility":"hidden","value":{"fieldNa-
     A                                      me":"HFLD","designValue":"[HFLD]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none","-
     A                                      dataLength":"10"},"left":"0px","top-
     A                                      ":"-30px","css class":"profound-con-
     A                                      verted"},{"id":"W4115F_SCR01C_avKey-
     A                                      s","field type":"output field","val-
     A                                      ue":{"fieldName":"AV_KEYS","dataLen-
     A                                      gth":"1134","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none","designV')
     A                                  1  4HTML('alue":"[AV_KEYS]"},"left":"0p-
     A                                      x","top":"0px","visibility":"hidden-
     A                                      "},{"id":"W4115F_SCR01C_action","fi-
     A                                      eld type":"html container","white s-
     A                                      pace":"normal","left":"0px","top":"-
     A                                      10px","width":"230px","css class":"-
     A                                      action-panel-converted","height":"7-
     A                                      00px","html":"<div class=\"top\"></-
     A                                      div><div class=\"imagetop\"><img sr-
     A                                      c=\"/profoundui/userdata/images/bar-
     A                                      _top.png\" /></div><div class=\"men-
     A                                      ulinks\"></div><div class=\"imagebo-
     A                                      ttom\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_bottom.png\" /></div-
     A                                      ><div class=\"bottom\"></div>"},{"f-
     A                                      ield type":"icon menu button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"32px","z ind-
     A                                      ex":"20","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1170px","id":"W4115F_S-
     A                                      CR01C_BtnIconMenuSystemTools","tool-
     A                                       tip":"System Tools","icon alignmen-
     A                                      t":"middle left","icon width":"16px-
     A                                      ","icon height":"24px","icon source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/systools.png","data function":"-
     A                                      SystemToolbarSystools","show down a-
     A                                      rrow":"Yes"},{"field type":"panel",-
     A                                      "panel style":"TransformButtonBar",-
     A                                      "id":"W4115F_SCR01C_ButtonBar","top-
     A                                      ":"35px","left":"1036px","width":"1-
     A                                      87px","height":"28px","css class":"-
     A                                      stationary","visibility":"hidden","-
     A                                      locked in place":"true"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1040px","id":"W4115F_SC-
     A                                      R01C_BtnSave","tool tip":"Save","on-
     A                                      click":"SystemToolbarSave","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/save.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1066px","id":"W-
     A                                      4115F_SCR01C_BtnRefresh","tool tip"-
     A                                      :"Refresh","onclick":"SystemToolbar-
     A                                      Refresh","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /refresh.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1092px","id":"W4115F_SCR01C_Bt-
     A                                      nSearch","tool tip":"Search","oncli-
     A                                      ck":"SystemToolbarSearch","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/search.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1118px","id":"-
     A                                      W4115F_SCR01C_BtnDiaryItems","tool -
     A                                      tip":"Diary/Work Items - IDARTS","o-
     A                                      nclick":"SystemToolbarDiary","backg-
     A                                      round image":{"fieldName":"DryIcnUR-
     A                                      L","dataLength":"128","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"}},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1144px","id":"W411-
     A                                      5F_SCR01C_BtnSystemMessages","tool -
     A                                      tip":"System Messages","onclick":"S-
     A                                      ystemToolbarMessages","background i-
     A                                      mage":{"fieldName":"MsgIcnURL","dat-
     A                                      aLength":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1196px","id":"W4115F_SCR0-
     A                                      1C_BtnHelp","tool tip":"Help","oncl-
     A                                      ick":"SystemToolbarHelp","backgroun-
     A                                      d image":"url(''/profoundu')
     A                                  1  5HTML('i/userdata/images/systool/hel-
     A                                      p.png'')"},{"id":"W4115F_SCR01C_Img-
     A                                      SysToolBottom","field type":"image"-
     A                                      ,"image source":"/profoundui/userda-
     A                                      ta/images/systool/butbarbot.png","l-
     A                                      eft":"1036px","top":"64px","width":-
     A                                      "187px","locked in place":"true","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden"},{"id":"W4115F_SCR01C_Mai-
     A                                      nTabPanel","field type":"tab panel"-
     A                                      ,"tab panel style":"Transform","tab-
     A                                       names":{"fieldName":"SCPRDS","desi-
     A                                      gnValue":"[SCPRDS]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"active tab":"0","left":"-
     A                                      250px","top":"70px","width":"970px"-
     A                                      ,"height":"657px","z index":"8","lo-
     A                                      cked in place":"true","css class":"-
     A                                      tab-panel","css class 2":"stationar-
     A                                      y"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W4115F_S-
     A                                      CR01C_BtnHiddenSave","value":"btnSa-
     A                                      ve","top":"100px","response":{"fiel-
     A                                      dName":"btnSave","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant1",-
     A                                      "field type":"output field","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      110px","cursor row":"1","css class"-
     A                                      :"top-line","value":"js: currentUse-
     A                                      r()","css class 2":"output-field","-
     A                                      parent tab panel":"W4115F_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"SCCONM","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCCONM","d-
     A                                      esignValue":"[SCCONM]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"414px","cursor column"-
     A                                      :"21","top":"110px","cursor row":"1-
     A                                      ","css class 2":"top-line","css cla-
     A                                      ss 3":"HI","description":"COMPANY N-
     A                                      AME","parent tab panel":"W4115F_SCR-
     A                                      01C_MainTabPanel","parent tab":"0",-
     A                                      "css class 4":"profound-converted"}-
     A                                      ,{"id":"constant2","field type":"ou-
     A                                      tput field","left":"778px","cursor -
     A                                      column":"73","top":"110px","cursor -
     A                                      row":"1","css class":"top-line","va-
     A                                      lue":"js: currentDate()","css class-
     A                                       2":"output-field","parent tab pane-
     A                                      l":"W4115F_SCR01C_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"W4115F_SCR01C-
     A                                      _fkeyMenu","field type":"menu","lef-
     A                                      t":"10px","top":"120px","height":"3-
     A                                      50px","width":"230px","hover backgr-
     A                                      ound color":"#9AAA61","hover text c-
     A                                      olor":"#FFFFFF","border color":"#4C-
     A                                      6106","menu option indent":"10px","-
     A                                      background color":"#758B27","css cl-
     A                                      ass":"action-menu","css class 2":"s-
     A                                      tationary","z index":"101"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W4115F_SCR01C_BtnHi-
     A                                      ddenRefresh","value":"btnRefresh","-
     A                                      top":"125px","response":{"fieldName-
     A                                      ":"btnRefresh","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"Q1PGM","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"Q1PGM","designValue":"[Q1P-
     A                                      GM]","refField":"DS10","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"281px-
     A                                      ","cursor column":"2","top":"130px"-
     A                                      ,"cursor row":"2","parent tab panel-
     A                                      ":"W4115F_SCR01C_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCPRDS","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCPRDS","designValue":"[SC-
     A                                      PRDS]","refField":"NAME","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"414-
     A                                      px","cursor column":"21","top":"130-
     A                                      px","cursor row":"2","css class 2":-
     A                                      "HI","description":"PROGRAM NAME","-
     A                                      parent tab panel":"W4115F_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","visib-
     A                                      ility":"hidden","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant3",-
     A                                      "field type":"output field","value"-
     A                                      :"SCR01","css class":"constant","le-
     A                                      ft":"799px","cursor column":"76","t-
     A                                      op":"130px","cursor row":"2","paren-
     A                                      t tab panel":"W4115F_SCR01C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant4","field type":"output field"-
     A                                      ,"value":"Group:","css class":"cons-
     A                                      tant","left":"281px","cursor column-
     A                                      ":"2","top":"150px","cursor row":"3-
     A                                      ","parent tab panel":"W4115F_SCR01C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCFND","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCFND","-
     A                                      designValue":"[SCFND]","refField":"-
     A                                      FND","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00"},"css class":"out')
     A                                  1  6HTML('put-field","left":"337px","cu-
     A                                      rsor column":"10","top":"150px","cu-
     A                                      rsor row":"3","width":"21px","text -
     A                                      align":"right","parent tab panel":"-
     A                                      W4115F_SCR01C_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCNAME","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCNAME","designValue":"[SCNAM-
     A                                      E]","refField":"NM60","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"372px"-
     A                                      ,"cursor column":"15","top":"150px"-
     A                                      ,"cursor row":"3","description":"FU-
     A                                      ND NAME","parent tab panel":"W4115F-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W4115F_-
     A                                      SCR01C_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant5","field type":"output field",-
     A                                      "value":"Emp #:","css class":"const-
     A                                      ant","visibility":{"fieldName":"70"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"281px","cursor -
     A                                      column":"2","top":"170px","cursor r-
     A                                      ow":"4","parent tab panel":"W4115F_-
     A                                      SCR01C_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"constant6","field type":-
     A                                      "output field","value":"Selection c-
     A                                      riteria:","css class":"constant","v-
     A                                      isibility":{"fieldName":"N70","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"281px","cursor column-
     A                                      ":"2","top":"170px","cursor row":"4-
     A                                      ","parent tab panel":"W4115F_SCR01C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCEDN","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCEDN","-
     A                                      designValue":"[SCEDN]","refField":"-
     A                                      DS60","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","visibility":{"fieldName":"70"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"337px","cursor -
     A                                      column":"10","top":"170px","cursor -
     A                                      row":"4","parent tab panel":"W4115F-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W4115F_-
     A                                      SCR01C_BtnHiddenDiaryItems","value"-
     A                                      :"btnDiary","top":"175px","response-
     A                                      ":{"fieldName":"btnDiary","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant8","field type":"output field-
     A                                      ","value":"Employer/div          :"-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"N70","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"190px","cursor row":"5","parent-
     A                                       tab panel":"W4115F_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant7","field type":"output field",-
     A                                      "value":"Year :","css class":"const-
     A                                      ant","visibility":{"fieldName":"70"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"281px","cursor -
     A                                      column":"2","top":"190px","cursor r-
     A                                      ow":"5","parent tab panel":"W4115F_-
     A                                      SCR01C_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCYR","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCY-
     A                                      R","designValue":"[SCYR]","refField-
     A                                      ":"FYR","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00"},"css class":"output-fie-
     A                                      ld","visibility":{"fieldName":"70",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"337px","cursor c-
     A                                      olumn":"10","top":"190px","cursor r-
     A                                      ow":"5","width":"21px","text align"-
     A                                      :"right","parent tab panel":"W4115F-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCFEMP","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCFEMP","designValue":"[SCFEMP]-
     A                                      ","refField":"EMP#","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"999.00","numBlankFi-
     A                                      ll":"true"},"visibility":{"fieldNam-
     A                                      e":"N70","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"456px",-
     A                                      "cursor column":"27","top":"190px",-
     A                                      "cursor row":"5","width":"64px","te-
     A                                      xt align":"right","set foc')
     A                                  1  7HTML('us":{"fieldName":"29","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 3":"UL","error message i-
     A                                      d":"WCR0694","error message file":"-
     A                                      WMESGG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"21","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"5 messages"-
     A                                      ,"error message id 2":"WCR0835","er-
     A                                      ror message file 2":"WMESGG","error-
     A                                       message library 2":"*LIBL","error -
     A                                      condition 2":{"fieldName":"27","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or message id 3":"WCR0728","error m-
     A                                      essage file 3":"WMESGG","error mess-
     A                                      age library 3":"*LIBL","error condi-
     A                                      tion 3":{"fieldName":"28","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssage id 4":"WCR0538","error messag-
     A                                      e file 4":"WMESGG","error message l-
     A                                      ibrary 4":"*LIBL","error condition -
     A                                      4":{"fieldName":"38","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                       id 5":"WCR0947","error message fil-
     A                                      e 5":"WMESGG","error message librar-
     A                                      y 5":"*LIBL","error condition 5":{"-
     A                                      fieldName":"39","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"description":"From-
     A                                       Employer #","parent tab panel":"W4-
     A                                      115F_SCR01C_MainTabPanel","parent t-
     A                                      ab":"0","css class 4":"profound-con-
     A                                      verted"},{"id":"constant9","field t-
     A                                      ype":"output field","value":"/","cs-
     A                                      s class":"constant","visibility":{"-
     A                                      fieldName":"N70","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "526px","cursor column":"37","top":-
     A                                      "190px","cursor row":"5","parent ta-
     A                                      b panel":"W4115F_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCFDIV"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCFDIV","design-
     A                                      Value":"[SCFDIV]","refField":"DIV",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00","numBlankFill":"true"},"visibil-
     A                                      ity":{"fieldName":"N70","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"540px","cursor column":"39"-
     A                                      ,"top":"190px","cursor row":"5","wi-
     A                                      dth":"36px","text align":"right","c-
     A                                      ss class 3":"UL","error message id"-
     A                                      :"WCR0694","error message file":"WM-
     A                                      ESGG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      21","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"5 messages","-
     A                                      error message id 2":"WCR0835","erro-
     A                                      r message file 2":"WMESGG","error m-
     A                                      essage library 2":"*LIBL","error co-
     A                                      ndition 2":{"fieldName":"27","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       message id 3":"WCR0728","error mes-
     A                                      sage file 3":"WMESGG","error messag-
     A                                      e library 3":"*LIBL","error conditi-
     A                                      on 3":{"fieldName":"28","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      age id 4":"WCR0538","error message -
     A                                      file 4":"WMESGG","error message lib-
     A                                      rary 4":"*LIBL","error condition 4"-
     A                                      :{"fieldName":"38","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error message i-
     A                                      d 5":"WCR0947","error message file -
     A                                      5":"WMESGG","error message library -
     A                                      5":"*LIBL","error condition 5":{"fi-
     A                                      eldName":"39","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"description":"From D-
     A                                      iv","parent tab panel":"W4115F_SCR0-
     A                                      1C_MainTabPanel","parent tab":"0","-
     A                                      css class 4":"profound-converted"},-
     A                                      {"id":"constant10","field type":"ou-
     A                                      tput field","value":"to","css class-
     A                                      ":"constant","visibility":{"fieldNa-
     A                                      me":"N70","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"582px"-
     A                                      ,"cursor column":"45","top":"190px"-
     A                                      ,"cursor row":"5","parent tab panel-
     A                                      ":"W4115F_SCR01C_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCTEMP","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCTEMP","designValue":-
     A                                      "[SCTEMP]","refField":"EMP#","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"999.00","n-
     A                                      umBlankFill":"true"},"visibility":{-
     A                                      "fieldName":"N70","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"603px","cursor column":"48","top"-
     A                                      :"190px","cursor row":"5","width":"-
     A                                      64px","text align":"right","set foc-
     A                                      us":{"fieldName":"30","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 3":"UL","error message id":"WC-
     A                                      R0694","error message file":"WMESGG-
     A                                      ","error message library":')
     A                                  1  8HTML('"*LIBL","error condition":{"f-
     A                                      ieldName":"22","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"4 -
     A                                      messages","error message id 2":"WCR-
     A                                      0835","error message file 2":"WMESG-
     A                                      G","error message library 2":"*LIBL-
     A                                      ","error condition 2":{"fieldName":-
     A                                      "27","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error message id 3":"WCR0728"-
     A                                      ,"error message file 3":"WMESGG","e-
     A                                      rror message library 3":"*LIBL","er-
     A                                      ror condition 3":{"fieldName":"28",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error message id 4":"WCR0947","err-
     A                                      or message file 4":"WMESGG","error -
     A                                      message library 4":"*LIBL","error c-
     A                                      ondition 4":{"fieldName":"41","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"desc-
     A                                      ription":"To Employer #","parent ta-
     A                                      b panel":"W4115F_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 4":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t11","field type":"output field","v-
     A                                      alue":"/","css class":"constant","v-
     A                                      isibility":{"fieldName":"N70","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"673px","cursor column-
     A                                      ":"58","top":"190px","cursor row":"-
     A                                      5","parent tab panel":"W4115F_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCTDIV","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      TDIV","designValue":"[SCTDIV]","ref-
     A                                      Field":"DIV","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00","numBlankFill":"tr-
     A                                      ue"},"visibility":{"fieldName":"N70-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"687px","cursor-
     A                                       column":"60","top":"190px","cursor-
     A                                       row":"5","width":"36px","text alig-
     A                                      n":"right","css class 3":"UL","erro-
     A                                      r message id":"WCR0694","error mess-
     A                                      age file":"WMESGG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"22","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      4 messages","error message id 2":"W-
     A                                      CR0835","error message file 2":"WME-
     A                                      SGG","error message library 2":"*LI-
     A                                      BL","error condition 2":{"fieldName-
     A                                      ":"27","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error message id 3":"WCR072-
     A                                      8","error message file 3":"WMESGG",-
     A                                      "error message library 3":"*LIBL","-
     A                                      error condition 3":{"fieldName":"28-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 4":"WCR0947","e-
     A                                      rror message file 4":"WMESGG","erro-
     A                                      r message library 4":"*LIBL","error-
     A                                       condition 4":{"fieldName":"41","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"de-
     A                                      scription":"To Div","parent tab pan-
     A                                      el":"W4115F_SCR01C_MainTabPanel","p-
     A                                      arent tab":"0","css class 4":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W4115F_SCR01C_BtnHiddenSystemMe-
     A                                      ssages","value":"btnMessage","top":-
     A                                      "200px","response":{"fieldName":"bt-
     A                                      nMessage","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant12","field-
     A                                       type":"output field","value":"Acti-
     A                                      ve employers only?:","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "N70","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"281px","cu-
     A                                      rsor column":"2","top":"210px","cur-
     A                                      sor row":"6","parent tab panel":"W4-
     A                                      115F_SCR01C_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCAEFL","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCAEFL","designValue":"[SCA-
     A                                      EFL]","refField":"FLAG","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","visib-
     A                                      ility":{"fieldName":"N70","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"456px","cursor column":"2-
     A                                      7","top":"210px","cursor row":"6","-
     A                                      width":"8px","set focus":{"fieldNam-
     A                                      e":"31","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 3":"UL","-
     A                                      error message id":"WCR0501","error -
     A                                      message file":"WMESGG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"25","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"1 message","description":"Activ-
     A                                      e Employers Only Flag","parent tab -
     A                                      panel":"W4115F_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 4":"pr-
     A                                      ofound-converted"},{"id":"')
     A                                  1  9HTML('constant13","field type":"out-
     A                                      put field","value":"Year :","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"N70","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"491-
     A                                      px","cursor column":"32","top":"210-
     A                                      px","cursor row":"6","parent tab pa-
     A                                      nel":"W4115F_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCFYR","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCFYR","designValue"-
     A                                      :"[SCFYR]","refField":"FYR","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"-999.00","n-
     A                                      umBlankFill":"true"},"visibility":{-
     A                                      "fieldName":"N70","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"540px","cursor column":"39","top"-
     A                                      :"210px","cursor row":"6","width":"-
     A                                      22px","text align":"right","css cla-
     A                                      ss 3":"UL","set focus":{"fieldName"-
     A                                      :"35","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"error message id":"WC-
     A                                      R0517","error message file":"WMESGG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"20",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"2 messages","erro-
     A                                      r message id 2":"WCR0947","error me-
     A                                      ssage file 2":"WMESGG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"39 or 41","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"par-
     A                                      ent tab panel":"W4115F_SCR01C_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 4":"profound-converted"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W4115F_SCR01C_BtnHid-
     A                                      denWorkSubmitJob","value":"btnWrksb-
     A                                      mjob","top":"225px","response":{"fi-
     A                                      eldName":"btnWrkJob","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t14","field type":"output field","v-
     A                                      alue":"Type option, press Enter.","-
     A                                      css class":"constant","visibility":-
     A                                      {"fieldName":"70","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "230px","cursor row":"7","css class-
     A                                       2":"BLU","parent tab panel":"W4115-
     A                                      F_SCR01C_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant15","field typ-
     A                                      e":"output field","value":"Type opt-
     A                                      ion, press Enter.","css class":"con-
     A                                      stant","visibility":{"fieldName":"N-
     A                                      70","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"281px","curs-
     A                                      or column":"2","top":"250px","curso-
     A                                      r row":"8","css class 2":"BLU","par-
     A                                      ent tab panel":"W4115F_SCR01C_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant16","field type":"output fie-
     A                                      ld","value":"1=Select","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"70","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"295px","c-
     A                                      ursor column":"4","top":"250px","cu-
     A                                      rsor row":"8","css class 2":"BLU","-
     A                                      parent tab panel":"W4115F_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W4115F_SCR01C_Btn-
     A                                      HiddenWorkPrinterOutput","value":"b-
     A                                      tnWrkprtout","top":"250px","respons-
     A                                      e":{"fieldName":"btnWrkPrnt","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "constant17","field type":"output f-
     A                                      ield","value":"1=Select","css class-
     A                                      ":"constant","visibility":{"fieldNa-
     A                                      me":"N70","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"295px"-
     A                                      ,"cursor column":"4","top":"270px",-
     A                                      "cursor row":"9","css class 2":"BLU-
     A                                      ","parent tab panel":"W4115F_SCR01C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W4115F_SCR01C_-
     A                                      BtnHiddenImageQueue","value":"btnIm-
     A                                      gQue","top":"275px","response":{"fi-
     A                                      eldName":"btnImgQue","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"FLD001"-
     A                                      ,"field type":"password field","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"FLD001",-
     A                                      "designValue":"[FLD001]","refField"-
     A                                      :"FLAG","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","left":"281px')
     A                                  1 10HTML('","cursor column":"2","top":"-
     A                                      290px","cursor row":"10","width":"8-
     A                                      px","read only":"true","css class 3-
     A                                      ":"PR","error message id":"WCR0833"-
     A                                      ,"error message file":"WMESGG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"26","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"1 message","description-
     A                                      ":"Error message field for non-sele-
     A                                      ction","parent tab panel":"W4115F_S-
     A                                      CR01C_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"SCERR","field type":"pass-
     A                                      word field","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCERR","designValue":"[SCER-
     A                                      R]","refField":"FLAG","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase"},"t-
     A                                      ext transform":"uppercase","left":"-
     A                                      400px","cursor column":"19","top":"-
     A                                      290px","cursor row":"10","width":"8-
     A                                      px","read only":"true","css class 3-
     A                                      ":"PR","error message id":"WCR0833"-
     A                                      ,"error message file":"WMESGG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"26","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"1 message","description-
     A                                      ":"Error message field for non-sele-
     A                                      ction","parent tab panel":"W4115F_S-
     A                                      CR01C_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W4115F_SC-
     A                                      R01C_BtnHiddenHelp","value":"btnHel-
     A                                      p","top":"300px","response":{"field-
     A                                      Name":"btnHelp","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant18",-
     A                                      "field type":"output field","value"-
     A                                      :"Opt","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"310px","cursor row":"11","css cla-
     A                                      ss 2":"HI","parent tab panel":"W411-
     A                                      5F_SCR01C_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted","css class 4":"subfile-headin-
     A                                      g"},{"id":"constant19","field type"-
     A                                      :"output field","value":"Department-
     A                                      ","css class":"constant","left":"31-
     A                                      6px","cursor column":"7","top":"310-
     A                                      px","cursor row":"11","css class 2"-
     A                                      :"HI","parent tab panel":"W4115F_SC-
     A                                      R01C_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      ,"css class 4":"subfile-heading"},{-
     A                                      "id":"SCR01S","field type":"grid","-
     A                                      number of columns":"2","record form-
     A                                      at name":"SCR01S","display subfile"-
     A                                      :{"fieldName":"01","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"display -
     A                                      control record":{"fieldName":"01","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"clear subfile":{"fieldName":-
     A                                      "04","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"subfile size":"999","i-
     A                                      nitialize subfile":{"fieldName":"02-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"delete subfile":{"fieldNa-
     A                                      me":"03","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"place cursor":"tru-
     A                                      e","header height":"20","row height-
     A                                      ":"20","css class":"subfilegrid","c-
     A                                      ss class 2":"profound-converted","p-
     A                                      arent tab panel":"W4115F_SCR01C_Mai-
     A                                      nTabPanel","parent tab":"0","subfil-
     A                                      e end":{"fieldName":"05","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"pa-
     A                                      ge down response":{"fieldName":"*IN-
     A                                      18","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"page up response":{"fieldName":-
     A                                      "*IN19","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"show paging controls":"true-
     A                                      ","scrollbar":"none","number of row-
     A                                      s":"11","top":"310px","left":"281px-
     A                                      ","column widths":"30,523","subfile-
     A                                       record number":{"fieldName":"#@$1"-
     A                                      ,"designValue":"[#@$1]","dataType":-
     A                                      "zoned","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"true","curSym":"","units"-
     A                                      :"","negNum":"-999.00","dataLength"-
     A                                      :"3","decPos":"0"}},{"id":"btnSubmi-
     A                                      t","field type":"button","value":"E-
     A                                      nter","shortcut key":"Enter","left"-
     A                                      :"14px","top":"150px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF03","field -
     A                                      type":"button","visibility":{"field-
     A                                      Name":"N70","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"value":"Exi-
     A                                      t","shortcut key":"F3","left":"14px-
     A                                      ","top":"183px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnCF10","field type":-
     A                                      "button","visibility":{"fieldName":-
     A                                      "N70","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"value":"Search","-
     A                                      shortcut key":"F10","left"')
     A                                  1 11HTML(':"14px","top":"216px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF12","-
     A                                      field type":"button","visibility":{-
     A                                      "fieldName":"70","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"value"-
     A                                      :"Cancel","shortcut key":"F12","lef-
     A                                      t":"14px","top":"249px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnCF13","fiel-
     A                                      d type":"button","visibility":{"fie-
     A                                      ldName":"N70","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"value":"C-
     A                                      hg user parms","shortcut key":"F13"-
     A                                      ,"left":"14px","top":"282px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnHELP",-
     A                                      "field type":"button","shortcut key-
     A                                      ":"Alt-F1","bypass validation":"tru-
     A                                      e","value":"HELP","response":{"fiel-
     A                                      dName":"*IN10","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"left":"14px","top":"-
     A                                      315px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"SCDPCD","field type":"output fi-
     A                                      eld","visibility":"hidden","value":-
     A                                      {"fieldName":"SCDPCD","designValue"-
     A                                      :"[SCDPCD]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"5"},"left-
     A                                      ":"-45px","top":"-359px","css class-
     A                                      ":"profound-converted","grid":"SCR0-
     A                                      1S","column":"0"},{"id":"SCSEL1","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCSEL1","designVal-
     A                                      ue":"[SCSEL1]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase","dataLength":"1-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"7px","cursor column":"3","top"-
     A                                      :"1px","cursor row":"12","width":"8-
     A                                      px","css class 3":{"fieldName":"N06-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"css class 4":{"fieldName-
     A                                      ":"20","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"RI","cu-
     A                                      stomFalse":""},"set focus":{"fieldN-
     A                                      ame":"24","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"description":"Sel-
     A                                      ection Field","css class 5":"profou-
     A                                      nd-converted","grid":"SCR01S","colu-
     A                                      mn":"0"},{"id":"SCDPNM","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCDPNM","designValue":"[SCDPNM]-
     A                                      ","refField":"DS40","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"5px","cu-
     A                                      rsor column":"7","top":"1px","curso-
     A                                      r row":"12","description":"Departme-
     A                                      nt name","css class 2":"profound-co-
     A                                      nverted","grid":"SCR01S","column":"-
     A                                      1"}]}')
     A            #@$1           3S 0H
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            FLD001    R        H      REFFLD(FLAG)
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCAEFL    R        H      REFFLD(FLAG)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCEDN     R        H      REFFLD(DS60)
     A            SCERR     R        H      REFFLD(FLAG)
     A            SCFDIV    R        H      REFFLD(DIV)
     A            SCFEMP    R        H      REFFLD(EMP#)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCTDIV    R        H      REFFLD(DIV)
     A            SCTEMP    R        H      REFFLD(EMP#)
     A            SCYR      R        H      REFFLD(FYR)
     A          R SCR01
     A  10 11 70                            CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"24-24"},"items":[{"id":"W4115F_-
     A                                      SCR01_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"W4115F_SCR01_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"W4115F_SCR01_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon alignment":"mi-
     A                                      ddle left","icon width":"16px","ico-
     A                                      n height":"24px","icon source":"/pr-
     A                                      ofoundui/userdata/images/systool/sy-
     A                                      stools.png","data function":"System-
     A                                      ToolbarSystools","show down arrow":-
     A                                      "Yes"},{"field type":"panel","panel-
     A                                       style":"TransformButtonBar","id":"-
     A                                      W4115F_SCR01_ButtonBar","top":"35px-
     A                                      ","left":"1036px","width":"187px","-
     A                                      height":"28px","css class":"station-
     A                                      ary","visibility":"hidden","locked -
     A                                      in place":"true"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1040px","id":"W4115F_SCR01_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"W4115F_SC-
     A                                      R01_BtnRefresh","tool tip":"Refresh-
     A                                      ","onclick":"SystemToolbarRefresh",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/refresh.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1092-
     A                                      px","id":"W4115F_SCR01_BtnSearch","-
     A                                      tool tip":"Search","onclick":"Syste-
     A                                      mToolbarSearch","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/search.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1118px","id":"W4115F_SCR-
     A                                      01_BtnDiaryItems","tool tip":"Diary-
     A                                      /Work Items - IDARTS","onclick":"Sy-
     A                                      stemToolbarDiary","background image-
     A                                      ":{"fieldName":"DryIcnURL","dataLen-
     A                                      gth":"128","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"}},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1144px","id":"W4115F_SCR01_Bt-
     A                                      nSystemMessages","tool tip":"System-
     A                                       Messages","onclick":"SystemToolbar-
     A                                      Messages","background image":{"fiel-
     A                                      dName":"MsgIcnURL","dataLe')
     A                                  1  4HTML('ngth":"128","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"}},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1196px","id":"W4115F_S-
     A                                      CR01_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"W4115F_SCR01_ImgSysToolBottom"-
     A                                      ,"field type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"W4115F_SCR01_MainTabPanel","fie-
     A                                      ld type":"tab panel","tab panel sty-
     A                                      le":"Transform","tab names":"Tab 1"-
     A                                      ,"active tab":"0","left":"250px","t-
     A                                      op":"70px","width":"970px","height"-
     A                                      :"657px","z index":"8","locked in p-
     A                                      lace":"true","css class":"tab-panel-
     A                                      ","css class 2":"stationary"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W4115F_SCR01_BtnH-
     A                                      iddenSave","value":"btnSave","top":-
     A                                      "100px","response":{"fieldName":"bt-
     A                                      nSave","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"W4115F_SCR01_fkeyMenu-
     A                                      ","field type":"menu","left":"10px"-
     A                                      ,"top":"120px","height":"350px","wi-
     A                                      dth":"230px","hover background colo-
     A                                      r":"#9AAA61","hover text color":"#F-
     A                                      FFFFF","border color":"#4C6106","me-
     A                                      nu option indent":"10px","backgroun-
     A                                      d color":"#758B27","css class":"act-
     A                                      ion-menu","css class 2":"stationary-
     A                                      ","z index":"101"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W4115F_SCR01_BtnHiddenRefres-
     A                                      h","value":"btnRefresh","top":"125p-
     A                                      x","response":{"fieldName":"btnRefr-
     A                                      esh","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W4115F_-
     A                                      SCR01_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W4115F_SCR01_BtnHiddenDi-
     A                                      aryItems","value":"btnDiary","top":-
     A                                      "175px","response":{"fieldName":"bt-
     A                                      nDiary","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W411-
     A                                      5F_SCR01_BtnHiddenSystemMessages","-
     A                                      value":"btnMessage","top":"200px","-
     A                                      response":{"fieldName":"btnMessage"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W4115F_SCR0-
     A                                      1_BtnHiddenWorkSubmitJob","value":"-
     A                                      btnWrksbmjob","top":"225px","respon-
     A                                      se":{"fieldName":"btnWrkJob","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W4115F_SCR01_BtnHi-
     A                                      ddenWorkPrinterOutput","value":"btn-
     A                                      Wrkprtout","top":"250px","response"-
     A                                      :{"fieldName":"btnWrkPrnt","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W4115F_SCR01_BtnHidd-
     A                                      enImageQueue","value":"btnImgQue","-
     A                                      top":"275px","response":{"fieldName-
     A                                      ":"btnImgQue","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W4115F_SCR01_BtnHiddenHelp","valu-
     A                                      e":"btnHelp","top":"300px","respons-
     A                                      e":{"fieldName":"btnHelp","dataType-
     A                                      ":"indicator","formatting"')
     A                                  1  5HTML(':"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant21","field typ-
     A                                      e":"output field","value":" ","css -
     A                                      class":"constant","visibility":{"fi-
     A                                      eldName":"70","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"28-
     A                                      1px","cursor column":"2","top":"570-
     A                                      px","cursor row":"24","css class 2"-
     A                                      :"BLU","parent tab panel":"W4115F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant20","field type":"-
     A                                      output field","value":" ","css clas-
     A                                      s":"constant","visibility":{"fieldN-
     A                                      ame":"N70","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"281px-
     A                                      ","cursor column":"2","top":"570px"-
     A                                      ,"cursor row":"24","css class 2":"B-
     A                                      LU","parent tab panel":"W4115F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant22","field type":"out-
     A                                      put field","value":" ","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"N70","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"351px","-
     A                                      cursor column":"12","top":"570px","-
     A                                      cursor row":"24","css class 2":"BLU-
     A                                      ","parent tab panel":"W4115F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant23","field type":"outpu-
     A                                      t field","value":" ","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "N70","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"442px","cu-
     A                                      rsor column":"25","top":"570px","cu-
     A                                      rsor row":"24","css class 2":"BLU",-
     A                                      "parent tab panel":"W4115F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"btnSubmit","field type":"button",-
     A                                      "value":"Enter","shortcut key":"Ent-
     A                                      er","left":"14px","top":"150px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnHEL-
     A                                      P","field type":"button","shortcut -
     A                                      key":"Alt-F1","bypass validation":"-
     A                                      true","value":"HELP","response":{"f-
     A                                      ieldName":"*IN10","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"left":"14px","top-
     A                                      ":"183px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"}]-
     A                                      }')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR02S                    SFL
     A                                      SETOF(10)
     A  20 22 23
     A  24 25 26
     A  27 28 84  QPUI000001     1A  O  2  2
     A  29 06     QPUI000002     1A  O  2  2
     A            SCDESC        28A  H
     A            SCFLDR        80A  H
     A            SCPGMN        10A  H
     A            SCSEL2         1A  H
     A            SC#CPY    R        H      REFFLD(A20)
     A            SCAINP    R        H      REFFLD(STAF)
     A            SCDCID    R        H      REFFLD(DCID)
     A            SCOUTQ    R        H      REFFLD(OUTQ)
     A          R QSFLCTL002                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  10 11 20
     A  21 22 23
     A  24 25 26                            CA01(10 'Response Indicator *IN10')
     A  27 28 34
     A  35 36 84
     A  01 02 03                            CA02(11 'Response Indicator *IN11')
     A  04 05 32
     A  18 33 19
     A  70                                  CA03(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(34 'Response Indicator *IN34')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(36 'Response Indicator *IN36')
     A                                      SETOF(84 'Response Indicator *IN84')
     A                                  1  2HTML('QPUICTL1    SCR02S    7    RS-
     A                                      FLDSP    0    E1    3     01RSFLDSP-
     A                                      CTL 0    E1    3     01RSFLINZ    0-
     A                                          E1    3     02RSFLDLT    0    E-
     A                                      1    3     03RSFLCLR    0    E1    -
     A                                      3     04RSFLPAG    1    C2    12 RS-
     A                                      FLSIZ    1    C3    999 1    RSFLNX-
     A                                      TCHG 0    E1    3     2915   ROVERL-
     A                                      AY   0     RROWS      2    C1    1C-
     A                                      2    21 RSFLMSGID  4    C7    SCM05-
     A                                      10C6    SCMESGC5    *LIBLC0    E1  -
     A                                        3     20RSFLMSGID  4    C7    WCR-
     A                                      0500C6    WMESGGC5    *LIBLC0    E1-
     A                                          3     21RSFLMSGID  4    C7    W-
     A                                      CR0834C6    WMESGGC5    *LIBLC0    -
     A                                      E1    3     23RSFLMSGID  4    C7   -
     A                                       SCM0516C6    SCMESGC5    *LIBLC0  -
     A                                        E1    3     24RSFLMSGID  4    C7 -
     A                                         SCM0517C6    SCMESGC5    *LIBLC0-
     A                                          E1    3     25RSFLMSGID  4    C-
     A                                      7    SCM0518C6    SCMESGC5    *LIBL-
     A                                      C0    E1    3     26RSFLMSGID  4   -
     A                                       C7    SCM0519C6    SCMESGC5    *LI-
     A                                      BLC0    E1    3     27RSFLMSGID  4 -
     A                                         C7    WCR0509C6    WMESGGC5    *-
     A                                      LIBLC0    E1    3     28RSFLMSGID  -
     A                                      4    C7    CPF5203C7    QCPFMSGC5  -
     A                                        *LIBLC0    E1    6     32 18RSFLM-
     A                                      SGID  4    C7    CPF5203C7    QCPFM-
     A                                      SGC5    *LIBLC0    E1    6     33 1-
     A                                      9RSFLMSGID  4    C7    WCR0945C6   -
     A                                       WMESGGC5    *LIBLC0    E1    3    -
     A                                       36RERRMSGID  5    C6    SCUDIDC7  -
     A                                        WCR0943C6    WMESGGC5    *LIBLC0 -
     A                                         E1    3     34RERRMSGID  5    C1-
     A                                      2   SCR02C_SCERRC7    WCR0833C6    -
     A                                      WMESGGC5    *LIBLC0    E1    3     -
     A                                      22')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"description":"Subfile Control for-
     A                                       GENERATE DEPT LETTERS","set off":{-
     A                                      "fieldName":"*IN20","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 2":{"fi-
     A                                      eldName":"*IN21","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"set off 3":{"field-
     A                                      Name":"*IN22","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 4":{"fieldNam-
     A                                      e":"*IN23","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"set off 5":{"fieldName":-
     A                                      "*IN24","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"set off 6":{"fieldName":"*I-
     A                                      N25","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 7":{"fieldName":"*IN26-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"set off 8":{"fieldName":"*IN27","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 9":{"fieldName":"*IN28","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 10":{"fieldName":"*IN34","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 11":{"fieldName":"*IN35","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"set off -
     A                                      12":{"fieldName":"*IN36","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 13-
     A                                      ":{"fieldName":"*IN84","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay":"tr-
     A                                      ue","error message id":"SCM0510","e-
     A                                      rror message file":"SCMESG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"20","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"11 messages","error messag-
     A                                      e id 2":"WCR0500","error message fi-
     A                                      le 2":"WMESGG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"21","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error message id -
     A                                      3":"WCR0834","error message file 3"-
     A                                      :"WMESGG","error message library 3"-
     A                                      :"*LIBL","error condition 3":{"fiel-
     A                                      dName":"23","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error message id 4":"S-
     A                                      CM0516","error message file 4":"SCM-
     A                                      ESG","error message library 4":"*LI-
     A                                      BL","error condition 4":{"fieldName-
     A                                      ":"24","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error message id 5":"SCM051-
     A                                      7","error message file 5":"SCMESG",-
     A                                      "error message library 5":"*LIBL","-
     A                                      error condition 5":{"fieldName":"25-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 6":"SCM0518","e-
     A                                      rror message file 6":"SCMESG","erro-
     A                                      r message library 6":"*LIBL","error-
     A                                       condition 6":{"fieldName":"26","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror message id 7":"SCM0519","error -
     A                                      message file 7":"SCMESG","error mes-
     A                                      sage library 7":"*LIBL","error cond-
     A                                      ition 7":{"fieldName":"27","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essage id 8":"WCR0509","error messa-
     A                                      ge file 8":"WMESGG","error message -
     A                                      library 8":"*LIBL","error condition-
     A                                       8":{"fieldName":"28","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      e id 9":"CPF5203","error message fi-
     A                                      le 9":"QCPFMSG","error message libr-
     A                                      ary 9":"*LIBL","error condition 9":-
     A                                      {"fieldName":"32 and 18","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sage id 10":"CPF5203","error messag-
     A                                      e file 10":"QCPFMSG","error message-
     A                                       library 10":"*LIBL","error conditi-
     A                                      on 10":{"fieldName":"33 and 19","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror message id 11":"WCR0945","error-
     A                                       message file 11":"WMESGG","error m-
     A                                      essage library 11":"*LIBL","error c-
     A                                      ondition 11":{"fieldName":"36","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"val-
     A                                      id command key":{"fieldName":"*IN11-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"overlay range":"1-21"},"items":[{-
     A                                      "id":"#@$2","field type":"output fi-
     A                                      eld","visibility":"hidden","value":-
     A                                      {"fieldName":"#@$2","designValue":"-
     A                                      [#@$2]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"true",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","dataLength":"3","decPos":"0-
     A                                      "},"left":"0px","top":"-30px","widt-
     A                                      h":"21px","text align":"right","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"W4115F_SCR02C_avKeys","field type-
     A                                      ":"output field","value":{')
     A                                  1  4HTML('"fieldName":"AV_KEYS","dataLe-
     A                                      ngth":"1134","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      AV_KEYS]"},"left":"0px","top":"0px"-
     A                                      ,"visibility":"hidden"},{"id":"W411-
     A                                      5F_SCR02C_action","field type":"htm-
     A                                      l container","white space":"normal"-
     A                                      ,"left":"0px","top":"10px","width":-
     A                                      "230px","css class":"action-panel-c-
     A                                      onverted","height":"700px","html":"-
     A                                      <div class=\"top\"></div><div class-
     A                                      =\"imagetop\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_top.png\" /><-
     A                                      /div><div class=\"menulinks\"></div-
     A                                      ><div class=\"imagebottom\"><img sr-
     A                                      c=\"/profoundui/userdata/images/bar-
     A                                      _bottom.png\" /></div><div class=\"-
     A                                      bottom\"></div>"},{"field type":"ic-
     A                                      on menu button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"32px","z index":"20","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      170px","id":"W4115F_SCR02C_BtnIconM-
     A                                      enuSystemTools","tool tip":"System -
     A                                      Tools","icon alignment":"middle lef-
     A                                      t","icon width":"16px","icon height-
     A                                      ":"24px","icon source":"/profoundui-
     A                                      /userdata/images/systool/systools.p-
     A                                      ng","data function":"SystemToolbarS-
     A                                      ystools","show down arrow":"Yes"},{-
     A                                      "field type":"panel","panel style":-
     A                                      "TransformButtonBar","id":"W4115F_S-
     A                                      CR02C_ButtonBar","top":"35px","left-
     A                                      ":"1036px","width":"187px","height"-
     A                                      :"28px","css class":"stationary","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"10-
     A                                      40px","id":"W4115F_SCR02C_BtnSave",-
     A                                      "tool tip":"Save","onclick":"System-
     A                                      ToolbarSave","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/save.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1066px","id":"W4115F_SCR02C_B-
     A                                      tnRefresh","tool tip":"Refresh","on-
     A                                      click":"SystemToolbarRefresh","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/refresh.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1092px","-
     A                                      id":"W4115F_SCR02C_BtnSearch","tool-
     A                                       tip":"Search","onclick":"SystemToo-
     A                                      lbarSearch","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/search.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1118px","id":"W4115F_SCR02C_-
     A                                      BtnDiaryItems","tool tip":"Diary/Wo-
     A                                      rk Items - IDARTS","onclick":"Syste-
     A                                      mToolbarDiary","background image":{-
     A                                      "fieldName":"DryIcnURL","dataLength-
     A                                      ":"128","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"}},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1144px","id":"W4115F_SCR02C_BtnS-
     A                                      ystemMessages","tool tip":"System M-
     A                                      essages","onclick":"SystemToolbarMe-
     A                                      ssages","background image":{"fieldN-
     A                                      ame":"MsgIcnURL","dataLength":"128"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none"}},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none"')
     A                                  1  5HTML(',"cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"W4115F_SCR-
     A                                      02C_BtnHelp","tool tip":"Help","onc-
     A                                      lick":"SystemToolbarHelp","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/help.png'')"},{"i-
     A                                      d":"W4115F_SCR02C_ImgSysToolBottom"-
     A                                      ,"field type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"W4115F_SCR02C_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W4115F_SCR02C_BtnHidde-
     A                                      nSave","value":"btnSave","top":"100-
     A                                      px","response":{"fieldName":"btnSav-
     A                                      e","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"constant24","field type":-
     A                                      "output field","left":"281px","curs-
     A                                      or column":"2","top":"110px","curso-
     A                                      r row":"1","css class":"top-line","-
     A                                      value":"js: currentUser()","css cla-
     A                                      ss 2":"output-field","parent tab pa-
     A                                      nel":"W4115F_SCR02C_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"SCR02C_SCCO-
     A                                      NM","field type":"output field","va-
     A                                      lue":{"fieldName":"SCCONM","designV-
     A                                      alue":"[SCCONM]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"414px","cursor column":"21",-
     A                                      "top":"110px","cursor row":"1","css-
     A                                       class 2":"top-line","css class 3":-
     A                                      "HI","description":"COMPANY NAME","-
     A                                      parent tab panel":"W4115F_SCR02C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 4":"profound-converted"},{"id"-
     A                                      :"constant25","field type":"output -
     A                                      field","left":"778px","cursor colum-
     A                                      n":"73","top":"110px","cursor row":-
     A                                      "1","css class":"top-line","value":-
     A                                      "js: currentDate()","css class 2":"-
     A                                      output-field","parent tab panel":"W-
     A                                      4115F_SCR02C_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"W4115F_SCR02C_fkey-
     A                                      Menu","field type":"menu","left":"1-
     A                                      0px","top":"120px","height":"350px"-
     A                                      ,"width":"230px","hover background -
     A                                      color":"#9AAA61","hover text color"-
     A                                      :"#FFFFFF","border color":"#4C6106"-
     A                                      ,"menu option indent":"10px","backg-
     A                                      round color":"#758B27","css class":-
     A                                      "action-menu","css class 2":"statio-
     A                                      nary","z index":"101"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W4115F_SCR02C_BtnHiddenR-
     A                                      efresh","value":"btnRefresh","top":-
     A                                      "125px","response":{"fieldName":"bt-
     A                                      nRefresh","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"SCR02C_Q1PGM","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"Q1PGM","designValue":"[Q-
     A                                      1PGM]","refField":"DS10","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"281-
     A                                      px","cursor column":"2","top":"130p-
     A                                      x","cursor row":"2","parent tab pan-
     A                                      el":"W4115F_SCR02C_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCR02C_SCPRD-
     A                                      S","field type":"output field","val-
     A                                      ue":{"fieldName":"SCPRDS","designVa-
     A                                      lue":"[SCPRDS]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"130px","cursor row":"2","css -
     A                                      class 2":"HI","description":"PROGRA-
     A                                      M NAME","parent tab panel":"W4115F_-
     A                                      SCR02C_MainTabPanel","parent tab":"-
     A                                      0","visibility":"hidden","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant26","field type":"output fiel-
     A                                      d","value":"SCR02","css class":"con-
     A                                      stant","left":"799px","cursor colum-
     A                                      n":"76","top":"130px","cursor row":-
     A                                      "2","parent tab panel":"W4115F_SCR0-
     A                                      2C_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"constant27","field type":"ou-
     A                                      tput field","value":"Group:","css c-
     A                                      lass":"constant","left":"281px","cu-
     A                                      rsor column":"2","top":"150px","cur-
     A                                      sor row":"3","parent tab panel":"W4-
     A                                      115F_SCR02C_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCR02C_SCFND","fiel-
     A                                      d type":"output field","va')
     A                                  1  6HTML('lue":{"fieldName":"SCFND","de-
     A                                      signValue":"[SCFND]","refField":"FN-
     A                                      D","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"false","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"9-
     A                                      99.00"},"css class":"output-field",-
     A                                      "left":"337px","cursor column":"10"-
     A                                      ,"top":"150px","cursor row":"3","wi-
     A                                      dth":"21px","text align":"right","p-
     A                                      arent tab panel":"W4115F_SCR02C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCR02C_SCNAME","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCNA-
     A                                      ME","designValue":"[SCNAME]","refFi-
     A                                      eld":"NM60","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"386px","cursor c-
     A                                      olumn":"17","top":"150px","cursor r-
     A                                      ow":"3","description":"FUND NAME","-
     A                                      parent tab panel":"W4115F_SCR02C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W4115F_SCR02C_Btn-
     A                                      HiddenSearch","value":"btnSearch","-
     A                                      top":"150px","response":{"fieldName-
     A                                      ":"btnSearch","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant28","f-
     A                                      ield type":"output field","value":"-
     A                                      Year :","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"170px","cursor row":"4","parent -
     A                                      tab panel":"W4115F_SCR02C_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCR02-
     A                                      C_SCFYR","field type":"output field-
     A                                      ","value":{"fieldName":"SCFYR","des-
     A                                      ignValue":"[SCFYR]","refField":"FYR-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"true","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00"},"css class":"output-field","l-
     A                                      eft":"337px","cursor column":"10","-
     A                                      top":"170px","cursor row":"4","widt-
     A                                      h":"21px","text align":"right","par-
     A                                      ent tab panel":"W4115F_SCR02C_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"c-
     A                                      onstant29","field type":"output fie-
     A                                      ld","value":"Employer/div:","css cl-
     A                                      ass":"constant","left":"386px","cur-
     A                                      sor column":"17","top":"170px","cur-
     A                                      sor row":"4","parent tab panel":"W4-
     A                                      115F_SCR02C_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCR02C_SCFEMP","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCFEMP","designValue":"[-
     A                                      SCFEMP]","refField":"EMP#","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00"},"cs-
     A                                      s class":"output-field","left":"491-
     A                                      px","cursor column":"32","top":"170-
     A                                      px","cursor row":"4","width":"63px"-
     A                                      ,"text align":"right","description"-
     A                                      :"From Employer #","parent tab pane-
     A                                      l":"W4115F_SCR02C_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant30","-
     A                                      field type":"output field","value":-
     A                                      "/","css class":"constant","left":"-
     A                                      561px","cursor column":"42","top":"-
     A                                      170px","cursor row":"4","parent tab-
     A                                       panel":"W4115F_SCR02C_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCR02C_S-
     A                                      CFDIV","field type":"output field",-
     A                                      "value":{"fieldName":"SCFDIV","desi-
     A                                      gnValue":"[SCFDIV]","refField":"DIV-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"99-
     A                                      9.00"},"css class":"output-field","-
     A                                      left":"575px","cursor column":"44",-
     A                                      "top":"170px","cursor row":"4","wid-
     A                                      th":"35px","text align":"right","de-
     A                                      scription":"From Div","parent tab p-
     A                                      anel":"W4115F_SCR02C_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"constant31-
     A                                      ","field type":"output field","valu-
     A                                      e":"to","css class":"constant","vis-
     A                                      ibility":{"fieldName":"N70","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"617px","cursor column":-
     A                                      "50","top":"170px","cursor row":"4"-
     A                                      ,"parent tab panel":"W4115F_SCR02C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCR02C_SCTEMP","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CTEMP","designValue":"[SCTEMP]","re-
     A                                      fField":"EMP#","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"999.00"},"css class":"ou-
     A                                      tput-field","visibility":{"fieldNam-
     A                                      e":"N70","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"638px",-
     A                                      "cursor column":"53","top":"170px",-
     A                                      "cursor row":"4","width":"63px","te-
     A                                      xt align":"right","description":"To-
     A                                       Employer #","parent tab panel":"W4-
     A                                      115F_SCR02C_MainTabPanel",')
     A                                  1  7HTML('"parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant32","field type":"output field"-
     A                                      ,"value":"/","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"N70","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"left":"708px","cursor col-
     A                                      umn":"63","top":"170px","cursor row-
     A                                      ":"4","parent tab panel":"W4115F_SC-
     A                                      R02C_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR02C_SCTDIV","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCTDIV","designValue":"[SCTDIV]-
     A                                      ","refField":"DIV","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00"},"css class"-
     A                                      :"output-field","visibility":{"fiel-
     A                                      dName":"N70","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"722-
     A                                      px","cursor column":"65","top":"170-
     A                                      px","cursor row":"4","width":"35px"-
     A                                      ,"text align":"right","description"-
     A                                      :"To Div","parent tab panel":"W4115-
     A                                      F_SCR02C_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W4115F-
     A                                      _SCR02C_BtnHiddenDiaryItems","value-
     A                                      ":"btnDiary","top":"175px","respons-
     A                                      e":{"fieldName":"btnDiary","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant33","field type":"output fie-
     A                                      ld","value":"Dept :","css class":"c-
     A                                      onstant","left":"281px","cursor col-
     A                                      umn":"2","top":"190px","cursor row"-
     A                                      :"5","parent tab panel":"W4115F_SCR-
     A                                      02C_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCR02C_SCDPCD","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCDPCD","designValue":"[SCDPCD]"-
     A                                      ,"refField":"DPCD","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"337px","c-
     A                                      ursor column":"10","top":"190px","c-
     A                                      ursor row":"5","description":"Depar-
     A                                      tment Code","parent tab panel":"W41-
     A                                      15F_SCR02C_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCR02C_SCDPNM","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCDPNM","designValue":"[S-
     A                                      CDPNM]","refField":"NAME","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"38-
     A                                      6px","cursor column":"17","top":"19-
     A                                      0px","cursor row":"5","description"-
     A                                      :"Department Name","parent tab pane-
     A                                      l":"W4115F_SCR02C_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W4115F_SCR02C_BtnHiddenSystemMes-
     A                                      sages","value":"btnMessage","top":"-
     A                                      200px","response":{"fieldName":"btn-
     A                                      Message","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"constant34","field -
     A                                      type":"output field","value":"Posit-
     A                                      ion to . . .","css class":"constant-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"210px","cursor row":"6","p-
     A                                      arent tab panel":"W4115F_SCR02C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCUDID","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCUDID"-
     A                                      ,"designValue":"[SCUDID]","refField-
     A                                      ":"DCID","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"uppercase"},"text transform-
     A                                      ":"uppercase","left":"414px","curso-
     A                                      r column":"21","top":"210px","curso-
     A                                      r row":"6","width":"85px","css clas-
     A                                      s 3":"UL","set focus":{"fieldName":-
     A                                      "35","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"WCR-
     A                                      0943","error message file":"WMESGG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"34","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"1 message","parent-
     A                                       tab panel":"W4115F_SCR02C_MainTabP-
     A                                      anel","parent tab":"0","css class 4-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W4115F_SCR02C_BtnHidden-
     A                                      WorkSubmitJob","value":"btnWrksbmjo-
     A                                      b","top":"225px","response":{"field-
     A                                      Name":"btnWrkJob","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"constant35-
     A                                      ","field type":"output field","valu-
     A                                      e":"Type option, press Enter.","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"')
     A                                  1  8HTML('230px","cursor row":"7","css -
     A                                      class 2":"BLU","parent tab panel":"-
     A                                      W4115F_SCR02C_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"SCR02C_SCERR","fi-
     A                                      eld type":"password field","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCERR","desi-
     A                                      gnValue":"[SCERR]","refField":"FLAG-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase"},"text transform":"uppe-
     A                                      rcase","left":"274px","cursor colum-
     A                                      n":"1","top":"250px","cursor row":"-
     A                                      8","width":"8px","read only":"true"-
     A                                      ,"css class 3":"PR","error message -
     A                                      id":"WCR0833","error message file":-
     A                                      "WMESGG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"22","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error messages":"1 message"-
     A                                      ,"description":"Error message for n-
     A                                      on-selection","parent tab panel":"W-
     A                                      4115F_SCR02C_MainTabPanel","parent -
     A                                      tab":"0","css class 4":"profound-co-
     A                                      nverted"},{"id":"constant36","field-
     A                                       type":"output field","value":"1=Se-
     A                                      lect","css class":"constant","left"-
     A                                      :"295px","cursor column":"4","top":-
     A                                      "250px","cursor row":"8","css class-
     A                                       2":"BLU","parent tab panel":"W4115-
     A                                      F_SCR02C_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted","css class 4":"subfile-heading-
     A                                      "},{"id":"constant37","field type":-
     A                                      "output field","value":"5=Display",-
     A                                      "css class":"constant","left":"372p-
     A                                      x","cursor column":"15","top":"250p-
     A                                      x","cursor row":"8","css class 2":"-
     A                                      BLU","parent tab panel":"W4115F_SCR-
     A                                      02C_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted",-
     A                                      "css class 4":"subfile-heading"},{"-
     A                                      id":"constant38","field type":"outp-
     A                                      ut field","value":"Addl","css class-
     A                                      ":"constant","left":"638px","cursor-
     A                                       column":"53","top":"250px","cursor-
     A                                       row":"8","css class 2":"HI","paren-
     A                                      t tab panel":"W4115F_SCR02C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted","css class -
     A                                      4":"subfile-heading"},{"id":"consta-
     A                                      nt39","field type":"output field","-
     A                                      value":"# of","css class":"constant-
     A                                      ","left":"687px","cursor column":"6-
     A                                      0","top":"250px","cursor row":"8","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"W4115F_SCR02C_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted","css class 4":"subfile-
     A                                      -heading"},{"id":"constant40","fiel-
     A                                      d type":"output field","value":"Out-
     A                                      put","css class":"constant","left":-
     A                                      "743px","cursor column":"68","top":-
     A                                      "250px","cursor row":"8","css class-
     A                                       2":"HI","parent tab panel":"W4115F-
     A                                      _SCR02C_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed","css class 4":"subfile-heading"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W4115F_SCR-
     A                                      02C_BtnHiddenWorkPrinterOutput","va-
     A                                      lue":"btnWrkprtout","top":"250px","-
     A                                      response":{"fieldName":"btnWrkPrnt"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant41","field type":"o-
     A                                      utput field","value":"Opt","css cla-
     A                                      ss":"constant","left":"281px","curs-
     A                                      or column":"2","top":"270px","curso-
     A                                      r row":"9","css class 2":"HI","pare-
     A                                      nt tab panel":"W4115F_SCR02C_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted","css class-
     A                                       4":"subfile-heading"},{"id":"const-
     A                                      ant42","field type":"output field",-
     A                                      "value":"Document ID","css class":"-
     A                                      constant","left":"316px","cursor co-
     A                                      lumn":"7","top":"270px","cursor row-
     A                                      ":"9","css class 2":"HI","parent ta-
     A                                      b panel":"W4115F_SCR02C_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted","css class 4":"-
     A                                      subfile-heading"},{"id":"constant43-
     A                                      ","field type":"output field","valu-
     A                                      e":"Document Description","css clas-
     A                                      s":"constant","left":"414px","curso-
     A                                      r column":"21","top":"270px","curso-
     A                                      r row":"9","css class 2":"HI","pare-
     A                                      nt tab panel":"W4115F_SCR02C_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted","css class-
     A                                       4":"subfile-heading"},{"id":"const-
     A                                      ant44","field type":"output field",-
     A                                      "value":"Input","css class":"consta-
     A                                      nt","left":"638px","cursor column":-
     A                                      "53","top":"270px","cursor row":"9"-
     A                                      ,"css class 2":"HI","parent tab pan-
     A                                      el":"W4115F_SCR02C_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted","css class 4":"subfi-
     A                                      le-heading"},{"id":"constant45","fi-
     A                                      eld type":"output field","value":"C-
     A                                      opies","css class":"constant","left-
     A                                      ":"687px","cursor column":"60","top-
     A                                      ":"270px","cursor row":"9","css cla-
     A                                      ss 2":"HI","parent tab panel":"W411-
     A                                      5F_SCR02C_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted","css class 4":"subfile-headin-
     A                                      g"},{"id":"constant46","field type"-
     A                                      :"output field","value":"Queue","cs-
     A                                      s class":"constant","left":"743px",-
     A                                      "cursor column":"68","top"')
     A                                  1  9HTML(':"270px","cursor row":"9","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "W4115F_SCR02C_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted","css class 4":"subfile-h-
     A                                      eading"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W41-
     A                                      15F_SCR02C_BtnHiddenImageQueue","va-
     A                                      lue":"btnImgQue","top":"275px","res-
     A                                      ponse":{"fieldName":"btnImgQue","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"SCR02S","field type":"grid","nu-
     A                                      mber of columns":"6","record format-
     A                                       name":"SCR02S","subfile next chang-
     A                                      ed":{"fieldName":"29","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"displ-
     A                                      ay subfile":{"fieldName":"01","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"display control record":{"fieldN-
     A                                      ame":"01","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"clear subfile":{"-
     A                                      fieldName":"04","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"subfile siz-
     A                                      e":"999","initialize subfile":{"fie-
     A                                      ldName":"02","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"delete subfile-
     A                                      ":{"fieldName":"03","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"place c-
     A                                      ursor":"true","header height":"40",-
     A                                      "row height":"20","css class":"subf-
     A                                      ilegrid","css class 2":"profound-co-
     A                                      nverted","parent tab panel":"W4115F-
     A                                      _SCR02C_MainTabPanel","parent tab":-
     A                                      "0","subfile end":{"fieldName":"05"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"sortable columns":"true","-
     A                                      number of rows":"13","top":"250px",-
     A                                      "left":"281px","column widths":"30,-
     A                                      98,231,56,42,103","subfile record n-
     A                                      umber":{"fieldName":"#@$2","designV-
     A                                      alue":"[#@$2]","dataType":"zoned","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"true","zeroFill":-
     A                                      "true","curSym":"","units":"","negN-
     A                                      um":"-999.00","dataLength":"3","dec-
     A                                      Pos":"0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      4115F_SCR02C_BtnHiddenHelp","value"-
     A                                      :"btnHelp","top":"300px","response"-
     A                                      :{"fieldName":"btnHelp","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"btnS-
     A                                      ubmit","field type":"button","value-
     A                                      ":"Enter","shortcut key":"Enter","l-
     A                                      eft":"14px","top":"150px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF03","fi-
     A                                      eld type":"button","value":"Exit","-
     A                                      shortcut key":"F3","left":"14px","t-
     A                                      op":"183px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF12","field type":"but-
     A                                      ton","value":"Cancel","shortcut key-
     A                                      ":"F12","left":"14px","top":"216px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nHELP","field type":"button","short-
     A                                      cut key":"Alt-F1","bypass validatio-
     A                                      n":"true","value":"HELP","response"-
     A                                      :{"fieldName":"*IN10","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"left":"14px",-
     A                                      "top":"249px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"SCFLDR","field type":"ou-
     A                                      tput field","visibility":"hidden","-
     A                                      value":{"fieldName":"SCFLDR","desig-
     A                                      nValue":"[SCFLDR]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"none","dataLength":"80-
     A                                      "},"left":"-45px","top":"-319px","c-
     A                                      ss class":"profound-converted","gri-
     A                                      d":"SCR02S","column":"0"},{"id":"SC-
     A                                      PGMN","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"SCPGMN","designValue":"[SCP-
     A                                      GMN]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none","dataLength":"10"},"left":"-4-
     A                                      5px","top":"-319px","css class":"pr-
     A                                      ofound-converted","grid":"SCR02S","-
     A                                      column":"0"},{"id":"SCSEL2","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCSEL2","designValue":"-
     A                                      [SCSEL2]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"uppercase","dataLength":"1"},"t-
     A                                      ext transform":"uppercase","left":"-
     A                                      7px","cursor column":"3","top":"1px-
     A                                      ","cursor row":"10","width":"8px","-
     A                                      css class 3":{"fieldName":"N06","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"css class 4":{"fieldName":"20-
     A                                       or 22 or 23 or 24 or 25 or 26 or 2-
     A                                      7","dataType":"expression"')
     A                                  1 10HTML(',"formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"RI","customFalse":""},"set focu-
     A                                      s":{"fieldName":"20 or 22 or 23 or -
     A                                      24 or 25 or 26 or 27","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"descr-
     A                                      iption":"Selection Field","css clas-
     A                                      s 5":"profound-converted","grid":"S-
     A                                      CR02S","column":"0"},{"id":"SCDCID"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCDCID","designValu-
     A                                      e":"[SCDCID]","refField":"DCID","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"5px","cursor column":"7","top":-
     A                                      "1px","cursor row":"10","css class -
     A                                      2":"profound-converted","grid":"SCR-
     A                                      02S","column":"1"},{"id":"SCDESC","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCDESC","designValue"-
     A                                      :"[SCDESC]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none","dataLength":"28"},"cs-
     A                                      s class":"output-field","left":"5px-
     A                                      ","cursor column":"21","top":"1px",-
     A                                      "cursor row":"10","css class 2":"pr-
     A                                      ofound-converted","grid":"SCR02S","-
     A                                      column":"2"},{"id":"SCAINP","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCAINP","designValue":"[SCA-
     A                                      INP]","refField":"STAF","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"5px"-
     A                                      ,"cursor column":"54","top":"1px","-
     A                                      cursor row":"10","css class 2":"pro-
     A                                      found-converted","grid":"SCR02S","c-
     A                                      olumn":"3"},{"id":"SC#CPY","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SC#CPY","designValue":"[-
     A                                      SC#CPY]","refField":"A20","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","numB-
     A                                      lankFill":"true"},"left":"5px","cur-
     A                                      sor column":"62","top":"1px","curso-
     A                                      r row":"10","width":"15px","text al-
     A                                      ign":"right","visibility":{"fieldNa-
     A                                      me":"84","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"hidde-
     A                                      n","customFalse":"visible"},"read o-
     A                                      nly":{"fieldName":"84","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 3":{"fieldName":"84","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "css class 4":{"fieldName":"N06 and-
     A                                       N84","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"description":"# COPI-
     A                                      ES","css class 5":"profound-convert-
     A                                      ed","grid":"SCR02S","column":"4"},{-
     A                                      "id":"SCOUTQ","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      OUTQ","designValue":"[SCOUTQ]","ref-
     A                                      Field":"OUTQ","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","left":"5px","cu-
     A                                      rsor column":"68","top":"1px","curs-
     A                                      or row":"10","width":"71px","css cl-
     A                                      ass 3":{"fieldName":"N06 and N84","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"css class 4":{"fieldName":"-
     A                                      28 and N84","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"RI-
     A                                      ","customFalse":""},"set focus":{"f-
     A                                      ieldName":"28 and N84","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 5":{"fieldName":"84","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"HI","customFalse":""},-
     A                                      "read only":{"fieldName":"84","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 6":{"fieldName":"84","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"description":"DOCUNMENT OUT-
     A                                      Q","css class 7":"profound-converte-
     A                                      d","grid":"SCR02S","column":"5"}]}')
     A            #@$2           3S 0H
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDPCD    R        H      REFFLD(DPCD)
     A            SCDPNM    R        H      REFFLD(NAME)
     A            SCERR     R        H      REFFLD(FLAG)
     A            SCFDIV    R        H      REFFLD(DIV)
     A            SCFEMP    R        H      REFFLD(EMP#)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCTDIV    R        H      REFFLD(DIV)
     A            SCTEMP    R        H      REFFLD(EMP#)
     A            SCUDID    R        H      REFFLD(DCID)
     A          R SCR02
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"24-24"},"items":[{"id":"W4115F_-
     A                                      SCR02_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"W4115F_SCR02_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"W4115F_SCR02_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon alignment":"mi-
     A                                      ddle left","icon width":"16px","ico-
     A                                      n height":"24px","icon source":"/pr-
     A                                      ofoundui/userdata/images/systool/sy-
     A                                      stools.png","data function":"System-
     A                                      ToolbarSystools","show down arrow":-
     A                                      "Yes"},{"field type":"panel","panel-
     A                                       style":"TransformButtonBar","id":"-
     A                                      W4115F_SCR02_ButtonBar","top":"35px-
     A                                      ","left":"1036px","width":"187px","-
     A                                      height":"28px","css class":"station-
     A                                      ary","visibility":"hidden","locked -
     A                                      in place":"true"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1040px","id":"W4115F_SCR02_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"W4115F_SC-
     A                                      R02_BtnRefresh","tool tip":"Refresh-
     A                                      ","onclick":"SystemToolbarRefresh",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/refresh.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1092-
     A                                      px","id":"W4115F_SCR02_BtnSearch","-
     A                                      tool tip":"Search","onclick":"Syste-
     A                                      mToolbarSearch","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/search.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1118px","id":"W4115F_SCR-
     A                                      02_BtnDiaryItems","tool tip":"Diary-
     A                                      /Work Items - IDARTS","onclick":"Sy-
     A                                      stemToolbarDiary","background image-
     A                                      ":{"fieldName":"DryIcnURL","dataLen-
     A                                      gth":"128","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"}},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1144px","id":"W4115F_SCR02_Bt-
     A                                      nSystemMessages","tool tip":"System-
     A                                       Messages","onclick":"SystemToolbar-
     A                                      Messages","background image":{"fiel-
     A                                      dName":"MsgIcnURL","dataLe')
     A                                  1  4HTML('ngth":"128","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"}},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1196px","id":"W4115F_S-
     A                                      CR02_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"W4115F_SCR02_ImgSysToolBottom"-
     A                                      ,"field type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"W4115F_SCR02_MainTabPanel","fie-
     A                                      ld type":"tab panel","tab panel sty-
     A                                      le":"Transform","tab names":"Tab 1"-
     A                                      ,"active tab":"0","left":"250px","t-
     A                                      op":"70px","width":"970px","height"-
     A                                      :"657px","z index":"8","locked in p-
     A                                      lace":"true","css class":"tab-panel-
     A                                      ","css class 2":"stationary"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W4115F_SCR02_BtnH-
     A                                      iddenSave","value":"btnSave","top":-
     A                                      "100px","response":{"fieldName":"bt-
     A                                      nSave","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"W4115F_SCR02_fkeyMenu-
     A                                      ","field type":"menu","left":"10px"-
     A                                      ,"top":"120px","height":"350px","wi-
     A                                      dth":"230px","hover background colo-
     A                                      r":"#9AAA61","hover text color":"#F-
     A                                      FFFFF","border color":"#4C6106","me-
     A                                      nu option indent":"10px","backgroun-
     A                                      d color":"#758B27","css class":"act-
     A                                      ion-menu","css class 2":"stationary-
     A                                      ","z index":"101"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W4115F_SCR02_BtnHiddenRefres-
     A                                      h","value":"btnRefresh","top":"125p-
     A                                      x","response":{"fieldName":"btnRefr-
     A                                      esh","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W4115F_-
     A                                      SCR02_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W4115F_SCR02_BtnHiddenDi-
     A                                      aryItems","value":"btnDiary","top":-
     A                                      "175px","response":{"fieldName":"bt-
     A                                      nDiary","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W411-
     A                                      5F_SCR02_BtnHiddenSystemMessages","-
     A                                      value":"btnMessage","top":"200px","-
     A                                      response":{"fieldName":"btnMessage"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W4115F_SCR0-
     A                                      2_BtnHiddenWorkSubmitJob","value":"-
     A                                      btnWrksbmjob","top":"225px","respon-
     A                                      se":{"fieldName":"btnWrkJob","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W4115F_SCR02_BtnHi-
     A                                      ddenWorkPrinterOutput","value":"btn-
     A                                      Wrkprtout","top":"250px","response"-
     A                                      :{"fieldName":"btnWrkPrnt","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W4115F_SCR02_BtnHidd-
     A                                      enImageQueue","value":"btnImgQue","-
     A                                      top":"275px","response":{"fieldName-
     A                                      ":"btnImgQue","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W4115F_SCR02_BtnHiddenHelp","valu-
     A                                      e":"btnHelp","top":"300px","respons-
     A                                      e":{"fieldName":"btnHelp","dataType-
     A                                      ":"indicator","formatting"')
     A                                  1  5HTML(':"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"btnSubmit","field type-
     A                                      ":"button","value":"Enter","shortcu-
     A                                      t key":"Enter","left":"14px","top":-
     A                                      "150px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnHELP","field type":"button"-
     A                                      ,"shortcut key":"Alt-F1","bypass va-
     A                                      lidation":"true","value":"HELP","re-
     A                                      sponse":{"fieldName":"*IN10","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"left":-
     A                                      "14px","top":"183px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
