     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20
     A  21 22 23
     A  24 25 26                            CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                  1  2HTML('QPUIREC6    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCPRDTC7    WCR0500C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     21RERRMS-
     A                                      GID  5    C6    SCPRDTC7    WCR0529-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     26RERRMSGID  5    C6    SCCMD-
     A                                      TC7    WCR0500C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     25RERRMSGID  5 -
     A                                         C6    SCCMDTC7    WCR0529C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     2-
     A                                      6RERRMSGID  5    C6    SCCPDFC7    -
     A                                      WCR0571C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     23')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN26","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"valid command key":{"f-
     A                                      ieldName":"*IN11","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"overlay range":"1-
     A                                      -23"},"items":[{"id":"W6008F_SCR01_-
     A                                      avKeys","field type":"output field"-
     A                                      ,"value":{"fieldName":"AV_KEYS","da-
     A                                      taLength":"1134","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none","designValue-
     A                                      ":"[AV_KEYS]"},"left":"0px","top":"-
     A                                      0px","visibility":"hidden"},{"id":"-
     A                                      W6008F_SCR01_action","field type":"-
     A                                      html container","white space":"norm-
     A                                      al","left":"0px","top":"10px","widt-
     A                                      h":"230px","css class":"action-pane-
     A                                      l-converted","height":"700px","html-
     A                                      ":"<div class=\"top\"></div><div cl-
     A                                      ass=\"imagetop\"><img src=\"/profou-
     A                                      ndui/userdata/images/bar_top.png\" -
     A                                      /></div><div class=\"menulinks\"></-
     A                                      div><div class=\"imagebottom\"><img-
     A                                       src=\"/profoundui/userdata/images/-
     A                                      bar_bottom.png\" /></div><div class-
     A                                      =\"bottom\"></div>"},{"field type":-
     A                                      "icon menu button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"32px","z index":"20","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1170px","id":"W6008F_SCR01_BtnIco-
     A                                      nMenuSystemTools","tool tip":"Syste-
     A                                      m Tools","icon alignment":"middle l-
     A                                      eft","icon width":"16px","icon heig-
     A                                      ht":"24px","icon source":"/profound-
     A                                      ui/userdata/images/systool/systools-
     A                                      .png","data function":"SystemToolba-
     A                                      rSystools","show down arrow":"Yes"}-
     A                                      ,{"field type":"panel","panel style-
     A                                      ":"TransformButtonBar","id":"W6008F-
     A                                      _SCR01_ButtonBar","top":"35px","lef-
     A                                      t":"1036px","width":"187px","height-
     A                                      ":"28px","css class":"stationary","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      040px","id":"W6008F_SCR01_BtnSave",-
     A                                      "tool tip":"Save","onclick":"System-
     A                                      ToolbarSave","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/save.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1066px","id":"W6008F_SCR01_Bt-
     A                                      nRefresh","tool tip":"Refresh","onc-
     A                                      lick":"SystemToolbarRefresh","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/refresh.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1092px","i-
     A                                      d":"W6008F_SCR01_BtnSearch","tool t-
     A                                      ip":"Search","onclick":"SystemToolb-
     A                                      arSearch","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/search.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1118px","id":"W6008F_SCR01_Btn-
     A                                      DiaryItems","tool tip":"Diary/Work -
     A                                      Items - IDARTS","onclick":"SystemTo-
     A                                      olbarDiary","background im')
     A                                  1  4HTML('age":{"fieldName":"DryIcnURL"-
     A                                      ,"dataLength":"128","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none"}},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1144px","id":"W6008F-
     A                                      _SCR01_BtnSystemMessages","tool tip-
     A                                      ":"System Messages","onclick":"Syst-
     A                                      emToolbarMessages","background imag-
     A                                      e":{"fieldName":"MsgIcnURL","dataLe-
     A                                      ngth":"128","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none"}},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1196px","id":"W6008F_SCR01_B-
     A                                      tnHelp","tool tip":"Help","onclick"-
     A                                      :"SystemToolbarHelp","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/help.png'')"},{"id":"W-
     A                                      6008F_SCR01_ImgSysToolBottom","fiel-
     A                                      d type":"image","image source":"/pr-
     A                                      ofoundui/userdata/images/systool/bu-
     A                                      tbarbot.png","left":"1036px","top":-
     A                                      "64px","width":"187px","locked in p-
     A                                      lace":"true","css class":"stationar-
     A                                      y","visibility":"hidden"},{"id":"W6-
     A                                      008F_SCR01_MainTabPanel","field typ-
     A                                      e":"tab panel","tab panel style":"T-
     A                                      ransform","tab names":{"fieldName":-
     A                                      "SCPRDS","designValue":"[SCPRDS]","-
     A                                      refField":"NAME","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"active tab-
     A                                      ":"0","left":"250px","top":"70px","-
     A                                      width":"970px","height":"657px","z -
     A                                      index":"8","locked in place":"true"-
     A                                      ,"css class":"tab-panel","css class-
     A                                       2":"stationary"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W6008F_SCR01_BtnHiddenSave","-
     A                                      value":"btnSave","top":"100px","res-
     A                                      ponse":{"fieldName":"btnSave","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"SCUSER","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCUSER","d-
     A                                      esignValue":"[SCUSER]","refField":"-
     A                                      USER","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"281px","cursor column"-
     A                                      :"2","top":"110px","cursor row":"1"-
     A                                      ,"css class 2":"top-line","parent t-
     A                                      ab panel":"W6008F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCCONM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCCONM","designValu-
     A                                      e":"[SCCONM]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"414px","cursor column":"21","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass 2":"top-line","css class 3":"HI-
     A                                      ","parent tab panel":"W6008F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 4":"profound-converted"},{"i-
     A                                      d":"constant1","field type":"output-
     A                                       field","left":"778px","cursor colu-
     A                                      mn":"73","top":"110px","cursor row"-
     A                                      :"1","css class":"top-line","value"-
     A                                      :"js: currentDate()","css class 2":-
     A                                      "output-field","parent tab panel":"-
     A                                      W6008F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"W6008F_SCR01_fkeyM-
     A                                      enu","field type":"menu","left":"10-
     A                                      px","top":"120px","height":"350px",-
     A                                      "width":"230px","hover background c-
     A                                      olor":"#9AAA61","hover text color":-
     A                                      "#FFFFFF","border color":"#4C6106",-
     A                                      "menu option indent":"10px","backgr-
     A                                      ound color":"#758B27","css class":"-
     A                                      action-menu","css class 2":"station-
     A                                      ary","z index":"101"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W6008F_SCR01_BtnHiddenRef-
     A                                      resh","value":"btnRefresh","top":"1-
     A                                      25px","response":{"fieldName":"btnR-
     A                                      efresh","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant2","field ty-
     A                                      pe":"output field","value":"W6008F"-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"130p-
     A                                      x","cursor row":"2","parent tab pan-
     A                                      el":"W6008F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCPR')
     A                                  1  5HTML('DS","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCPRDS","d-
     A                                      esignValue":"[SCPRDS]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"414px","cursor column"-
     A                                      :"21","top":"130px","cursor row":"2-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"W6008F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant3","field type":"-
     A                                      output field","value":"SCR01","css -
     A                                      class":"constant","left":"799px","c-
     A                                      ursor column":"76","top":"130px","c-
     A                                      ursor row":"2","parent tab panel":"-
     A                                      W6008F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W6-
     A                                      008F_SCR01_BtnHiddenSearch","value"-
     A                                      :"btnSearch","top":"150px","respons-
     A                                      e":{"fieldName":"btnSearch","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W6008F_SCR01_BtnHid-
     A                                      denDiaryItems","value":"btnDiary","-
     A                                      top":"175px","response":{"fieldName-
     A                                      ":"btnDiary","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W6008F_SCR01_BtnHiddenSystemMessag-
     A                                      es","value":"btnMessage","top":"200-
     A                                      px","response":{"fieldName":"btnMes-
     A                                      sage","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W6008F-
     A                                      _SCR01_BtnHiddenWorkSubmitJob","val-
     A                                      ue":"btnWrksbmjob","top":"225px","r-
     A                                      esponse":{"fieldName":"btnWrkJob","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant5","field type":"outp-
     A                                      ut field","value":"Batch date      -
     A                                                              :","css cla-
     A                                      ss":"constant","left":"358px","curs-
     A                                      or column":"13","top":"250px","curs-
     A                                      or row":"8","parent tab panel":"W60-
     A                                      08F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCPRDT","field type":-
     A                                      "date field","css class":"input","c-
     A                                      ss class 2":"date-field","value":{"-
     A                                      fieldName":"SCPRDT","designValue":"-
     A                                      [SCPRDT]","refField":"DT8","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"-999.00","nu-
     A                                      mBlankFill":"true","edtWrd":"''  / -
     A                                       /    ''","dateFormat":"m/d/Y"},"le-
     A                                      ft":"652px","cursor column":"55","t-
     A                                      op":"250px","cursor row":"8","width-
     A                                      ":"71px","text align":"right","css -
     A                                      class 3":"UL","css class 4":"HI","e-
     A                                      rror message id":"WCR0500","error m-
     A                                      essage file":"WMESGG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"21","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"WCR0529","error message file 2":"-
     A                                      WMESGG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"26","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"parent tab panel":"W6008-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 5":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W6008F_-
     A                                      SCR01_BtnHiddenWorkPrinterOutput","-
     A                                      value":"btnWrkprtout","top":"250px"-
     A                                      ,"response":{"fieldName":"btnWrkPrn-
     A                                      t","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W6008F_SC-
     A                                      R01_BtnHiddenImageQueue","value":"b-
     A                                      tnImgQue","top":"275px","response":-
     A                                      {"fieldName":"btnImgQue","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant6","field type":"output field"-
     A                                      ,"value":"Check mailing dt         -
     A                                                     :","css class":"cons-
     A                                      tant","left":"358px","cursor column-
     A                                      ":"13","top":"290px","cursor row":"-
     A                                      10","parent tab panel":"W6008F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCCMDT","field type":"date fi-
     A                                      eld","css class":"input","css class-
     A                                       2":"date-field","value":{"fieldNam-
     A                                      e":"SCCMDT","designValue":')
     A                                  1  6HTML('"[SCCMDT]","refField":"DT8","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00","numBlankFill":"true","edtWrd":-
     A                                      "''  /  /    ''","dateFormat":"m/d/-
     A                                      Y"},"left":"652px","cursor column":-
     A                                      "55","top":"290px","cursor row":"10-
     A                                      ","width":"71px","text align":"righ-
     A                                      t","css class 3":"UL","error messag-
     A                                      e id":"WCR0500","error message file-
     A                                      ":"WMESGG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"25","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"2 messag-
     A                                      es","error message id 2":"WCR0529",-
     A                                      "error message file 2":"WMESGG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"26","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      parent tab panel":"W6008F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 4":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W6008F_SCR01_BtnHi-
     A                                      ddenHelp","value":"btnHelp","top":"-
     A                                      300px","response":{"fieldName":"btn-
     A                                      Help","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant4","field type-
     A                                      ":"output field","value":"Generate -
     A                                      Concentra Paid Date File       :","-
     A                                      css class":"constant","visibility":-
     A                                      {"fieldName":"22","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"358px","cursor column":"13","top"-
     A                                      :"330px","cursor row":"12","parent -
     A                                      tab panel":"W6008F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCCPDF-
     A                                      ","field type":"checkbox","css clas-
     A                                      s":"input","css class 2":"checkbox"-
     A                                      ,"value":{"fieldName":"SCCPDF","des-
     A                                      ignValue":"[SCCPDF]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase","dataLeng-
     A                                      th":"1"},"text transform":"uppercas-
     A                                      e","visibility":{"fieldName":"22","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"652px","top":"330-
     A                                      px","width":"8px","error message id-
     A                                      ":"WCR0571","error message file":"W-
     A                                      MESGG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "23","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"1 message","-
     A                                      parent tab panel":"W6008F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted","checke-
     A                                      d value":"Y","unchecked value":" "}-
     A                                      ,{"id":"SCMSG1","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCMS-
     A                                      G1","designValue":"[SCMSG1]","refFi-
     A                                      eld":"NM60","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"358px","cursor c-
     A                                      olumn":"13","top":"390px","cursor r-
     A                                      ow":"15","css class 2":"HI","parent-
     A                                       tab panel":"W6008F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"SCMSG-
     A                                      2","field type":"output field","val-
     A                                      ue":{"fieldName":"SCMSG2","designVa-
     A                                      lue":"[SCMSG2]","refField":"NM60","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"358px","cursor column":"13","-
     A                                      top":"410px","cursor row":"16","css-
     A                                       class 2":"HI","parent tab panel":"-
     A                                      W6008F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"btnSubmit","field -
     A                                      type":"button","value":"Enter","sho-
     A                                      rtcut key":"Enter","left":"14px","t-
     A                                      op":"150px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF03","field type":"but-
     A                                      ton","value":"Exit","shortcut key":-
     A                                      "F3","left":"14px","top":"183px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnCF-
     A                                      13","field type":"button","value":"-
     A                                      Chg user parms","shortcut key":"F13-
     A                                      ","left":"14px","top":"216px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnHELP"-
     A                                      ,"field type":"button","shortcut ke-
     A                                      y":"Alt-F1","bypass validation":"tr-
     A                                      ue","value":"HELP","response":{"fie-
     A                                      ldName":"*IN10","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"left":"14px","top":-
     A                                      "249px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCCPDF         1A  H
     A            SCCMDT    R        H      REFFLD(DT8)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMSG1    R        H      REFFLD(NM60)
     A            SCMSG2    R        H      REFFLD(NM60)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPRDT    R        H      REFFLD(DT8)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR99
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    3C1    3 FSCERR     INPUTONLY -
     A                                      0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"3-3"},"items"-
     A                                      :[{"id":"W6008F_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"W6008F_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W6008F_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"W6008F_SCR99_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1040px","id":"-
     A                                      W6008F_SCR99_BtnSave","tool tip":"S-
     A                                      ave","onclick":"SystemToolbarSave",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/save.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1066px"-
     A                                      ,"id":"W6008F_SCR99_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"W6008F_SC-
     A                                      R99_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"W6008F_SCR99_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "W6008F_SCR99_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLe')
     A                                  1  4HTML('ading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"W6008F_SCR99_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"W6008F_SCR99_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"W6008F_SCR99_Ma-
     A                                      inTabPanel","field type":"tab panel-
     A                                      ","tab panel style":"Transform","ta-
     A                                      b names":"Tab 1","active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      6008F_SCR99_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"W6008-
     A                                      F_SCR99_fkeyMenu","field type":"men-
     A                                      u","left":"10px","top":"120px","hei-
     A                                      ght":"350px","width":"230px","hover-
     A                                       background color":"#9AAA61","hover-
     A                                       text color":"#FFFFFF","border colo-
     A                                      r":"#4C6106","menu option indent":"-
     A                                      10px","background color":"#758B27",-
     A                                      "css class":"action-menu","css clas-
     A                                      s 2":"stationary","z index":"101"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W6008F_SCR99-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCERR",-
     A                                      "field type":"password field","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","input only":"true","value":{"f-
     A                                      ieldName":"SCERR","designValue":"[S-
     A                                      CERR]","refField":"FLAG","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"288px","cursor column":"3","top"-
     A                                      :"150px","cursor row":"3","width":"-
     A                                      8px","read only":"true","css class -
     A                                      3":"PR-UL","parent tab panel":"W600-
     A                                      8F_SCR99_MainTabPanel","parent tab"-
     A                                      :"0","css class 4":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W6008F-
     A                                      _SCR99_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W6008F_SCR99_BtnHiddenD-
     A                                      iaryItems","value":"btnDiary","top"-
     A                                      :"175px","response":{"fieldName":"b-
     A                                      tnDiary","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W60-
     A                                      08F_SCR99_BtnHiddenSystemMessages",-
     A                                      "value":"btnMessage","top":"200px",-
     A                                      "response":{"fieldName":"btnMessage-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W6008F_SCR-
     A                                      99_BtnHiddenWorkSubmitJob","value":-
     A                                      "btnWrksbmjob","top":"225px","respo-
     A                                      nse":{"fieldName":"btnWrkJob","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W6008F_SCR99_BtnH-
     A                                      iddenWorkPrinterOutput","value":"bt-
     A                                      nWrkprtout","top":"250px","response-
     A                                      ":{"fieldName":"btnWrkPrnt","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css cla')
     A                                  1  5HTML('ss":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W600-
     A                                      8F_SCR99_BtnHiddenImageQueue","valu-
     A                                      e":"btnImgQue","top":"275px","respo-
     A                                      nse":{"fieldName":"btnImgQue","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W6008F_SCR99_BtnH-
     A                                      iddenHelp","value":"btnHelp","top":-
     A                                      "300px","response":{"fieldName":"bt-
     A                                      nHelp","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"btnSubmit","field typ-
     A                                      e":"button","value":"Enter","shortc-
     A                                      ut key":"Enter","left":"14px","top"-
     A                                      :"150px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF03","field type":"button-
     A                                      ","value":"Exit","shortcut key":"F3-
     A                                      ","left":"14px","top":"183px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF13"-
     A                                      ,"field type":"button","value":"Chg-
     A                                       user parms","shortcut key":"F13","-
     A                                      left":"14px","top":"216px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnHELP","f-
     A                                      ield type":"button","shortcut key":-
     A                                      "Alt-F1","bypass validation":"true"-
     A                                      ,"value":"HELP","response":{"fieldN-
     A                                      ame":"*IN10","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"left":"14px","top":"24-
     A                                      9px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR     R        H      REFFLD(FLAG)
