     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20
     A  21 22 23
     A  24 30 31                            CA01(10 'Response Indicator *IN10')
     A  32 71 72
     A  73 69                               CA02(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                  1  2HTML('QPUIREC9    RROWS      2    C-
     A                                      1    1C2    24 RERRMSGID  5    C6  -
     A                                        SCFFNDC7    WCR0508C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     71RERRMS-
     A                                      GID  5    C6    SCFFNDC7    WCR0702-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     73RERRMSGID  5    C6    SCTFN-
     A                                      DC7    WCR0508C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     72RERRMSGID  5 -
     A                                         C6    SCTFNDC7    WCR0702C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     7-
     A                                      3RERRMSGID  5    C6    SCFRDTC7    -
     A                                      WCR0500C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     20RERRMSGID  5    C6  -
     A                                        SCFRDTC7    WCR0529C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     22RERRMS-
     A                                      GID  5    C6    SCTODTC7    WCR0500-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     21RERRMSGID  5    C6    SCTOD-
     A                                      TC7    WCR0529C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     22')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN30","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN31","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN32","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN71","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N72","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN7-
     A                                      3","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"return cursor record":{"fieldNam-
     A                                      e":"HREC","dataLength":"10","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"none"},"retur-
     A                                      n cursor field":{"fieldName":"HFLD"-
     A                                      ,"dataLength":"10","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"none"},"valid command -
     A                                      key":{"fieldName":"*IN11","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"overlay r-
     A                                      ange":"1-24"},"items":[{"id":"HREC"-
     A                                      ,"field type":"output field","visib-
     A                                      ility":"hidden","value":{"fieldName-
     A                                      ":"HREC","designValue":"[HREC]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"none","da-
     A                                      taLength":"10"},"left":"0px","top":-
     A                                      "-30px","css class":"profound-conve-
     A                                      rted"},{"id":"HFLD","field type":"o-
     A                                      utput field","visibility":"hidden",-
     A                                      "value":{"fieldName":"HFLD","design-
     A                                      Value":"[HFLD]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"none","dataLength":"10"},-
     A                                      "left":"0px","top":"-30px","css cla-
     A                                      ss":"profound-converted"},{"id":"W7-
     A                                      044F_SCR01_avKeys","field type":"ou-
     A                                      tput field","value":{"fieldName":"A-
     A                                      V_KEYS","dataLength":"1134","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[AV_KEYS]"},"left":"0-
     A                                      px","top":"0px","visibility":"hidde-
     A                                      n"},{"id":"W7044F_SCR01_action","fi-
     A                                      eld type":"html container","white s-
     A                                      pace":"normal","left":"0px","top":"-
     A                                      10px","width":"230px","css class":"-
     A                                      action-panel-converted","height":"7-
     A                                      00px","html":"<div class=\"top\"></-
     A                                      div><div class=\"imagetop\"><img sr-
     A                                      c=\"/profoundui/userdata/images/bar-
     A                                      _top.png\" /></div><div class=\"men-
     A                                      ulinks\"></div><div class=\"imagebo-
     A                                      ttom\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_bottom.png\" /></div-
     A                                      ><div class=\"bottom\"></div>"},{"f-
     A                                      ield type":"icon menu button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"32px","z ind-
     A                                      ex":"20","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1170px","id":"W7044F_S-
     A                                      CR01_BtnIconMenuSystemTools","tool -
     A                                      tip":"System Tools","icon alignment-
     A                                      ":"middle left","icon width":"16px"-
     A                                      ,"icon height":"24px","icon source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/systools.png","data function":"S-
     A                                      ystemToolbarSystools","show down ar-
     A                                      row":"Yes"},{"field type":"panel","-
     A                                      panel style":"TransformButtonBar","-
     A                                      id":"W7044F_SCR01_ButtonBar","top":-
     A                                      "35px","left":"1036px","width":"187-
     A                                      px","height":"28px","css class":"st-
     A                                      ationary","visibility":"hidden","lo-
     A                                      cked in place":"true"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1040px","id":"W7044F_SCR0-
     A                                      1_BtnSave","tool tip":"Save","oncli-
     A                                      ck":"SystemToolbarSave","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/save.png'')"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background rep')
     A                                  1  4HTML('eat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"W7044F_SCR01_BtnRefresh"-
     A                                      ,"tool tip":"Refresh","onclick":"Sy-
     A                                      stemToolbarRefresh","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/refresh.png'')"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1092px","id":"W7044-
     A                                      F_SCR01_BtnSearch","tool tip":"Sear-
     A                                      ch","onclick":"SystemToolbarSearch"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/search.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1118-
     A                                      px","id":"W7044F_SCR01_BtnDiaryItem-
     A                                      s","tool tip":"Diary/Work Items - I-
     A                                      DARTS","onclick":"SystemToolbarDiar-
     A                                      y","background image":{"fieldName":-
     A                                      "DryIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1144px","-
     A                                      id":"W7044F_SCR01_BtnSystemMessages-
     A                                      ","tool tip":"System Messages","onc-
     A                                      lick":"SystemToolbarMessages","back-
     A                                      ground image":{"fieldName":"MsgIcnU-
     A                                      RL","dataLength":"128","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"}},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1196px","id":"W70-
     A                                      44F_SCR01_BtnHelp","tool tip":"Help-
     A                                      ","onclick":"SystemToolbarHelp","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/help.png'')-
     A                                      "},{"id":"W7044F_SCR01_ImgSysToolBo-
     A                                      ttom","field type":"image","image s-
     A                                      ource":"/profoundui/userdata/images-
     A                                      /systool/butbarbot.png","left":"103-
     A                                      6px","top":"64px","width":"187px","-
     A                                      locked in place":"true","css class"-
     A                                      :"stationary","visibility":"hidden"-
     A                                      },{"id":"W7044F_SCR01_MainTabPanel"-
     A                                      ,"field type":"tab panel","tab pane-
     A                                      l style":"Transform","tab names":{"-
     A                                      fieldName":"SCPRDS","designValue":"-
     A                                      [SCPRDS]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "active tab":"0","left":"250px","to-
     A                                      p":"70px","width":"970px","height":-
     A                                      "657px","z index":"8","locked in pl-
     A                                      ace":"true","css class":"tab-panel"-
     A                                      ,"css class 2":"stationary"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W7044F_SCR01_BtnHi-
     A                                      ddenSave","value":"btnSave","top":"-
     A                                      100px","response":{"fieldName":"btn-
     A                                      Save","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant1","field type-
     A                                      ":"output field","left":"281px","cu-
     A                                      rsor column":"2","top":"110px","cur-
     A                                      sor row":"1","css class":"top-line"-
     A                                      ,"value":"js: currentUser()","css c-
     A                                      lass 2":"output-field","parent tab -
     A                                      panel":"W7044F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"SCCONM","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCCONM","designValue":-
     A                                      "[SCCONM]","refField":"NAME","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "414px","cursor column":"21","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                       2":"top-line","css class 3":"HI","-
     A                                      description":"COMPANY NAME","parent-
     A                                       tab panel":"W7044F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 4"-
     A                                      :"profound-converted"},{"i')
     A                                  1  5HTML('d":"constant2","field type":"-
     A                                      output field","left":"778px","curso-
     A                                      r column":"73","top":"110px","curso-
     A                                      r row":"1","css class":"top-line","-
     A                                      value":"js: currentDate()","css cla-
     A                                      ss 2":"output-field","parent tab pa-
     A                                      nel":"W7044F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"W7044F_SCR01-
     A                                      _fkeyMenu","field type":"menu","lef-
     A                                      t":"10px","top":"120px","height":"3-
     A                                      50px","width":"230px","hover backgr-
     A                                      ound color":"#9AAA61","hover text c-
     A                                      olor":"#FFFFFF","border color":"#4C-
     A                                      6106","menu option indent":"10px","-
     A                                      background color":"#758B27","css cl-
     A                                      ass":"action-menu","css class 2":"s-
     A                                      tationary","z index":"101"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W7044F_SCR01_BtnHid-
     A                                      denRefresh","value":"btnRefresh","t-
     A                                      op":"125px","response":{"fieldName"-
     A                                      :"btnRefresh","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"Q1PGM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"Q1PGM","designValue":"[Q1PG-
     A                                      M]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one","dataLength":"10"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"W70-
     A                                      44F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCPRDS","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCPRDS","designValue":"[SCPRDS]",-
     A                                      "refField":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"414px","cu-
     A                                      rsor column":"21","top":"130px","cu-
     A                                      rsor row":"2","css class 2":"HI","d-
     A                                      escription":"PROGRAM NAME","parent -
     A                                      tab panel":"W7044F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","visibility":"-
     A                                      hidden","css class 3":"profound-con-
     A                                      verted"},{"id":"constant3","field t-
     A                                      ype":"output field","value":"SCR01"-
     A                                      ,"css class":"constant","left":"799-
     A                                      px","cursor column":"76","top":"130-
     A                                      px","cursor row":"2","parent tab pa-
     A                                      nel":"W7044F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W7044F_SCR01_BtnHiddenSearch","-
     A                                      value":"btnSearch","top":"150px","r-
     A                                      esponse":{"fieldName":"btnSearch","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant4","field type":"outp-
     A                                      ut field","value":"Type information-
     A                                      , press Enter.","css class":"consta-
     A                                      nt","left":"281px","cursor column":-
     A                                      "2","top":"170px","cursor row":"4",-
     A                                      "css class 2":"BLU","parent tab pan-
     A                                      el":"W7044F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W7044F_SCR01_BtnHiddenDiaryItems-
     A                                      ","value":"btnDiary","top":"175px",-
     A                                      "response":{"fieldName":"btnDiary",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W7044F_SCR01-
     A                                      _BtnHiddenSystemMessages","value":"-
     A                                      btnMessage","top":"200px","response-
     A                                      ":{"fieldName":"btnMessage","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant5","field type":"output fie-
     A                                      ld","value":"Group range:","css cla-
     A                                      ss":"constant","left":"295px","curs-
     A                                      or column":"4","top":"210px","curso-
     A                                      r row":"6","parent tab panel":"W704-
     A                                      4F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCFFND","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCFFND","designValue":"[SCFFND-
     A                                      ]","refField":"FND","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"999.00","numBlankFi-
     A                                      ll":"true"},"left":"386px","cursor -
     A                                      column":"17","top":"210px","cursor -
     A                                      row":"6","width":"22px","text align-
     A                                      ":"right","read only":{"fieldName":-
     A                                      "69","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 3":{"fieldNa-
     A                                      me":"69","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N69","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"se')
     A                                  1  6HTML('t focus":{"fieldName":"30","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"error message id":"WCR0508","-
     A                                      error message file":"WMESGG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"71","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"2 messages","error messag-
     A                                      e id 2":"WCR0702","error message fi-
     A                                      le 2":"WMESGG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"73","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"parent tab panel"-
     A                                      :"W7044F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 5":"profound--
     A                                      converted"},{"id":"constant7","fiel-
     A                                      d type":"output field","value":"-",-
     A                                      "css class":"constant","left":"414p-
     A                                      x","cursor column":"21","top":"210p-
     A                                      x","cursor row":"6","parent tab pan-
     A                                      el":"W7044F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCTFND","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCTFND","designValue"-
     A                                      :"[SCTFND]","refField":"FND","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"999.00","n-
     A                                      umBlankFill":"true"},"left":"428px"-
     A                                      ,"cursor column":"23","top":"210px"-
     A                                      ,"cursor row":"6","width":"22px","t-
     A                                      ext align":"right","read only":{"fi-
     A                                      eldName":"69","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 3":-
     A                                      {"fieldName":"69","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"PR","customFalse":""},"css clas-
     A                                      s 4":{"fieldName":"N69","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"se-
     A                                      t focus":{"fieldName":"31","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      error message id":"WCR0508","error -
     A                                      message file":"WMESGG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"72","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"2 messages","error message id 2-
     A                                      ":"WCR0702","error message file 2":-
     A                                      "WMESGG","error message library 2":-
     A                                      "*LIBL","error condition 2":{"field-
     A                                      Name":"73","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"parent tab panel":"W704-
     A                                      4F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 5":"profound-conver-
     A                                      ted"},{"id":"constant6","field type-
     A                                      ":"output field","value":"(blank fo-
     A                                      r all)","css class":"constant","lef-
     A                                      t":"463px","cursor column":"28","to-
     A                                      p":"210px","cursor row":"6","parent-
     A                                       tab panel":"W7044F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W7044F_SCR01_BtnHiddenWo-
     A                                      rkSubmitJob","value":"btnWrksbmjob"-
     A                                      ,"top":"225px","response":{"fieldNa-
     A                                      me":"btnWrkJob","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W7044F_SCR01_BtnHiddenWorkPrint-
     A                                      erOutput","value":"btnWrkprtout","t-
     A                                      op":"250px","response":{"fieldName"-
     A                                      :"btnWrkPrnt","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant8","fi-
     A                                      eld type":"output field","value":"D-
     A                                      ate range :","css class":"constant"-
     A                                      ,"left":"295px","cursor column":"4"-
     A                                      ,"top":"270px","cursor row":"9","pa-
     A                                      rent tab panel":"W7044F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CFRDT","field type":"date field","c-
     A                                      ss class":"input","css class 2":"da-
     A                                      te-field","value":{"fieldName":"SCF-
     A                                      RDT","designValue":"[SCFRDT]","refF-
     A                                      ield":"DT8","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"-999.00","numBlankFill":"tr-
     A                                      ue","edtWrd":"''  /  /    ''","date-
     A                                      Format":"m/d/Y"},"left":"386px","cu-
     A                                      rsor column":"17","top":"270px","cu-
     A                                      rsor row":"9","width":"71px","text -
     A                                      align":"right","set focus":{"fieldN-
     A                                      ame":"32","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 3":"HI"-
     A                                      ,"error message id":"WCR0500","erro-
     A                                      r message file":"WMESGG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"20","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"2 messages","error message id-
     A                                       2":"WCR0529","error message file 2-
     A                                      ":"WMESGG","error message library 2-
     A                                      ":"*LIBL","error condition')
     A                                  1  7HTML(' 2":{"fieldName":"22","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"parent-
     A                                       tab panel":"W7044F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 4"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant9","field type":"output field","-
     A                                      value":"-","css class":"constant","-
     A                                      left":"463px","cursor column":"28",-
     A                                      "top":"270px","cursor row":"9","par-
     A                                      ent tab panel":"W7044F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      TODT","field type":"date field","cs-
     A                                      s class":"input","css class 2":"dat-
     A                                      e-field","value":{"fieldName":"SCTO-
     A                                      DT","designValue":"[SCTODT]","refFi-
     A                                      eld":"DT8","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"-999.00","numBlankFill":"tru-
     A                                      e","edtWrd":"''  /  /    ''","dateF-
     A                                      ormat":"m/d/Y"},"left":"499px","cur-
     A                                      sor column":"30","top":"270px","cur-
     A                                      sor row":"9","width":"71px","text a-
     A                                      lign":"right","css class 3":"HI","e-
     A                                      rror message id":"WCR0500","error m-
     A                                      essage file":"WMESGG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"21","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"WCR0529","error message file 2":"-
     A                                      WMESGG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"22","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"parent tab panel":"W7044-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 4":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W7044F_-
     A                                      SCR01_BtnHiddenImageQueue","value":-
     A                                      "btnImgQue","top":"275px","response-
     A                                      ":{"fieldName":"btnImgQue","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W7044F_SCR01_BtnHidd-
     A                                      enHelp","value":"btnHelp","top":"30-
     A                                      0px","response":{"fieldName":"btnHe-
     A                                      lp","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant10","field type"-
     A                                      :"output field","value":"All claim -
     A                                      processing must be complete for the-
     A                                       dates entered.","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"330px","cursor row":"12-
     A                                      ","css class 2":"BLU","parent tab p-
     A                                      anel":"W7044F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"btnSubmit",-
     A                                      "field type":"button","value":"Ente-
     A                                      r","shortcut key":"Enter","left":"1-
     A                                      4px","top":"150px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF03","field typ-
     A                                      e":"button","value":"Exit","shortcu-
     A                                      t key":"F3","left":"14px","top":"18-
     A                                      3px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF10","field type":"button","v-
     A                                      alue":"Search","shortcut key":"F10"-
     A                                      ,"left":"14px","top":"216px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF13",-
     A                                      "field type":"button","value":"F13"-
     A                                      ,"shortcut key":"F13","left":"14px"-
     A                                      ,"top":"249px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnHELP","field type":"-
     A                                      button","shortcut key":"Alt-F1","by-
     A                                      pass validation":"true","value":"HE-
     A                                      LP","response":{"fieldName":"*IN10"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "left":"14px","top":"282px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFFND    R        H      REFFLD(FND)
     A            SCFRDT    R        H      REFFLD(DT8)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCTFND    R        H      REFFLD(FND)
     A            SCTODT    R        H      REFFLD(DT8)
     A          R SCR99
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC3    RASSUME    0     -
     A                                      RROWS      2    C1    3C1    3 FSCE-
     A                                      RR     INPUTONLY 0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","valid command key"-
     A                                      :{"fieldName":"*IN11","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"overlay range-
     A                                      ":"3-3"},"items":[{"id":"W7044F_SCR-
     A                                      99_avKeys","field type":"output fie-
     A                                      ld","value":{"fieldName":"AV_KEYS",-
     A                                      "dataLength":"1134","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[AV_KEYS]"},"left":"0px","top-
     A                                      ":"0px","visibility":"hidden"},{"id-
     A                                      ":"W7044F_SCR99_action","field type-
     A                                      ":"html container","white space":"n-
     A                                      ormal","left":"0px","top":"10px","w-
     A                                      idth":"230px","css class":"action-p-
     A                                      anel-converted","height":"700px","h-
     A                                      tml":"<div class=\"top\"></div><div-
     A                                       class=\"imagetop\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_top.png-
     A                                      \" /></div><div class=\"menulinks\"-
     A                                      ></div><div class=\"imagebottom\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_bottom.png\" /></div><div cl-
     A                                      ass=\"bottom\"></div>"},{"field typ-
     A                                      e":"icon menu button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"32px","z index":"20"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1170px","id":"W7044F_SCR99_Btn-
     A                                      IconMenuSystemTools","tool tip":"Sy-
     A                                      stem Tools","icon alignment":"middl-
     A                                      e left","icon width":"16px","icon h-
     A                                      eight":"24px","icon source":"/profo-
     A                                      undui/userdata/images/systool/systo-
     A                                      ols.png","data function":"SystemToo-
     A                                      lbarSystools","show down arrow":"Ye-
     A                                      s"},{"field type":"panel","panel st-
     A                                      yle":"TransformButtonBar","id":"W70-
     A                                      44F_SCR99_ButtonBar","top":"35px","-
     A                                      left":"1036px","width":"187px","hei-
     A                                      ght":"28px","css class":"stationary-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1040px","id":"W7044F_SCR99_BtnSav-
     A                                      e","tool tip":"Save","onclick":"Sys-
     A                                      temToolbarSave","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/save.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1066px","id":"W7044F_SCR99-
     A                                      _BtnRefresh","tool tip":"Refresh","-
     A                                      onclick":"SystemToolbarRefresh","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/refresh.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1092px"-
     A                                      ,"id":"W7044F_SCR99_BtnSearch","too-
     A                                      l tip":"Search","onclick":"SystemTo-
     A                                      olbarSearch","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/search.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1118px","id":"W7044F_SCR99_-
     A                                      BtnDiaryItems","tool tip":"Diary/Wo-
     A                                      rk Items - IDARTS","onclick":"Syste-
     A                                      mToolbarDiary","background image":{-
     A                                      "fieldName":"DryIcnURL","dataLength-
     A                                      ":"128","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"}},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1144px","id":"W7044F_SCR99_BtnSy-
     A                                      stemMessages","tool tip":"System Me-
     A                                      ssages","onclick":"SystemToolbarMes-
     A                                      sages","background image":{"fieldNa-
     A                                      me":"MsgIcnURL","dataLengt')
     A                                  1  4HTML('h":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1196px","id":"W7044F_SCR9-
     A                                      9_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"W7044F_SCR99_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "W7044F_SCR99_MainTabPanel","field -
     A                                      type":"tab panel","tab panel style"-
     A                                      :"Transform","tab names":"Tab 1","a-
     A                                      ctive tab":"0","left":"250px","top"-
     A                                      :"70px","width":"970px","height":"6-
     A                                      57px","z index":"8","locked in plac-
     A                                      e":"true","css class":"tab-panel","-
     A                                      css class 2":"stationary"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W7044F_SCR99_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"W7044F_SCR99_fkeyMenu","-
     A                                      field type":"menu","left":"10px","t-
     A                                      op":"120px","height":"350px","width-
     A                                      ":"230px","hover background color":-
     A                                      "#9AAA61","hover text color":"#FFFF-
     A                                      FF","border color":"#4C6106","menu -
     A                                      option indent":"10px","background c-
     A                                      olor":"#758B27","css class":"action-
     A                                      -menu","css class 2":"stationary","-
     A                                      z index":"101"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W7044F_SCR99_BtnHiddenRefresh",-
     A                                      "value":"btnRefresh","top":"125px",-
     A                                      "response":{"fieldName":"btnRefresh-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"SCERR","field type":"passw-
     A                                      ord field","css class":"input","css-
     A                                       class 2":"textbox","input only":"t-
     A                                      rue","value":{"fieldName":"SCERR","-
     A                                      designValue":"[SCERR]","refField":"-
     A                                      FLAG","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","left":"288px","cursor c-
     A                                      olumn":"3","top":"150px","cursor ro-
     A                                      w":"3","width":"8px","read only":"t-
     A                                      rue","css class 3":"PR-UL","parent -
     A                                      tab panel":"W7044F_SCR99_MainTabPan-
     A                                      el","parent tab":"0","css class 4":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W7044F_SCR99_BtnHiddenSea-
     A                                      rch","value":"btnSearch","top":"150-
     A                                      px","response":{"fieldName":"btnSea-
     A                                      rch","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W7044F_-
     A                                      SCR99_BtnHiddenDiaryItems","value":-
     A                                      "btnDiary","top":"175px","response"-
     A                                      :{"fieldName":"btnDiary","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W7044F_SCR99_BtnHidden-
     A                                      SystemMessages","value":"btnMessage-
     A                                      ","top":"200px","response":{"fieldN-
     A                                      ame":"btnMessage","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W7044F_SCR99_BtnHiddenWorkSub-
     A                                      mitJob","value":"btnWrksbmjob","top-
     A                                      ":"225px","response":{"fieldName":"-
     A                                      btnWrkJob","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      7044F_SCR99_BtnHiddenWorkPrinterOut-
     A                                      put","value":"btnWrkprtout","top":"-
     A                                      250px","response":{"fieldName":"btn-
     A                                      WrkPrnt","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place"')
     A                                  1  5HTML(':"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W7044F_SCR99_BtnHiddenI-
     A                                      mageQueue","value":"btnImgQue","top-
     A                                      ":"275px","response":{"fieldName":"-
     A                                      btnImgQue","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      7044F_SCR99_BtnHiddenHelp","value":-
     A                                      "btnHelp","top":"300px","response":-
     A                                      {"fieldName":"btnHelp","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"btnSu-
     A                                      bmit","field type":"button","value"-
     A                                      :"Enter","shortcut key":"Enter","le-
     A                                      ft":"14px","top":"150px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF03","fie-
     A                                      ld type":"button","value":"Exit","s-
     A                                      hortcut key":"F3","left":"14px","to-
     A                                      p":"183px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnHELP","field type":"butt-
     A                                      on","shortcut key":"Alt-F1","bypass-
     A                                       validation":"true","value":"HELP",-
     A                                      "response":{"fieldName":"*IN10","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"lef-
     A                                      t":"14px","top":"216px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR     R        H      REFFLD(FLAG)
