     A                                      REF(*LIBL/WREFP)
     A                                      INDARA
     A          R RCDTABAURQ
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RASSUME    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdTabAuRq","description":"Audi-
     A                                      t Request","overlay":"true","assume-
     A                                      ":"true"},"items":[{"id":"BtnExitBu-
     A                                      tton","field type":"button","css cl-
     A                                      ass":"button","value":"Exit","left"-
     A                                      :"525px","top":"10px","width":"100p-
     A                                      x","cursor":"default","description"-
     A                                      :"Exit Button","response":{"fieldNa-
     A                                      me":"ExitNow","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"shortcut key":"F3","v-
     A                                      isibility":"hidden"},{"id":"TabAudR-
     A                                      q","field type":"tab panel","css cl-
     A                                      ass":"tab-panel","left":"250px","to-
     A                                      p":"70px","width":"970px","height":-
     A                                      {"fieldName":"TabHeight","dataLengt-
     A                                      h":"5","decPos":"0","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","dataType":"zon-
     A                                      ed","formatting":"Number","units":"-
     A                                      px","negNum":"-999.00","designValue-
     A                                      ":"3270px"},"tab names":"Audit Requ-
     A                                      est","z index":"0","tab panel style-
     A                                      ":"CompSuite Tab Panel","value":"va-
     A                                      lue text","active tab":{"fieldName"-
     A                                      :"TabIndex","dataLength":"5","decPo-
     A                                      s":"0","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","dataType":"zoned","formatti-
     A                                      ng":"Number","units":"","negNum":"--
     A                                      999.00"},"ontabclick":"pui.click(\"-
     A                                      BtnTabClick\")"},{"id":"BtnTabClick-
     A                                      ","field type":"button","css class"-
     A                                      :"button","cursor":"default","descr-
     A                                      iption":"tab click button","value":-
     A                                      "Tab","response":{"fieldName":"tabC-
     A                                      lick","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"shortcut key":"F3","left":"48-
     A                                      5px","top":"10px","width":"35px","v-
     A                                      isibility":"hidden"},{"id":"btnRefr-
     A                                      esh","field type":"button","css cla-
     A                                      ss":"button","value":"Refresh","lef-
     A                                      t":"640px","top":"10px","width":"10-
     A                                      0px","cursor":"default","response":-
     A                                      {"fieldName":"BtnRefresh","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"visibilit-
     A                                      y":"hidden"}]}')
     A            BTNREFRESH     1A  H
     A            EXITNOW        1A  H
     A            TABCLICK       1A  H
     A            TABHEIGHT      5S 0H
     A            TABINDEX       5S 0H
     A          R RCDAUDRQ
     A                                  1  2HTML('QPUIREC14   ROVERLAY   0     -
     A                                      RASSUME    0     RROWS      2    C1-
     A                                          1C1    1 RERRMSGID  5    C11   -
     A                                      DrpPopGroupFMSFND     C6    WMESGGC-
     A                                      5    *LIBLC0    FERFND     RERRMSGI-
     A                                      D  5    C13   TxbPolExpToDtFMSPEXPT-
     A                                      ODTC6    WMESGGC5    *LIBLC0    FER-
     A                                      PEXPTODTRERRMSGID  5    C13   TxbPo-
     A                                      lExpToDtFMSMUTUALEXC6    WMESGGC5  -
     A                                        *LIBLC0    FERMUTUALEXRERRMSGID  -
     A                                      5    C14   TxbPolExpFrmDtFMSPEXPFRD-
     A                                      TC6    WMESGGC5    *LIBLC0    FERPE-
     A                                      XPFRDTRERRMSGID  5    C13   DrpPoli-
     A                                      cyTypeFMSPOLTYP  C6    WMESGGC5    -
     A                                      *LIBLC0    FERPOLTYP  RERRMSGID  5 -
     A                                         C13   DrpPolicyYearFMSFYR     C6-
     A                                          WMESGGC5    *LIBLC0    FERFYR  -
     A                                         RERRMSGID  5    C14   TxbDartsRe-
     A                                      markFMSDRTRMK  C6    WMESGGC5    *L-
     A                                      IBLC0    FERDRTRMK  REMSGID    5   -
     A                                       C11   TxbEmployerFMSMUTUALEXC6    -
     A                                      WMESGGC5    *LIBLC0    FERMUTUALEXR-
     A                                      EMSGID    5    C11   TxbEmployerFMS-
     A                                      EMPDIVNMC6    WMESGGC5    *LIBLC0  -
     A                                        FEREMPDIVNMRERRMSGID  5    C9    -
     A                                      DrpRegionFMSREGION  C6    WMESGGC5 -
     A                                         *LIBLC0    FERREGION  RERRMSGID -
     A                                       5    C17   DrpPolicyDivisionFMSDIV-
     A                                           C6    WMESGGC5    *LIBLC0    F-
     A                                      ERDIV     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdAudRq","overlay":"true","ext-
     A                                      ernal css":"label","description":"A-
     A                                      udit Request","assume":"true","over-
     A                                      lay range":"1-1","design overlay fo-
     A                                      rmats":"RcdTabAuRq","header text al-
     A                                      ign":"Left,Right","csv file name":"-
     A                                      Payment Value 1 Codes","selection v-
     A                                      alue":"A","onload":"var UpdAudFlg =-
     A                                       get(''CbxUpdAuditTrack'');\nvar Au-
     A                                      dRFlg   =  get(''DrpAuditRequestPro-
     A                                      c'');\nif ((UpdAudFlg !== \"Y\"  &&-
     A                                       UpdAudFlg !== \"on\")|| AudRFlg ==-
     A                                       \"N\" ) {\n\tapplyProperty(\"CbxUp-
     A                                      dPrevAuditReq\",\"disabled\",\"true-
     A                                      \");\n\tchangeElementValue(''CbxUpd-
     A                                      PrevAuditReq'', \"N\"); \n}   \nif -
     A                                      ((UpdAudFlg==\"Y\"  || UpdAudFlg ==-
     A                                       \"on\")&&  AudRFlg !== \"N\") {\n\-
     A                                      tapplyProperty(\"CbxUpdPrevAuditReq-
     A                                      \",\"disabled\",\"false\"); \n}\n\n-
     A                                      if (UpdAudFlg==\"Y\"  || UpdAudFlg -
     A                                      == \"on\") {\n\tapplyProperty(\"Cbx-
     A                                      DoNotGenerateOutput\",\"disabled\",-
     A                                      \"false\");\n}\nelse {\n  applyProp-
     A                                      erty(\"CbxDoNotGenerateOutput\",\"d-
     A                                      isabled\",\"true\");\n\tchangeEleme-
     A                                      ntValue(''CbxDoNotGenerateOutput'',-
     A                                       \"N\");\t \n}\n\nwindow.region = f-
     A                                      unction region()  \n{\nvar group = -
     A                                      get(\"DrpPopGroup\");\nif(group !==-
     A                                      \"\") {      \n//applyProperty(\"Dr-
     A                                      pRegion\", \"choices selection crit-
     A                                      eria\", \"RECO# = \" + get(\"TxbCo#-
     A                                      \") + \" AND REFND = \" + get(\"Drp-
     A                                      PopGroup\") + \"\");\napplyProperty-
     A                                      (\"DrpRegion\", \"choices selection-
     A                                       criteria\", \"RECO# = \" + get(\"T-
     A                                      xbCo#\") + \" AND REFND = ''\" + gr-
     A                                      oup + \"''\");\napplyProperty(\"Drp-
     A                                      Region\", \"disabled\", false);\n//-
     A                                      applyProperty(\"DrpRegion\", \"valu-
     A                                      e\", \"\");\napplyProperty(\"DrpReg-
     A                                      ion\", \"tooltip\", \"\");\n}\nelse-
     A                                       {    \napplyProperty(\"DrpRegion\"-
     A                                      , \"disabled\", true);\napplyProper-
     A                                      ty(\"DrpRegion\", \"value\", \"\");-
     A                                      \napplyProperty(\"DrpRegion\", \"to-
     A                                      ol tip\", \"Region can only be sele-
     A                                      cted when group is selected.\");\n}-
     A                                      \napplyProperty(\"DrpRegion\", \"fi-
     A                                      eld type\", \"select box\"); \n}\nw-
     A                                      indow.divisionSelections = function-
     A                                      () {\ndebugger;\n\tvar company = ge-
     A                                      t(\"TxbCo#\");\n\tvar group = get(\-
     A                                      "DrpPopGroup\");\n\n\tvar employer -
     A                                      = parseInt(get(\"TxbEmployer\"));\n-
     A                                      \tvar disEmployer = \"true\";\n\tif-
     A                                       (employer > 0){\n    disEmployer =-
     A                                       \"false\";\n    changeElementValue-
     A                                      (\"DrpPolicyDivision\", \"\");\n\t}-
     A                                      \n\tapplyProperty(\"DrpPolicyDivisi-
     A                                      on\", \"disabled\", disEmployer);\n-
     A                                      \t//apply selection critera based o-
     A                                      n employer info to\n\tvar divChoice-
     A                                      s = ''EMco# = '' + company.toString-
     A                                      () + '' and EMfnd = '' + group.toSt-
     A                                      ring() + '' and EMemp# = '' + emplo-
     A                                      yer.toString();\n\tapplyProperty(\"-
     A                                      DrpPolicyDivision\", \"choices sele-
     A                                      ction criteria\", divChoices);\n\ta-
     A                                      pplyProperty(\"DrpPol')
     A                                  1  2HTML('icyDivision\", \"field type\"-
     A                                      , \"select box\");\n}\n\nwindow.fun-
     A                                      dYearSelections = function() {\n\n\-
     A                                      tvar company = get(\"TxbCo#\");\n\t-
     A                                      var group = get(\"DrpPopGroup\");\n-
     A                                      \tvar employer = parseInt(get(\"Txb-
     A                                      Employer\"));\n\tvar division = par-
     A                                      seInt(get(\"DrpPolicyDivision\"));\-
     A                                      n\tvar disEmployer = \"true\";\n\ti-
     A                                      f (employer > 0) {\n    disEmployer-
     A                                       = \"false\";\n\t}\n\tapplyProperty-
     A                                      (\"DrpPolicyYear\", \"disabled\", d-
     A                                      isEmployer);\n\t//apply selection c-
     A                                      ritera based on employer info to\n\-
     A                                      t\tif (division >= 0) {\n\tvar fyrC-
     A                                      hoices = ''ELco# = '' + company.toS-
     A                                      tring() + '' and ELfnd = '' + group-
     A                                      .toString() + '' and ELemp# = '' + -
     A                                      employer.toString() + '' and Eldiv -
     A                                      = '' + division.toString();\n\t}\n\-
     A                                      telse {\n\tvar fyrChoices = ''ELco#-
     A                                       = '' + company.toString() + '' and-
     A                                       ELfnd = '' + group.toString() + ''-
     A                                       and ELemp# = '' + employer.toStrin-
     A                                      g();\n\t}\n\tapplyProperty(\"DrpPol-
     A                                      icyYear\", \"choices selection crit-
     A                                      eria\", fyrChoices); \n\tapplyPrope-
     A                                      rty(\"DrpPolicyYear\", \"field type-
     A                                      \", \"select box\");\n}\n\nwindow.s-
     A                                      ingleEmployerSettings = function() -
     A                                      {\n  var employer = parseInt(get(\"-
     A                                      TxbEmployer\"));\n  if (employer > -
     A                                      0) {\n    changeElementValue(\"DrpA-
     A                                      uditRequestProc\", \"A\");\n    app-
     A                                      lyProperty(\"DrpAuditRequestProc\",-
     A                                      \"disabled\",\"true\"); \n    apply-
     A                                      Property(\"TxbPolExpToDt\",\"disabl-
     A                                      ed\",\"true\");         \n    chang-
     A                                      eElementValue(\"TxbPolExpToDt\", \"-
     A                                      \");\n    applyProperty(\"TxbPolExp-
     A                                      FrmDt\",\"disabled\",\"true\");    -
     A                                           \n    changeElementValue(\"Txb-
     A                                      PolExpFrmDt\", \"\");\n    changeEl-
     A                                      ementValue(\"DrpPolicyType\", \"B\"-
     A                                      );\n    applyProperty(\"DrpPolicyTy-
     A                                      pe\",\"disabled\",\"true\");\n    c-
     A                                      hangeElementValue(\"DrpRegion\", \"-
     A                                      \");\n    applyProperty(\"DrpRegion-
     A                                      \",\"disabled\",\"true\");  \n    }-
     A                                      \n    else {\n      applyProperty(\-
     A                                      "DrpAuditRequestProc\",\"disabled\"-
     A                                      ,\"false\"); \n      applyProperty(-
     A                                      \"TxbPolExpToDt\",\"disabled\",\"fa-
     A                                      lse\");         \n      applyProper-
     A                                      ty(\"TxbPolExpFrmDt\",\"disabled\",-
     A                                      \"false\");         \n      applyPr-
     A                                      operty(\"DrpPolicyType\",\"disabled-
     A                                      \",\"false\");\n      applyProperty-
     A                                      (\"DrpRegion\",\"disabled\",\"false-
     A                                      \");  \n    }\n}\n\nregion();\ndivi-
     A                                      sionSelections();\nfundYearSelectio-
     A                                      ns();\nsingleEmployerSettings();"},-
     A                                      "items":[{"id":"BtnExitButtonAll","-
     A                                      field type":"button","css class":"b-
     A                                      utton","value":"Exit","left":"750px-
     A                                      ","top":"10px","width":"100px","cur-
     A                                      sor":"default","description":"Exit -
     A                                      Button","response":{"fieldName":"Ex-
     A                                      itNow","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"shortcut key":"F3","visibili-
     A                                      ty":"hidden","height"')
     A                                  1  2HTML(':"25px"},{"id":"FldSetCon1","-
     A                                      field type":"field set panel","css -
     A                                      class":"fieldset","left":"255px","t-
     A                                      op":"95px","width":"950px","height"-
     A                                      :"210px","z index":"8","visibility"-
     A                                      :{"fieldName":"indCont1","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "locked in place":"true"},{"id":"Fl-
     A                                      dSetCon2","field type":"field set p-
     A                                      anel","css class":"fieldset","left"-
     A                                      :"255px","top":{"fieldName":"scCon2-
     A                                      top","dataLength":"5","decPos":"0",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","numBlankFill":"false","zeroFil-
     A                                      l":"false","curSym":"","dataType":"-
     A                                      zoned","formatting":"Number","negNu-
     A                                      m":"-999.00","units":"px","designVa-
     A                                      lue":"320px"},"width":"950px","heig-
     A                                      ht":"305px","z index":"8","locked i-
     A                                      n place":"true"},{"id":"LblGroup","-
     A                                      field type":"output field","css cla-
     A                                      ss":"label","value":"Group ","left"-
     A                                      :"265px","top":"25px","parent field-
     A                                       set":"FldSetCon1","description":"G-
     A                                      roup Label","width":"40px","visibil-
     A                                      ity":"hidden"},{"id":"DrpPopGroup",-
     A                                      "field type":"select box","css clas-
     A                                      s":"input","description":"Group Sel-
     A                                      ection Drop Down box","value":{"fie-
     A                                      ldName":"scFnd","refField":"elfnd w-
     A                                      delp","numSep":"false","zeroBalance-
     A                                      ":"false","numBlankFill":"false","z-
     A                                      eroFill":"true","curSym":"","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","negNum":"-999.00","units":"","d-
     A                                      esignValue":"[scFnd]"},"left":"265p-
     A                                      x","top":"45px","width":"230px","pa-
     A                                      rent field set":"FldSetCon1","choic-
     A                                      es database file":{"fieldName":"grp-
     A                                      From","dataLength":"200","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"},"ch-
     A                                      oice options field":{"fieldName":"g-
     A                                      rpSelect","dataLength":"100","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      ,"choice values field":"DIGITS(FNFN-
     A                                      D)","choices selection criteria":{"-
     A                                      fieldName":"grpwhere","dataLength":-
     A                                      "200","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"},"order by":"FNFND","cs-
     A                                      s class 2":"dropdown","tab index":"-
     A                                      1","visibility":"hidden","error mes-
     A                                      sages":"1 message","error message i-
     A                                      d":{"fieldName":"msFnd","dataLength-
     A                                      ":"10","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"},"error message file":-
     A                                      "WMESGG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"erFnd","dataType":"indicator","f-
     A                                      ormatting":"Indicator')
     A                                  1  2HTML('","indFormat":"1 / 0"},"error-
     A                                       enhanced mode":"0","read only":{"f-
     A                                      ieldName":"indGrpRd","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"disable-
     A                                      d":{"fieldName":"indGrpRd","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"b-
     A                                      lank option":"true","onchange":"cal-
     A                                      lAjaxProgram(999999999, ''W7230R01'-
     A                                      ', {''params'': '','' + get(''TxbCo-
     A                                      #'') + '','' +  get(''DrpPopGroup''-
     A                                      ) + '',''},function(data) {  if(''P-
     A                                      oints'' in data) {changeElementValu-
     A                                      e(''TxbDartsRemark'', data.Points)}-
     A                                      },false);\n\nregion();"},{"id":"Hdg-
     A                                      EmpMtl","field type":"output field"-
     A                                      ,"css class":"heading","description-
     A                                      ":"Mutiple Employer Label","value":-
     A                                      "Request for Multiple Employer by E-
     A                                      xpiration Date","left":"265px","top-
     A                                      ":"115px","width":"325px","parent f-
     A                                      ield set":"FldSetCon1","visibility"-
     A                                      :{"fieldName":"indMassReq","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"heading type":"Section Header"},-
     A                                      {"id":"HdgEmpSing","field type":"ou-
     A                                      tput field","css class":"heading","-
     A                                      description":"Single Employer Label-
     A                                      ","value":"Request for Single Emplo-
     A                                      yer / Division","left":"755px","top-
     A                                      ":"115px","width":"255px","parent f-
     A                                      ield set":"FldSetCon1","visibility"-
     A                                      :{"fieldName":"indSigReq","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"heading type":"Section Header"},{-
     A                                      "id":"LblPolToDt","field type":"out-
     A                                      put field","css class":"label","des-
     A                                      cription":"Policy To date","value":-
     A                                      "Policy Expiration Date Range","lef-
     A                                      t":"265px","top":"145px","width":"1-
     A                                      70px","parent field set":"FldSetCon-
     A                                      1","visibility":{"fieldName":"indMa-
     A                                      ssReq","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"}},{"id":"TxbPolExpT-
     A                                      oDt","field type":"date field","css-
     A                                       class":"input","value":{"fieldName-
     A                                      ":"scPExpToDt","dataLength":"8","de-
     A                                      cPos":"0","numSep":"false","zeroBal-
     A                                      ance":"false","numBlankFill":"false-
     A                                      ","zeroFill":"true","edtWrd":"''  /-
     A                                        /    ''","curSym":"","dataType":"-
     A                                      zoned","formatting":"Number","negNu-
     A                                      m":"-999.00","units":"","designValu-
     A                                      e":"[scPExpToDt]"},"left":"265px","-
     A                                      top":"160px","parent field set":"Fl-
     A                                      dSetCon1","text align":"right","css-
     A                                       class 2":"datefield","tab index":"-
     A                                      2","width":"85px","visibility":{"fi-
     A                                      eldName":"indMassReq","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"er-
     A                                      ror messages":"2 messages","error m-
     A                                      essage id":{"fieldName":"msPExpToDt-
     A                                      ","dataLength":"10","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"n')
     A                                  1  2HTML('one"},"error message file":"W-
     A                                      MESGG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "erPExpToDt","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error enhanced mode":"-
     A                                      0","error message id 2":{"fieldName-
     A                                      ":"msMutualEx","dataLength":"10","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"},"error message file 2":"WMESGG-
     A                                      ","error message library 2":"*LIBL"-
     A                                      ,"error condition 2":{"fieldName":"-
     A                                      erMutualEx","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error enhanced mode 2":-
     A                                      "0"},{"id":"TxbPolExpFrmDt","field -
     A                                      type":"date field","css class":"inp-
     A                                      ut","value":{"fieldName":"scPExpFrD-
     A                                      t","dataLength":"8","decPos":"0","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","numBlankFill":"false","zeroFill"-
     A                                      :"true","edtWrd":"''  /  /    ''","-
     A                                      curSym":"","dataType":"zoned","form-
     A                                      atting":"Number","negNum":"-999.00"-
     A                                      ,"units":"","designValue":"[scPExpF-
     A                                      rDt]"},"text align":"right","left":-
     A                                      "405px","top":"160px","parent field-
     A                                       set":"FldSetCon1","css class 2":"d-
     A                                      atefield","tab index":"2","width":"-
     A                                      100px","visibility":{"fieldName":"i-
     A                                      ndMassReq","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"error message-
     A                                      s":"1 message","error message id":{-
     A                                      "fieldName":"msPExpFrDt","dataLengt-
     A                                      h":"10","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"},"error message file"-
     A                                      :"WMESGG","error message library":"-
     A                                      *LIBL","error condition":{"fieldNam-
     A                                      e":"erPExpFrDt","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error enhanced mode-
     A                                      ":"0"},{"id":"LblHypen","field type-
     A                                      ":"output field","css class":"label-
     A                                      ","description":"Hyphen Lable","val-
     A                                      ue":"-","left":"385px","top":"160px-
     A                                      ","width":"15px","parent field set"-
     A                                      :"FldSetCon1","visibility":{"fieldN-
     A                                      ame":"indMassReq","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"}},{"id":-
     A                                      "LblEmpDiv","field type":"output fi-
     A                                      eld","css class":"label","descripti-
     A                                      on":"Empployer Divsion Label","valu-
     A                                      e":"Employer","left":"755px","top":-
     A                                      "145px","width":"110px","parent fie-
     A                                      ld set":"FldSetCon1","visibility":{-
     A                                      "fieldName":"indSigReq","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"}},-
     A                                      {"id":"ImgEmpDiv","field type":"ima-
     A                                      ge","css class":"image","image sour-
     A                                      ce":"/profoundui/userdata/images/as-
     A                                      terisk_orange_small.png","left":"86-
     A                                      5px","top":"145px","height":"8px","-
     A                                      width":"8px","parent')
     A                                  1  2HTML(' field set":"FldSetCon1","vis-
     A                                      ibility":{"fieldName":"indSigReq","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"}},{"id":"TxbEmployerDivClr"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","value":{"fieldName":"scEm-
     A                                      pDiv","dataLength":"5","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[scEmpDiv]","decPos":"unde-
     A                                      fined","refField":"undefined","keyw-
     A                                      ords":[]},"left":"655px","top":"115-
     A                                      px","width":"315px","parent field s-
     A                                      et":"FldSetCon1","css class 2":"tex-
     A                                      tbox","tab index":"4","required":"f-
     A                                      alse","allow blanks":"true","contai-
     A                                      ns match":"true","visibility":"hidd-
     A                                      en"},{"id":"LblPolType","field type-
     A                                      ":"output field","css class":"label-
     A                                      ","description":"Policy Type Label"-
     A                                      ,"value":"Policy Type","left":"265p-
     A                                      x","top":"185px","width":"70px","pa-
     A                                      rent field set":"FldSetCon1","visib-
     A                                      ility":{"fieldName":"indMassReq","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"}},{"id":"DrpPolicyType","fie-
     A                                      ld type":"select box","css class":"-
     A                                      input","description":"Policy Type D-
     A                                      ropdown","value":{"fieldName":"scPo-
     A                                      lTyp","dataLength":"1","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[scPolTyp]"},"left":"265px-
     A                                      ","top":"200px","width":"140px","pa-
     A                                      rent field set":"FldSetCon1","css c-
     A                                      lass 2":"dropdown","tab index":"6",-
     A                                      "choices":",New and Renewal Busines-
     A                                      s,New Business,Renewal Business","c-
     A                                      hoice values":",B,N,R","visibility"-
     A                                      :{"fieldName":"indMassReq","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"error messages":"1 message","err-
     A                                      or message id":{"fieldName":"msPolT-
     A                                      yp","dataLength":"10","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"},"error-
     A                                       message file":"WMESGG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"erPolTyp","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error e-
     A                                      nhanced mode":"0"},{"id":"LblYear",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"label","description":"Year La-
     A                                      bel","value":"Year","left":"755px",-
     A                                      "top":"225px","width":"245px","pare-
     A                                      nt field set":"FldSetCon1","visibil-
     A                                      ity":{"fieldName":"indSigReq","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"}},{"id":"DrpPolicyYear","field -
     A                                      type":"select box","css class":"inp-
     A                                      ut","description":"Po')
     A                                  1  2HTML('licy Type Dropdown","value":{-
     A                                      "fieldName":"scFYR","refField":"ELF-
     A                                      YR WDELP","numSep":"false","zeroBal-
     A                                      ance":"false","numBlankFill":"false-
     A                                      ","zeroFill":"false","curSym":"","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","negNum":"-999.00","units":-
     A                                      "","designValue":"[scFYR]"},"left":-
     A                                      "755px","top":"240px","width":"250p-
     A                                      x","parent field set":"FldSetCon1",-
     A                                      "css class 2":"dropdown","tab index-
     A                                      ":"9","choice options field":"ELFYR-
     A                                       || '' - '' || SUBSTR(CHAR(19000000-
     A                                      +ELPFDT),5,2) || ''/'' || SUBSTR(CH-
     A                                      AR(19000000+ELPFDT),7,2) || ''/'' |-
     A                                      | SUBSTR(CHAR(19000000+ELPFDT),1,4)-
     A                                       || '' '' || LOWER(''TO'') || '' ''-
     A                                        || SUBSTR(CHAR(19000000+ELPTDT),5-
     A                                      ,2) || ''/'' || SUBSTR(CHAR(1900000-
     A                                      0+ELPTDT),7,2) || ''/'' || SUBSTR(C-
     A                                      HAR(19000000+ELPTDT),1,4)","choice -
     A                                      values field":"ELFYR","order by":"E-
     A                                      LFYR DESC","visibility":{"fieldName-
     A                                      ":"indSigReq","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"choices da-
     A                                      tabase file":"WDELP","error message-
     A                                      s":"1 message","error message id":{-
     A                                      "fieldName":"msFyr","dataLength":"1-
     A                                      0","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"},"error message file":"WME-
     A                                      SGG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"e-
     A                                      rFyr","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error enhanced mode":"0","bla-
     A                                      nk option":"true","disabled":{"fiel-
     A                                      dName":"Indpolyear","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"}},{"id":"Btn-
     A                                      EmpSearch","field type":"button","c-
     A                                      ss class":"button","description":"E-
     A                                      mpployer Divsion Button","left":"10-
     A                                      05px","top":"160px","width":"23px",-
     A                                      "parent field set":"FldSetCon1","cu-
     A                                      rsor":"default","background image":-
     A                                      "url(/profoundui/userdata/images/sy-
     A                                      stool/search.png)","response":{"fie-
     A                                      ldName":"selEmpSrch","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"tab index":"5"-
     A                                      ,"visibility":{"fieldName":"indSigR-
     A                                      eq","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"disabled":{"fieldNam-
     A                                      e":"isMultGrps","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"}},{"id":"HdgSelC-
     A                                      rt","field type":"output field","cs-
     A                                      s class":"heading","description":"S-
     A                                      election Criteria Label","value":"S-
     A                                      election Criteria","left":"265px","-
     A                                      top":{"fieldName":"scLSelCrtT","dat-
     A                                      aLength":"5","decPos":"0","numSep":-
     A                                      "false","zeroBalance":"false","numB-
     A                                      lankFill":"false","zeroFill":"false-
     A                                      ","curSym":"","dataTy')
     A                                  1  2HTML('pe":"zoned","formatting":"Num-
     A                                      ber","negNum":"-999.00","units":"px-
     A                                      ","designValue":"325px"},"width":"1-
     A                                      35px","parent field set":"FldSetCon-
     A                                      2","heading type":"Section Header"}-
     A                                      ,{"id":"LblAudReq","field type":"ou-
     A                                      tput field","css class":"label","de-
     A                                      scription":"Audit Request Label","v-
     A                                      alue":"Audit Request to Process","l-
     A                                      eft":"265px","top":{"fieldName":"sc-
     A                                      LAudReqT","dataLength":"5","decPos"-
     A                                      :"0","numSep":"false","zeroBalance"-
     A                                      :"false","numBlankFill":"false","ze-
     A                                      roFill":"false","curSym":"","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      negNum":"-999.00","units":"px","des-
     A                                      ignValue":"355px"},"width":"150px",-
     A                                      "parent field set":"FldSetCon2","vi-
     A                                      sibility":{"fieldName":"isSnglEmp",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"hidden / vi-
     A                                      sible"}},{"id":"DrpAuditRequestProc-
     A                                      ","field type":"select box","css cl-
     A                                      ass":"input","description":"Audit R-
     A                                      equest Process Dropdown","value":{"-
     A                                      fieldName":"scAudRProc","dataLength-
     A                                      ":"1","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[scAudRP-
     A                                      roc]"},"choices":"Generate only req-
     A                                      uests not previously run, Regenerat-
     A                                      e previously run requests,Generate -
     A                                      all requests meeting criteria","cho-
     A                                      ice values":"N,R,A","left":"265px",-
     A                                      "top":{"fieldName":"scDAudRPrT","da-
     A                                      taLength":"5","decPos":"0","numSep"-
     A                                      :"false","zeroBalance":"false","num-
     A                                      BlankFill":"false","zeroFill":"fals-
     A                                      e","curSym":"","dataType":"zoned","-
     A                                      formatting":"Number","negNum":"-999-
     A                                      .00","units":"px","designValue":"37-
     A                                      0px"},"width":"240px","parent field-
     A                                       set":"FldSetCon2","css class 2":"d-
     A                                      ropdown","tab index":"10","onchange-
     A                                      ":"var UpdAudFlg = get(''CbxUpdAudi-
     A                                      tTrack'');\nvar AudRFlg   =  get(''-
     A                                      DrpAuditRequestProc'');\nif ((UpdAu-
     A                                      dFlg !== \"Y\" && UpdAudFlg !== \"o-
     A                                      n\") || AudRFlg == \"N\" ) { \n  ap-
     A                                      plyProperty(\"CbxUpdPrevAuditReq\",-
     A                                      \"disabled\",\"true\"); \n  changeE-
     A                                      lementValue(''CbxUpdPrevAuditReq'',-
     A                                       \"N\");\n}   \nif ((UpdAudFlg==\"Y-
     A                                      \"  || UpdAudFlg ==\"on\") &&  AudR-
     A                                      Flg !== \"N\") {\n  applyProperty(\-
     A                                      "CbxUpdPrevAuditReq\",\"disabled\",-
     A                                      \"false\");\n}\n","blank option":"f-
     A                                      alse","visibility":{"fieldName":"is-
     A                                      SnglEmp","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"hi-
     A                                      dden / visible"}},{"id":"ImgAudReq"-
     A                                      ,"field type":"image","css class":"-
     A                                      image","image source":"/profoundui/-
     A                                      userdata/images/asterisk_orange_sma-
     A                                      ll.png","left":"420px","top":{"fiel-
     A                                      dName":"scIAudReqT","dataLength":"5-
     A                                      ","decPos":"0","numSep":"false","ze-
     A                                      roBalance":"false","n')
     A                                  1  2HTML('umBlankFill":"false","zeroFil-
     A                                      l":"false","curSym":"","dataType":"-
     A                                      zoned","formatting":"Number","negNu-
     A                                      m":"-999.00","units":"px","designVa-
     A                                      lue":"355px"},"height":"8px","width-
     A                                      ":"8px","parent field set":"FldSetC-
     A                                      on2"},{"id":"ImgPolExp","field type-
     A                                      ":"image","css class":"image","imag-
     A                                      e source":"/profoundui/userdata/ima-
     A                                      ges/asterisk_orange_small.png","lef-
     A                                      t":"440px","top":"145px","height":"-
     A                                      8px","width":"8px","parent field se-
     A                                      t":"FldSetCon1","visibility":{"fiel-
     A                                      dName":"indMassReq","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"}},{"id-
     A                                      ":"ImgPolTyp","field type":"image",-
     A                                      "css class":"image","image source":-
     A                                      "/profoundui/userdata/images/asteri-
     A                                      sk_orange_small.png","left":"340px"-
     A                                      ,"top":"185px","height":"8px","widt-
     A                                      h":"8px","parent field set":"FldSet-
     A                                      Con1","visibility":{"fieldName":"in-
     A                                      dMassReq","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"}},{"id":"LblDrtR-
     A                                      mk","field type":"output field","cs-
     A                                      s class":"label","description":"Dar-
     A                                      ts Remark  Label","value":"DARTS Re-
     A                                      mark","left":"750px","top":{"fieldN-
     A                                      ame":"scLDrtRmkT","dataLength":"5",-
     A                                      "decPos":"0","numSep":"false","zero-
     A                                      Balance":"false","numBlankFill":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"dataType":"zoned","formatting":"N-
     A                                      umber","negNum":"-999.00","units":"-
     A                                      px","designValue":"355px"},"width":-
     A                                      "110px","parent field set":"FldSetC-
     A                                      on2","visibility":{"fieldName":"isN-
     A                                      otScrpt","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"}},{"id":"TxbDartsRe-
     A                                      mark","field type":"textbox","css c-
     A                                      lass":"input","value":{"fieldName":-
     A                                      "scDrtRmk","dataLength":"80","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none",-
     A                                      "designValue":"[scDrtRmk]"},"set fo-
     A                                      cus":{"fieldName":"fcDrtRmk","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "left":"750px","top":{"fieldName":"-
     A                                      scTDrtRmkT","dataLength":"5","decPo-
     A                                      s":"0","numSep":"false","zeroBalanc-
     A                                      e":"false","numBlankFill":"false","-
     A                                      zeroFill":"false","curSym":"","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"negNum":"-999.00","units":"px","d-
     A                                      esignValue":"365px"},"width":"240px-
     A                                      ","parent field set":"FldSetCon2","-
     A                                      css class 2":"textbox","tab index":-
     A                                      "11","error message id":{"fieldName-
     A                                      ":"msDrtRmk","dataLength":"10","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "},"error message file":"WMESGG","e-
     A                                      rror message library"')
     A                                  1  2HTML(':"*LIBL","error condition":{"-
     A                                      fieldName":"erDrtRmk","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error enhance-
     A                                      d mode":"0","error messages":"1 mes-
     A                                      sage","visibility":{"fieldName":"is-
     A                                      NotScrpt","customTrue":"","customFa-
     A                                      lse":"","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"}},{"id":"CbxUpdAud-
     A                                      itTrack","field type":"checkbox","c-
     A                                      ss class":"input","value":{"fieldNa-
     A                                      me":"scUpdAudT","refField":"FLAG","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"reference-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[scUpdAudT-
     A                                      ]"},"left":"265px","top":{"fieldNam-
     A                                      e":"scCUpdAuT","dataLength":"5","de-
     A                                      cPos":"0","numSep":"false","zeroBal-
     A                                      ance":"false","numBlankFill":"false-
     A                                      ","zeroFill":"false","curSym":"","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","negNum":"-999.00","units":"px"-
     A                                      ,"designValue":"410px"},"label":"Up-
     A                                      date Audit Tracking","parent field -
     A                                      set":"FldSetCon2","checked value":"-
     A                                      Y","css class 2":"checkbox","descri-
     A                                      ption":"Update Audit Tracking","tab-
     A                                       index":"15","disabled":{"fieldName-
     A                                      ":"indUpdAudT","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"onchange":"va-
     A                                      r UpdAudFlg = get(''CbxUpdAuditTrac-
     A                                      k'');\nvar AudRFlg   =  get(''DrpAu-
     A                                      ditRequestProc'');\nif ((UpdAudFlg -
     A                                      !== \"Y\"  && UpdAudFlg !== \"on\")-
     A                                      || AudRFlg == \"N\" ) {\n\tapplyPro-
     A                                      perty(\"CbxUpdPrevAuditReq\",\"disa-
     A                                      bled\",\"true\");\n\tchangeElementV-
     A                                      alue(''CbxUpdPrevAuditReq'', \"N\")-
     A                                      ; \n}   \nif ((UpdAudFlg==\"Y\"  ||-
     A                                       UpdAudFlg == \"on\")&&  AudRFlg !=-
     A                                      = \"N\") {\n\tapplyProperty(\"CbxUp-
     A                                      dPrevAuditReq\",\"disabled\",\"fals-
     A                                      e\"); \n}\n\nif (UpdAudFlg==\"Y\"  -
     A                                      || UpdAudFlg == \"on\") {\n\tapplyP-
     A                                      roperty(\"CbxDoNotGenerateOutput\",-
     A                                      \"disabled\",\"false\");\n}\nelse {-
     A                                      \n  applyProperty(\"CbxDoNotGenerat-
     A                                      eOutput\",\"disabled\",\"true\");\n-
     A                                      \tchangeElementValue(''CbxDoNotGene-
     A                                      rateOutput'', \"N\");\t \n}\n","unc-
     A                                      hecked value":"N"},{"id":"CbxUpdPre-
     A                                      vAuditReq","field type":"checkbox",-
     A                                      "css class":"input","description":"-
     A                                      Update Audit Tracking Regenerated",-
     A                                      "value":{"fieldName":"scUpdAudTR","-
     A                                      refField":"FLAG","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[scUpdAudTR]"},"checked val-
     A                                      ue":"Y","label":"Update Audit Track-
     A                                      ing for Regenerated Previously Run -
     A                                      Audit Requests ","left":"285px","to-
     A                                      p":{"fieldName":"scCUpdAuRT","dataL-
     A                                      ength":"5","decPos":"0","numSep":"f-
     A                                      alse","zeroBalance":"false","numBla-
     A                                      nkFill":"false","zero')
     A                                  1  2HTML('Fill":"false","curSym":"","da-
     A                                      taType":"zoned","formatting":"Numbe-
     A                                      r","negNum":"-999.00","units":"px",-
     A                                      "designValue":"435px"},"parent fiel-
     A                                      d set":"FldSetCon2","css class 2":"-
     A                                      checkbox","tab index":"17","disable-
     A                                      d":{"fieldName":"indUpdAuTR","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "unchecked value":"N"},{"id":"CbxSe-
     A                                      lfRptPayroll","field type":"checkbo-
     A                                      x","css class":"input","description-
     A                                      ":"Use Self Reporting Payroll Amoun-
     A                                      t in Place of Estimated Payrolls","-
     A                                      value":{"fieldName":"scSlfRptPy","r-
     A                                      efField":"FLAG","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[scSlfRptPy]"},"checked valu-
     A                                      e":"Y","label":"Use Self Reporting -
     A                                      Payroll Amount in Place of Estimate-
     A                                      d Payrolls","left":"750px","top":{"-
     A                                      fieldName":"scCsRpayT","dataLength"-
     A                                      :"5","decPos":"0","numSep":"false",-
     A                                      "zeroBalance":"false","numBlankFill-
     A                                      ":"false","zeroFill":"false","noExt-
     A                                      raSpaces":"false","curSym":"","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"negNum":"-999.00","units":"px","d-
     A                                      esignValue":"395px"},"parent field -
     A                                      set":"FldSetCon2","css class 2":"ch-
     A                                      eckbox","tab index":"14","disabled"-
     A                                      :{"fieldName":"indSlfRpt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"un-
     A                                      checked value":"N"},{"id":"CbxPrint-
     A                                      SelfRptPayroll","field type":"check-
     A                                      box","css class":"input","descripti-
     A                                      on":"Print Self Reported Payrolls b-
     A                                      y Class Code and Reporting Period "-
     A                                      ,"value":{"fieldName":"scPSlfRptP",-
     A                                      "refField":"FLAG","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[scPSlfRptP]"},"checked va-
     A                                      lue":"Y","label":"Print Self Report-
     A                                      ed Payrolls by Class Code and Repor-
     A                                      ting Period","left":"750px","top":{-
     A                                      "fieldName":"scCPrtsRpT","dataLengt-
     A                                      h":"5","decPos":"0","numSep":"false-
     A                                      ","zeroBalance":"false","numBlankFi-
     A                                      ll":"false","zeroFill":"false","noE-
     A                                      xtraSpaces":"false","curSym":"","da-
     A                                      taType":"zoned","formatting":"Numbe-
     A                                      r","negNum":"-999.00","units":"px",-
     A                                      "designValue":"415px"},"parent fiel-
     A                                      d set":"FldSetCon2","css class 2":"-
     A                                      checkbox","tab index":"16","disable-
     A                                      d":{"fieldName":"indPSlfRpt","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "unchecked value":"N"},{"id":"LblCo-
     A                                      mCodes","field type":"output field"-
     A                                      ,"css class":"label","description":-
     A                                      "Comment  Codes Label","value":"Com-
     A                                      ment  Codes","left":"265px","top":{-
     A                                      "fieldName":"scLComCdT","dataLength-
     A                                      ":"5","decPos":"0","n')
     A                                  1  2HTML('umSep":"false","zeroBalance":-
     A                                      "false","numBlankFill":"false","zer-
     A                                      oFill":"false","curSym":"","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      egNum":"-999.00","units":"px","desi-
     A                                      gnValue":"480px"},"width":"235px","-
     A                                      parent field set":"FldSetCon2"},{"i-
     A                                      d":"DrpCommentCode1","field type":"-
     A                                      select box","css class":"input","de-
     A                                      scription":"Comment Codes 1 Dropdow-
     A                                      n","value":{"fieldName":"scComCd1",-
     A                                      "dataLength":"43","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"uppercase","desig-
     A                                      nValue":"[scComCd1]"},"left":"265px-
     A                                      ","top":{"fieldName":"scDComCd1T","-
     A                                      dataLength":"5","decPos":"0","numSe-
     A                                      p":"false","zeroBalance":"false","n-
     A                                      umBlankFill":"false","zeroFill":"fa-
     A                                      lse","curSym":"","dataType":"zoned"-
     A                                      ,"formatting":"Number","negNum":"-9-
     A                                      99.00","units":"px","designValue":"-
     A                                      495px"},"width":"235px","parent fie-
     A                                      ld set":"FldSetCon2","css class 2":-
     A                                      "dropdown","tab index":"22","choice-
     A                                      s database file":"WTBCP","choice op-
     A                                      tions field":"BCKEY || '' - '' || B-
     A                                      CDESC","choice values field":"BCKEY-
     A                                       || '' - '' || BCDESC","choices sel-
     A                                      ection criteria":"BCSTAT <> ''I''",-
     A                                      "blank option":"true","order by":"B-
     A                                      CKEY"},{"id":"DrpCommentCode2","fie-
     A                                      ld type":"select box","css class":"-
     A                                      input","description":"Comment Codes-
     A                                       2 Dropdown","value":{"fieldName":"-
     A                                      scComCd2","dataLength":"43","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"upperca-
     A                                      se","designValue":"[scComCd2]"},"ch-
     A                                      oices database file":"WTBCP","choic-
     A                                      e options field":"BCKEY || '' - '' -
     A                                      || BCDESC","choice values field":"B-
     A                                      CKEY || '' - '' || BCDESC","left":"-
     A                                      265px","top":{"fieldName":"scDComCd-
     A                                      2T","dataLength":"5","decPos":"0","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","numBlankFill":"false","zeroFill-
     A                                      ":"false","curSym":"","dataType":"z-
     A                                      oned","formatting":"Number","negNum-
     A                                      ":"-999.00","units":"px","designVal-
     A                                      ue":"515px"},"width":"235px","paren-
     A                                      t field set":"FldSetCon2","css clas-
     A                                      s 2":"dropdown","tab index":"23","c-
     A                                      hoices selection criteria":"BCSTAT -
     A                                      <> ''I''","blank option":"true","or-
     A                                      der by":"BCKEY"},{"id":"DrpCommentC-
     A                                      ode3","field type":"select box","cs-
     A                                      s class":"input","description":"Com-
     A                                      ment Codes 3 Dropdown","value":{"fi-
     A                                      eldName":"scComCd3","dataLength":"4-
     A                                      3","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"uppercase","designValue":"[scCom-
     A                                      Cd3]"},"choices database file":"WTB-
     A                                      CP","choice options field":"BCKEY |-
     A                                      | '' - '' || BCDESC",')
     A                                  1  2HTML('"choice values field":"BCKEY -
     A                                      || '' - '' || BCDESC ","left":"265p-
     A                                      x","top":{"fieldName":"scDComCd3T",-
     A                                      "dataLength":"5","decPos":"0","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      numBlankFill":"false","zeroFill":"f-
     A                                      alse","curSym":"","dataType":"zoned-
     A                                      ","formatting":"Number","negNum":"--
     A                                      999.00","units":"px","designValue":-
     A                                      "535px"},"width":"235px","parent fi-
     A                                      eld set":"FldSetCon2","css class 2"-
     A                                      :"dropdown","tab index":"24","choic-
     A                                      es selection criteria":"BCSTAT <> '-
     A                                      'I''","blank option":"true","order -
     A                                      by":"BCKEY"},{"id":"DrpCommentCode4-
     A                                      ","field type":"select box","css cl-
     A                                      ass":"input","description":"Comment-
     A                                       Codes 4 Dropdown","value":{"fieldN-
     A                                      ame":"scComCd4","dataLength":"43","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"u-
     A                                      ppercase","designValue":"[scComCd4]-
     A                                      "},"choices database file":"WTBCP",-
     A                                      "choice options field":"BCKEY || ''-
     A                                       - '' || BCDESC","choice values fie-
     A                                      ld":"BCKEY || '' - '' || BCDESC","l-
     A                                      eft":"265px","top":{"fieldName":"sc-
     A                                      DComCd4T","dataLength":"5","decPos"-
     A                                      :"0","numSep":"false","zeroBalance"-
     A                                      :"false","numBlankFill":"false","ze-
     A                                      roFill":"false","curSym":"","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      negNum":"-999.00","units":"px","des-
     A                                      ignValue":"555px"},"width":"235px",-
     A                                      "parent field set":"FldSetCon2","cs-
     A                                      s class 2":"dropdown","tab index":"-
     A                                      25","choices selection criteria":"B-
     A                                      CSTAT <> ''I''","blank option":"tru-
     A                                      e","order by":"BCKEY"},{"id":"DrpCo-
     A                                      mmentCode5","field type":"select bo-
     A                                      x","css class":"input","description-
     A                                      ":"Comment Codes 5 Dropdown","value-
     A                                      ":{"fieldName":"scComCd5","dataLeng-
     A                                      th":"43","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"uppercase","designValue":"-
     A                                      [scComCd5]"},"choices database file-
     A                                      ":"WTBCP","choice options field":"B-
     A                                      CKEY || '' - '' || BCDESC","choice -
     A                                      values field":"BCKEY || '' - '' || -
     A                                      BCDESC","left":"265px","top":{"fiel-
     A                                      dName":"scDComCd5T","dataLength":"5-
     A                                      ","decPos":"0","numSep":"false","ze-
     A                                      roBalance":"false","numBlankFill":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","dataType":"zoned","formatting":-
     A                                      "Number","negNum":"-999.00","units"-
     A                                      :"px","designValue":"575px"},"width-
     A                                      ":"235px","parent field set":"FldSe-
     A                                      tCon2","css class 2":"dropdown","ta-
     A                                      b index":"26","choices selection cr-
     A                                      iteria":"BCSTAT <> ''I''","blank op-
     A                                      tion":"true","order by":"BCKEY"},{"-
     A                                      id":"BtnCancel","field type":"butto-
     A                                      n","css class":"button","cursor":"d-
     A                                      efault","description":"cancel","res-
     A                                      ponse":{"fieldName":"BtnCancel","da-
     A                                      taType":"indicator","')
     A                                  1  2HTML('formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"left":"1005px","to-
     A                                      p":{"fieldName":"scBCancelT","dataL-
     A                                      ength":"5","decPos":"0","numSep":"f-
     A                                      alse","zeroBalance":"false","numBla-
     A                                      nkFill":"false","zeroFill":"false",-
     A                                      "curSym":"","dataType":"zoned","for-
     A                                      matting":"Number","negNum":"-999.00-
     A                                      ","units":"px","designValue":"605px-
     A                                      "},"width":"90px","parent field set-
     A                                      ":"FldSetCon2","value":"Cancel","ta-
     A                                      b index":"27","shortcut key":"Escap-
     A                                      e"},{"id":"BtnSubmit","field type":-
     A                                      "button","css class":"button","curs-
     A                                      or":"default","description":"Submit-
     A                                      ","value":"Submit","response":{"fie-
     A                                      ldName":"BtnSubmit","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"left":"1105px",-
     A                                      "top":{"fieldName":"scBSubmitT","da-
     A                                      taLength":"5","decPos":"0","numSep"-
     A                                      :"false","zeroBalance":"false","num-
     A                                      BlankFill":"false","zeroFill":"fals-
     A                                      e","curSym":"","dataType":"zoned","-
     A                                      formatting":"Number","negNum":"-999-
     A                                      .00","units":"px","designValue":"60-
     A                                      5px"},"width":"90px","parent field -
     A                                      set":"FldSetCon2","tab index":"28",-
     A                                      "shortcut key":"Enter"},{"id":"BtnD-
     A                                      rtRmk","field type":"button","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      description":"Darts Remark Button",-
     A                                      "response":{"fieldName":"selDrtRmk"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "background image":"url(/profoundui-
     A                                      /userdata/images/systool/search.png-
     A                                      )","left":"995px","top":{"fieldName-
     A                                      ":"scBDrtRmkT","dataLength":"5","de-
     A                                      cPos":"0","numSep":"false","zeroBal-
     A                                      ance":"false","numBlankFill":"false-
     A                                      ","zeroFill":"false","curSym":"","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","negNum":"-999.00","units":"px"-
     A                                      ,"designValue":"370px"},"width":"23-
     A                                      px","parent field set":"FldSetCon2"-
     A                                      ,"tab index":"12","visibility":{"fi-
     A                                      eldName":"isNotScrpt","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"}},{"id-
     A                                      ":"TxbCo#","field type":"textbox","-
     A                                      css class":"input","value":{"fieldN-
     A                                      ame":"sccompany#","dataLength":"3",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[sccompany#]"}-
     A                                      ,"required":"false","allow blanks":-
     A                                      "true","contains match":"true","lef-
     A                                      t":"665px","top":"135px","width":"2-
     A                                      05px","parent field set":"FldSetCon-
     A                                      1","css class 2":"textbox","tab ind-
     A                                      ex":"4","visibility":"hidden"},{"id-
     A                                      ":"imgDarts","field type":"image","-
     A                                      css class":"image","left":"845px","-
     A                                      top":{"fieldName":"scLDrtRmkT","dat-
     A                                      aLength":"5","decPos":"0","numSep":-
     A                                      "false","zeroBalance":"false","numB-
     A                                      lankFill":"false","zeroFill":"false-
     A                                      ","curSym":"","dataTy')
     A                                  1  2HTML('pe":"zoned","formatting":"Num-
     A                                      ber","negNum":"-999.00","units":"px-
     A                                      ","designValue":"355px"},"height":"-
     A                                      8px","width":"8px","image source":"-
     A                                      /profoundui/userdata/images/asteris-
     A                                      k_orange_small.png","css class 2":"-
     A                                      required-icon","parent field set":"-
     A                                      FldSetCon2","visibility":{"fieldNam-
     A                                      e":"isNotScrpt","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"}},{"id":"Txb-
     A                                      Employer","field type":"textbox","c-
     A                                      ss class":"textbox","value":{"field-
     A                                      Name":"scEmp#","dataLength":"9","de-
     A                                      cPos":"0","numSep":"false","zeroBal-
     A                                      ance":"false","numBlankFill":"false-
     A                                      ","zeroFill":"false","noExtraSpaces-
     A                                      ":"false","curSym":"","dataType":"z-
     A                                      oned","formatting":"Number","negNum-
     A                                      ":"-999.00","units":"","designValue-
     A                                      ":"[scEmp#]"},"left":"755px","top":-
     A                                      "160px","required":"false","set foc-
     A                                      us":{"fieldName":"fcEmpDivNm","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"allow blanks":"true","error messa-
     A                                      ges":"2 messages","error message id-
     A                                      ":{"fieldName":"msMutualEx","dataLe-
     A                                      ngth":"10","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"},"error message fi-
     A                                      le":"WMESGG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"erMutualEx","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error enhanced m-
     A                                      ode":"1","error message id 2":{"fie-
     A                                      ldName":"msEmpDivNm","dataLength":"-
     A                                      10","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"},"error message file 2":"-
     A                                      WMESGG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"erEmpDivNm","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error enhanced mo-
     A                                      de 2":"1","choices database file":"-
     A                                      WMEMP","contains match":"true","vis-
     A                                      ibility":{"fieldName":"indSigReq","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"width":"245px","tab index-
     A                                      ":"4","onchange":"applyProperty(\"D-
     A                                      rpPolicyYear\",\"disabled\",\"true\-
     A                                      ");         changeElementValue(\"Dr-
     A                                      pPolicyYear\", \" \");\ndivisionSel-
     A                                      ections();\nfundYearSelections();\n-
     A                                      singleEmployerSettings();\n","tool -
     A                                      tip":{"fieldName":"strTipEmp","data-
     A                                      Length":"100","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none","designValue":"-
     A                                      [strTipEmp]"},"disabled":{"fieldNam-
     A                                      e":"isMultGrps","customTrue":"","cu-
     A                                      stomFalse":"","dataTy')
     A                                  1  2HTML('pe":"indicator","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"choices selection criteria":{-
     A                                      "fieldName":"empChoices","dataLengt-
     A                                      h":"200","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none"},"choice options fie-
     A                                      ld":"EMEMP# || ''-'' || EMNAME","ch-
     A                                      oice values field":"EMEMP#","user d-
     A                                      efined data":{"fieldName":"empChoic-
     A                                      es","dataLength":"200","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"},"pare-
     A                                      nt field set":"FldSetCon1","onkeyup-
     A                                      ":"singleEmployerSettings();","onke-
     A                                      ypress":"singleEmployerSettings();"-
     A                                      },{"id":"LblRegion","field type":"o-
     A                                      utput field","css class":"label","d-
     A                                      escription":"Region Label","value":-
     A                                      "Region","left":"265px","top":"225p-
     A                                      x","width":"70px","parent field set-
     A                                      ":"FldSetCon1","visibility":{"field-
     A                                      Name":"indMassReq","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"}},{"id"-
     A                                      :"DrpRegion","field type":"select b-
     A                                      ox","css class":"input","descriptio-
     A                                      n":"Region Dropdown","value":{"fiel-
     A                                      dName":"scRegion","refField":"RGN#"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"referen-
     A                                      ce","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[scRegio-
     A                                      n]"},"error messages":"1 message","-
     A                                      blank option":"true","left":"265px"-
     A                                      ,"top":"240px","width":"140px","par-
     A                                      ent field set":"FldSetCon1","css cl-
     A                                      ass 2":"dropdown","tab index":"8","-
     A                                      visibility":{"fieldName":"indMassRe-
     A                                      q","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"choices database file-
     A                                      ":"WMREP","choice options field":"R-
     A                                      EDESC","choice values field":"RERGN-
     A                                      #","blank option label":"*ALL","ord-
     A                                      er by":"REDESC","error message id":-
     A                                      {"fieldName":"msRegion","dataLength-
     A                                      ":"10","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"},"error message file":-
     A                                      "WMESGG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"erRegion","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error enhanced mode":"0"-
     A                                      },{"id":"CbxDoNotGenerateOutput","f-
     A                                      ield type":"checkbox","css class":"-
     A                                      input","description":"Update Audit -
     A                                      Tracking Regenerated","value":{"fie-
     A                                      ldName":"scNoOutput","refField":"FL-
     A                                      AG","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"refe-
     A                                      rence","formatting":"')
     A                                  1  2HTML('Text","textTransform":"none",-
     A                                      "designValue":"[scNoOutput]"},"chec-
     A                                      ked value":"Y","unchecked value":"N-
     A                                      ","disabled":{"fieldName":"indNotOu-
     A                                      tp","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"label":"Do not Generate Ou-
     A                                      tput","left":"285px","top":{"fieldN-
     A                                      ame":"scCNoOutpT","dataLength":"5",-
     A                                      "decPos":"0","numSep":"false","zero-
     A                                      Balance":"false","numBlankFill":"fa-
     A                                      lse","zeroFill":"false","noExtraSpa-
     A                                      ces":"false","curSym":"","dataType"-
     A                                      :"zoned","formatting":"Number","neg-
     A                                      Num":"-999.00","units":"px","design-
     A                                      Value":"450px"},"parent field set":-
     A                                      "FldSetCon2","css class 2":"checkbo-
     A                                      x","tab index":"19","onchange":"var-
     A                                       visDrtRmk = ''False''\nvar noOutpu-
     A                                      t = get(\"CbxDoNotGenerateOutput\")-
     A                                      ;\nvar con2Top = getObj(\"FldSetCon-
     A                                      2\").pui.properties[\"top\"];\nvar -
     A                                      drtLblTop = parseInt(con2Top) + 15 -
     A                                      + \"px\";\nvar drtTxbTop = parseInt-
     A                                      (con2Top) + 30 + \"px\";\nif (noOut-
     A                                      put == \"Y\"){\n  visDrtRmk = \"vis-
     A                                      ible\";\n  applyProperty(\"LblDrtRm-
     A                                      k\", \"top\", drtLblTop);\n  applyP-
     A                                      roperty(\"TxbDartsRemark\", \"top\"-
     A                                      , drtTxbTop);\n} else{\n  visDrtRmk-
     A                                       = \"hidden\";\n}\napplyProperty(\"-
     A                                      LblDrtRmk\", \"visibility\", visDrt-
     A                                      Rmk);\napplyProperty(\"TxbDartsRema-
     A                                      rk\", \"visibility\", visDrtRmk);\n-
     A                                      TxbDartsRemark"},{"id":"CbxNonMass"-
     A                                      ,"field type":"checkbox","css class-
     A                                      ":"input","description":"Non-Mass G-
     A                                      enerate all divisions (Called from -
     A                                      Policy Toolbar)","value":{"fieldNam-
     A                                      e":"scGenAllDv","refField":"FLAG","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"reference-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[scGenAllD-
     A                                      v]"},"checked value":"Y","unchecked-
     A                                       value":"N","label":"Generate for A-
     A                                      ll Divisions","left":"265px","top":-
     A                                      {"fieldName":"scCGenDivT","dataLeng-
     A                                      th":"5","decPos":"0","numSep":"fals-
     A                                      e","zeroBalance":"false","numBlankF-
     A                                      ill":"false","zeroFill":"false","no-
     A                                      ExtraSpaces":"false","curSym":"","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","negNum":"-999.00","units":"px"-
     A                                      ,"designValue":"390px"},"css class -
     A                                      2":"checkbox","tab index":"13","vis-
     A                                      ibility":{"fieldName":"indNonMass",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"}},{"id":"CbxGenerateWC000301-
     A                                      Endorsement","field type":"checkbox-
     A                                      ","css class":"input","description"-
     A                                      :"Generate WC 00 03 01 Endorsement -
     A                                      Forms","value":{"fieldName":"scGen3-
     A                                      01En","refField":"FLAG","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"reference","formatt-
     A                                      ing":"Text","textTran')
     A                                  1  2HTML('sform":"none","designValue":"-
     A                                      [scGen301En]"},"checked value":"Y",-
     A                                      "unchecked value":"N","label":"Gene-
     A                                      rate WC000301 Endorsement","left":"-
     A                                      750px","top":{"fieldName":"scCGen30-
     A                                      1T","dataLength":"5","decPos":"0","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","numBlankFill":"false","zeroFill-
     A                                      ":"false","noExtraSpaces":"false","-
     A                                      curSym":"","dataType":"zoned","form-
     A                                      atting":"Number","negNum":"-999.00"-
     A                                      ,"units":"px","designValue":"435px"-
     A                                      },"parent field set":"FldSetCon2","-
     A                                      css class 2":"checkbox","tab index"-
     A                                      :"18"},{"id":"CbxGenerateWC000311En-
     A                                      dorsement","field type":"checkbox",-
     A                                      "css class":"input","description":"-
     A                                      Generate WC 00 03 11 Endorsement Fo-
     A                                      rms","value":{"fieldName":"scGen311-
     A                                      En","refField":"FLAG","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","textTransform":"none","d-
     A                                      esignValue":"[scGen311En]"},"checke-
     A                                      d value":"Y","unchecked value":"N",-
     A                                      "label":"Generate WC000311 Endorsem-
     A                                      ent","left":"750px","top":{"fieldNa-
     A                                      me":"scCGen311T","dataLength":"5","-
     A                                      decPos":"0","numSep":"false","zeroB-
     A                                      alance":"false","numBlankFill":"fal-
     A                                      se","zeroFill":"false","noExtraSpac-
     A                                      es":"false","curSym":"","dataType":-
     A                                      "zoned","formatting":"Number","negN-
     A                                      um":"-999.00","units":"px","designV-
     A                                      alue":"455px"},"parent field set":"-
     A                                      FldSetCon2","css class 2":"checkbox-
     A                                      ","tab index":"20"},{"id":"CbxListC-
     A                                      laims","field type":"checkbox","css-
     A                                       class":"input","description":"List-
     A                                       Claims","value":{"fieldName":"scLi-
     A                                      stClms","refField":"FLAG","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"reference","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[scListClms]"},"ch-
     A                                      ecked value":"Y","unchecked value":-
     A                                      "N","label":"List Claims on Audit R-
     A                                      equest","left":"750px","top":{"fiel-
     A                                      dName":"scCclmAudT","dataLength":"5-
     A                                      ","decPos":"0","numSep":"false","ze-
     A                                      roBalance":"false","numBlankFill":"-
     A                                      false","zeroFill":"false","noExtraS-
     A                                      paces":"false","curSym":"","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      egNum":"-999.00","units":"px","desi-
     A                                      gnValue":"485px"},"parent field set-
     A                                      ":"FldSetCon2","css class 2":"check-
     A                                      box","tab index":"21"},{"id":"LblDi-
     A                                      vision","field type":"output field"-
     A                                      ,"css class":"label","description":-
     A                                      "Division Label","value":"Division"-
     A                                      ,"left":"755px","top":"185px","widt-
     A                                      h":"245px","parent field set":"FldS-
     A                                      etCon1","visibility":{"fieldName":"-
     A                                      indSigReq","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"}},{"id":"DrpPol-
     A                                      icyDivision","field type":"select b-
     A                                      ox","css class":"input","descriptio-
     A                                      n":"Policy Division D')
     A                                  1  2HTML('ropdown","value":{"fieldName"-
     A                                      :"scDivChr","dataLength":"5","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"true","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[scDivChr]"},"error m-
     A                                      essages":"1 message","choices datab-
     A                                      ase file":"WMEMP","choice options f-
     A                                      ield":"DIGITS(EMDIV) || (CASE EMSTR-
     A                                      P WHEN ''Y'' THEN ''*'' ELSE '' '' -
     A                                      END) ||     (CASE (SELECT ELRTCD FR-
     A                                      OM WDELP WHERE ELCO# = WMEMP.EMCO# -
     A                                      AND ELFND  = WMEMP.EMFND AND ELEMP#-
     A                                       = WMEMP.EMEMP# AND ELDIV = WMEMP.E-
     A                                      MDIV AND  ELFYR = (SELECT MAX(ELFYR-
     A                                      ) FROM WDELP WHERE ELCO# = WMEMP.EM-
     A                                      CO# AND  ELFND = WMEMP.EMFND AND EL-
     A                                      EMP# = WMEMP.EMEMP# AND ELDIV =    -
     A                                              WMEMP.EMDIV)) WHEN '' '' TH-
     A                                      EN ''-''  ELSE '' ('' || (SELECT RS-
     A                                      JRST FROM    WMRSP WHERE RSCO# = WM-
     A                                      EMP.EMCO# AND RSRTCD = (SELECT ELRT-
     A                                      CD FROM     WDELP WHERE ELCO# = WME-
     A                                      MP.EMCO# AND ELFND = WMEMP.EMFND AN-
     A                                      D ELEMP# = WMEMP.EMEMP# AND ELDIV =-
     A                                       WMEMP.EMDIV AND ELFYR = (SELECT MA-
     A                                      X(ELFYR)  FROM WDELP WHERE ELCO# = -
     A                                      WMEMP.EMCO# AND ELFND = WMEMP.EMFND-
     A                                       AND     ELEMP# = WMEMP.EMEMP# AND -
     A                                      ELDIV = WMEMP.EMDIV))) || '')'' || -
     A                                      ''-'' END)  || TRIM(EMNAME)","choic-
     A                                      e values field":"DIGITS(EMDIV)","bl-
     A                                      ank option":"true","blank option la-
     A                                      bel":"All Divisions","order by":"EM-
     A                                      DIV","left":"755px","top":"200px","-
     A                                      width":"245px","parent field set":"-
     A                                      FldSetCon1","css class 2":"dropdown-
     A                                      ","tab index":"8","visibility":{"fi-
     A                                      eldName":"indSigReq","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"oncha-
     A                                      nge":"fundYearSelections();","disab-
     A                                      led":{"fieldName":"Indpolyear","cus-
     A                                      tomTrue":"","customFalse":"","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "choices selection criteria":{"fiel-
     A                                      dName":"divChoices","dataLength":"1-
     A                                      0","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"},"error message id":{"fiel-
     A                                      dName":"msDiv","dataLength":"10","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"},"error message file":"WMESGG",-
     A                                      "error message library":"*LIBL","er-
     A                                      ror condition":{"fieldName":"erDiv"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror enhanced mode":"0"}]}')
     A            BTNCANCEL      1A  H
     A            BTNSUBMIT      1A  H
     A            DIVCHOICES    10A  H
     A            EMPCHOICES   200A  H
     A            ERDIV          1A  H
     A            ERDRTRMK       1A  H
     A            EREMPDIVNM     1A  H
     A            ERFND          1A  H
     A            ERFYR          1A  H
     A            ERMUTUALEX     1A  H
     A            ERPEXPFRDT     1A  H
     A            ERPEXPTODT     1A  H
     A            ERPOLTYP       1A  H
     A            ERREGION       1A  H
     A            EXITNOW        1A  H
     A            FCDRTRMK       1A  H
     A            FCEMPDIVNM     1A  H
     A            GRPFROM      200A  H
     A            GRPSELECT    100A  H
     A            GRPWHERE     200A  H
     A            INDCONT1       1A  H
     A            INDGRPRD       1A  H
     A            INDMASSREQ     1A  H
     A            INDNONMASS     1A  H
     A            INDNOTOUTP     1A  H
     A            INDPOLYEAR     1A  H
     A            INDPSLFRPT     1A  H
     A            INDSIGREQ      1A  H
     A            INDSLFRPT      1A  H
     A            INDUPDAUDT     1A  H
     A            INDUPDAUTR     1A  H
     A            ISMULTGRPS     1A  H
     A            ISNOTSCRPT     1A  H
     A            ISSNGLEMP      1A  H
     A            MSDIV         10A  H
     A            MSDRTRMK      10A  H
     A            MSEMPDIVNM    10A  H
     A            MSFND         10A  H
     A            MSFYR         10A  H
     A            MSMUTUALEX    10A  H
     A            MSPEXPFRDT    10A  H
     A            MSPEXPTODT    10A  H
     A            MSPOLTYP      10A  H
     A            MSREGION      10A  H
     A            SCAUDRPROC     1A  H
     A            SCBCANCELT     5S 0H
     A            SCBDRTRMKT     5S 0H
     A            SCBSUBMITT     5S 0H
     A            SCCCLMAUDT     5S 0H
     A            SCCGEN301T     5S 0H
     A            SCCGEN311T     5S 0H
     A            SCCGENDIVT     5S 0H
     A            SCCNOOUTPT     5S 0H
     A            SCCOMCD1      43A  H
     A            SCCOMCD2      43A  H
     A            SCCOMCD3      43A  H
     A            SCCOMCD4      43A  H
     A            SCCOMCD5      43A  H
     A            SCCOMPANY#     3A  H
     A            SCCON2TOP      5S 0H
     A            SCCPRTSRPT     5S 0H
     A            SCCSRPAYT      5S 0H
     A            SCCUPDAURT     5S 0H
     A            SCCUPDAUT      5S 0H
     A            SCDAUDRPRT     5S 0H
     A            SCDCOMCD1T     5S 0H
     A            SCDCOMCD2T     5S 0H
     A            SCDCOMCD3T     5S 0H
     A            SCDCOMCD4T     5S 0H
     A            SCDCOMCD5T     5S 0H
     A            SCDIVCHR       5A  H
     A            SCDRTRMK      80A  H
     A            SCEMP#         9S 0H
     A            SCEMPDIV       5A  H
     A            SCIAUDREQT     5S 0H
     A            SCLAUDREQT     5S 0H
     A            SCLCOMCDT      5S 0H
     A            SCLDRTRMKT     5S 0H
     A            SCLSELCRTT     5S 0H
     A            SCPEXPFRDT     8S 0H
     A            SCPEXPTODT     8S 0H
     A            SCPOLTYP       1A  H
     A            SCTDRTRMKT     5S 0H
     A            SELDRTRMK      1A  H
     A            SELEMPSRCH     1A  H
     A            STRTIPEMP    100A  H
     A            SCFND     R        H      REFFLD(ELFND WDELP)
     A            SCFYR     R        H      REFFLD(ELFYR WDELP)
     A            SCGEN301ENR        H      REFFLD(FLAG)
     A            SCGEN311ENR        H      REFFLD(FLAG)
     A            SCGENALLDVR        H      REFFLD(FLAG)
     A            SCLISTCLMSR        H      REFFLD(FLAG)
     A            SCNOOUTPUTR        H      REFFLD(FLAG)
     A            SCPSLFRPTPR        H      REFFLD(FLAG)
     A            SCREGION  R        H      REFFLD(RGN#)
     A            SCSLFRPTPYR        H      REFFLD(FLAG)
     A            SCUPDAUDT R        H      REFFLD(FLAG)
     A            SCUPDAUDTRR        H      REFFLD(FLAG)
