     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 21
     A  22 23                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                  1  2HTML('QPUIREC5    RPUTOVR    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C5    SCFDTC7    WCR05-
     A                                      00C6    WMESGGC5    *LIBLC0    E1  -
     A                                        3     21RERRMSGID  5    C5    SCF-
     A                                      DTC7    WCR0529C6    WMESGGC5    *L-
     A                                      IBLC0    E1    3     23RERRMSGID  5-
     A                                          C5    SCTDTC7    WCR0500C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     2-
     A                                      2')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN21","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN22","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN23","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"put overri-
     A                                      de":"true","valid command key":{"fi-
     A                                      eldName":"*IN11","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"overlay range":"1--
     A                                      23"},"items":[{"id":"W7245F_SCR01_a-
     A                                      vKeys","field type":"output field",-
     A                                      "value":{"fieldName":"AV_KEYS","dat-
     A                                      aLength":"1134","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[AV_KEYS]"},"left":"0px","top":"0-
     A                                      px","visibility":"hidden"},{"id":"W-
     A                                      7245F_SCR01_action","field type":"h-
     A                                      tml container","white space":"norma-
     A                                      l","left":"0px","top":"10px","width-
     A                                      ":"230px","css class":"action-panel-
     A                                      -converted","height":"700px","html"-
     A                                      :"<div class=\"top\"></div><div cla-
     A                                      ss=\"imagetop\"><img src=\"/profoun-
     A                                      dui/userdata/images/bar_top.png\" /-
     A                                      ></div><div class=\"menulinks\"></d-
     A                                      iv><div class=\"imagebottom\"><img -
     A                                      src=\"/profoundui/userdata/images/b-
     A                                      ar_bottom.png\" /></div><div class=-
     A                                      \"bottom\"></div>"},{"field type":"-
     A                                      icon menu button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"32px","z index":"20","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1170px","id":"W7245F_SCR01_BtnIcon-
     A                                      MenuSystemTools","tool tip":"System-
     A                                       Tools","icon alignment":"middle le-
     A                                      ft","icon width":"16px","icon heigh-
     A                                      t":"24px","icon source":"/profoundu-
     A                                      i/userdata/images/systool/systools.-
     A                                      png","data function":"SystemToolbar-
     A                                      Systools","show down arrow":"Yes"},-
     A                                      {"field type":"panel","panel style"-
     A                                      :"TransformButtonBar","id":"W7245F_-
     A                                      SCR01_ButtonBar","top":"35px","left-
     A                                      ":"1036px","width":"187px","height"-
     A                                      :"28px","css class":"stationary","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"10-
     A                                      40px","id":"W7245F_SCR01_BtnSave","-
     A                                      tool tip":"Save","onclick":"SystemT-
     A                                      oolbarSave","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/save.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1066px","id":"W7245F_SCR01_Btn-
     A                                      Refresh","tool tip":"Refresh","oncl-
     A                                      ick":"SystemToolbarRefresh","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/refresh.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1092px","id-
     A                                      ":"W7245F_SCR01_BtnSearch","tool ti-
     A                                      p":"Search","onclick":"SystemToolba-
     A                                      rSearch","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /search.png'')"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1118px","id":"W7245F_SCR01_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border ri')
     A                                  1  4HTML('ght style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1144px","id":"W7245F_-
     A                                      SCR01_BtnSystemMessages","tool tip"-
     A                                      :"System Messages","onclick":"Syste-
     A                                      mToolbarMessages","background image-
     A                                      ":{"fieldName":"MsgIcnURL","dataLen-
     A                                      gth":"128","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"}},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1196px","id":"W7245F_SCR01_Bt-
     A                                      nHelp","tool tip":"Help","onclick":-
     A                                      "SystemToolbarHelp","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/help.png'')"},{"id":"W7-
     A                                      245F_SCR01_ImgSysToolBottom","field-
     A                                       type":"image","image source":"/pro-
     A                                      foundui/userdata/images/systool/but-
     A                                      barbot.png","left":"1036px","top":"-
     A                                      64px","width":"187px","locked in pl-
     A                                      ace":"true","css class":"stationary-
     A                                      ","visibility":"hidden"},{"id":"W72-
     A                                      45F_SCR01_MainTabPanel","field type-
     A                                      ":"tab panel","tab panel style":"Tr-
     A                                      ansform","tab names":{"fieldName":"-
     A                                      SCPRDS","designValue":"[SCPRDS]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"active tab"-
     A                                      :"0","left":"250px","top":"70px","w-
     A                                      idth":"970px","height":"657px","z i-
     A                                      ndex":"8","locked in place":"true",-
     A                                      "css class":"tab-panel","css class -
     A                                      2":"stationary"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W7245F_SCR01_BtnHiddenSave","v-
     A                                      alue":"btnSave","top":"100px","resp-
     A                                      onse":{"fieldName":"btnSave","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCUSER","field type":"output field-
     A                                      ","value":{"fieldName":"SCUSER","de-
     A                                      signValue":"[SCUSER]","refField":"U-
     A                                      SER","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"110px","cursor row":"1",-
     A                                      "css class 2":"top-line","parent ta-
     A                                      b panel":"W7245F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"SCCONM",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCCONM","designValue-
     A                                      ":"[SCCONM]","refField":"NAME","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"414px","cursor column":"21","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss 2":"top-line","css class 3":"HI"-
     A                                      ,"description":"COMPANY NAME","pare-
     A                                      nt tab panel":"W7245F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      4":"profound-converted"},{"id":"con-
     A                                      stant1","field type":"output field"-
     A                                      ,"left":"778px","cursor column":"73-
     A                                      ","top":"110px","cursor row":"1","c-
     A                                      ss class":"top-line","value":"js: c-
     A                                      urrentDate()","css class 2":"output-
     A                                      -field","parent tab panel":"W7245F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"W7245F_SCR01_fkeyMenu","f-
     A                                      ield type":"menu","left":"10px","to-
     A                                      p":"120px","height":"350px","width"-
     A                                      :"230px","hover background color":"-
     A                                      #9AAA61","hover text color":"#FFFFF-
     A                                      F","border color":"#4C6106","menu o-
     A                                      ption indent":"10px","background co-
     A                                      lor":"#758B27","css class":"action--
     A                                      menu","css class 2":"stationary","z-
     A                                       index":"101"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W7245F_SCR01_BtnHiddenRefresh","-
     A                                      value":"btnRefresh","top":"125px","-
     A                                      response":{"fieldName":"btnRefresh"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"Q1PGM","field type":"output-
     A                                       field","value":{"fieldName":"Q1PGM-
     A                                      ","designValue":"[Q1PGM]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none","dataLen-
     A                                      gth":"10"},"css class":"output-fiel-
     A                                      d","left":"281px","cursor column":"-
     A                                      2","top":"130px","cursor row":"2","-
     A                                      parent tab panel":"W7245F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCPRDS","field type":"output field-
     A                                      ","value":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","te')
     A                                  1  5HTML('xtTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"414px","-
     A                                      cursor column":"21","top":"130px","-
     A                                      cursor row":"2","css class 2":"HI",-
     A                                      "description":"PROGRAM NAME","paren-
     A                                      t tab panel":"W7245F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","visibility"-
     A                                      :"hidden","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant2","field-
     A                                       type":"output field","value":"SCR0-
     A                                      1","css class":"constant","left":"7-
     A                                      99px","cursor column":"76","top":"1-
     A                                      30px","cursor row":"2","parent tab -
     A                                      panel":"W7245F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W7245F_SCR01_BtnHiddenSearch"-
     A                                      ,"value":"btnSearch","top":"150px",-
     A                                      "response":{"fieldName":"btnSearch"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant3","field type":"ou-
     A                                      tput field","value":"Group:","css c-
     A                                      lass":"constant","left":"281px","cu-
     A                                      rsor column":"2","top":"170px","cur-
     A                                      sor row":"4","parent tab panel":"W7-
     A                                      245F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCFND","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCFND","designValue":"[SCFND]","r-
     A                                      efField":"FND","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"999.00"},"css class":"out-
     A                                      put-field","left":"337px","cursor c-
     A                                      olumn":"10","top":"170px","cursor r-
     A                                      ow":"4","width":"21px","text align"-
     A                                      :"right","description":"FUND NUMBER-
     A                                      ","parent tab panel":"W7245F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCNAME","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCNAME",-
     A                                      "designValue":"[SCNAME]","refField"-
     A                                      :"NM60","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"372px","cursor colum-
     A                                      n":"15","top":"170px","cursor row":-
     A                                      "4","parent tab panel":"W7245F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W7245F_SCR01_-
     A                                      BtnHiddenDiaryItems","value":"btnDi-
     A                                      ary","top":"175px","response":{"fie-
     A                                      ldName":"btnDiary","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W7245F_SCR01_BtnHiddenSystem-
     A                                      Messages","value":"btnMessage","top-
     A                                      ":"200px","response":{"fieldName":"-
     A                                      btnMessage","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant4","fiel-
     A                                      d type":"output field","value":"Typ-
     A                                      e information, press Enter.","css c-
     A                                      lass":"constant","left":"281px","cu-
     A                                      rsor column":"2","top":"210px","cur-
     A                                      sor row":"6","css class 2":"BLU","p-
     A                                      arent tab panel":"W7245F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W7245F_SCR01_BtnHid-
     A                                      denWorkSubmitJob","value":"btnWrksb-
     A                                      mjob","top":"225px","response":{"fi-
     A                                      eldName":"btnWrkJob","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t5","field type":"output field","va-
     A                                      lue":"Date range:","css class":"con-
     A                                      stant","left":"295px","cursor colum-
     A                                      n":"4","top":"250px","cursor row":"-
     A                                      8","parent tab panel":"W7245F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCFDT","field type":"date fiel-
     A                                      d","css class":"input","css class 2-
     A                                      ":"date-field","value":{"fieldName"-
     A                                      :"SCFDT","designValue":"[SCFDT]","r-
     A                                      efField":"DT8","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"-999.00","numBlankFill":-
     A                                      "true","edtWrd":"''  /  /    ''","d-
     A                                      ateFormat":"m/d/Y"},"left":"379px",-
     A                                      "cursor column":"16","top":"250px",-
     A                                      "cursor row":"8","width":"71px","te-
     A                                      xt align":"right","css class 3":"HI-
     A                                      ","error message id":"WCR0500","err-
     A                                      or message file":"WMESGG","error me-
     A                                      ssage library":"*LIBL","error condi-
     A                                      tion":{"fieldName":"21","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      ages":"2 messages","error message i-
     A                                      d 2":"WCR0529","error message file -
     A                                      2":"WMESGG","error message library -
     A                                      2":"*LIBL","error condition 2":{"fi-
     A                                      eldName":"23","dataType":"')
     A                                  1  6HTML('expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"paren-
     A                                      t tab panel":"W7245F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 4-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant6","field type":"output field",-
     A                                      "value":"-","css class":"constant",-
     A                                      "left":"456px","cursor column":"27"-
     A                                      ,"top":"250px","cursor row":"8","pa-
     A                                      rent tab panel":"W7245F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CTDT","field type":"date field","cs-
     A                                      s class":"input","css class 2":"dat-
     A                                      e-field","value":{"fieldName":"SCTD-
     A                                      T","designValue":"[SCTDT]","refFiel-
     A                                      d":"DT8","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00","numBlankFill":"true"-
     A                                      ,"edtWrd":"''  /  /    ''","dateFor-
     A                                      mat":"m/d/Y"},"left":"492px","curso-
     A                                      r column":"29","top":"250px","curso-
     A                                      r row":"8","width":"71px","text ali-
     A                                      gn":"right","css class 3":"HI","err-
     A                                      or message id":"WCR0500","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"22","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","parent tab panel":"W72-
     A                                      45F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 4":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W7245-
     A                                      F_SCR01_BtnHiddenWorkPrinterOutput"-
     A                                      ,"value":"btnWrkprtout","top":"250p-
     A                                      x","response":{"fieldName":"btnWrkP-
     A                                      rnt","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W7245F_-
     A                                      SCR01_BtnHiddenImageQueue","value":-
     A                                      "btnImgQue","top":"275px","response-
     A                                      ":{"fieldName":"btnImgQue","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W7245F_SCR01_BtnHidd-
     A                                      enHelp","value":"btnHelp","top":"30-
     A                                      0px","response":{"fieldName":"btnHe-
     A                                      lp","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px","top":"1-
     A                                      50px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF03","field type":"button","-
     A                                      value":"Exit","shortcut key":"F3","-
     A                                      left":"14px","top":"183px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF13","f-
     A                                      ield type":"button","value":"Chg us-
     A                                      er parms","shortcut key":"F13","lef-
     A                                      t":"14px","top":"216px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnHELP","fiel-
     A                                      d type":"button","shortcut key":"Al-
     A                                      t-F1","bypass validation":"true","v-
     A                                      alue":"HELP","response":{"fieldName-
     A                                      ":"*IN10","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"left":"14px","top":"249px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFDT     R        H      REFFLD(DT8)
     A            SCFND     R        H      REFFLD(FND)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCTDT     R        H      REFFLD(DT8)
     A            SCUSER    R        H      REFFLD(USER)
