     A                                      REF(*LIBL/WREFP)
     A          R SCR01
     A  09                                  CA01
     A                                  1  2HTML('QPUIREC2    RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","overlay range":"1--
     A                                      23"},"items":[{"id":"W7354F02_SCR01-
     A                                      _avKeys","field type":"output field-
     A                                      ","value":{"fieldName":"AV_KEYS","d-
     A                                      ataLength":"1134","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[AV_KEYS]"},"left":"0px","top":-
     A                                      "0px","visibility":"hidden"},{"id":-
     A                                      "W7354F02_SCR01_action","field type-
     A                                      ":"html container","white space":"n-
     A                                      ormal","left":"0px","top":"10px","w-
     A                                      idth":"230px","css class":"action-p-
     A                                      anel-converted","height":"700px","h-
     A                                      tml":"<div class=\"top\"></div><div-
     A                                       class=\"imagetop\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_top.png-
     A                                      \" /></div><div class=\"menulinks\"-
     A                                      ></div><div class=\"imagebottom\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_bottom.png\" /></div><div cl-
     A                                      ass=\"bottom\"></div>"},{"field typ-
     A                                      e":"icon menu button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"32px","z index":"20"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1170px","id":"W7354F02_SCR01_B-
     A                                      tnIconMenuSystemTools","tool tip":"-
     A                                      System Tools","icon source":"/profo-
     A                                      undui/userdata/images/systool/systo-
     A                                      ols.png","data function":"SystemToo-
     A                                      lbarSystools","show down arrow":"Ye-
     A                                      s"},{"field type":"panel","panel st-
     A                                      yle":"TransformButtonBar","id":"W73-
     A                                      54F02_SCR01_ButtonBar","top":"35px"-
     A                                      ,"left":"1036px","width":"187px","h-
     A                                      eight":"28px","css class":"stationa-
     A                                      ry","visibility":"hidden","locked i-
     A                                      n place":"true"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1040px","id":"W7354F02_SCR01_Bt-
     A                                      nSave","tool tip":"Save","onclick":-
     A                                      "SystemToolbarSave","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/save.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1066px",')
     A                                  1  2HTML('"id":"W7354F02_SCR01_BtnRefre-
     A                                      sh","tool tip":"Refresh","onclick":-
     A                                      "SystemToolbarRefresh","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/refresh.png'')"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1092px","id":"W7-
     A                                      354F02_SCR01_BtnSearch","tool tip":-
     A                                      "Search","onclick":"SystemToolbarSe-
     A                                      arch","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/se-
     A                                      arch.png'')"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1118px","id":"W7354F02_SCR01_BtnDi-
     A                                      aryItems","tool tip":"Diary/Work It-
     A                                      ems - IDARTS","onclick":"SystemTool-
     A                                      barDiary","background image":{"fiel-
     A                                      dName":"DryIcnURL","dataLength":"12-
     A                                      8","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"}},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      44px","id":"W7354F02_SCR01_BtnSyste-
     A                                      mMessages","tool tip":"System Messa-
     A                                      ges","onclick":"SystemToolbarMessag-
     A                                      es","background image":{"fieldName"-
     A                                      :"MsgIcnURL","dataLength":"128","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"}},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1196px",-
     A                                      "id":"W7354F02_SCR01_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"')
     A                                  1  2HTML('W7354F02_SCR01_ImgSysToolBott-
     A                                      om","field type":"image","image sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/butbarbot.png","left":"1036p-
     A                                      x","top":"64px","width":"187px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      stationary","visibility":"hidden"},-
     A                                      {"id":"W7354F02_SCR01_MainTabPanel"-
     A                                      ,"field type":"tab panel","tab pane-
     A                                      l style":"Transform","tab names":{"-
     A                                      fieldName":"SCPRDS","designValue":"-
     A                                      [SCPRDS]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "active tab":"0","left":"250px","to-
     A                                      p":"70px","width":"970px","height":-
     A                                      "657px","z index":"8","locked in pl-
     A                                      ace":"true","css class":"tab-panel"-
     A                                      ,"css class 2":"stationary"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W7354F02_SCR01_Btn-
     A                                      HiddenSave","value":"btnSave","top"-
     A                                      :"100px","response":{"fieldName":"b-
     A                                      tnSave","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant1","field ty-
     A                                      pe":"output field","left":"281px","-
     A                                      cursor column":"2","top":"110px","c-
     A                                      ursor row":"1","css class":"top-lin-
     A                                      e","value":"js: currentUser()","css-
     A                                       class 2":"output-field","parent ta-
     A                                      b panel":"W7354F02_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCCONM-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCCONM","designVal-
     A                                      ue":"[SCCONM]","refField":"NAME","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"414px","cursor column":"21","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass 2":"top-line","css class 3":"H-
     A                                      I","parent tab panel":"W7354F02_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 4":"profound-converted"},-
     A                                      {"id":"constant2","field type":"out-
     A                                      put field","left":"778px","cursor c-
     A                                      olumn":"73","top":"110px","cursor r-
     A                                      ow":"1","css class":"top-line","val-
     A                                      ue":"js: currentDate()","css class -
     A                                      2":"output-field","parent tab panel-
     A                                      ":"W7354F02_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"W7354F02_SCR0-
     A                                      1_fkeyMenu","field type":"menu","le-
     A                                      ft":"10px","top":"120px","height":"-
     A                                      350px","width":"230px","hover backg-
     A                                      round color":"#9AAA61","hover text -
     A                                      color":"#FFFFFF","border color":"#4-
     A                                      C6106","menu option indent":"10px",-
     A                                      "background color":"#758B27","css c-
     A                                      lass":"action-menu","css class 2":"-
     A                                      stationary","z index":"101"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","c')
     A                                  1  2HTML('ss class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W7354F02_SCR01_BtnHiddenRefresh",-
     A                                      "value":"btnRefresh","top":"125px",-
     A                                      "response":{"fieldName":"btnRefresh-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"Q1PGM","field type":"outpu-
     A                                      t field","value":{"fieldName":"Q1PG-
     A                                      M","designValue":"[Q1PGM]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none","dataLe-
     A                                      ngth":"10"},"css class":"output-fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"130px","cursor row":"2",-
     A                                      "parent tab panel":"W7354F02_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCPRDS","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCPRDS",-
     A                                      "designValue":"[SCPRDS]","refField"-
     A                                      :"NAME","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"414px","cursor colum-
     A                                      n":"21","top":"130px","cursor row":-
     A                                      "2","css class 2":"HI","parent tab -
     A                                      panel":"W7354F02_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","visibility":"hi-
     A                                      dden","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant3","field typ-
     A                                      e":"output field","value":"SCR01","-
     A                                      css class":"constant","left":"799px-
     A                                      ","cursor column":"76","top":"130px-
     A                                      ","cursor row":"2","parent tab pane-
     A                                      l":"W7354F02_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCMODE","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCMODE","designValue":"[-
     A                                      SCMODE]","refField":"PGM","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"76-
     A                                      4px","cursor column":"71","top":"15-
     A                                      0px","cursor row":"3","css class 2"-
     A                                      :"HI","parent tab panel":"W7354F02_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W7354F02_-
     A                                      SCR01_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W7354F02_SCR01_BtnHidden-
     A                                      DiaryItems","value":"btnDiary","top-
     A                                      ":"175px","response":{"fieldName":"-
     A                                      btnDiary","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"cons')
     A                                  1  2HTML('tant4","field type":"output f-
     A                                      ield","value":"Group:","css class":-
     A                                      "constant","left":"281px","cursor c-
     A                                      olumn":"2","top":"190px","cursor ro-
     A                                      w":"5","parent tab panel":"W7354F02-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCFND","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      FND","designValue":"[SCFND]","refFi-
     A                                      eld":"FND","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"true","zeroFill":-
     A                                      "true","curSym":"","units":"","negN-
     A                                      um":"-999.00"},"css class":"output--
     A                                      field","left":"330px","cursor colum-
     A                                      n":"9","top":"190px","cursor row":"-
     A                                      5","width":"21px","text align":"rig-
     A                                      ht","parent tab panel":"W7354F02_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCFNAM","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCFN-
     A                                      AM","designValue":"[SCFNAM]","refFi-
     A                                      eld":"NM60","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"358px","cursor c-
     A                                      olumn":"13","top":"190px","cursor r-
     A                                      ow":"5","parent tab panel":"W7354F0-
     A                                      2_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"W7354F0-
     A                                      2_SCR01_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant5","field type":"out-
     A                                      put field","value":"Reporting Month-
     A                                      /Year:","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"210px","cursor row":"6","parent -
     A                                      tab panel":"W7354F02_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCRP-
     A                                      MY","field type":"output field","va-
     A                                      lue":{"fieldName":"SCRPMY","designV-
     A                                      alue":"[SCRPMY]","dataType":"zoned"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"true","zeroFill-
     A                                      ":"true","curSym":"","units":"","ne-
     A                                      gNum":"-999.00","dataLength":"6","d-
     A                                      ecPos":"0","edtWrd":"''  /    ''"},-
     A                                      "css class":"output-field","left":"-
     A                                      435px","cursor column":"24","top":"-
     A                                      210px","cursor row":"6","width":"49-
     A                                      px","text align":"right","parent ta-
     A                                      b panel":"W7354F02_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W7354F02_SCR01_BtnHiddenW-
     A                                      orkSubmitJob","value"')
     A                                  1  2HTML(':"btnWrksbmjob","top":"225px"-
     A                                      ,"response":{"fieldName":"btnWrkJob-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant6","field type":"o-
     A                                      utput field","value":"Carrier code -
     A                                           :","css class":"constant","lef-
     A                                      t":"295px","cursor column":"4","top-
     A                                      ":"250px","cursor row":"8","parent -
     A                                      tab panel":"W7354F02_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCCA-
     A                                      RR","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCCARR","des-
     A                                      ignValue":"[SCCARR]","dataType":"zo-
     A                                      ned","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00","dataLength":-
     A                                      "5","decPos":"0"},"left":"435px","c-
     A                                      ursor column":"24","top":"250px","c-
     A                                      ursor row":"8","width":"36px","css -
     A                                      class 3":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"HI","customFalse":""},-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 4":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"css class 5":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"parent tab panel":"W7-
     A                                      354F02_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"W7-
     A                                      354F02_SCR01_BtnHiddenWorkPrinterOu-
     A                                      tput","value":"btnWrkprtout","top":-
     A                                      "250px","response":{"fieldName":"bt-
     A                                      nWrkPrnt","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant7","field -
     A                                      type":"output field","value":"Emplo-
     A                                      yer          :","css class":"consta-
     A                                      nt","left":"295px","cursor column":-
     A                                      "4","top":"270px","cursor row":"9",-
     A                                      "parent tab panel":"W7354F02_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCEMP#","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCEM-
     A                                      P#","designValue":"[SCEMP#]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"9","decPos":"0"},"left":"4-
     A                                      35px","cursor column":"24","top":"2-
     A                                      70px","cursor row":"9","width":"64p-
     A                                      x","css class 3":{"fieldName":"09",-
     A                                      "dataType":"expressio')
     A                                  1  2HTML('n","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 4":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "css class 5":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"parent tab panel":"W7354F02_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"SCENAM","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      ENAM","designValue":"[SCENAM]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none","da-
     A                                      taLength":"40"},"css class":"output-
     A                                      -field","left":"512px","cursor colu-
     A                                      mn":"35","top":"270px","cursor row"-
     A                                      :"9","parent tab panel":"W7354F02_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W7354F02_S-
     A                                      CR01_BtnHiddenImageQueue","value":"-
     A                                      btnImgQue","top":"275px","response"-
     A                                      :{"fieldName":"btnImgQue","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant8","field type":"output field-
     A                                      ","value":"Year              :","cs-
     A                                      s class":"constant","left":"295px",-
     A                                      "cursor column":"4","top":"290px","-
     A                                      cursor row":"10","parent tab panel"-
     A                                      :"W7354F02_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCFYR","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCFYR","designValue":"[-
     A                                      SCFYR]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","dataLength":"3","decPos":-
     A                                      "0"},"left":"435px","cursor column"-
     A                                      :"24","top":"290px","cursor row":"1-
     A                                      0","width":"22px","css class 3":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"read only":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       4":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"css -
     A                                      class 5":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"C')
     A                                  1  2HTML('ustom Values","customTrue":"U-
     A                                      L","customFalse":""},"parent tab pa-
     A                                      nel":"W7354F02_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 6":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W7354F02_SCR01_BtnHiddenHelp"-
     A                                      ,"value":"btnHelp","top":"300px","r-
     A                                      esponse":{"fieldName":"btnHelp","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant9","field type":"output-
     A                                       field","value":"Certificate number-
     A                                      :","css class":"constant","left":"2-
     A                                      95px","cursor column":"4","top":"33-
     A                                      0px","cursor row":"12","parent tab -
     A                                      panel":"W7354F02_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCCRT#",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCCRT#","designV-
     A                                      alue":"[SCCRT#]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase","dataLength":-
     A                                      "7"},"text transform":"uppercase","-
     A                                      left":"435px","cursor column":"24",-
     A                                      "top":"330px","cursor row":"12","wi-
     A                                      dth":"50px","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 4":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"css class -
     A                                      5":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"pare-
     A                                      nt tab panel":"W7354F02_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"id":"c-
     A                                      onstant10","field type":"output fie-
     A                                      ld","value":"State code        :","-
     A                                      css class":"constant","left":"295px-
     A                                      ","cursor column":"4","top":"350px"-
     A                                      ,"cursor row":"13","parent tab pane-
     A                                      l":"W7354F02_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCSTCD","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCSTCD","designValue-
     A                                      ":"[SCSTCD]","dataType":"zoned","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00","dataLength":"2","dec-
     A                                      Pos":"0"},"left":"435px","cursor co-
     A                                      lumn":"24","top":"350px","cursor ro-
     A                                      w":"13","width":"15px","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting"')
     A                                  1  2HTML(':"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 4":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"css class 5":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"parent t-
     A                                      ab panel":"W7354F02_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant11","field type":"output field",-
     A                                      "value":"Effective date    :","css -
     A                                      class":"constant","left":"295px","c-
     A                                      ursor column":"4","top":"370px","cu-
     A                                      rsor row":"14","parent tab panel":"-
     A                                      W7354F02_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCEFDT","field t-
     A                                      ype":"date field","css class":"inpu-
     A                                      t","css class 2":"date-field","valu-
     A                                      e":{"fieldName":"SCEFDT","designVal-
     A                                      ue":"[SCEFDT]","dataType":"zoned","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"-999.00","dataLength":"8","d-
     A                                      ecPos":"0","edtWrd":"''  /  /    ''-
     A                                      ","dateFormat":"m/d/Y"},"left":"435-
     A                                      px","cursor column":"24","top":"370-
     A                                      px","cursor row":"14","width":"71px-
     A                                      ","css class 3":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"read only":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 4":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"css class 5":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"parent tab pan-
     A                                      el":"W7354F02_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 6":"prof-
     A                                      ound-converted"},{"id":"constant12"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Report number     :","css class"-
     A                                      :"constant","left":"295px","cursor -
     A                                      column":"4","top":"410px","cursor r-
     A                                      ow":"16","parent tab panel":"W7354F-
     A                                      02_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCRPT#","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCRPT#","designValue":"[SCRPT#-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase","dataLength":"1"},"text tra-
     A                                      nsform":"uppercase","')
     A                                  1  2HTML('left":"435px","cursor column"-
     A                                      :"24","top":"410px","cursor row":"1-
     A                                      6","width":"8px","css class 3":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      4":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"css c-
     A                                      lass 5":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "parent tab panel":"W7354F02_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted"},{"i-
     A                                      d":"constant13","field type":"outpu-
     A                                      t field","value":"Correction record-
     A                                       :","css class":"constant","left":"-
     A                                      295px","cursor column":"4","top":"4-
     A                                      30px","cursor row":"17","parent tab-
     A                                       panel":"W7354F02_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCCORR"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCCORR","design-
     A                                      Value":"[SCCORR]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase","dataLength"-
     A                                      :"1"},"text transform":"uppercase",-
     A                                      "left":"435px","cursor column":"24"-
     A                                      ,"top":"430px","cursor row":"17","w-
     A                                      idth":"8px","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 4":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"css class -
     A                                      5":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"pare-
     A                                      nt tab panel":"W7354F02_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"id":"b-
     A                                      tnSubmit","field type":"button","va-
     A                                      lue":"Enter","shortcut key":"Enter"-
     A                                      ,"left":"14px","top":"150px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF03",-
     A                                      "field type":"button","value":"Exit-
     A                                      ","shortcut key":"F3","left":"14px"-
     A                                      ,"top":"183px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnCF12","field type":"-
     A                                      button","value":"Cancel","shortcut -
     A                                      key":"F12","left":"14')
     A                                  1  2HTML('px","top":"216px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCARR         5S 0H
     A            SCCORR         1A  H
     A            SCCRT#         7A  H
     A            SCEFDT         8S 0H
     A            SCEMP#         9S 0H
     A            SCENAM        40A  H
     A            SCFYR          3S 0H
     A            SCRPMY         6S 0H
     A            SCRPT#         1A  H
     A            SCSTCD         2S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFNAM    R        H      REFFLD(NM60)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR02
     A  09 91                               CA01
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })\n-
     A                                      \nchangeElementValue(''TxbUnCAud'',-
     A                                      ''''); \napplyProperty(\"TxbUnCAud\-
     A                                      ",\"visibility\",\"hidden\");\n\nif-
     A                                       ( get(''TxtEstExp'') == ''U'')\n {-
     A                                      \n   changeElementValue(''TxbUnCAud-
     A                                      '', \"Uncooperative Audit\");  \n  -
     A                                       applyProperty(\"TxbUnCAud\",\"visi-
     A                                      bility\",\"visible\");\n }","overla-
     A                                      y range":"1-23"},"items":[{"id":"W7-
     A                                      354F02_SCR02_avKeys","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "AV_KEYS","dataLength":"1134","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[AV_KEYS]"},"left":-
     A                                      "0px","top":"0px","visibility":"hid-
     A                                      den"},{"id":"W7354F02_SCR02_action"-
     A                                      ,"field type":"html container","whi-
     A                                      te space":"normal","left":"0px","to-
     A                                      p":"10px","width":"230px","css clas-
     A                                      s":"action-panel-converted","height-
     A                                      ":"700px","html":"<div class=\"top\-
     A                                      "></div><div class=\"imagetop\"><im-
     A                                      g src=\"/profoundui/userdata/images-
     A                                      /bar_top.png\" /></div><div class=\-
     A                                      "menulinks\"></div><div class=\"ima-
     A                                      gebottom\"><img src=\"/profoundui/u-
     A                                      serdata/images/bar_bottom.png\" /><-
     A                                      /div><div class=\"bottom\"></div>"}-
     A                                      ,{"field type":"icon menu button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"32px","z-
     A                                       index":"20","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1170px","id":"W735-
     A                                      4F02_SCR02_BtnIconMenuSystemTools",-
     A                                      "tool tip":"System Tools","icon sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/systools.png","data function-
     A                                      ":"SystemToolbarSystools","show dow-
     A                                      n arrow":"Yes"},{"field type":"pane-
     A                                      l","panel style":"TransformButtonBa-
     A                                      r","id":"W7354F02_SCR02_ButtonBar",-
     A                                      "top":"35px","left":"1036px","width-
     A                                      ":"187px","height":"28px","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n","locked in place":"true"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1040px","id":"W7354-
     A                                      F02_SCR02_BtnSave","tool tip":"Save-
     A                                      ","onclick":"SystemToolbarSave","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/save.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40')
     A                                  1  2HTML('px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1066px","id":"W7354F02_SC-
     A                                      R02_BtnRefresh","tool tip":"Refresh-
     A                                      ","onclick":"SystemToolbarRefresh",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/refresh.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1092-
     A                                      px","id":"W7354F02_SCR02_BtnSearch"-
     A                                      ,"tool tip":"Search","onclick":"Sys-
     A                                      temToolbarSearch","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/search.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1118px","id":"W7354F02-
     A                                      _SCR02_BtnDiaryItems","tool tip":"D-
     A                                      iary/Work Items - IDARTS","onclick"-
     A                                      :"SystemToolbarDiary","background i-
     A                                      mage":{"fieldName":"DryIcnURL","dat-
     A                                      aLength":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1144px","id":"W7354F02_SC-
     A                                      R02_BtnSystemMessages","tool tip":"-
     A                                      System Messages","onclick":"SystemT-
     A                                      oolbarMessages","background image":-
     A                                      {"fieldName":"MsgIcnURL","dataLengt-
     A                                      h":"128","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none"}},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left ')
     A                                  1  2HTML('style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1196px","id-
     A                                      ":"W7354F02_SCR02_BtnHelp","tool ti-
     A                                      p":"Help","onclick":"SystemToolbarH-
     A                                      elp","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/hel-
     A                                      p.png'')"},{"id":"W7354F02_SCR02_Im-
     A                                      gSysToolBottom","field type":"image-
     A                                      ","image source":"/profoundui/userd-
     A                                      ata/images/systool/butbarbot.png","-
     A                                      left":"1036px","top":"64px","width"-
     A                                      :"187px","locked in place":"true","-
     A                                      css class":"stationary","visibility-
     A                                      ":"hidden"},{"id":"W7354F02_SCR02_M-
     A                                      ainTabPanel","field type":"tab pane-
     A                                      l","tab panel style":"Transform","t-
     A                                      ab names":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"active tab":"0","left"-
     A                                      :"250px","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W7354F-
     A                                      02_SCR02_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      14","field type":"output field","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass":"top-line","value":"js: curren-
     A                                      tUser()","css class 2":"output-fiel-
     A                                      d","parent tab panel":"W7354F02_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"SCR02_SCCONM","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCCONM","designValue":"[SCCONM]","-
     A                                      refField":"NAME","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"414px","cur-
     A                                      sor column":"21","top":"110px","cur-
     A                                      sor row":"1","css class 2":"top-lin-
     A                                      e","css class 3":"HI","parent tab p-
     A                                      anel":"W7354F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 4":"pr-
     A                                      ofound-converted"},{"id":"constant1-
     A                                      5","field type":"output field","lef-
     A                                      t":"778px","cursor column":"73","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass":"top-line","value":"js: curren-
     A                                      tDate()","css class 2":"output-fiel-
     A                                      d","parent tab panel":"W7354F02_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"W7354F02_SCR02_fkeyMenu","fi-
     A                                      eld type":"menu","left":"10px","top-
     A                                      ":"120px","height":"350px","width":-
     A                                      "230px","hover background color":"#-
     A                                      9AAA61","hover text c')
     A                                  1  2HTML('olor":"#FFFFFF","border color-
     A                                      ":"#4C6106","menu option indent":"1-
     A                                      0px","background color":"#758B27","-
     A                                      css class":"action-menu","css class-
     A                                       2":"stationary","z index":"101"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W7354F02_SCR0-
     A                                      2_BtnHiddenRefresh","value":"btnRef-
     A                                      resh","top":"125px","response":{"fi-
     A                                      eldName":"btnRefresh","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"SCR02_-
     A                                      Q1PGM","field type":"output field",-
     A                                      "value":{"fieldName":"Q1PGM","desig-
     A                                      nValue":"[Q1PGM]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none","dataLength":"10-
     A                                      "},"css class":"output-field","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"130px","cursor row":"2","parent t-
     A                                      ab panel":"W7354F02_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCR02-
     A                                      _SCPRDS","field type":"output field-
     A                                      ","value":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"414px","cursor column":-
     A                                      "21","top":"130px","cursor row":"2"-
     A                                      ,"css class 2":"HI","parent tab pan-
     A                                      el":"W7354F02_SCR02_MainTabPanel","-
     A                                      parent tab":"0","visibility":"hidde-
     A                                      n","css class 3":"profound-converte-
     A                                      d"},{"id":"constant16","field type"-
     A                                      :"output field","value":"SCR02","cs-
     A                                      s class":"constant","left":"799px",-
     A                                      "cursor column":"76","top":"130px",-
     A                                      "cursor row":"2","parent tab panel"-
     A                                      :"W7354F02_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCR02_SCMODE",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCMODE","designValue-
     A                                      ":"[SCMODE]","refField":"PGM","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"764px","cursor column":"71","top"-
     A                                      :"150px","cursor row":"3","css clas-
     A                                      s 2":"HI","parent tab panel":"W7354-
     A                                      F02_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W7354-
     A                                      F02_SCR02_BtnHiddenSearch","value":-
     A                                      "btnSearch","top":"150px","response-
     A                                      ":{"fieldName":"btnSearch","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"')
     A                                  1  2HTML('75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W7354F02_SCR02_BtnHiddenDiaryItems"-
     A                                      ,"value":"btnDiary","top":"175px","-
     A                                      response":{"fieldName":"btnDiary","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant17","field type":"out-
     A                                      put field","value":"Group:","css cl-
     A                                      ass":"constant","left":"281px","cur-
     A                                      sor column":"2","top":"190px","curs-
     A                                      or row":"5","parent tab panel":"W73-
     A                                      54F02_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCR02_SCFND","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCFND","designValue":"[SCF-
     A                                      ND]","refField":"FND","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"true",-
     A                                      "zeroFill":"true","curSym":"","unit-
     A                                      s":"","negNum":"-999.00"},"css clas-
     A                                      s":"output-field","left":"330px","c-
     A                                      ursor column":"9","top":"190px","cu-
     A                                      rsor row":"5","width":"21px","text -
     A                                      align":"right","parent tab panel":"-
     A                                      W7354F02_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCR02_SCFNAM","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCFNAM","designValue":-
     A                                      "[SCFNAM]","refField":"NM60","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "358px","cursor column":"13","top":-
     A                                      "190px","cursor row":"5","parent ta-
     A                                      b panel":"W7354F02_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W7354F02_SCR02_BtnHiddenS-
     A                                      ystemMessages","value":"btnMessage"-
     A                                      ,"top":"200px","response":{"fieldNa-
     A                                      me":"btnMessage","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant18"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Reporting Month/Year:","css clas-
     A                                      s":"constant","left":"281px","curso-
     A                                      r column":"2","top":"210px","cursor-
     A                                       row":"6","parent tab panel":"W7354-
     A                                      F02_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCR02_SCRPMY","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCRPMY","designValue":"[SCR-
     A                                      PMY]","dataType":"zoned","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"true","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","dataLength":"6","decPos":"0",-
     A                                      "edtWrd":"''  /    ''"},"css class"-
     A                                      :"output-field","left":"435px","cur-
     A                                      sor column":"24","top":"210px","cur-
     A                                      sor row":"6","width":"49px","text a-
     A                                      lign":"right","parent')
     A                                  1  2HTML(' tab panel":"W7354F02_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W7354F02_SCR02_B-
     A                                      tnHiddenWorkSubmitJob","value":"btn-
     A                                      Wrksbmjob","top":"225px","response"-
     A                                      :{"fieldName":"btnWrkJob","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant20","field type":"output fiel-
     A                                      d","value":"Policy conditions(Y/N)"-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"91","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"295px","cursor column":"4","top-
     A                                      ":"250px","cursor row":"8","parent -
     A                                      tab panel":"W7354F02_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant19","field type":"output field"-
     A                                      ,"value":"Policy conditions(1/0)","-
     A                                      css class":"constant","visibility":-
     A                                      {"fieldName":"N91","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"295px","cursor column":"4","top"-
     A                                      :"250px","cursor row":"8","parent t-
     A                                      ab panel":"W7354F02_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W7354F02_SCR02_BtnHidden-
     A                                      WorkPrinterOutput","value":"btnWrkp-
     A                                      rtout","top":"250px","response":{"f-
     A                                      ieldName":"btnWrkPrnt","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant22","field type":"output field",-
     A                                      "value":"3 yr fixed rate    :","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"91","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"3-
     A                                      09px","cursor column":"6","top":"27-
     A                                      0px","cursor row":"9","parent tab p-
     A                                      anel":"W7354F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"constant2-
     A                                      1","field type":"output field","val-
     A                                      ue":"Excess coverage      :","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"N91","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"30-
     A                                      9px","cursor column":"6","top":"270-
     A                                      px","cursor row":"9","parent tab pa-
     A                                      nel":"W7354F02_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCPL01","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCPL01","designVal-
     A                                      ue":"[SCPL01]","dataType":"char","f-
     A                                      ormatting":"Text","tr')
     A                                  1  2HTML('imLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase","dataLength":"1"},"text transf-
     A                                      orm":"uppercase","visibility":{"fie-
     A                                      ldName":"91","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"456-
     A                                      px","cursor column":"27","top":"270-
     A                                      px","cursor row":"9","width":"8px",-
     A                                      "css class 3":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"read only":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 4":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"css class 5":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"parent tab panel-
     A                                      ":"W7354F02_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 6":"profou-
     A                                      nd-converted"},{"id":"SCPC01","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCPC01","designValue"-
     A                                      :"[SCPC01]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase","dataLength":"1"},-
     A                                      "text transform":"uppercase","visib-
     A                                      ility":{"fieldName":"N91","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"477px","cursor column":"3-
     A                                      0","top":"270px","cursor row":"9","-
     A                                      width":"8px","css class 3":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"HI",-
     A                                      "customFalse":""},"read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 4":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"css class-
     A                                       5":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"par-
     A                                      ent tab panel":"W7354F02_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 6":"profound-converted"},{"id":"-
     A                                      constant23","field type":"output fi-
     A                                      eld","value":"Term(1=Non 3yr fixed -
     A                                      rate)","css class":"constant","visi-
     A                                      bility":{"fieldName":"N91","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"519px","cursor column":"-
     A                                      36","top":"270px","cursor row":"9",-
     A                                      "parent tab panel":"W7354F02_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","')
     A                                  1  2HTML('left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W7354F02_SCR02_BtnHiddenImageQ-
     A                                      ueue","value":"btnImgQue","top":"27-
     A                                      5px","response":{"fieldName":"btnIm-
     A                                      gQue","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant25","field typ-
     A                                      e":"output field","value":"Multista-
     A                                      te policy  :","css class":"constant-
     A                                      ","visibility":{"fieldName":"91","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"left":"309px","cursor col-
     A                                      umn":"6","top":"290px","cursor row"-
     A                                      :"10","parent tab panel":"W7354F02_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant24","field type":-
     A                                      "output field","value":"Interstate -
     A                                      rated     :","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"N91","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"left":"309px","cursor col-
     A                                      umn":"6","top":"290px","cursor row"-
     A                                      :"10","parent tab panel":"W7354F02_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCPL02","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCPL02","designValue":"[SCPL02]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase","dataLength":"1"},"text transf-
     A                                      orm":"uppercase","visibility":{"fie-
     A                                      ldName":"91","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"456-
     A                                      px","cursor column":"27","top":"290-
     A                                      px","cursor row":"10","width":"8px"-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"read only":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 4":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"PR","cust-
     A                                      omFalse":""},"css class 5":{"fieldN-
     A                                      ame":"N09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"parent tab pane-
     A                                      l":"W7354F02_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"SCPC02","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCPC02","designValue-
     A                                      ":"[SCPC02]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase","dataLength":"1"}-
     A                                      ,"text transform":"up')
     A                                  1  2HTML('percase","visibility":{"field-
     A                                      Name":"N91","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"477p-
     A                                      x","cursor column":"30","top":"290p-
     A                                      x","cursor row":"10","width":"8px",-
     A                                      "css class 3":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"read only":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 4":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"css class 5":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"parent tab panel-
     A                                      ":"W7354F02_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 6":"profou-
     A                                      nd-converted"},{"id":"constant26","-
     A                                      field type":"output field","value":-
     A                                      "(3=3yr fixed rate)       :","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"N91","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"54-
     A                                      7px","cursor column":"40","top":"29-
     A                                      0px","cursor row":"10","parent tab -
     A                                      panel":"W7354F02_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCTERM",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCTERM","designV-
     A                                      alue":"[SCTERM]","dataType":"zoned"-
     A                                      ,"formatting":"Number","numSep":"tr-
     A                                      ue","zeroBalance":"true","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00","dataLength":"1","de-
     A                                      cPos":"0"},"visibility":{"fieldName-
     A                                      ":"N91","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"736px","-
     A                                      cursor column":"67","top":"290px","-
     A                                      cursor row":"10","width":"8px","css-
     A                                       class 3":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 4":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"css class 5":{"fieldName":-
     A                                      "N09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"parent tab panel":"W-
     A                                      7354F02_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 6":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button"')
     A                                  1  2HTML(',"cursor":"default","visibili-
     A                                      ty":"hidden","id":"W7354F02_SCR02_B-
     A                                      tnHiddenHelp","value":"btnHelp","to-
     A                                      p":"300px","response":{"fieldName":-
     A                                      "btnHelp","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant28","field-
     A                                       type":"output field","value":"Inte-
     A                                      rstate rated . :","css class":"cons-
     A                                      tant","visibility":{"fieldName":"91-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"309px","cursor-
     A                                       column":"6","top":"310px","cursor -
     A                                      row":"11","parent tab panel":"W7354-
     A                                      F02_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"constant27","field ty-
     A                                      pe":"output field","value":"Assigne-
     A                                      d risk        :","css class":"const-
     A                                      ant","visibility":{"fieldName":"N91-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"309px","cursor-
     A                                       column":"6","top":"310px","cursor -
     A                                      row":"11","parent tab panel":"W7354-
     A                                      F02_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCPL03","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SCPL03","designValue":"[SCPL0-
     A                                      3]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase","dataLength":"1"},"text tr-
     A                                      ansform":"uppercase","visibility":{-
     A                                      "fieldName":"91","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "456px","cursor column":"27","top":-
     A                                      "310px","cursor row":"11","width":"-
     A                                      8px","css class 3":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 4":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 5":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"parent tab -
     A                                      panel":"W7354F02_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted"},{"id":"SCPC03",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCPC03","designV-
     A                                      alue":"[SCPC03]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase","dataLength":-
     A                                      "1"},"text transform":"uppercase","-
     A                                      visibility":{"fieldName":"N91","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat"')
     A                                  1  2HTML(':"visible / hidden"},"left":"-
     A                                      477px","cursor column":"30","top":"-
     A                                      310px","cursor row":"11","width":"8-
     A                                      px","css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"read only":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 4":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"css class 5":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"parent tab p-
     A                                      anel":"W7354F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted"},{"id":"constant2-
     A                                      9","field type":"output field","val-
     A                                      ue":"Policy type ID#              :-
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"N91","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"519px","cursor column":"36","-
     A                                      top":"310px","cursor row":"11","par-
     A                                      ent tab panel":"W7354F02_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCPTYP","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCPTYP",-
     A                                      "designValue":"[SCPTYP]","dataType"-
     A                                      :"zoned","formatting":"Number","num-
     A                                      Sep":"true","zeroBalance":"true","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00","dataLength"-
     A                                      :"2","decPos":"0"},"visibility":{"f-
     A                                      ieldName":"N91","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      736px","cursor column":"67","top":"-
     A                                      310px","cursor row":"11","width":"1-
     A                                      5px","css class 3":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 4":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 5":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"parent tab -
     A                                      panel":"W7354F02_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      31","field type":"output field","va-
     A                                      lue":"Estimated exposure :","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"91","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"')
     A                                  1  2HTML('},"left":"309px","cursor colu-
     A                                      mn":"6","top":"330px","cursor row":-
     A                                      "12","parent tab panel":"W7354F02_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      ,"onchange":"var EstExp = get(''Con-
     A                                      stant31'');if (EstExp !== \"U\"){ a-
     A                                      pplyProperty(\"TxbUnCAud\",\"disabl-
     A                                      ed\",\"true\");}\nif (EstExp  == \"-
     A                                      U\"){ applyProperty(\"TxbUnCAud\",\-
     A                                      "disabled\",\"false\");}\n"},{"id":-
     A                                      "constant30","field type":"output f-
     A                                      ield","value":"Canceled policy     -
     A                                       :","css class":"constant","visibil-
     A                                      ity":{"fieldName":"N91","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"309px","cursor column":"6",-
     A                                      "top":"330px","cursor row":"12","pa-
     A                                      rent tab panel":"W7354F02_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted","width"-
     A                                      :"105px"},{"id":"TxtEstExp","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCPL04","designValue":"-
     A                                      [SCPL04]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"uppercase","dataLength":"1"},"t-
     A                                      ext transform":"uppercase","visibil-
     A                                      ity":{"fieldName":"91","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"456px","cursor column":"27",-
     A                                      "top":"330px","cursor row":"12","wi-
     A                                      dth":"8px","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 4":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"css class 5-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"paren-
     A                                      t tab panel":"W7354F02_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"SC-
     A                                      PC04","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCPC04","d-
     A                                      esignValue":"[SCPC04]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase","dataLe-
     A                                      ngth":"1"},"text transform":"upperc-
     A                                      ase","visibility":{"fieldName":"N91-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"477px","cursor-
     A                                       column":"30","top":"330px","cursor-
     A                                       row":"12","width":"8px","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom ')
     A                                  1  2HTML('Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 4":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"css class 5"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"parent-
     A                                       tab panel":"W7354F02_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      6":"profound-converted"},{"id":"con-
     A                                      stant32","field type":"output field-
     A                                      ","value":"Estimated audit      :",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"N91","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"309px","cursor column":"6","top-
     A                                      ":"350px","cursor row":"13","parent-
     A                                       tab panel":"W7354F02_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant33","field type":"output field-
     A                                      ","value":"Retrospective rated:","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"91","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "309px","cursor column":"6","top":"-
     A                                      350px","cursor row":"13","parent ta-
     A                                      b panel":"W7354F02_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPL05-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCPL05","desig-
     A                                      nValue":"[SCPL05]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase","dataLength-
     A                                      ":"1"},"text transform":"uppercase"-
     A                                      ,"visibility":{"fieldName":"91","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"456px","cursor colu-
     A                                      mn":"27","top":"350px","cursor row"-
     A                                      :"13","width":"8px","css class 3":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 4":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"cs-
     A                                      s class 5":{"fieldName":"N09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"parent tab panel":"W7354F02_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted"},-
     A                                      {"id":"SCPC05","field type":"textbo-
     A                                      x","css class":"input')
     A                                  1  2HTML('","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCPC05","designV-
     A                                      alue":"[SCPC05]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase","dataLength":-
     A                                      "1"},"text transform":"uppercase","-
     A                                      visibility":{"fieldName":"N91","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"477px","cursor colum-
     A                                      n":"30","top":"350px","cursor row":-
     A                                      "13","width":"8px","css class 3":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 4":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"css-
     A                                       class 5":{"fieldName":"N09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"UL","customFalse":""-
     A                                      },"parent tab panel":"W7354F02_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "id":"constant34","field type":"out-
     A                                      put field","value":"Policy exp date-
     A                                                    :","css class":"const-
     A                                      ant","left":"519px","cursor column"-
     A                                      :"36","top":"350px","cursor row":"1-
     A                                      3","parent tab panel":"W7354F02_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCCNDT","field type":"date f-
     A                                      ield","css class":"input","css clas-
     A                                      s 2":"date-field","value":{"fieldNa-
     A                                      me":"SCCNDT","designValue":"[SCCNDT-
     A                                      ]","dataType":"zoned","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00","dataLength":"8","decPos":"0","-
     A                                      edtWrd":"''  /  /    ''","dateForma-
     A                                      t":"m/d/Y"},"left":"736px","cursor -
     A                                      column":"67","top":"350px","cursor -
     A                                      row":"13","width":"71px","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 4":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"css class 5":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"parent tab panel":"W7354F0-
     A                                      2_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed"},{"id":"constant35","field type-
     A                                      ":"output field","val')
     A                                  1  2HTML('ue":"Disease B only       :",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"N91","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"309px","cursor column":"6","top-
     A                                      ":"370px","cursor row":"14","parent-
     A                                       tab panel":"W7354F02_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant36","field type":"output field-
     A                                      ","value":"Cancelled mid-term :","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"91","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "309px","cursor column":"6","top":"-
     A                                      370px","cursor row":"14","parent ta-
     A                                      b panel":"W7354F02_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPL06-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCPL06","desig-
     A                                      nValue":"[SCPL06]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase","dataLength-
     A                                      ":"1"},"text transform":"uppercase"-
     A                                      ,"visibility":{"fieldName":"91","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"456px","cursor colu-
     A                                      mn":"27","top":"370px","cursor row"-
     A                                      :"14","width":"8px","css class 3":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 4":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"cs-
     A                                      s class 5":{"fieldName":"N09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"parent tab panel":"W7354F02_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted"},-
     A                                      {"id":"SCPC06","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CPC06","designValue":"[SCPC06]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      ","dataLength":"1"},"text transform-
     A                                      ":"uppercase","visibility":{"fieldN-
     A                                      ame":"N91","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"477px-
     A                                      ","cursor column":"30","top":"370px-
     A                                      ","cursor row":"14","width":"8px","-
     A                                      css class 3":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"read only":{"fie')
     A                                  1  2HTML('ldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 4":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"css-
     A                                       class 5":{"fieldName":"N09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"UL","customFalse":""-
     A                                      },"parent tab panel":"W7354F02_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "id":"constant37","field type":"out-
     A                                      put field","value":"Risk ID#       -
     A                                                    :","css class":"const-
     A                                      ant","left":"519px","cursor column"-
     A                                      :"36","top":"370px","cursor row":"1-
     A                                      4","parent tab panel":"W7354F02_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCRSK#","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CRSK#","designValue":"[SCRSK#]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      ","dataLength":"9"},"text transform-
     A                                      ":"uppercase","left":"736px","curso-
     A                                      r column":"67","top":"370px","curso-
     A                                      r row":"14","width":"64px","css cla-
     A                                      ss 3":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"re-
     A                                      ad only":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 4":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"css class 5":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"parent tab panel":"W7354-
     A                                      F02_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"constant38","field ty-
     A                                      pe":"output field","value":"Excludi-
     A                                      ng disease    :","css class":"const-
     A                                      ant","visibility":{"fieldName":"N91-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"309px","cursor-
     A                                       column":"6","top":"390px","cursor -
     A                                      row":"15","parent tab panel":"W7354-
     A                                      F02_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"constant39","field ty-
     A                                      pe":"output field","value":"Managed-
     A                                       care org   :","css class":"constan-
     A                                      t","visibility":{"fieldName":"91","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"309px","cursor co-
     A                                      lumn":"6","top":"390px","cursor row-
     A                                      ":"15","parent tab panel":"W7354F02-
     A                                      _SCR02_MainTabPanel",')
     A                                  1  2HTML('"parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCPL-
     A                                      07","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCPL07","des-
     A                                      ignValue":"[SCPL07]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase","dataLeng-
     A                                      th":"1"},"text transform":"uppercas-
     A                                      e","visibility":{"fieldName":"91","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"456px","cursor co-
     A                                      lumn":"27","top":"390px","cursor ro-
     A                                      w":"15","width":"8px","css class 3"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 4":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      css class 5":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"parent tab panel":"W7354F02_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"SCPC07","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCPC07","designValue":"[SCPC07]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se","dataLength":"1"},"text transfo-
     A                                      rm":"uppercase","visibility":{"fiel-
     A                                      dName":"N91","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"477-
     A                                      px","cursor column":"30","top":"390-
     A                                      px","cursor row":"15","width":"8px"-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"read only":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 4":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"PR","cust-
     A                                      omFalse":""},"css class 5":{"fieldN-
     A                                      ame":"N09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"parent tab pane-
     A                                      l":"W7354F02_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant40",-
     A                                      "field type":"output field","value"-
     A                                      :"Pending file#                :","-
     A                                      css class":"constant","left":"519px-
     A                                      ","cursor column":"36","top":"390px-
     A                                      ","cursor row":"15","')
     A                                  1  2HTML('parent tab panel":"W7354F02_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCPND#","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCPND#","designValue":"[SCPND#]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se","dataLength":"10"},"text transf-
     A                                      orm":"uppercase","left":"736px","cu-
     A                                      rsor column":"67","top":"390px","cu-
     A                                      rsor row":"15","width":"71px","css -
     A                                      class 3":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"HI","customFalse":""},-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 4":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"css class 5":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"parent tab panel":"W7-
     A                                      354F02_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"id":"constant41","field-
     A                                       type":"output field","value":"Cler-
     A                                      ical error       :","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      N91","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"309px","cur-
     A                                      sor column":"6","top":"410px","curs-
     A                                      or row":"16","parent tab panel":"W7-
     A                                      354F02_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCPC08","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCPC08","designValue":"[SC-
     A                                      PC08]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase","dataLength":"1"},"text-
     A                                       transform":"uppercase","visibility-
     A                                      ":{"fieldName":"N91","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"477px","cursor column":"30","t-
     A                                      op":"410px","cursor row":"16","widt-
     A                                      h":"8px","css class 3":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 4":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"css class 5":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Val')
     A                                  1  2HTML('ues","customTrue":"UL","custo-
     A                                      mFalse":""},"parent tab panel":"W73-
     A                                      54F02_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted"},{"id":"constant42","field -
     A                                      type":"output field","value":"Unit -
     A                                      report resubmission(R/ ):","css cla-
     A                                      ss":"constant","left":"519px","curs-
     A                                      or column":"36","top":"410px","curs-
     A                                      or row":"16","parent tab panel":"W7-
     A                                      354F02_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCURRI","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCURRI","designValue":"[SC-
     A                                      URRI]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase","dataLength":"1"},"text-
     A                                       transform":"uppercase","left":"736-
     A                                      px","cursor column":"67","top":"410-
     A                                      px","cursor row":"16","width":"8px"-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"read only":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 4":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"PR","cust-
     A                                      omFalse":""},"css class 5":{"fieldN-
     A                                      ame":"N09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"parent tab pane-
     A                                      l":"W7354F02_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant43",-
     A                                      "field type":"output field","value"-
     A                                      :"Correction type      :","css clas-
     A                                      s":"constant","visibility":{"fieldN-
     A                                      ame":"91","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"295px"-
     A                                      ,"cursor column":"4","top":"430px",-
     A                                      "cursor row":"17","parent tab panel-
     A                                      ":"W7354F02_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant44","-
     A                                      field type":"output field","value":-
     A                                      "Retrospective rated  :","css class-
     A                                      ":"constant","visibility":{"fieldNa-
     A                                      me":"N91","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"309px"-
     A                                      ,"cursor column":"6","top":"430px",-
     A                                      "cursor row":"17","parent tab panel-
     A                                      ":"W7354F02_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCCTYP","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCCTYP","designValue"-
     A                                      :"[SCCTYP]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase","dataLength":"1"},-
     A                                      "text transform":"upp')
     A                                  1  2HTML('ercase","visibility":{"fieldN-
     A                                      ame":"91","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"456px"-
     A                                      ,"cursor column":"27","top":"430px"-
     A                                      ,"cursor row":"17","width":"8px","c-
     A                                      ss class 3":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"HI","customFalse":"-
     A                                      "},"read only":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"css class 4":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"css class 5":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"parent tab panel":-
     A                                      "W7354F02_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 6":"profound-
     A                                      -converted"},{"id":"SCPC09","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCPC09","designValue":"-
     A                                      [SCPC09]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"uppercase","dataLength":"1"},"t-
     A                                      ext transform":"uppercase","visibil-
     A                                      ity":{"fieldName":"N91","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"477px","cursor column":"30"-
     A                                      ,"top":"430px","cursor row":"17","w-
     A                                      idth":"8px","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 4":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"css class -
     A                                      5":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"pare-
     A                                      nt tab panel":"W7354F02_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"id":"c-
     A                                      onstant45","field type":"output fie-
     A                                      ld","value":"Replacement report(R/ -
     A                                      )      :","css class":"constant","l-
     A                                      eft":"519px","cursor column":"36","-
     A                                      top":"430px","cursor row":"17","par-
     A                                      ent tab panel":"W7354F02_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCRRPT","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCRRPT",-
     A                                      "designValue":"[SCRRPT]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"up')
     A                                  1  2HTML('percase","dataLength":"1"},"t-
     A                                      ext transform":"uppercase","left":"-
     A                                      736px","cursor column":"67","top":"-
     A                                      430px","cursor row":"17","width":"8-
     A                                      px","css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"read only":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 4":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"css class 5":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"parent tab p-
     A                                      anel":"W7354F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted"},{"id":"constant4-
     A                                      6","field type":"output field","val-
     A                                      ue":"Type of coverage     :","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"91","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"295-
     A                                      px","cursor column":"4","top":"450p-
     A                                      x","cursor row":"18","parent tab pa-
     A                                      nel":"W7354F02_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"constant47-
     A                                      ","field type":"output field","valu-
     A                                      e":"No excess payroll    :","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"N91","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"309-
     A                                      px","cursor column":"6","top":"450p-
     A                                      x","cursor row":"18","parent tab pa-
     A                                      nel":"W7354F02_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCID01","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCID01","designVal-
     A                                      ue":"[SCID01]","dataType":"zoned","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00","dataLength":"2","de-
     A                                      cPos":"0"},"visibility":{"fieldName-
     A                                      ":"91","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"456px","c-
     A                                      ursor column":"27","top":"450px","c-
     A                                      ursor row":"18","width":"15px","css-
     A                                       class 3":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 4":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"css class 5":{"fieldName":-
     A                                      "N09","dataType":"exp')
     A                                  1  2HTML('ression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      parent tab panel":"W7354F02_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"SCPC10","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCPC1-
     A                                      0","designValue":"[SCPC10]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase","d-
     A                                      ataLength":"1"},"text transform":"u-
     A                                      ppercase","visibility":{"fieldName"-
     A                                      :"N91","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"477px","c-
     A                                      ursor column":"30","top":"450px","c-
     A                                      ursor row":"18","width":"8px","css -
     A                                      class 3":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"HI","customFalse":""},-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 4":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"css class 5":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"parent tab panel":"W7-
     A                                      354F02_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"id":"constant48","field-
     A                                       type":"output field","value":"Plan-
     A                                       indicator       :","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      91","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"295px","curs-
     A                                      or column":"4","top":"470px","curso-
     A                                      r row":"19","parent tab panel":"W73-
     A                                      54F02_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"constant49","field -
     A                                      type":"output field","value":"Large-
     A                                       risk-","css class":"constant","vis-
     A                                      ibility":{"fieldName":"N91","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"309px","cursor column":-
     A                                      "6","top":"470px","cursor row":"19"-
     A                                      ,"parent tab panel":"W7354F02_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCID02","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCI-
     A                                      D02","designValue":"[SCID02]","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","data-
     A                                      Length":"2","decPos":"0"},"visibili-
     A                                      ty":{"fieldName":"91","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible')
     A                                  1  2HTML(' / hidden"},"left":"456px","c-
     A                                      ursor column":"27","top":"470px","c-
     A                                      ursor row":"19","width":"15px","css-
     A                                       class 3":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 4":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"css class 5":{"fieldName":-
     A                                      "N09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"parent tab panel":"W-
     A                                      7354F02_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 6":"profound-c-
     A                                      onverted"},{"id":"constant50","fiel-
     A                                      d type":"output field","value":"Sta-
     A                                      te effective date         :","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"91","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"519-
     A                                      px","cursor column":"36","top":"470-
     A                                      px","cursor row":"19","parent tab p-
     A                                      anel":"W7354F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCSTED","-
     A                                      field type":"date field","css class-
     A                                      ":"input","css class 2":"date-field-
     A                                      ","value":{"fieldName":"SCSTED","de-
     A                                      signValue":"[SCSTED]","dataType":"z-
     A                                      oned","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"false","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"-999.00","dataLength"-
     A                                      :"8","decPos":"0","edtWrd":"''  /  -
     A                                      /    ''","dateFormat":"m/d/Y"},"vis-
     A                                      ibility":{"fieldName":"91","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"736px","cursor column":"-
     A                                      67","top":"470px","cursor row":"19"-
     A                                      ,"width":"71px","css class 3":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 4-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"css cl-
     A                                      ass 5":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      parent tab panel":"W7354F02_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant51","field type":"output-
     A                                       field","value":"Non-standard type -
     A                                         :","css class":"constant","visib-
     A                                      ility":{"fieldName":"91","dataType"-
     A                                      :"expression","format')
     A                                  1  2HTML('ting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"295px"-
     A                                      ,"cursor column":"4","top":"490px",-
     A                                      "cursor row":"20","parent tab panel-
     A                                      ":"W7354F02_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant52","-
     A                                      field type":"output field","value":-
     A                                      "large deductible:","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      N91","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"344px","cur-
     A                                      sor column":"11","top":"490px","cur-
     A                                      sor row":"20","parent tab panel":"W-
     A                                      7354F02_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCID03","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCID03","designValue":"[S-
     A                                      CID03]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00","dataLength":"2","decPos":"-
     A                                      0"},"visibility":{"fieldName":"91",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"456px","cursor c-
     A                                      olumn":"27","top":"490px","cursor r-
     A                                      ow":"20","width":"15px","css class -
     A                                      3":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 4":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 5":{"fieldName":"N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"parent tab panel":"W7354F02-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 6":"profound-converte-
     A                                      d"},{"id":"SCPC11","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCPC11","designValue":"[SCPC11]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case","dataLength":"1"},"text trans-
     A                                      form":"uppercase","visibility":{"fi-
     A                                      eldName":"N91","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"4-
     A                                      77px","cursor column":"30","top":"4-
     A                                      90px","cursor row":"20","width":"8p-
     A                                      x","css class 3":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"HI","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class ')
     A                                  1  2HTML('4":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "css class 5":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"parent tab panel":"W7354F02_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"constant53","field type":-
     A                                      "output field","value":"Federal emp-
     A                                      loyer ID#         :","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "91","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"519px","cur-
     A                                      sor column":"36","top":"490px","cur-
     A                                      sor row":"20","parent tab panel":"W-
     A                                      7354F02_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCFEIN","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCFEIN","designValue":"[S-
     A                                      CFEIN]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00","dataLength":"9","decPos":"-
     A                                      0"},"visibility":{"fieldName":"91",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"736px","cursor c-
     A                                      olumn":"67","top":"490px","cursor r-
     A                                      ow":"20","width":"64px","css class -
     A                                      3":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 4":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 5":{"fieldName":"N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"parent tab panel":"W7354F02-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 6":"profound-converte-
     A                                      d"},{"id":"constant54","field type"-
     A                                      :"output field","value":"Approved m-
     A                                      anaged care:","css class":"constant-
     A                                      ","visibility":{"fieldName":"N91","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"309px","cursor co-
     A                                      lumn":"6","top":"510px","cursor row-
     A                                      ":"21","parent tab panel":"W7354F02-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCPC12","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCPC12","designValue":"[SCPC12]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"fa')
     A                                  1  2HTML('lse","trimTrailing":"true","t-
     A                                      extTransform":"uppercase","dataLeng-
     A                                      th":"1"},"text transform":"uppercas-
     A                                      e","visibility":{"fieldName":"N91",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"477px","cursor c-
     A                                      olumn":"30","top":"510px","cursor r-
     A                                      ow":"21","width":"8px","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 4":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "css class 5":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"parent tab panel":"W7354F02_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"btnSubmit","field type":"-
     A                                      button","value":"Enter","shortcut k-
     A                                      ey":"Enter","left":"14px","top":"15-
     A                                      0px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF03","field type":"button","v-
     A                                      alue":"Exit","shortcut key":"F3","l-
     A                                      eft":"14px","top":"183px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF12","fi-
     A                                      eld type":"button","value":"Cancel"-
     A                                      ,"shortcut key":"F12","left":"14px"-
     A                                      ,"top":"216px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"TxbUnCAud","field type"-
     A                                      :"textbox","css class":"textbox","v-
     A                                      alue":{"fieldName":"scUnAudit","dat-
     A                                      aLength":"30","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none","designValue":"-
     A                                      [scUnAudit]"},"left":"519px","top":-
     A                                      "330px","required":"false","parent -
     A                                      tab panel":"W7354F02_SCR02_MainTabP-
     A                                      anel","parent tab":"0","height":"10-
     A                                      px","read only":"true"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCNDT         8S 0H
     A            SCCTYP         1A  H
     A            SCFEIN         9S 0H
     A            SCID01         2S 0H
     A            SCID02         2S 0H
     A            SCID03         2S 0H
     A            SCPC01         1A  H
     A            SCPC02         1A  H
     A            SCPC03         1A  H
     A            SCPC04         1A  H
     A            SCPC05         1A  H
     A            SCPC06         1A  H
     A            SCPC07         1A  H
     A            SCPC08         1A  H
     A            SCPC09         1A  H
     A            SCPC10         1A  H
     A            SCPC11         1A  H
     A            SCPC12         1A  H
     A            SCPL01         1A  H
     A            SCPL02         1A  H
     A            SCPL03         1A  H
     A            SCPL04         1A  H
     A            SCPL05         1A  H
     A            SCPL06         1A  H
     A            SCPL07         1A  H
     A            SCPND#        10A  H
     A            SCPTYP         2S 0H
     A            SCRPMY         6S 0H
     A            SCRRPT         1A  H
     A            SCRSK#         9A  H
     A            SCSTED         8S 0H
     A            SCTERM         1S 0H
     A            SCUNAUDIT     30A  H
     A            SCURRI         1A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFNAM    R        H      REFFLD(NM60)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR03
     A  09                                  CA01
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"W7354F02_SCR03_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"W7354F02_SCR03_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W7354F02_SCR03_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"W7354F02_SCR03_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"W7354F02_SCR03_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"W7354F02_S')
     A                                  1  2HTML('CR03_BtnRefresh","tool tip":"-
     A                                      Refresh","onclick":"SystemToolbarRe-
     A                                      fresh","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/r-
     A                                      efresh.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1092px","id":"W7354F02_SCR03_Btn-
     A                                      Search","tool tip":"Search","onclic-
     A                                      k":"SystemToolbarSearch","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/search.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1118px","id":"W-
     A                                      7354F02_SCR03_BtnDiaryItems","tool -
     A                                      tip":"Diary/Work Items - IDARTS","o-
     A                                      nclick":"SystemToolbarDiary","backg-
     A                                      round image":{"fieldName":"DryIcnUR-
     A                                      L","dataLength":"128","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"}},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1144px","id":"W735-
     A                                      4F02_SCR03_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"W7354F02_S-
     A                                      CR03_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"W7354F02_SCR03_I')
     A                                  1  2HTML('mgSysToolBottom","field type"-
     A                                      :"image","image source":"/profoundu-
     A                                      i/userdata/images/systool/butbarbot-
     A                                      .png","left":"1036px","top":"64px",-
     A                                      "width":"187px","locked in place":"-
     A                                      true","css class":"stationary","vis-
     A                                      ibility":"hidden"},{"id":"W7354F02_-
     A                                      SCR03_MainTabPanel","field type":"t-
     A                                      ab panel","tab panel style":"Transf-
     A                                      orm","tab names":{"fieldName":"SCPR-
     A                                      DS","designValue":"[SCPRDS]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"active tab":"0"-
     A                                      ,"left":"250px","top":"70px","width-
     A                                      ":"970px","height":"657px","z index-
     A                                      ":"8","locked in place":"true","css-
     A                                       class":"tab-panel","css class 2":"-
     A                                      stationary"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W7354F02_SCR03_BtnHiddenSave","val-
     A                                      ue":"btnSave","top":"100px","respon-
     A                                      se":{"fieldName":"btnSave","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant55","field type":"output fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"110px","cursor row":"1",-
     A                                      "css class":"top-line","value":"js:-
     A                                       currentUser()","css class 2":"outp-
     A                                      ut-field","parent tab panel":"W7354-
     A                                      F02_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"SCR03_SCCONM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCCONM","designValue":"[SCC-
     A                                      ONM]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"414p-
     A                                      x","cursor column":"21","top":"110p-
     A                                      x","cursor row":"1","css class 2":"-
     A                                      top-line","css class 3":"HI","paren-
     A                                      t tab panel":"W7354F02_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       4":"profound-converted"},{"id":"co-
     A                                      nstant56","field type":"output fiel-
     A                                      d","left":"778px","cursor column":"-
     A                                      73","top":"110px","cursor row":"1",-
     A                                      "css class":"top-line","value":"js:-
     A                                       currentDate()","css class 2":"outp-
     A                                      ut-field","parent tab panel":"W7354-
     A                                      F02_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"W7354F02_SCR03_fkeyMe-
     A                                      nu","field type":"menu","left":"10p-
     A                                      x","top":"120px","height":"350px","-
     A                                      width":"230px","hover background co-
     A                                      lor":"#9AAA61","hover text color":"-
     A                                      #FFFFFF","border color":"#4C6106","-
     A                                      menu option indent":"10px","backgro-
     A                                      und color":"#758B27","css class":"a-
     A                                      ction-menu","css class 2":"stationa-
     A                                      ry","z index":"101"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class')
     A                                  1  2HTML('":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W7354F-
     A                                      02_SCR03_BtnHiddenRefresh","value":-
     A                                      "btnRefresh","top":"125px","respons-
     A                                      e":{"fieldName":"btnRefresh","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCR03_Q1PGM","field type":"output -
     A                                      field","value":{"fieldName":"Q1PGM"-
     A                                      ,"designValue":"[Q1PGM]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"css class":"output-field-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"W7354F02_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR03_SCPRDS","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCPR-
     A                                      DS","designValue":"[SCPRDS]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"414px","cursor c-
     A                                      olumn":"21","top":"130px","cursor r-
     A                                      ow":"2","css class 2":"HI","parent -
     A                                      tab panel":"W7354F02_SCR03_MainTabP-
     A                                      anel","parent tab":"0","visibility"-
     A                                      :"hidden","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant57","fiel-
     A                                      d type":"output field","value":"SCR-
     A                                      03","css class":"constant","left":"-
     A                                      799px","cursor column":"76","top":"-
     A                                      130px","cursor row":"2","parent tab-
     A                                       panel":"W7354F02_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCR03_S-
     A                                      CMODE","field type":"output field",-
     A                                      "value":{"fieldName":"SCMODE","desi-
     A                                      gnValue":"[SCMODE]","refField":"PGM-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"764px","cursor column":"71-
     A                                      ","top":"150px","cursor row":"3","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"W7354F02_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W7354F02_SCR03_BtnHiddenSearch","-
     A                                      value":"btnSearch","top":"150px","r-
     A                                      esponse":{"fieldName":"btnSearch","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"W7354F02_SCR0-
     A                                      3_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},')
     A                                  1  2HTML('{"id":"constant58","field typ-
     A                                      e":"output field","value":"Group:",-
     A                                      "css class":"constant","left":"281p-
     A                                      x","cursor column":"2","top":"190px-
     A                                      ","cursor row":"5","parent tab pane-
     A                                      l":"W7354F02_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCR03_SCFND"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCFND","designValue-
     A                                      ":"[SCFND]","refField":"FND","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00"},"c-
     A                                      ss class":"output-field","left":"33-
     A                                      0px","cursor column":"9","top":"190-
     A                                      px","cursor row":"5","width":"21px"-
     A                                      ,"text align":"right","parent tab p-
     A                                      anel":"W7354F02_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCR03_SCF-
     A                                      NAM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCFNAM","design-
     A                                      Value":"[SCFNAM]","refField":"NM60"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"358px","cursor column":"13"-
     A                                      ,"top":"190px","cursor row":"5","pa-
     A                                      rent tab panel":"W7354F02_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W7354F02_SCR03_Btn-
     A                                      HiddenSystemMessages","value":"btnM-
     A                                      essage","top":"200px","response":{"-
     A                                      fieldName":"btnMessage","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant59","field type":"output field"-
     A                                      ,"value":"Reporting Month/Year:","c-
     A                                      ss class":"constant","left":"281px"-
     A                                      ,"cursor column":"2","top":"210px",-
     A                                      "cursor row":"6","parent tab panel"-
     A                                      :"W7354F02_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCR03_SCRPMY",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCRPMY","designValue-
     A                                      ":"[SCRPMY]","dataType":"zoned","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"true","zeroFill":"t-
     A                                      rue","curSym":"","units":"","negNum-
     A                                      ":"-999.00","dataLength":"6","decPo-
     A                                      s":"0","edtWrd":"''  /    ''"},"css-
     A                                       class":"output-field","left":"435p-
     A                                      x","cursor column":"24","top":"210p-
     A                                      x","cursor row":"6","width":"49px",-
     A                                      "text align":"right","parent tab pa-
     A                                      nel":"W7354F02_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W7354F02_SCR03_')
     A                                  1  2HTML('BtnHiddenWorkSubmitJob","valu-
     A                                      e":"btnWrksbmjob","top":"225px","re-
     A                                      sponse":{"fieldName":"btnWrkJob","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant60","field type":"outp-
     A                                      ut field","value":"Deductible type -
     A                                                   :","css class":"consta-
     A                                      nt","left":"302px","cursor column":-
     A                                      "5","top":"250px","cursor row":"8",-
     A                                      "parent tab panel":"W7354F02_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCDTYP","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCDT-
     A                                      YP","designValue":"[SCDTYP]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00","dataL-
     A                                      ength":"4","decPos":"0"},"left":"51-
     A                                      9px","cursor column":"36","top":"25-
     A                                      0px","cursor row":"8","width":"29px-
     A                                      ","css class 3":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"read only":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 4":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"css class 5":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"parent tab pan-
     A                                      el":"W7354F02_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 6":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W7354F02_SCR03_BtnHiddenWorkPr-
     A                                      interOutput","value":"btnWrkprtout"-
     A                                      ,"top":"250px","response":{"fieldNa-
     A                                      me":"btnWrkPrnt","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant61"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Deductible percent           :",-
     A                                      "css class":"constant","left":"302p-
     A                                      x","cursor column":"5","top":"270px-
     A                                      ","cursor row":"9","parent tab pane-
     A                                      l":"W7354F02_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCDPCT","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCDPCT","designValue-
     A                                      ":"[SCDPCT]","dataType":"zoned","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00","dataLength":"2","dec-
     A                                      Pos":"0"},"left":"519px","cursor co-
     A                                      lumn":"36","top":"270px","cursor ro-
     A                                      w":"9","width":"15px"')
     A                                  1  2HTML(',"css class 3":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 4":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR"-
     A                                      ,"customFalse":""},"css class 5":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"parent ta-
     A                                      b panel":"W7354F02_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W7354F02_SCR03_BtnHiddenI-
     A                                      mageQueue","value":"btnImgQue","top-
     A                                      ":"275px","response":{"fieldName":"-
     A                                      btnImgQue","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant62","fiel-
     A                                      d type":"output field","value":"Ded-
     A                                      uctible amount/claim      :","css c-
     A                                      lass":"constant","left":"302px","cu-
     A                                      rsor column":"5","top":"290px","cur-
     A                                      sor row":"10","parent tab panel":"W-
     A                                      7354F02_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCDAMP","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCDAMP","designValue":"[S-
     A                                      CDAMP]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","dataLength":"9","decPos":-
     A                                      "0"},"left":"519px","cursor column"-
     A                                      :"36","top":"290px","cursor row":"1-
     A                                      0","width":"64px","css class 3":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"read only":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       4":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"css -
     A                                      class 5":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"parent tab panel":"W7354F02_SCR03-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 6":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W7354F02_SCR03-
     A                                      _BtnHiddenHelp","valu')
     A                                  1  2HTML('e":"btnHelp","top":"300px","r-
     A                                      esponse":{"fieldName":"btnHelp","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant63","field type":"outpu-
     A                                      t field","value":"Deductible amount-
     A                                      -aggregate. :","css class":"constan-
     A                                      t","left":"302px","cursor column":"-
     A                                      5","top":"310px","cursor row":"11",-
     A                                      "parent tab panel":"W7354F02_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCDAGG","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCDA-
     A                                      GG","designValue":"[SCDAGG]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"9","decPos":"0"},"left":"5-
     A                                      19px","cursor column":"36","top":"3-
     A                                      10px","cursor row":"11","width":"64-
     A                                      px","css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"read only":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 4":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"css class 5":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"parent tab p-
     A                                      anel":"W7354F02_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted"},{"id":"constant6-
     A                                      4","field type":"output field","val-
     A                                      ue":"Previous report number       :-
     A                                      ","css class":"constant","left":"30-
     A                                      2px","cursor column":"5","top":"350-
     A                                      px","cursor row":"13","parent tab p-
     A                                      anel":"W7354F02_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCPRP#","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCPRP#","designVa-
     A                                      lue":"[SCPRP#]","dataType":"zoned",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"-999.00","dataLength":"2","-
     A                                      decPos":"0"},"left":"519px","cursor-
     A                                       column":"36","top":"350px","cursor-
     A                                       row":"13","width":"15px","css clas-
     A                                      s 3":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 4":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","')
     A                                  1  2HTML('customFalse":""},"css class 5-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"paren-
     A                                      t tab panel":"W7354F02_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"co-
     A                                      nstant65","field type":"output fiel-
     A                                      d","value":"Previous correction ind-
     A                                      icator:","css class":"constant","le-
     A                                      ft":"302px","cursor column":"5","to-
     A                                      p":"370px","cursor row":"14","paren-
     A                                      t tab panel":"W7354F02_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      PCOR","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCPCOR","d-
     A                                      esignValue":"[SCPCOR]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase","dataLe-
     A                                      ngth":"1"},"text transform":"upperc-
     A                                      ase","left":"519px","cursor column"-
     A                                      :"36","top":"370px","cursor row":"1-
     A                                      4","width":"8px","css class 3":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      4":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"css c-
     A                                      lass 5":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "parent tab panel":"W7354F02_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted"},{"i-
     A                                      d":"constant66","field type":"outpu-
     A                                      t field","value":"Previous carrier -
     A                                      code        :","css class":"constan-
     A                                      t","left":"302px","cursor column":"-
     A                                      5","top":"390px","cursor row":"15",-
     A                                      "parent tab panel":"W7354F02_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCPCAR","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCPC-
     A                                      AR","designValue":"[SCPCAR]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"5","decPos":"0"},"left":"5-
     A                                      19px","cursor column":"36","top":"3-
     A                                      90px","cursor row":"15","width":"36-
     A                                      px","css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"read only":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class')
     A                                  1  2HTML(' 4":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 5":{"fieldName":"N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"parent tab panel":"W7354F02-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 6":"profound-converte-
     A                                      d"},{"id":"constant67","field type"-
     A                                      :"output field","value":"Previous p-
     A                                      olicy number       :","css class":"-
     A                                      constant","left":"302px","cursor co-
     A                                      lumn":"5","top":"410px","cursor row-
     A                                      ":"16","parent tab panel":"W7354F02-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCPPOL","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCPPOL","designValue":"[SCPPOL]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case","dataLength":"18"},"text tran-
     A                                      sform":"uppercase","left":"519px","-
     A                                      cursor column":"36","top":"410px","-
     A                                      cursor row":"16","width":"127px","c-
     A                                      ss class 3":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"HI","customFalse":"-
     A                                      "},"read only":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"css class 4":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"css class 5":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"parent tab panel":-
     A                                      "W7354F02_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 6":"profound-
     A                                      -converted"},{"id":"constant68","fi-
     A                                      eld type":"output field","value":"P-
     A                                      revious effective date      :","css-
     A                                       class":"constant","left":"302px","-
     A                                      cursor column":"5","top":"430px","c-
     A                                      ursor row":"17","parent tab panel":-
     A                                      "W7354F02_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCPEFD","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCPEFD","designValue":"-
     A                                      [SCPEFD]","dataType":"zoned","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"false","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"-999.00","dataLength":"6","decPos-
     A                                      ":"0"},"left":"519px","cursor colum-
     A                                      n":"36","top":"430px","cursor row":-
     A                                      "17","width":"43px","css class 3":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":')
     A                                  1  2HTML('""},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 4":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 5":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"parent tab -
     A                                      panel":"W7354F02_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      69","field type":"output field","va-
     A                                      lue":"Previous exposure state      -
     A                                      :","css class":"constant","left":"3-
     A                                      02px","cursor column":"5","top":"45-
     A                                      0px","cursor row":"18","parent tab -
     A                                      panel":"W7354F02_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCPEXP",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCPEXP","designV-
     A                                      alue":"[SCPEXP]","dataType":"zoned"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"-999.00","dataLength":"2",-
     A                                      "decPos":"0"},"left":"519px","curso-
     A                                      r column":"36","top":"450px","curso-
     A                                      r row":"18","width":"15px","css cla-
     A                                      ss 3":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"re-
     A                                      ad only":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 4":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"css class 5":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"parent tab panel":"W7354-
     A                                      F02_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"constant70","field ty-
     A                                      pe":"output field","value":"Previou-
     A                                      s certificate #       :","css class-
     A                                      ":"constant","left":"302px","cursor-
     A                                       column":"5","top":"470px","cursor -
     A                                      row":"19","parent tab panel":"W7354-
     A                                      F02_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCPCER","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SCPCER","designValue":"[SCPCE-
     A                                      R]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase","dataLength":"7"},"text tr-
     A                                      ansform":"uppercase","left":"519px"-
     A                                      ,"cursor column":"36","top":"470px"-
     A                                      ,"cursor row":"19","width":"50px","-
     A                                      css class 3":{"fieldN')
     A                                  1  2HTML('ame":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 4":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"css-
     A                                       class 5":{"fieldName":"N09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"UL","customFalse":""-
     A                                      },"parent tab panel":"W7354F02_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "id":"constant71","field type":"out-
     A                                      put field","value":"ASWG unit submi-
     A                                      ssion         :","css class":"const-
     A                                      ant","left":"302px","cursor column"-
     A                                      :"5","top":"510px","cursor row":"21-
     A                                      ","parent tab panel":"W7354F02_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCASWG","field type":"checkbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"checkbox","value":{"fieldName":"-
     A                                      SCASWG","designValue":"[SCASWG]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e","dataLength":"1"},"text transfor-
     A                                      m":"uppercase","left":"519px","top"-
     A                                      :"510px","width":"8px","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 4":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "css class 5":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"parent tab panel":"W7354F02_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      ","checked value":"Y","unchecked va-
     A                                      lue":"N"},{"id":"btnSubmit","field -
     A                                      type":"button","value":"Enter","sho-
     A                                      rtcut key":"Enter","left":"14px","t-
     A                                      op":"150px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF03","field type":"but-
     A                                      ton","value":"Exit","shortcut key":-
     A                                      "F3","left":"14px","top":"183px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnCF-
     A                                      12","field type":"button","value":"-
     A                                      Cancel","shortcut key":"F12","left"-
     A                                      :"14px","top":"216px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"')
     A                                  1  2HTML('true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCASWG         1A  H
     A            SCDAGG         9S 0H
     A            SCDAMP         9S 0H
     A            SCDPCT         2S 0H
     A            SCDTYP         4S 0H
     A            SCPCAR         5S 0H
     A            SCPCER         7A  H
     A            SCPCOR         1A  H
     A            SCPEFD         6S 0H
     A            SCPEXP         2S 0H
     A            SCPPOL        18A  H
     A            SCPRP#         2S 0H
     A            SCRPMY         6S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFNAM    R        H      REFFLD(NM60)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
