     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20
     A  21 22 23
     A  24 25 26                            CA01(10 'Response Indicator *IN10')
     A  27 71 72
     A  73 74 75
     A  76 78 43                            CA02(11 'Response Indicator *IN11')
     A  59 67 68
     A  69 77                               CA03(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                      SETOF(74 'Response Indicator *IN74')
     A                                      SETOF(75 'Response Indicator *IN75')
     A                                      SETOF(76 'Response Indicator *IN76')
     A                                      SETOF(78 'Response Indicator *IN78')
     A                                  1  2HTML('QPUIREC10   RROWS      2    C-
     A                                      1    1C2    24 RERRMSGID  5    C5  -
     A                                        SCCO#C7    WCR0507C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     22RERRMSG-
     A                                      ID  5    C5    SCFNDC7    WCR0508C6-
     A                                          WMESGGC5    *LIBLC0    E1    3 -
     A                                          23RERRMSGID  5    C6    SCOTYPC-
     A                                      7    WC31358C6    WMESGGC5    *LIBL-
     A                                      C0    E1    3     71RERRMSGID  5   -
     A                                       C5    SCLIBC7    WCR0826C6    WMES-
     A                                      GGC5    *LIBLC0    E1    3     72RE-
     A                                      RRMSGID  5    C6    SCFNAMC7    WC3-
     A                                      1360C6    WMESGGC5    *LIBLC0    E1-
     A                                          3     73RERRMSGID  5    C4    S-
     A                                      CSTC7    WCR0504C6    WMESGGC5    *-
     A                                      LIBLC0    E1    3     26RERRMSGID  -
     A                                      5    C4    SCSTC7    WC30232C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     2-
     A                                      7RERRMSGID  5    C4    SCERC7    WC-
     A                                      R1087C6    WMESGGC5    *LIBLC0    E-
     A                                      1    3     77RERRMSGID  5    C6    -
     A                                      SCPEEPC7    WCR1241C6    WMESGGC5  -
     A                                        *LIBLC0    E1    3     43')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN26","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN71","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N72","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN7-
     A                                      3","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN74"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN75","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN76","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN78","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"retur-
     A                                      n cursor record":{"fieldName":"HREC-
     A                                      ","dataLength":"10","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none"},"return cursor-
     A                                       field":{"fieldName":"HFLD","dataLe-
     A                                      ngth":"10","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"none"},"valid command key":{"f-
     A                                      ieldName":"*IN11","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"overlay range":"1-
     A                                      -24"},"items":[{"id":"HREC","field -
     A                                      type":"output field","visibility":"-
     A                                      hidden","value":{"fieldName":"HREC"-
     A                                      ,"designValue":"[HREC]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"none","dataLength-
     A                                      ":"10"},"left":"0px","top":"-30px",-
     A                                      "css class":"profound')
     A                                  1  2HTML('-converted"},{"id":"HFLD","fi-
     A                                      eld type":"output field","visibilit-
     A                                      y":"hidden","value":{"fieldName":"H-
     A                                      FLD","designValue":"[HFLD]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"none","dataLe-
     A                                      ngth":"10"},"left":"0px","top":"-30-
     A                                      px","css class":"profound-converted-
     A                                      "},{"id":"W7417F_SCR01_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"W7417F_SCR01-
     A                                      _action","field type":"html contain-
     A                                      er","white space":"normal","left":"-
     A                                      0px","top":"10px","width":"230px","-
     A                                      css class":"action-panel-converted"-
     A                                      ,"height":"700px","html":"<div clas-
     A                                      s=\"top\"></div><div class=\"imaget-
     A                                      op\"><img src=\"/profoundui/userdat-
     A                                      a/images/bar_top.png\" /></div><div-
     A                                       class=\"menulinks\"></div><div cla-
     A                                      ss=\"imagebottom\"><img src=\"/prof-
     A                                      oundui/userdata/images/bar_bottom.p-
     A                                      ng\" /></div><div class=\"bottom\">-
     A                                      </div>"},{"field type":"icon menu b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      32px","z index":"20","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1170px","i-
     A                                      d":"W7417F_SCR01_BtnIconMenuSystemT-
     A                                      ools","tool tip":"System Tools","ic-
     A                                      on source":"/profoundui/userdata/im-
     A                                      ages/systool/systools.png","data fu-
     A                                      nction":"SystemToolbarSystools","sh-
     A                                      ow down arrow":"Yes"},{"field type"-
     A                                      :"panel","panel style":"TransformBu-
     A                                      ttonBar","id":"W7417F_SCR01_ButtonB-
     A                                      ar","top":"35px","left":"1036px","w-
     A                                      idth":"187px","height":"28px","css -
     A                                      class":"stationary","visibility":"h-
     A                                      idden","locked in place":"true"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1040px","id":"W-
     A                                      7417F_SCR01_BtnSave","tool tip":"Sa-
     A                                      ve","onclick":"SystemToolbarSave","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/save.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"')
     A                                  1  2HTML('hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"W7417F_SC-
     A                                      R01_BtnRefresh","tool tip":"Refresh-
     A                                      ","onclick":"SystemToolbarRefresh",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/refresh.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1092-
     A                                      px","id":"W7417F_SCR01_BtnSearch","-
     A                                      tool tip":"Search","onclick":"Syste-
     A                                      mToolbarSearch","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/search.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1118px","id":"W7417F_SCR-
     A                                      01_BtnDiaryItems","tool tip":"Diary-
     A                                      /Work Items - IDARTS","onclick":"Sy-
     A                                      stemToolbarDiary","background image-
     A                                      ":{"fieldName":"DryIcnURL","dataLen-
     A                                      gth":"128","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"}},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1144px","id":"W7417F_SCR01_Bt-
     A                                      nSystemMessages","tool tip":"System-
     A                                       Messages","onclick":"SystemToolbar-
     A                                      Messages","background image":{"fiel-
     A                                      dName":"MsgIcnURL","dataLength":"12-
     A                                      8","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"}},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      96px","id":"W7417F_SCR01_BtnHelp","-
     A                                      tool tip":"Help","onclick":"SystemT-
     A                                      oolbarHelp","background image":"url-
     A                                      (''/profoundui/userda')
     A                                  1  2HTML('ta/images/systool/help.png'')-
     A                                      "},{"id":"W7417F_SCR01_ImgSysToolBo-
     A                                      ttom","field type":"image","image s-
     A                                      ource":"/profoundui/userdata/images-
     A                                      /systool/butbarbot.png","left":"103-
     A                                      6px","top":"64px","width":"187px","-
     A                                      locked in place":"true","css class"-
     A                                      :"stationary","visibility":"hidden"-
     A                                      },{"id":"W7417F_SCR01_MainTabPanel"-
     A                                      ,"field type":"tab panel","tab pane-
     A                                      l style":"Transform","tab names":{"-
     A                                      fieldName":"SCPRDS","dataLength":"4-
     A                                      0","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"},"active tab":"0","left":"-
     A                                      250px","top":"70px","width":"970px"-
     A                                      ,"height":"657px","z index":"8","lo-
     A                                      cked in place":"true","css class":"-
     A                                      tab-panel","css class 2":"stationar-
     A                                      y"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W7417F_S-
     A                                      CR01_BtnHiddenSave","value":"btnSav-
     A                                      e","top":"100px","response":{"field-
     A                                      Name":"btnSave","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant1","-
     A                                      field type":"output field","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      10px","cursor row":"1","css class":-
     A                                      "top-line","value":"js: currentUser-
     A                                      ()","css class 2":"output-field","p-
     A                                      arent tab panel":"W7417F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      SCCONM","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCCONM","des-
     A                                      ignValue":"[SCCONM]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"110px","cursor row":"1",-
     A                                      "css class 2":"top-line","css class-
     A                                       3":"HI","description":"COMPANY NAM-
     A                                      E","parent tab panel":"W7417F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 4":"profound-converted"},{"-
     A                                      id":"constant2","field type":"outpu-
     A                                      t field","left":"778px","cursor col-
     A                                      umn":"73","top":"110px","cursor row-
     A                                      ":"1","css class":"top-line","value-
     A                                      ":"js: currentDate()","css class 2"-
     A                                      :"output-field","parent tab panel":-
     A                                      "W7417F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"W7417F_SCR01_fkey-
     A                                      Menu","field type":"menu","left":"1-
     A                                      0px","top":"120px","height":"350px"-
     A                                      ,"width":"230px","hover background -
     A                                      color":"#9AAA61","hover text color"-
     A                                      :"#FFFFFF","border color":"#4C6106"-
     A                                      ,"menu option indent":"10px","backg-
     A                                      round color":"#758B27","css class":-
     A                                      "action-menu","css class 2":"statio-
     A                                      nary","z index":"101"},{"field type-
     A                                      ":"button","left":"11')
     A                                  1  2HTML('40px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W741-
     A                                      7F_SCR01_BtnHiddenRefresh","value":-
     A                                      "btnRefresh","top":"125px","respons-
     A                                      e":{"fieldName":"btnRefresh","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "Q1PGM","field type":"output field"-
     A                                      ,"value":{"fieldName":"Q1PGM","desi-
     A                                      gnValue":"[Q1PGM]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"130px","cursor row":"2","parent -
     A                                      tab panel":"W7417F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt3","field type":"output field","v-
     A                                      alue":"WCPOLS Data Transmission Pro-
     A                                      mpt","css class":"constant","left":-
     A                                      "442px","cursor column":"25","top":-
     A                                      "130px","cursor row":"2","css class-
     A                                       2":"HI","parent tab panel":"W7417F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant4","field type":-
     A                                      "output field","value":"SCR01","css-
     A                                       class":"constant","left":"799px","-
     A                                      cursor column":"76","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "W7417F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      7417F_SCR01_BtnHiddenSearch","value-
     A                                      ":"btnSearch","top":"150px","respon-
     A                                      se":{"fieldName":"btnSearch","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "constant5","field type":"output fi-
     A                                      eld","value":"Type selections, pres-
     A                                      s Enter.","css class":"constant","l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"170px","cursor row":"4","css c-
     A                                      lass 2":"BLU","parent tab panel":"W-
     A                                      7417F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W74-
     A                                      17F_SCR01_BtnHiddenDiaryItems","val-
     A                                      ue":"btnDiary","top":"175px","respo-
     A                                      nse":{"fieldName":"btnDiary","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W7417F_SCR01_BtnHi-
     A                                      ddenSystemMessages","value":"btnMes-
     A                                      sage","top":"200px","response":{"fi-
     A                                      eldName":"btnMessage"')
     A                                  1  2HTML(',"dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"SCCO#","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCCO#","designValue":"[SCCO#]"-
     A                                      ,"dataType":"zoned","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"true","curSy-
     A                                      m":"","units":"","negNum":"-999.00"-
     A                                      ,"dataLength":"3","decPos":"0"},"le-
     A                                      ft":"460px","cursor column":"26","t-
     A                                      op":"210px","cursor row":"6","width-
     A                                      ":"22px","text align":"right","css -
     A                                      class 3":"UL","css class 4":"HI","s-
     A                                      et focus":{"fieldName":"74","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "error message id":"WCR0507","error-
     A                                       message file":"WMESGG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"22","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"1 message","parent tab panel":-
     A                                      "W7417F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 5":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      7417F_SCR01_BtnHiddenWorkSubmitJob"-
     A                                      ,"value":"btnWrksbmjob","top":"225p-
     A                                      x","response":{"fieldName":"btnWrkJ-
     A                                      ob","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"SCFND","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCFND","designValue":"[SCFND]","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"999.00","d-
     A                                      ataLength":"3","decPos":"0","numBla-
     A                                      nkFill":"true"},"left":"460px","cur-
     A                                      sor column":"26","top":"235px","cur-
     A                                      sor row":"8","width":"22px","text a-
     A                                      lign":"right","css class 3":"profou-
     A                                      nd-converted","set focus":{"fieldNa-
     A                                      me":"75","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"error message id":-
     A                                      "WCR0508","error message file":"WME-
     A                                      SGG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"2-
     A                                      3","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"1 message","pa-
     A                                      rent tab panel":"W7417F_SCR01_MainT-
     A                                      abPanel","parent tab":"0"},{"id":"c-
     A                                      onstant8","field type":"output fiel-
     A                                      d","value":"(Leave blank to process-
     A                                       multiple groups)","css class":"con-
     A                                      stant","left":"500px","cursor colum-
     A                                      n":"41","top":"235px","cursor row":-
     A                                      "8","parent tab panel":"W7417F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","w')
     A                                  1  2HTML('idth":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W7417F_SCR01_BtnHiddenWorkPr-
     A                                      interOutput","value":"btnWrkprtout"-
     A                                      ,"top":"250px","response":{"fieldNa-
     A                                      me":"btnWrkPrnt","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"W7417F_SCR01_BtnHiddenImageQue-
     A                                      ue","value":"btnImgQue","top":"275p-
     A                                      x","response":{"fieldName":"btnImgQ-
     A                                      ue","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"SCOTYP","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCOTYP","designValue":"[SCOTYP]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case","dataLength":"1"},"text trans-
     A                                      form":"uppercase","left":"935px","c-
     A                                      ursor column":"26","top":"115px","c-
     A                                      ursor row":"10","width":"8px","css -
     A                                      class 3":"HI","set focus":{"fieldNa-
     A                                      me":"76","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"error message id":-
     A                                      "WC31358","error message file":"WME-
     A                                      SGG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"7-
     A                                      1","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"1 message","de-
     A                                      scription":"output type","parent ta-
     A                                      b panel":"W7417F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 4":"p-
     A                                      rofound-converted","visibility":"hi-
     A                                      dden","disabled":"true","height":"1-
     A                                      5px"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W7417F-
     A                                      _SCR01_BtnHiddenHelp","value":"btnH-
     A                                      elp","top":"300px","response":{"fie-
     A                                      ldName":"btnHelp","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"SCLIB","fi-
     A                                      eld type":"text area","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCLIB","dataLengt-
     A                                      h":"250","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"uppercase","designValue":"-
     A                                      [SCLIB]"},"text transform":"none","-
     A                                      left":"460px","cursor column":"26",-
     A                                      "top":"260px","cursor row":"12","wi-
     A                                      dth":"580px","error messages":"1 me-
     A                                      ssage","description":"file library"-
     A                                      ,"parent tab panel":"W7417F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted","heig-
     A                                      ht":"40px","error message id":"WCR0-
     A                                      826","error message f')
     A                                  1  2HTML('ile":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"72","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error enhanced m-
     A                                      ode":"0"},{"id":"SCFNAM","field typ-
     A                                      e":"text area","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCFNAM","dataLength":"10-
     A                                      0","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"uppercase","designValue":"[SCFNA-
     A                                      M]"},"text transform":"none","left"-
     A                                      :"460px","cursor column":"26","top"-
     A                                      :"315px","cursor row":"14","width":-
     A                                      "580px","error messages":"1 message-
     A                                      ","description":"file name","parent-
     A                                       tab panel":"W7417F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted","height":"40p-
     A                                      x","error message id":"WC31360","er-
     A                                      ror message file":"WMESGG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"73","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error enh-
     A                                      anced mode":"0"},{"id":"SCST","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCST","designValue":"-
     A                                      [SCST]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"uppercase","dataLength":"2"},"tex-
     A                                      t transform":"uppercase","visibilit-
     A                                      y":{"fieldName":"59","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"460px","cursor column":"26","t-
     A                                      op":"370px","cursor row":"16","widt-
     A                                      h":"15px","set focus":{"fieldName":-
     A                                      "78","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"WCR-
     A                                      0504","error message file":"WMESGG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"26","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"2 messages","error-
     A                                       message id 2":"WC30232","error mes-
     A                                      sage file 2":"WMESGG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"27","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"parent tab-
     A                                       panel":"W7417F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant1-
     A                                      4","field type":"output field","val-
     A                                      ue":"(leave blank for NCCI)","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"59","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"490-
     A                                      px","cursor column":"41","top":"375-
     A                                      px","cursor row":"16","parent tab p-
     A                                      anel":"W7417F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id')
     A                                  1  2HTML('":"SCER","field type":"select-
     A                                       box","css class":"input","value":{-
     A                                      "fieldName":"SCER","dataLength":"1"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[SCER]"},"lef-
     A                                      t":"460px","top":"395px","css class-
     A                                       2":"dropdown","choices":"All recor-
     A                                      ds,Interstate rated only,Intrastate-
     A                                       rated only","parent tab panel":"W7-
     A                                      417F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","choice values":",1,3","erro-
     A                                      r message id":"WCR1087","error mess-
     A                                      age file":"WMESGG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"77","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error enhanced mo-
     A                                      de":"0","error messages":"1 message-
     A                                      ","set focus":{"fieldName":"68","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"}},{"id":"SCPEEP","field type":"c-
     A                                      heckbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCPEEP","designValue":"[SCPEEP-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase","dataLength":"1"},"text tra-
     A                                      nsform":"uppercase","visibility":{"-
     A                                      fieldName":"67","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"46-
     A                                      0px","top":"420px","width":"8px","s-
     A                                      et focus":{"fieldName":"69","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "error message id":"WCR1241","error-
     A                                       message file":"WMESGG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"43","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"1 message","parent tab panel":-
     A                                      "W7417F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted","checked value":"Y","unch-
     A                                      ecked value":" "},{"id":"CxbLCTAOld-
     A                                      Carrier","field type":"checkbox","c-
     A                                      ss class":"checkbox","value":{"fiel-
     A                                      dName":"scOldCar","dataLength":"1",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[scOldCar]"},"-
     A                                      left":"460px","top":"445px","parent-
     A                                       tab panel":"W7417F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","description"-
     A                                      :"LCTA old carrier # data checkbox"-
     A                                      ,"checked value":"Y","visibility":{-
     A                                      "fieldName":"clt045","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"}},{"i-
     A                                      d":"btnSubmit","field type":"button-
     A                                      ","value":"Enter","shortcut key":"E-
     A                                      nter","left":"14px","top":"150px","-
     A                                      width":"100px","heigh')
     A                                  1  2HTML('t":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF03","field typ-
     A                                      e":"button","value":"Exit","shortcu-
     A                                      t key":"F3","left":"14px","top":"18-
     A                                      3px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF10","field type":"button","v-
     A                                      alue":"Search","shortcut key":"F10"-
     A                                      ,"left":"14px","top":"216px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF13",-
     A                                      "field type":"button","value":"Chg -
     A                                      user parms","shortcut key":"F13","l-
     A                                      eft":"14px","top":"249px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnHELP","fi-
     A                                      eld type":"button","shortcut key":"-
     A                                      Alt-F1","bypass validation":"true",-
     A                                      "value":"HELP","response":{"fieldNa-
     A                                      me":"*IN10","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"left":"14px","top":"282-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "lblCompany3","field type":"output -
     A                                      field","css class":"label","value":-
     A                                      "Company#","left":"295px","top":"21-
     A                                      5px","width":"160px","parent tab pa-
     A                                      nel":"W7417F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0"},{"id":"lblGroup","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"label","value":"Group","left":"-
     A                                      295px","top":"240px","width":"160px-
     A                                      "},{"id":"lblOutputDirectory","fiel-
     A                                      d type":"output field","css class":-
     A                                      "label","value":"Output directory",-
     A                                      "left":"295px","top":"260px","width-
     A                                      ":"160px"},{"id":"lblOutputFileName-
     A                                      ","field type":"output field","css -
     A                                      class":"label","value":"Output file-
     A                                       name","left":"295px","top":"315px"-
     A                                      ,"width":"160px"},{"id":"lblStateRe-
     A                                      ceivingData","field type":"output f-
     A                                      ield","css class":"label","value":"-
     A                                      State receiving data","left":"295px-
     A                                      ","top":"375px","width":"160px"},{"-
     A                                      id":"lblExperienceRating","field ty-
     A                                      pe":"output field","css class":"lab-
     A                                      el","value":"Experience rating","le-
     A                                      ft":"295px","top":"395px","width":"-
     A                                      160px"},{"id":"lblProcessedThroughP-
     A                                      EEP","field type":"output field","c-
     A                                      ss class":"label","value":"Processe-
     A                                      d through PEEP","left":"295px","top-
     A                                      ":"420px","width":"160px","visibili-
     A                                      ty":{"fieldName":"67","customTrue":-
     A                                      "","customFalse":"","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"}},{"i-
     A                                      d":"lblGenerateOldCarrierData","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"label","value":"Generate old carr-
     A                                      ier# data","left":"295px","top":"44-
     A                                      5px","width":"160px","visibility":{-
     A                                      "fieldName":"clt045","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"')
     A                                  1  2HTML('Indicator","indFormat":"visib-
     A                                      le / hidden"}}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            CLT045         1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCO#          3S 0H
     A            SCER           1A  H
     A            SCFNAM       100A  H
     A            SCFND          3S 0H
     A            SCLIB        250A  H
     A            SCOLDCAR       1A  H
     A            SCOTYP         1A  H
     A            SCPEEP         1A  H
     A            SCPRDS        40A  H
     A            SCST           2A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A          R SCR02
     A  10 11 20
     A  21 22 23
     A  24 25                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                  1  2HTML('QPUIREC8    RROWS      2    C-
     A                                      1    1C2    24 RERRMSGID  5    C5  -
     A                                        SCINZC7    SCM0607C6    SCMESGC5 -
     A                                         *LIBLC0    E1    3     20RERRMSG-
     A                                      ID  5    C5    SCDEVC7    SCM0626C6-
     A                                          SCMESGC5    *LIBLC0    E1    3 -
     A                                          21RERRMSGID  5    C5    SCDEVC7-
     A                                          SCM0627C6    SCMESGC5    *LIBLC-
     A                                      0    E1    3     22RERRMSGID  5    -
     A                                      C5    SCDEVC7    SCM0503C6    SCMES-
     A                                      GC5    *LIBLC0    E1    3     23RER-
     A                                      RMSGID  5    C5    SCVOLC7    SCM05-
     A                                      03C6    SCMESGC5    *LIBLC0    E1  -
     A                                        3     24RERRMSGID  5    C5    SCD-
     A                                      ENC7    SCM0626C6    SCMESGC5    *L-
     A                                      IBLC0    E1    3     21RERRMSGID  5-
     A                                          C5    SCDENC7    SCM0503C6    S-
     A                                      CMESGC5    *LIBLC0    E1    3     2-
     A                                      5')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"valid command key":-
     A                                      {"fieldName":"*IN11","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"overlay range"-
     A                                      :"1-24"},"items":[{"id":"W7417F_SCR-
     A                                      02_avKeys","field type":"output fie-
     A                                      ld","value":{"fieldName":"AV_KEYS",-
     A                                      "dataLength":"1134","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[AV_KEYS]"},"left":"0px","top-
     A                                      ":"0px","visibility":"hidden"},{"id-
     A                                      ":"W7417F_SCR02_action","field type-
     A                                      ":"html container","white space":"n-
     A                                      ormal","left":"0px","top":"10px","w-
     A                                      idth":"230px","css class":"action-p-
     A                                      anel-converted","height":"700px","h-
     A                                      tml":"<div class=\"top\"></div><div-
     A                                       class=\"imagetop\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_top.png-
     A                                      \" /></div><div class=\"menulinks\"-
     A                                      ></div><div class=\"imagebottom\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_bottom.png\" /></div><div cl-
     A                                      ass=\"bottom\"></div>"},{"field typ-
     A                                      e":"icon menu button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"32px","z index":"20"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1170px","id":"W7417F_SCR02_Btn-
     A                                      IconMenuSystemTools","tool tip":"Sy-
     A                                      stem Tools","icon source":"/profoun-
     A                                      dui/userdata/images/systool/systool-
     A                                      s.png","data function":"SystemToolb-
     A                                      arSystools","show down arrow":"Yes"-
     A                                      },{"field type":"panel","panel styl-
     A                                      e":"TransformButtonBar","id":"W7417-
     A                                      F_SCR02_ButtonBar","top":"35px","le-
     A                                      ft":"1036px","width":"187px","heigh-
     A                                      t":"28px","css class":"stationary",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-rep')
     A                                  1  2HTML('eat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1040px","id":"W-
     A                                      7417F_SCR02_BtnSave","tool tip":"Sa-
     A                                      ve","onclick":"SystemToolbarSave","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/save.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1066px",-
     A                                      "id":"W7417F_SCR02_BtnRefresh","too-
     A                                      l tip":"Refresh","onclick":"SystemT-
     A                                      oolbarRefresh","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/refresh.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1092px","id":"W7417F_SCR-
     A                                      02_BtnSearch","tool tip":"Search","-
     A                                      onclick":"SystemToolbarSearch","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/search.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1118px","-
     A                                      id":"W7417F_SCR02_BtnDiaryItems","t-
     A                                      ool tip":"Diary/Work Items - IDARTS-
     A                                      ","onclick":"SystemToolbarDiary","b-
     A                                      ackground image":{"fieldName":"DryI-
     A                                      cnURL","dataLength":"128","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none"}},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1144px","id":"-
     A                                      W7417F_SCR02_BtnSystemMessages","to-
     A                                      ol tip":"System Messages","onclick"-
     A                                      :"SystemToolbarMessages","backgroun-
     A                                      d image":{"fieldName"')
     A                                  1  2HTML(':"MsgIcnURL","dataLength":"12-
     A                                      8","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"}},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      96px","id":"W7417F_SCR02_BtnHelp","-
     A                                      tool tip":"Help","onclick":"SystemT-
     A                                      oolbarHelp","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/help.png'')"},{"id":"W7417F_SCR-
     A                                      02_ImgSysToolBottom","field type":"-
     A                                      image","image source":"/profoundui/-
     A                                      userdata/images/systool/butbarbot.p-
     A                                      ng","left":"1036px","top":"64px","w-
     A                                      idth":"187px","locked in place":"tr-
     A                                      ue","css class":"stationary","visib-
     A                                      ility":"hidden"},{"id":"W7417F_SCR0-
     A                                      2_MainTabPanel","field type":"tab p-
     A                                      anel","tab panel style":"Transform"-
     A                                      ,"tab names":"Tab 1","active tab":"-
     A                                      0","left":"250px","top":"70px","wid-
     A                                      th":"970px","height":"657px","z ind-
     A                                      ex":"8","locked in place":"true","c-
     A                                      ss class":"tab-panel","css class 2"-
     A                                      :"stationary"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W7417F_SCR02_BtnHiddenSave","val-
     A                                      ue":"btnSave","top":"100px","respon-
     A                                      se":{"fieldName":"btnSave","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant20","field type":"output fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"110px","cursor row":"1",-
     A                                      "css class":"top-line","value":"js:-
     A                                       currentUser()","css class 2":"outp-
     A                                      ut-field","parent tab panel":"W7417-
     A                                      F_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"SCR02_SCCONM","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCCONM","designValue":"[SCCON-
     A                                      M]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"414px"-
     A                                      ,"cursor column":"21","top":"110px"-
     A                                      ,"cursor row":"1","css class 2":"to-
     A                                      p-line","css class 3":"HI","descrip-
     A                                      tion":"COMPANY NAME","parent tab pa-
     A                                      nel":"W7417F_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 4":"profo-
     A                                      und-converted"},{"id":"constant21",-
     A                                      "field type":"output field","left":-
     A                                      "778px","cursor column":"73","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                      ":"top-line","value":"js: currentDa-
     A                                      te()","css class 2":"')
     A                                  1  2HTML('output-field","parent tab pan-
     A                                      el":"W7417F_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"W7417F_SCR02_-
     A                                      fkeyMenu","field type":"menu","left-
     A                                      ":"10px","top":"120px","height":"35-
     A                                      0px","width":"230px","hover backgro-
     A                                      und color":"#9AAA61","hover text co-
     A                                      lor":"#FFFFFF","border color":"#4C6-
     A                                      106","menu option indent":"10px","b-
     A                                      ackground color":"#758B27","css cla-
     A                                      ss":"action-menu","css class 2":"st-
     A                                      ationary","z index":"101"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W7417F_SCR02_BtnHidd-
     A                                      enRefresh","value":"btnRefresh","to-
     A                                      p":"125px","response":{"fieldName":-
     A                                      "btnRefresh","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"SCR02_Q1PGM","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"Q1PGM","designValue":"-
     A                                      [Q1PGM]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none","dataLength":"10"},"css c-
     A                                      lass":"output-field","left":"281px"-
     A                                      ,"cursor column":"2","top":"130px",-
     A                                      "cursor row":"2","parent tab panel"-
     A                                      :"W7417F_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"constant22","fie-
     A                                      ld type":"output field","value":"WC-
     A                                      POLS Data Transmission Prompt","css-
     A                                       class":"constant","left":"442px","-
     A                                      cursor column":"25","top":"130px","-
     A                                      cursor row":"2","css class 2":"HI",-
     A                                      "parent tab panel":"W7417F_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant23","field type":"output -
     A                                      field","value":"SCR02","css class":-
     A                                      "constant","left":"799px","cursor c-
     A                                      olumn":"76","top":"130px","cursor r-
     A                                      ow":"2","parent tab panel":"W7417F_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W7417F_SC-
     A                                      R02_BtnHiddenSearch","value":"btnSe-
     A                                      arch","top":"150px","response":{"fi-
     A                                      eldName":"btnSearch","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W7417F_SCR02_BtnHiddenDiar-
     A                                      yItems","value":"btnDiary","top":"1-
     A                                      75px","response":{"fieldName":"btnD-
     A                                      iary","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant24","field typ-
     A                                      e":"output field","value":"Load the-
     A                                       tape into the tape d')
     A                                  1  2HTML('rive now.","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"190px","cursor row":"5"-
     A                                      ,"css class 2":"BLU","parent tab pa-
     A                                      nel":"W7417F_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W7417F_SCR02_BtnHiddenSystemMes-
     A                                      sages","value":"btnMessage","top":"-
     A                                      200px","response":{"fieldName":"btn-
     A                                      Message","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W74-
     A                                      17F_SCR02_BtnHiddenWorkSubmitJob","-
     A                                      value":"btnWrksbmjob","top":"225px"-
     A                                      ,"response":{"fieldName":"btnWrkJob-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant25","field type":"-
     A                                      output field","value":"Press Enter -
     A                                      to start the data transfer process.-
     A                                      ","css class":"constant","left":"28-
     A                                      1px","cursor column":"2","top":"230-
     A                                      px","cursor row":"7","css class 2":-
     A                                      "BLU","parent tab panel":"W7417F_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W7417F_SCR0-
     A                                      2_BtnHiddenWorkPrinterOutput","valu-
     A                                      e":"btnWrkprtout","top":"250px","re-
     A                                      sponse":{"fieldName":"btnWrkPrnt","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant26","field type":"out-
     A                                      put field","value":"Should this tap-
     A                                      e be initialized (INZ/   ):","css c-
     A                                      lass":"constant","left":"295px","cu-
     A                                      rsor column":"4","top":"270px","cur-
     A                                      sor row":"9","parent tab panel":"W7-
     A                                      417F_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCINZ","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SCINZ","designValue":"[SCINZ]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase","dataLength":"3"},"text tran-
     A                                      sform":"uppercase","left":"596px","-
     A                                      cursor column":"47","top":"270px","-
     A                                      cursor row":"9","width":"22px","err-
     A                                      or message id":"SCM0607","error mes-
     A                                      sage file":"SCMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"20","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","parent tab panel":"W74-
     A                                      17F_SCR02_MainTabPane')
     A                                  1  2HTML('l","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W7417F_SCR02_BtnHidd-
     A                                      enImageQueue","value":"btnImgQue","-
     A                                      top":"275px","response":{"fieldName-
     A                                      ":"btnImgQue","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"W7417F_SCR02_BtnHiddenHelp","valu-
     A                                      e":"btnHelp","top":"300px","respons-
     A                                      e":{"fieldName":"btnHelp","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant27","field type":"output fiel-
     A                                      d","value":"Tape device            -
     A                                                        :","css class":"c-
     A                                      onstant","left":"295px","cursor col-
     A                                      umn":"4","top":"310px","cursor row"-
     A                                      :"11","parent tab panel":"W7417F_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCDEV","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CDEV","designValue":"[SCDEV]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase",-
     A                                      "dataLength":"10"},"text transform"-
     A                                      :"uppercase","left":"596px","cursor-
     A                                       column":"47","top":"310px","cursor-
     A                                       row":"11","width":"71px","css clas-
     A                                      s 3":"HI","error message id":"SCM06-
     A                                      26","error message file":"SCMESG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"21","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"3 messages","error m-
     A                                      essage id 2":"SCM0627","error messa-
     A                                      ge file 2":"SCMESG","error message -
     A                                      library 2":"*LIBL","error condition-
     A                                       2":{"fieldName":"22","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      e id 3":"SCM0503","error message fi-
     A                                      le 3":"SCMESG","error message libra-
     A                                      ry 3":"*LIBL","error condition 3":{-
     A                                      "fieldName":"23","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"parent tab panel"-
     A                                      :"W7417F_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 4":"profound--
     A                                      converted"},{"id":"constant28","fie-
     A                                      ld type":"output field","value":"Vo-
     A                                      lume                               -
     A                                          :","css class":"constant","left-
     A                                      ":"295px","cursor column":"4","top"-
     A                                      :"350px","cursor row":"13","parent -
     A                                      tab panel":"W7417F_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCVOL"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2')
     A                                  1  2HTML('":"textbox","value":{"fieldNa-
     A                                      me":"SCVOL","designValue":"[SCVOL]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case","dataLength":"10"},"text tran-
     A                                      sform":"uppercase","left":"596px","-
     A                                      cursor column":"47","top":"350px","-
     A                                      cursor row":"13","width":"71px","cs-
     A                                      s class 3":"HI","error message id":-
     A                                      "SCM0503","error message file":"SCM-
     A                                      ESG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"2-
     A                                      4","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"1 message","pa-
     A                                      rent tab panel":"W7417F_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 4":"profound-converted"},{"id":"c-
     A                                      onstant29","field type":"output fie-
     A                                      ld","value":"Density               -
     A                                                         :","css class":"-
     A                                      constant","left":"295px","cursor co-
     A                                      lumn":"4","top":"390px","cursor row-
     A                                      ":"15","parent tab panel":"W7417F_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCDEN","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCDEN","designValue":"[SCDEN]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      ,"dataLength":"10"},"text transform-
     A                                      ":"uppercase","left":"596px","curso-
     A                                      r column":"47","top":"390px","curso-
     A                                      r row":"15","width":"71px","css cla-
     A                                      ss 3":"HI","error message id":"SCM0-
     A                                      626","error message file":"SCMESG",-
     A                                      "error message library":"*LIBL","er-
     A                                      ror condition":{"fieldName":"21","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"2 messages","error -
     A                                      message id 2":"SCM0503","error mess-
     A                                      age file 2":"SCMESG","error message-
     A                                       library 2":"*LIBL","error conditio-
     A                                      n 2":{"fieldName":"25","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"parent tab -
     A                                      panel":"W7417F_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 4":"pro-
     A                                      found-converted"},{"id":"btnSubmit"-
     A                                      ,"field type":"button","value":"Ent-
     A                                      er","shortcut key":"Enter","left":"-
     A                                      14px","top":"150px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF03","field ty-
     A                                      pe":"button","value":"Exit","shortc-
     A                                      ut key":"F3","left":"14px","top":"1-
     A                                      83px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF12","field type":"button","-
     A                                      value":"Cancel","shortcut key":"F12-
     A                                      ","left":"14px","top":"216px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF13"-
     A                                      ,"field type":"button')
     A                                  1  2HTML('","value":"Chg user parms","s-
     A                                      hortcut key":"F13","left":"14px","t-
     A                                      op":"249px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnHELP","field type":"but-
     A                                      ton","shortcut key":"Alt-F1","bypas-
     A                                      s validation":"true","value":"HELP"-
     A                                      ,"response":{"fieldName":"*IN10","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"le-
     A                                      ft":"14px","top":"282px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCDEN         10A  H
     A            SCDEV         10A  H
     A            SCINZ          3A  H
     A            SCVOL         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A          R SCR03
     A  10 11 33
     A  34 35 36
     A  37 38 39                            CA01(10 'Response Indicator *IN10')
     A  40 41 42
     A  43 44 45
     A  46 47 68                            CA02(11 'Response Indicator *IN11')
     A  77                                  CA03(33 'Response Indicator *IN33')
     A                                      SETOF(34 'Response Indicator *IN34')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(36 'Response Indicator *IN36')
     A                                      SETOF(37 'Response Indicator *IN37')
     A                                      SETOF(38 'Response Indicator *IN38')
     A                                      SETOF(39 'Response Indicator *IN39')
     A                                      SETOF(40 'Response Indicator *IN40')
     A                                      SETOF(41 'Response Indicator *IN41')
     A                                      SETOF(42 'Response Indicator *IN42')
     A                                      SETOF(43 'Response Indicator *IN43')
     A                                      SETOF(44 'Response Indicator *IN44')
     A                                      SETOF(45 'Response Indicator *IN45')
     A                                      SETOF(46 'Response Indicator *IN46')
     A                                  1  2HTML('QPUIREC17   RROWS      2    C-
     A                                      1    1C2    24 RERRMSGID  5    C6  -
     A                                        SCMAILC7    WCR0503C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     33RERRMS-
     A                                      GID  5    C6    SCCNAMC7    WCR0503-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     34RERRMSGID  5    C6    SCPHN-
     A                                      AC7    WCR0502C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     35RERRMSGID  5 -
     A                                         C6    SCPHN1C7    WCR0502C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     3-
     A                                      6RERRMSGID  5    C6    SCPHN2C7    -
     A                                      WCR0502C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     37RERRMSGID  5    C5  -
     A                                        SCEXTC7    WCR0547C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     38RERRMSG-
     A                                      ID  5    C6    SCFAXAC7    WCR0502C-
     A                                      6    WMESGGC5    *LIBLC0    E1    3-
     A                                           39RERRMSGID  5    C6    SCFAX1-
     A                                      C7    WCR0502C6    WMESGGC5    *LIB-
     A                                      LC0    E1    3     40RERRMSGID  5  -
     A                                        C6    SCFAX2C7    WCR0502C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     41-
     A                                      RERRMSGID  5    C6    SCSTRTC7    W-
     A                                      CR0503C6    WMESGGC5    *LIBLC0    -
     A                                      E1    3     42RERRMSGID  5    C6   -
     A                                       SCCITYC7    WCR0503C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     43RERRMSG-
     A                                      ID  5    C5    SCST2C7    WCR0504C6-
     A                                          WMESGGC5    *LIBLC0    E1    3 -
     A                                          44RERRMSGID  5    C6    SCZIP1C-
     A                                      7    WCR0502C6    WMESGGC5    *LIBL-
     A                                      C0    E1    3     45RERRMSGID  5   -
     A                                       C6    SCZIP2C7    WCR0547C6    WME-
     A                                      SGGC5    *LIBLC0    E1    3     46R-
     A                                      ERRMSGID  5    C9    SCDtaPvdrC7   -
     A                                       WCR1087C6    WMESGGC5    *LIBLC0  -
     A                                        E1    3     77RERRMSGID  5    C9 -
     A                                         SCTPEFeinC7    WCR0502C6    WMES-
     A                                      GGC5    *LIBLC0    E1    3     47')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN33","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN34","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN35","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN36","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN37","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN38","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN39","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN40","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN41","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N42","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN4-
     A                                      3","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN44"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN45","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN46","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"val-
     A                                      id command key":{"fieldName":"*IN11-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"overlay range":"1-24"},"items":[{-
     A                                      "id":"W7417F_SCR03_avKeys","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"AV_KEYS","dataLength":"1134"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[AV_KEYS]"},"-
     A                                      left":"0px","top":"0px","visibility-
     A                                      ":"hidden"},{"id":"W7417F_SCR03_act-
     A                                      ion","field type":"html container",-
     A                                      "white space":"normal","left":"0px"-
     A                                      ,"top":"10px","width":"230px","css -
     A                                      class":"action-panel-converted","he-
     A                                      ight":"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/ba')
     A                                  1  2HTML('r_bottom.png\" /></div><div c-
     A                                      lass=\"bottom\"></div>"},{"field ty-
     A                                      pe":"icon menu button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"32px","z index":"20-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1170px","id":"W7417F_SCR03_Bt-
     A                                      nIconMenuSystemTools","tool tip":"S-
     A                                      ystem Tools","icon source":"/profou-
     A                                      ndui/userdata/images/systool/systoo-
     A                                      ls.png","data function":"SystemTool-
     A                                      barSystools","show down arrow":"Yes-
     A                                      "},{"field type":"panel","panel sty-
     A                                      le":"TransformButtonBar","id":"W741-
     A                                      7F_SCR03_ButtonBar","top":"35px","l-
     A                                      eft":"1036px","width":"187px","heig-
     A                                      ht":"28px","css class":"stationary"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1040px","id":"W7417F_SCR03_BtnSave-
     A                                      ","tool tip":"Save","onclick":"Syst-
     A                                      emToolbarSave","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/save.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1066px","id":"W7417F_SCR03_-
     A                                      BtnRefresh","tool tip":"Refresh","o-
     A                                      nclick":"SystemToolbarRefresh","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/refresh.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1092px",-
     A                                      "id":"W7417F_SCR03_BtnSearch","tool-
     A                                       tip":"Search","onclick":"SystemToo-
     A                                      lbarSearch","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/search.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in p')
     A                                  1  2HTML('lace":"true","left":"1118px",-
     A                                      "id":"W7417F_SCR03_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "W7417F_SCR03_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"}},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1196px","id":"W7417F_-
     A                                      SCR03_BtnHelp","tool tip":"Help","o-
     A                                      nclick":"SystemToolbarHelp","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/help.png'')"},{-
     A                                      "id":"W7417F_SCR03_ImgSysToolBottom-
     A                                      ","field type":"image","image sourc-
     A                                      e":"/profoundui/userdata/images/sys-
     A                                      tool/butbarbot.png","left":"1036px"-
     A                                      ,"top":"64px","width":"187px","lock-
     A                                      ed in place":"true","css class":"st-
     A                                      ationary","visibility":"hidden"},{"-
     A                                      id":"W7417F_SCR03_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","dataLength":"40","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"},"active tab":"0","left":"250p-
     A                                      x","top":"70px","width":"970px","he-
     A                                      ight":"657px","z index":"8","locked-
     A                                       in place":"true","css class":"tab--
     A                                      panel","css class 2":"stationary"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W7417F_SCR03-
     A                                      _BtnHiddenSave","value":"btnSave","-
     A                                      top":"100px","response":{"fieldName-
     A                                      ":"btnSave","dataType":"indicator",-
     A                                      "formatting":"Indicat')
     A                                  1  2HTML('or","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant30","field type":"outpu-
     A                                      t field","left":"281px","cursor col-
     A                                      umn":"2","top":"110px","cursor row"-
     A                                      :"1","css class":"top-line","value"-
     A                                      :"js: currentUser()","css class 2":-
     A                                      "output-field","parent tab panel":"-
     A                                      W7417F_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCR03_SCCONM","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCCONM","designValue":"[-
     A                                      SCCONM]","refField":"NAME","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"4-
     A                                      14px","cursor column":"21","top":"1-
     A                                      10px","cursor row":"1","css class 2-
     A                                      ":"top-line","css class 3":"HI","de-
     A                                      scription":"COMPANY NAME","parent t-
     A                                      ab panel":"W7417F_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 4":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t31","field type":"output field","l-
     A                                      eft":"778px","cursor column":"73","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class":"top-line","value":"js: curr-
     A                                      entDate()","css class 2":"output-fi-
     A                                      eld","parent tab panel":"W7417F_SCR-
     A                                      03_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"W7417F_SCR03_fkeyMenu","fiel-
     A                                      d type":"menu","left":"10px","top":-
     A                                      "120px","height":"350px","width":"2-
     A                                      30px","hover background color":"#9A-
     A                                      AA61","hover text color":"#FFFFFF",-
     A                                      "border color":"#4C6106","menu opti-
     A                                      on indent":"10px","background color-
     A                                      ":"#758B27","css class":"action-men-
     A                                      u","css class 2":"stationary","z in-
     A                                      dex":"101"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W7417F_SCR03_BtnHiddenRefresh","val-
     A                                      ue":"btnRefresh","top":"125px","res-
     A                                      ponse":{"fieldName":"btnRefresh","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"SCR03_Q1PGM","field type":"out-
     A                                      put field","value":{"fieldName":"Q1-
     A                                      PGM","designValue":"[Q1PGM]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none","data-
     A                                      Length":"10"},"css class":"output-f-
     A                                      ield","left":"281px","cursor column-
     A                                      ":"2","top":"130px","cursor row":"2-
     A                                      ","parent tab panel":"W7417F_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant32","field type":"outpu-
     A                                      t field","value":"WCPOLS Data Trans-
     A                                      mission Prompt","css class":"consta-
     A                                      nt","left":"442px","cursor column":-
     A                                      "25","top":"130px","cursor row":"2"-
     A                                      ,"css class 2":"HI","parent tab pan-
     A                                      el":"W7417F_SCR03_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":')
     A                                  1  2HTML('"constant33","field type":"ou-
     A                                      tput field","value":"SCR03","css cl-
     A                                      ass":"constant","left":"799px","cur-
     A                                      sor column":"76","top":"130px","cur-
     A                                      sor row":"2","parent tab panel":"W7-
     A                                      417F_SCR03_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W741-
     A                                      7F_SCR03_BtnHiddenSearch","value":"-
     A                                      btnSearch","top":"150px","response"-
     A                                      :{"fieldName":"btnSearch","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant34","field type":"output fiel-
     A                                      d","value":"Please enter contact in-
     A                                      formation for response from state b-
     A                                      ureau:","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"170px","cursor row":"4","css cla-
     A                                      ss 2":"BLU","parent tab panel":"W74-
     A                                      17F_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W7417-
     A                                      F_SCR03_BtnHiddenDiaryItems","value-
     A                                      ":"btnDiary","top":"175px","respons-
     A                                      e":{"fieldName":"btnDiary","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W7417F_SCR03_BtnHidd-
     A                                      enSystemMessages","value":"btnMessa-
     A                                      ge","top":"200px","response":{"fiel-
     A                                      dName":"btnMessage","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      35","field type":"output field","va-
     A                                      lue":"E-mail address:","css class":-
     A                                      "constant","left":"295px","cursor c-
     A                                      olumn":"4","top":"210px","cursor ro-
     A                                      w":"6","parent tab panel":"W7417F_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCMAIL","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCMAIL","designValue":"[SCMAIL]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se","dataLength":"31"},"text transf-
     A                                      orm":"uppercase","left":"407px","cu-
     A                                      rsor column":"20","top":"210px","cu-
     A                                      rsor row":"6","width":"218px","css -
     A                                      class 3":"HI","css class 4":"UL","e-
     A                                      rror message id":"WCR0503","error m-
     A                                      essage file":"WMESGG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"33","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"1 message","parent')
     A                                  1  2HTML(' tab panel":"W7417F_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 5":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W7417F_SCR03_BtnHi-
     A                                      ddenWorkSubmitJob","value":"btnWrks-
     A                                      bmjob","top":"225px","response":{"f-
     A                                      ieldName":"btnWrkJob","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt36","field type":"output field","-
     A                                      value":"Name          :","css class-
     A                                      ":"constant","left":"295px","cursor-
     A                                       column":"4","top":"250px","cursor -
     A                                      row":"8","parent tab panel":"W7417F-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCCNAM","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCCNAM","designValue":"[SCCNAM]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case","dataLength":"25"},"text tran-
     A                                      sform":"uppercase","left":"407px","-
     A                                      cursor column":"20","top":"250px","-
     A                                      cursor row":"8","width":"176px","cs-
     A                                      s class 3":"HI","css class 4":"UL",-
     A                                      "error message id":"WCR0503","error-
     A                                       message file":"WMESGG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"34","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"1 message","parent tab panel":-
     A                                      "W7417F_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 5":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      7417F_SCR03_BtnHiddenWorkPrinterOut-
     A                                      put","value":"btnWrkprtout","top":"-
     A                                      250px","response":{"fieldName":"btn-
     A                                      WrkPrnt","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W74-
     A                                      17F_SCR03_BtnHiddenImageQueue","val-
     A                                      ue":"btnImgQue","top":"275px","resp-
     A                                      onse":{"fieldName":"btnImgQue","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant37","field type":"output-
     A                                       field","value":"Phone number  :","-
     A                                      css class":"constant","left":"295px-
     A                                      ","cursor column":"4","top":"290px"-
     A                                      ,"cursor row":"10","parent tab pane-
     A                                      l":"W7417F_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant38","f-
     A                                      ield type":"output field","value":"-
     A                                      (","css class":"constant","left":"4-
     A                                      07px","cursor column"')
     A                                  1  2HTML(':"20","top":"290px","cursor r-
     A                                      ow":"10","parent tab panel":"W7417F-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCPHNA","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCPHNA","designValue":"[SCPHNA]"-
     A                                      ,"refField":"AREA","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"-999.00"},"left":"42-
     A                                      1px","cursor column":"22","top":"29-
     A                                      0px","cursor row":"10","width":"22p-
     A                                      x","css class 3":"HI","css class 4"-
     A                                      :"UL","error message id":"WCR0502",-
     A                                      "error message file":"WMESGG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"35","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"1 message","parent tab p-
     A                                      anel":"W7417F_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 5":"prof-
     A                                      ound-converted"},{"id":"constant39"-
     A                                      ,"field type":"output field","value-
     A                                      ":")","css class":"constant","left"-
     A                                      :"449px","cursor column":"26","top"-
     A                                      :"290px","cursor row":"10","parent -
     A                                      tab panel":"W7417F_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPHN1-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCPHN1","refFi-
     A                                      eld":"PHN1","numSep":"false","zeroB-
     A                                      alance":"false","numBlankFill":"fal-
     A                                      se","zeroFill":"true","curSym":"","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","negNum":"-999.00","units"-
     A                                      :"","designValue":"[SCPHN1]"},"left-
     A                                      ":"463px","cursor column":"28","top-
     A                                      ":"290px","cursor row":"10","width"-
     A                                      :"22px","css class 3":"HI","css cla-
     A                                      ss 4":"UL","error message id":"WCR0-
     A                                      502","error message file":"WMESGG",-
     A                                      "error message library":"*LIBL","er-
     A                                      ror condition":{"fieldName":"36","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"1 message","parent -
     A                                      tab panel":"W7417F_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 5":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt40","field type":"output field","-
     A                                      value":"-","css class":"constant","-
     A                                      left":"491px","cursor column":"32",-
     A                                      "top":"290px","cursor row":"10","pa-
     A                                      rent tab panel":"W7417F_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CPHN2","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCPHN2","-
     A                                      refField":"PHN2","numSep":"false","-
     A                                      zeroBalance":"false","numBlankFill"-
     A                                      :"false","zeroFill":"true","curSym"-
     A                                      :"","dataType":"reference","formatt-
     A                                      ing":"Number","negNum":"-999.00","u-
     A                                      nits":"","designValue":"[SCPHN2]"},-
     A                                      "left":"505px","curso')
     A                                  1  2HTML('r column":"34","top":"290px",-
     A                                      "cursor row":"10","width":"29px","c-
     A                                      ss class 3":"HI","css class 4":"UL"-
     A                                      ,"error message id":"WCR0502","erro-
     A                                      r message file":"WMESGG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"37","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"1 message","parent tab panel"-
     A                                      :"W7417F_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 5":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W7417F_SCR03_BtnHiddenHelp","value"-
     A                                      :"btnHelp","top":"300px","response"-
     A                                      :{"fieldName":"btnHelp","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant41","field type":"output field"-
     A                                      ,"value":"Extension     :","css cla-
     A                                      ss":"constant","left":"295px","curs-
     A                                      or column":"4","top":"330px","curso-
     A                                      r row":"12","parent tab panel":"W74-
     A                                      17F_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCEXT","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCEXT","designValue":"[SCEXT]"-
     A                                      ,"dataType":"zoned","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"-999.00-
     A                                      ","dataLength":"6","decPos":"0"},"l-
     A                                      eft":"407px","cursor column":"20","-
     A                                      top":"330px","cursor row":"12","wid-
     A                                      th":"43px","css class 3":"UL","erro-
     A                                      r message id":"WCR0547","error mess-
     A                                      age file":"WMESGG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"38","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      1 message","parent tab panel":"W741-
     A                                      7F_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 4":"profound-conver-
     A                                      ted"},{"id":"constant42","field typ-
     A                                      e":"output field","value":"Fax numb-
     A                                      er  . :","css class":"constant","le-
     A                                      ft":"295px","cursor column":"4","to-
     A                                      p":"370px","cursor row":"14","paren-
     A                                      t tab panel":"W7417F_SCR03_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant43","field type":"output field"-
     A                                      ,"value":"(","css class":"constant"-
     A                                      ,"left":"407px","cursor column":"20-
     A                                      ","top":"370px","cursor row":"14","-
     A                                      parent tab panel":"W7417F_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCFAXA","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCFAXA"-
     A                                      ,"designValue":"[SCFAXA]","refField-
     A                                      ":"AREA","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false')
     A                                  1  2HTML('","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"-999.00"},-
     A                                      "left":"421px","cursor column":"22"-
     A                                      ,"top":"370px","cursor row":"14","w-
     A                                      idth":"22px","css class 3":"HI","cs-
     A                                      s class 4":"UL","error message id":-
     A                                      "WCR0502","error message file":"WME-
     A                                      SGG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"3-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"1 message","pa-
     A                                      rent tab panel":"W7417F_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 5":"profound-converted"},{"id":"c-
     A                                      onstant44","field type":"output fie-
     A                                      ld","value":")","css class":"consta-
     A                                      nt","left":"449px","cursor column":-
     A                                      "26","top":"370px","cursor row":"14-
     A                                      ","parent tab panel":"W7417F_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCFAX1","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCFA-
     A                                      X1","refField":"PHN1","numSep":"fal-
     A                                      se","zeroBalance":"false","numBlank-
     A                                      Fill":"false","zeroFill":"true","cu-
     A                                      rSym":"","dataType":"reference","fo-
     A                                      rmatting":"Number","negNum":"-999.0-
     A                                      0","units":"","designValue":"[SCFAX-
     A                                      1]"},"left":"463px","cursor column"-
     A                                      :"28","top":"370px","cursor row":"1-
     A                                      4","width":"22px","css class 3":"HI-
     A                                      ","css class 4":"UL","error message-
     A                                       id":"WCR0502","error message file"-
     A                                      :"WMESGG","error message library":"-
     A                                      *LIBL","error condition":{"fieldNam-
     A                                      e":"40","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error messages":"1 message-
     A                                      ","parent tab panel":"W7417F_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 5":"profound-converted"},{"i-
     A                                      d":"constant45","field type":"outpu-
     A                                      t field","value":"-","css class":"c-
     A                                      onstant","left":"491px","cursor col-
     A                                      umn":"32","top":"370px","cursor row-
     A                                      ":"14","parent tab panel":"W7417F_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCFAX2","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCFAX2","refField":"PHN2","numSep"-
     A                                      :"false","zeroBalance":"false","num-
     A                                      BlankFill":"false","zeroFill":"true-
     A                                      ","curSym":"","dataType":"reference-
     A                                      ","formatting":"Number","negNum":"--
     A                                      999.00","units":"","designValue":"[-
     A                                      SCFAX2]"},"left":"505px","cursor co-
     A                                      lumn":"34","top":"370px","cursor ro-
     A                                      w":"14","width":"29px","css class 3-
     A                                      ":"HI","css class 4":"UL","error me-
     A                                      ssage id":"WCR0502","error message -
     A                                      file":"WMESGG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"41","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"1 me-
     A                                      ssage","parent tab panel":"W7417F_S-
     A                                      CR03_MainTabPanel","p')
     A                                  1  2HTML('arent tab":"0","css class 5":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt46","field type":"output field","-
     A                                      value":"Street        :","css class-
     A                                      ":"constant","left":"295px","cursor-
     A                                       column":"4","top":"410px","cursor -
     A                                      row":"16","parent tab panel":"W7417-
     A                                      F_SCR03_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCSTRT","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCSTRT","designValue":"[SCSTRT]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase","dataLength":"60"},"text tra-
     A                                      nsform":"uppercase","left":"407px",-
     A                                      "cursor column":"20","top":"410px",-
     A                                      "cursor row":"16","width":"421px","-
     A                                      css class 3":"HI","css class 4":"UL-
     A                                      ","error message id":"WCR0503","err-
     A                                      or message file":"WMESGG","error me-
     A                                      ssage library":"*LIBL","error condi-
     A                                      tion":{"fieldName":"42","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      ages":"1 message","parent tab panel-
     A                                      ":"W7417F_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 5":"profound-
     A                                      -converted"},{"id":"constant47","fi-
     A                                      eld type":"output field","value":"C-
     A                                      ity          :","css class":"consta-
     A                                      nt","left":"295px","cursor column":-
     A                                      "4","top":"450px","cursor row":"18"-
     A                                      ,"parent tab panel":"W7417F_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCCITY","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCCIT-
     A                                      Y","designValue":"[SCCITY]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase","d-
     A                                      ataLength":"30"},"text transform":"-
     A                                      uppercase","left":"407px","cursor c-
     A                                      olumn":"20","top":"450px","cursor r-
     A                                      ow":"18","width":"211px","css class-
     A                                       3":"HI","css class 4":"UL","error -
     A                                      message id":"WCR0503","error messag-
     A                                      e file":"WMESGG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"43","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"1 -
     A                                      message","parent tab panel":"W7417F-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 5":"profound-converte-
     A                                      d"},{"id":"constant48","field type"-
     A                                      :"output field","value":"State     -
     A                                          :","css class":"constant","left-
     A                                      ":"295px","cursor column":"4","top"-
     A                                      :"490px","cursor row":"20","parent -
     A                                      tab panel":"W7417F_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCST2"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCST2","designV-
     A                                      alue":"[SCST2]","dataType":"char","-
     A                                      formatting":"Text","t')
     A                                  1  2HTML('rimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case","dataLength":"2"},"text trans-
     A                                      form":"uppercase","left":"407px","c-
     A                                      ursor column":"20","top":"490px","c-
     A                                      ursor row":"20","width":"15px","css-
     A                                       class 3":"HI","css class 4":"UL","-
     A                                      error message id":"WCR0504","error -
     A                                      message file":"WMESGG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"44","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"1 message","parent tab panel":"-
     A                                      W7417F_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 5":"profound-co-
     A                                      nverted"},{"id":"constant49","field-
     A                                       type":"output field","value":"Zip -
     A                                      code      :","css class":"constant"-
     A                                      ,"left":"295px","cursor column":"4"-
     A                                      ,"top":"530px","cursor row":"22","p-
     A                                      arent tab panel":"W7417F_SCR03_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCZIP1","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCZIP1",-
     A                                      "designValue":"[SCZIP1]","refField"-
     A                                      :"ZIP1","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"false","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"-999.00"},"left":"407px","curso-
     A                                      r column":"20","top":"530px","curso-
     A                                      r row":"22","width":"36px","css cla-
     A                                      ss 3":"HI","css class 4":"UL","erro-
     A                                      r message id":"WCR0502","error mess-
     A                                      age file":"WMESGG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"45","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      1 message","parent tab panel":"W741-
     A                                      7F_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 5":"profound-conver-
     A                                      ted"},{"id":"constant50","field typ-
     A                                      e":"output field","value":"-","css -
     A                                      class":"constant","left":"449px","c-
     A                                      ursor column":"26","top":"530px","c-
     A                                      ursor row":"22","parent tab panel":-
     A                                      "W7417F_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCZIP2","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCZIP2","designValue":"[S-
     A                                      CZIP2]","refField":"ZIP2","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"-999.00"},"le-
     A                                      ft":"463px","cursor column":"28","t-
     A                                      op":"530px","cursor row":"22","widt-
     A                                      h":"29px","css class 3":"UL","error-
     A                                       message id":"WCR0547","error messa-
     A                                      ge file":"WMESGG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"46","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"1-
     A                                       message","parent tab panel":"W7417-
     A                                      F_SCR03_MainTabPanel"')
     A                                  1  2HTML(',"parent tab":"0","css class -
     A                                      4":"profound-converted"},{"id":"btn-
     A                                      Submit","field type":"button","valu-
     A                                      e":"Enter","shortcut key":"Enter","-
     A                                      left":"14px","top":"150px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF03","f-
     A                                      ield type":"button","value":"Exit",-
     A                                      "shortcut key":"F3","left":"14px","-
     A                                      top":"183px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF12","field type":"bu-
     A                                      tton","value":"Cancel","shortcut ke-
     A                                      y":"F12","left":"14px","top":"216px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnHELP","field type":"button","shor-
     A                                      tcut key":"Alt-F1","bypass validati-
     A                                      on":"true","value":"HELP","response-
     A                                      ":{"fieldName":"*IN10","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"left":"14px"-
     A                                      ,"top":"249px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"LblDtaPvdr","field type-
     A                                      ":"output field","css class":"const-
     A                                      ant","value":"Data Provider   :","c-
     A                                      ursor row":"22","cursor column":"4"-
     A                                      ,"left":"295px","top":"570px","css -
     A                                      class 2":"profound-converted","pare-
     A                                      nt tab panel":"W7417F_SCR03_MainTab-
     A                                      Panel","parent tab":"0"},{"id":"Lbl-
     A                                      TpeFein","field type":"output field-
     A                                      ","css class":"constant","value":"T-
     A                                      PE Fein     :","cursor row":"22","c-
     A                                      ursor column":"4","left":"295px","t-
     A                                      op":"610px","css class 2":"profound-
     A                                      -converted","parent tab panel":"W74-
     A                                      17F_SCR03_MainTabPanel","parent tab-
     A                                      ":"0"},{"id":"SCDtaPvdr","field typ-
     A                                      e":"select box","css class":"input"-
     A                                      ,"value":{"fieldName":"SCDtaPvdr","-
     A                                      dataLength":"1","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[SCDtaPvdr]"},"set focus":{"field-
     A                                      Name":"68","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error messages":-
     A                                      "1 message","error message id":"WCR-
     A                                      1087","error message file":"WMESGG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"77","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error enhanced mode":"0","choices":-
     A                                      "Insurance Carrier,Data Collection -
     A                                      Organization,Third Party Entity","c-
     A                                      hoice values":"C,D,T","left":"410px-
     A                                      ","top":"570px","css class 2":"drop-
     A                                      down","parent tab panel":"W7417F_SC-
     A                                      R03_MainTabPanel","parent tab":"0"}-
     A                                      ,{"id":"SCTPEFein","field type":"te-
     A                                      xtbox","css class":"input","value":-
     A                                      {"fieldName":"SCTFein","dataLength"-
     A                                      :"9","decPos":"0","nu')
     A                                  1  2HTML('mSep":"false","zeroBalance":"-
     A                                      false","numBlankFill":"false","zero-
     A                                      Fill":"false","noExtraSpaces":"fals-
     A                                      e","curSym":"","dataType":"zoned","-
     A                                      formatting":"Number","negNum":"-999-
     A                                      .00","units":"","designValue":"[SCT-
     A                                      Fein]"},"cursor row":"22","cursor c-
     A                                      olumn":"20","error messages":"1 mes-
     A                                      sage","left":"410px","top":"610px",-
     A                                      "width":"90px","css class 2":"textb-
     A                                      ox","parent tab panel":"W7417F_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","e-
     A                                      rror message id":"WCR0502","error m-
     A                                      essage file":"WMESGG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"47","customTrue":""-
     A                                      ,"customFalse":"","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error enhanced m-
     A                                      ode":"0"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCITY        30A  H
     A            SCCNAM        25A  H
     A            SCDTAPVDR      1A  H
     A            SCEXT          6S 0H
     A            SCMAIL        31A  H
     A            SCPRDS        40A  H
     A            SCST2          2A  H
     A            SCSTRT        60A  H
     A            SCTFEIN        9S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFAX1    R        H      REFFLD(PHN1)
     A            SCFAX2    R        H      REFFLD(PHN2)
     A            SCFAXA    R        H      REFFLD(AREA)
     A            SCPHN1    R        H      REFFLD(PHN1)
     A            SCPHN2    R        H      REFFLD(PHN2)
     A            SCPHNA    R        H      REFFLD(AREA)
     A            SCZIP1    R        H      REFFLD(ZIP1)
     A            SCZIP2    R        H      REFFLD(ZIP2)
     A          R SCR04S                    SFL
     A                                      SETOF(10)
     A  19        QPUI000001     1A  O  2  2
     A            SCEMPS    R        H      REFFLD(EMP#)
     A            SCENAM    R        H      REFFLD(DS30)
     A            SCFND2    R        H      REFFLD(FND)
     A            SCSTAT    R        H      REFFLD(DS10)
     A            SCTRDT    R        H      REFFLD(DT8)
     A            SCTYPE    R        H      REFFLD(DS9)
     A            SCUNID    R        H      REFFLD(A120)
     A          R QSFLCTL001                SFLCTL(SCR04S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR04C')
     A          R SCR04C
     A  10 11 18
     A  21 22 51
     A  52 53 54                            CA01(10 'Response Indicator *IN10')
     A  01 02 03
     A  04 05 31
     A  17 32 67                            CA02(11 'Response Indicator *IN11')
     A  68                                  CA03(18 'Response Indicator *IN18')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(51 'Response Indicator *IN51')
     A                                      SETOF(52 'Response Indicator *IN52')
     A                                      SETOF(53 'Response Indicator *IN53')
     A                                      SETOF(54 'Response Indicator *IN54')
     A                                  1  2HTML('QPUICTL1    SCR04S    7    RS-
     A                                      FLDSP    0    E1    3     01RSFLDSP-
     A                                      CTL 0    E1    3     01RSFLINZ    0-
     A                                          E1    3     02RSFLDLT    0    E-
     A                                      1    3     03RSFLCLR    0    E1    -
     A                                      3     04RSFLPAG    1    C2    11 RS-
     A                                      FLSIZ    1    C2    12 1    RSFLNXT-
     A                                      CHG 0    E1    3     199    ROVERLA-
     A                                      Y   0     RROWS      2    C1    1C2-
     A                                          21 RSFLMSGID  4    C7    WCR218-
     A                                      0C6    WMESGGC5    *LIBLC0    E1   -
     A                                       3     21RSFLMSG    1    C49   You -
     A                                      cannot use this function with optio-
     A                                      ns pendingE1    3     22RSFLMSGID  -
     A                                      4    C7    SCM0516C6    SCMESGC5   -
     A                                       *LIBLC0    E1    3     51RSFLMSGID-
     A                                        4    C7    SCM0517C6    SCMESGC5 -
     A                                         *LIBLC0    E1    3     52RSFLMSG-
     A                                      ID  4    C7    SCM0518C6    SCMESGC-
     A                                      5    *LIBLC0    E1    3     53RSFLM-
     A                                      SGID  4    C7    SCM0519C6    SCMES-
     A                                      GC5    *LIBLC0    E1    3     54RSF-
     A                                      LMSGID  4    C7    WCR0600C6    WME-
     A                                      SGGC5    *LIBLC0    E2    6     31 -
     A                                      176     32 18')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR04C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"set off":{"fieldName":"*IN21","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 2":{"fieldName":"*IN22","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 3":{"fieldName":"*IN51","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 4-
     A                                      ":{"fieldName":"*IN52","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 5":{-
     A                                      "fieldName":"*IN53","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 6":{"fi-
     A                                      eldName":"*IN54","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"overlay":"true","e-
     A                                      rror message id":"WCR2180","error m-
     A                                      essage file":"WMESGG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"21","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"7 messages","error message 2":"Y-
     A                                      ou cannot use this function with op-
     A                                      tions pending","error condition 2":-
     A                                      {"fieldName":"22","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error message id-
     A                                       3":"SCM0516","error message file 3-
     A                                      ":"SCMESG","error message library 3-
     A                                      ":"*LIBL","error condition 3":{"fie-
     A                                      ldName":"51","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error message id 4":"-
     A                                      SCM0517","error message file 4":"SC-
     A                                      MESG","error message library 4":"*L-
     A                                      IBL","error condition 4":{"fieldNam-
     A                                      e":"52","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 5":"SCM05-
     A                                      18","error message file 5":"SCMESG"-
     A                                      ,"error message library 5":"*LIBL",-
     A                                      "error condition 5":{"fieldName":"5-
     A                                      3","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 6":"SCM0519","-
     A                                      error message file 6":"SCMESG","err-
     A                                      or message library 6":"*LIBL","erro-
     A                                      r condition 6":{"fieldName":"54","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror message id 7":"WCR0600","error-
     A                                       message file 7":"WMESGG","error me-
     A                                      ssage library 7":"*LIBL","error con-
     A                                      dition 7":{"fieldName":"31 and 17 o-
     A                                      r 32 and 18","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"valid command key":{"-
     A                                      fieldName":"*IN11","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"overlay range":"-
     A                                      1-21"},"items":[{"id":"HHREC#","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"')
     A                                  1  2HTML('fieldName":"HHREC#","designVa-
     A                                      lue":"[HHREC#]","dataType":"zoned",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"true","zeroFill"-
     A                                      :"true","curSym":"","units":"","neg-
     A                                      Num":"-999.00","dataLength":"4","de-
     A                                      cPos":"0"},"left":"0px","top":"-30p-
     A                                      x","width":"28px","text align":"rig-
     A                                      ht","css class":"profound-converted-
     A                                      "},{"id":"W7417F_SCR04C_avKeys","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"AV_KEYS","dataLength":"-
     A                                      1134","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[AV_KEYS-
     A                                      ]"},"left":"0px","top":"0px","visib-
     A                                      ility":"hidden"},{"id":"W7417F_SCR0-
     A                                      4C_action","field type":"html conta-
     A                                      iner","white space":"normal","left"-
     A                                      :"0px","top":"10px","width":"230px"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","height":"700px","html":"<div cl-
     A                                      ass=\"top\"></div><div class=\"imag-
     A                                      etop\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_top.png\" /></div><d-
     A                                      iv class=\"menulinks\"></div><div c-
     A                                      lass=\"imagebottom\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_bottom-
     A                                      .png\" /></div><div class=\"bottom\-
     A                                      "></div>"},{"field type":"icon menu-
     A                                       button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"32px","z index":"20","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1170px",-
     A                                      "id":"W7417F_SCR04C_BtnIconMenuSyst-
     A                                      emTools","tool tip":"System Tools",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"W7417F_SCR04C_But-
     A                                      tonBar","top":"35px","left":"1036px-
     A                                      ","width":"187px","height":"28px","-
     A                                      css class":"stationary","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1040px","id-
     A                                      ":"W7417F_SCR04C_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibili')
     A                                  1  2HTML('ty":"hidden","locked in place-
     A                                      ":"true","left":"1066px","id":"W741-
     A                                      7F_SCR04C_BtnRefresh","tool tip":"R-
     A                                      efresh","onclick":"SystemToolbarRef-
     A                                      resh","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/re-
     A                                      fresh.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1092px","id":"W7417F_SCR04C_BtnSe-
     A                                      arch","tool tip":"Search","onclick"-
     A                                      :"SystemToolbarSearch","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/search.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1118px","id":"W74-
     A                                      17F_SCR04C_BtnDiaryItems","tool tip-
     A                                      ":"Diary/Work Items - IDARTS","oncl-
     A                                      ick":"SystemToolbarDiary","backgrou-
     A                                      nd image":{"fieldName":"DryIcnURL",-
     A                                      "dataLength":"128","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"}},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1144px","id":"W7417F_-
     A                                      SCR04C_BtnSystemMessages","tool tip-
     A                                      ":"System Messages","onclick":"Syst-
     A                                      emToolbarMessages","background imag-
     A                                      e":{"fieldName":"MsgIcnURL","dataLe-
     A                                      ngth":"128","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none"}},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1196px","id":"W7417F_SCR04C_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoun')
     A                                  1  2HTML('dui/userdata/images/systool/h-
     A                                      elp.png'')"},{"id":"W7417F_SCR04C_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"W7417F_SCR04C_M-
     A                                      ainTabPanel","field type":"tab pane-
     A                                      l","tab panel style":"Transform","t-
     A                                      ab names":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"active tab":"0","left"-
     A                                      :"250px","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W7417F-
     A                                      _SCR04C_BtnHiddenSave","value":"btn-
     A                                      Save","top":"100px","response":{"fi-
     A                                      eldName":"btnSave","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant5-
     A                                      1","field type":"output field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss":"top-line","value":"js: current-
     A                                      User()","css class 2":"output-field-
     A                                      ","parent tab panel":"W7417F_SCR04C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"SCR04C_SCCONM","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCCONM","designValue":"[SCCONM]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"414px","curs-
     A                                      or column":"21","top":"110px","curs-
     A                                      or row":"1","css class 2":"top-line-
     A                                      ","css class 3":"HI","description":-
     A                                      "COMPANY NAME","parent tab panel":"-
     A                                      W7417F_SCR04C_MainTabPanel","parent-
     A                                       tab":"0","css class 4":"profound-c-
     A                                      onverted"},{"id":"constant52","fiel-
     A                                      d type":"output field","left":"778p-
     A                                      x","cursor column":"73","top":"110p-
     A                                      x","cursor row":"1","css class":"to-
     A                                      p-line","value":"js: currentDate()"-
     A                                      ,"css class 2":"output-field","pare-
     A                                      nt tab panel":"W7417F_SCR04C_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"W7-
     A                                      417F_SCR04C_fkeyMenu","field type":-
     A                                      "menu","left":"10px","top":"120px",-
     A                                      "height":"350px","width":"230px","h-
     A                                      over background color":"#9AAA61","h-
     A                                      over text color":"#FFFFFF","border -
     A                                      color":"#4C6106","menu option inden-
     A                                      t":"10px","background color":"#758B-
     A                                      27","css class":"action-menu","css -
     A                                      class 2":"stationary","z index":"10-
     A                                      1"},{"field type":"bu')
     A                                  1  2HTML('tton","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W7417F_SCR04C_BtnHidden-
     A                                      Refresh","value":"btnRefresh","top"-
     A                                      :"125px","response":{"fieldName":"b-
     A                                      tnRefresh","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"Q1PGM1","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"Q1PGM1","designValue":"[Q1PGM-
     A                                      1]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one","dataLength":"10"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"W74-
     A                                      17F_SCR04C_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCPRDS","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCPRDS","designValue":"[SCPRDS]"-
     A                                      ,"refField":"NAME","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"414px","c-
     A                                      ursor column":"21","top":"130px","c-
     A                                      ursor row":"2","css class 2":"HI","-
     A                                      description":"PROGRAM NAME","parent-
     A                                       tab panel":"W7417F_SCR04C_MainTabP-
     A                                      anel","parent tab":"0","visibility"-
     A                                      :"hidden","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant53","fiel-
     A                                      d type":"output field","value":"SCR-
     A                                      04","css class":"constant","left":"-
     A                                      799px","cursor column":"76","top":"-
     A                                      130px","cursor row":"2","parent tab-
     A                                       panel":"W7417F_SCR04C_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W7417F_SCR04C_BtnHiddenSear-
     A                                      ch","value":"btnSearch","top":"150p-
     A                                      x","response":{"fieldName":"btnSear-
     A                                      ch","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant54","field type"-
     A                                      :"output field","value":"Group:","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"N67","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "170px","cursor row":"4","parent ta-
     A                                      b panel":"W7417F_SCR04C_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t55","field type":"output field","v-
     A                                      alue":"Carrier #:","css class":"con-
     A                                      stant","visibility":{"fieldName":"6-
     A                                      7","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"281px","curso-
     A                                      r column":"2","top":"170px","cursor-
     A                                       row":"4","parent tab panel":"W7417-
     A                                      F_SCR04C_MainTabPanel')
     A                                  1  2HTML('","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      R04C_SCFND","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCFND","-
     A                                      designValue":"[SCFND]","refField":"-
     A                                      FND","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00"},"css class":"output-field-
     A                                      ","visibility":{"fieldName":"N67","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"330px","cursor co-
     A                                      lumn":"9","top":"170px","cursor row-
     A                                      ":"4","width":"21px","text align":"-
     A                                      right","parent tab panel":"W7417F_S-
     A                                      CR04C_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCNAME","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      NAME","designValue":"[SCNAME]","ref-
     A                                      Field":"NM60","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","visibility":{"fieldNa-
     A                                      me":"N67","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"358px"-
     A                                      ,"cursor column":"13","top":"170px"-
     A                                      ,"cursor row":"4","description":"FU-
     A                                      ND NAME","parent tab panel":"W7417F-
     A                                      _SCR04C_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCCARR","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCCARR","designValue":"[SCCARR]","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00","da-
     A                                      taLength":"5","decPos":"0"},"css cl-
     A                                      ass":"output-field","visibility":{"-
     A                                      fieldName":"67 and N68","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"358px","cursor column":"13"-
     A                                      ,"top":"170px","cursor row":"4","wi-
     A                                      dth":"35px","text align":"right","p-
     A                                      arent tab panel":"W7417F_SCR04C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant56","field type":"output f-
     A                                      ield","value":"Various Carrier IDs"-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"67 and 68","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"358px","cursor column":"-
     A                                      13","top":"170px","cursor row":"4",-
     A                                      "parent tab panel":"W7417F_SCR04C_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant57","field type":"output-
     A                                       field","value":"Multiple Group Sub-
     A                                      mission","css class":"constant","vi-
     A                                      sibility":{"fieldName":"67 and N68"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"400px","cursor -
     A                                      column":"19","top":"1')
     A                                  1  2HTML('70px","cursor row":"4","paren-
     A                                      t tab panel":"W7417F_SCR04C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W7417F_SCR04C_BtnHidde-
     A                                      nDiaryItems","value":"btnDiary","to-
     A                                      p":"175px","response":{"fieldName":-
     A                                      "btnDiary","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      7417F_SCR04C_BtnHiddenSystemMessage-
     A                                      s","value":"btnMessage","top":"200p-
     A                                      x","response":{"fieldName":"btnMess-
     A                                      age","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"SCEMPX","field type":"p-
     A                                      assword field","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCEMPX","designValue":"[-
     A                                      SCEMPX]","refField":"EMP#","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"-999.00"},"l-
     A                                      eft":"274px","cursor column":"1","t-
     A                                      op":"210px","cursor row":"6","width-
     A                                      ":"64px","read only":"true","css cl-
     A                                      ass 3":"PR-UL","parent tab panel":"-
     A                                      W7417F_SCR04C_MainTabPanel","parent-
     A                                       tab":"0","css class 4":"profound-c-
     A                                      onverted"},{"id":"SCR04C_SCENAM","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCENAM","designValue":-
     A                                      "[SCENAM]","refField":"DS30","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "372px","cursor column":"15","top":-
     A                                      "210px","cursor row":"6","visibilit-
     A                                      y":"hidden","description":"EMPLOYER-
     A                                       NAME","parent tab panel":"W7417F_S-
     A                                      CR04C_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCEMP#","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      EMP#","designValue":"[SCEMP#]","ref-
     A                                      Field":"EMP#","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"false","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"999.00"},"css class":"out-
     A                                      put-field","left":"596px","cursor c-
     A                                      olumn":"47","top":"210px","cursor r-
     A                                      ow":"6","width":"63px","text align"-
     A                                      :"right","visibility":"hidden","des-
     A                                      cription":"Employer Number","parent-
     A                                       tab panel":"W7417F_SCR04C_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","v')
     A                                  1  2HTML('isibility":"hidden","id":"W74-
     A                                      17F_SCR04C_BtnHiddenWorkSubmitJob",-
     A                                      "value":"btnWrksbmjob","top":"225px-
     A                                      ","response":{"fieldName":"btnWrkJo-
     A                                      b","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"constant58","field type":-
     A                                      "output field","value":"The policie-
     A                                      s listed below will be processed wh-
     A                                      en <ENTER> is pressed.","css class"-
     A                                      :"constant","left":"309px","cursor -
     A                                      column":"6","top":"230px","cursor r-
     A                                      ow":"7","css class 2":"BLU","css cl-
     A                                      ass 3":"UL","parent tab panel":"W74-
     A                                      17F_SCR04C_MainTabPanel","parent ta-
     A                                      b":"0","css class 4":"profound-conv-
     A                                      erted"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W741-
     A                                      7F_SCR04C_BtnHiddenWorkPrinterOutpu-
     A                                      t","value":"btnWrkprtout","top":"25-
     A                                      0px","response":{"fieldName":"btnWr-
     A                                      kPrnt","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W7417-
     A                                      F_SCR04C_BtnHiddenImageQueue","valu-
     A                                      e":"btnImgQue","top":"275px","respo-
     A                                      nse":{"fieldName":"btnImgQue","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant59","field type":"output -
     A                                      field","value":"Type","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"290px","cursor row-
     A                                      ":"10","css class 2":"HI","parent t-
     A                                      ab panel":"W7417F_SCR04C_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted","css class 4":-
     A                                      "subfile-heading"},{"id":"constant6-
     A                                      0","field type":"output field","val-
     A                                      ue":"Date","css class":"constant","-
     A                                      left":"351px","cursor column":"12",-
     A                                      "top":"290px","cursor row":"10","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "W7417F_SCR04C_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted","css class 4":"subfile-h-
     A                                      eading"},{"id":"constant61","field -
     A                                      type":"output field","value":"Grp",-
     A                                      "css class":"constant","left":"435p-
     A                                      x","cursor column":"24","top":"290p-
     A                                      x","cursor row":"10","css class 2":-
     A                                      "HI","parent tab panel":"W7417F_SCR-
     A                                      04C_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted",-
     A                                      "css class 4":"subfile-heading"},{"-
     A                                      id":"constant62","field type":"outp-
     A                                      ut field","value":"Emp #","css clas-
     A                                      s":"constant","left":"463px","curso-
     A                                      r column":"28","top":"290px","curso-
     A                                      r row":"10","css class 2":"HI","par-
     A                                      ent tab panel":"W7417F_SCR04C_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted","css clas-
     A                                      s 4":"subfile-heading"},{"id":"cons-
     A                                      tant63","field type":')
     A                                  1  2HTML('"output field","value":"Emplo-
     A                                      yer Name","css class":"constant","l-
     A                                      eft":"533px","cursor column":"38","-
     A                                      top":"290px","cursor row":"10","css-
     A                                       class 2":"HI","parent tab panel":"-
     A                                      W7417F_SCR04C_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted","css class 4":"subfile-he-
     A                                      ading"},{"id":"constant64","field t-
     A                                      ype":"output field","value":"Status-
     A                                      ","css class":"constant","left":"75-
     A                                      0px","cursor column":"69","top":"29-
     A                                      0px","cursor row":"10","css class 2-
     A                                      ":"HI","parent tab panel":"W7417F_S-
     A                                      CR04C_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      ","css class 4":"subfile-heading"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W7417F_SCR04-
     A                                      C_BtnHiddenHelp","value":"btnHelp",-
     A                                      "top":"300px","response":{"fieldNam-
     A                                      e":"btnHelp","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"SCR04S","field -
     A                                      type":"grid","number of columns":"6-
     A                                      ","record format name":"SCR04S","su-
     A                                      bfile next changed":{"fieldName":"1-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"display subfile":{"field-
     A                                      Name":"01","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"display control -
     A                                      record":{"fieldName":"01","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      lear subfile":{"fieldName":"04","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"subfile size":"12","initialize-
     A                                       subfile":{"fieldName":"02","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "delete subfile":{"fieldName":"03",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"place cursor":"true","heade-
     A                                      r height":"20","row height":"20","c-
     A                                      ss class":"subfilegrid","css class -
     A                                      2":"profound-converted","parent tab-
     A                                       panel":"W7417F_SCR04C_MainTabPanel-
     A                                      ","parent tab":"0","subfile end":{"-
     A                                      fieldName":"05","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"page down r-
     A                                      esponse":{"fieldName":"*IN18","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"show -
     A                                      paging controls":"true","show page -
     A                                      number":"true","scrollbar":"none","-
     A                                      number of rows":"12","top":"290px",-
     A                                      "left":"276px","column widths":"70,-
     A                                      84,28,70,217,105","subfile record n-
     A                                      umber":{"fieldName":"HHREC#","desig-
     A                                      nValue":"[HHREC#]","dataType":"zone-
     A                                      d","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"true","curSym":"","units":"","-
     A                                      negNum":"-999.00","da')
     A                                  1  2HTML('taLength":"4","decPos":"0"}},-
     A                                      {"id":"btnSubmit","field type":"but-
     A                                      ton","value":"Enter","shortcut key"-
     A                                      :"Enter","left":"14px","top":"150px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF03","field type":"button","valu-
     A                                      e":"Exit       ","shortcut key":"F3-
     A                                      ","left":"14px","top":"183px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF12"-
     A                                      ,"field type":"button","value":"Can-
     A                                      cel","shortcut key":"F12","left":"1-
     A                                      4px","top":"216px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnHELP","field typ-
     A                                      e":"button","shortcut key":"Alt-F1"-
     A                                      ,"bypass validation":"true","value"-
     A                                      :"HELP","response":{"fieldName":"*I-
     A                                      N10","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"left":"14px","top":"249px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"SCUNID-
     A                                      ","field type":"output field","visi-
     A                                      bility":"hidden","value":{"fieldNam-
     A                                      e":"SCUNID","designValue":"[SCUNID]-
     A                                      ","refField":"A120","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"true","curSym":"","units"-
     A                                      :"","negNum":"-999.00"},"left":"-79-
     A                                      px","top":"-339px","width":"84px","-
     A                                      text align":"right","description":"-
     A                                      UNIQUE IDENTIFIER","css class":"pro-
     A                                      found-converted","grid":"SCR04S","c-
     A                                      olumn":"0"},{"id":"SCTYPE","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCTYPE","designValue":"[SCTY-
     A                                      PE]","refField":"DS9","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"5px","-
     A                                      cursor column":"2","top":"1px","cur-
     A                                      sor row":"11","description":"TRANSM-
     A                                      ISSION TYPE","css class 2":"profoun-
     A                                      d-converted","grid":"SCR04S","colum-
     A                                      n":"0"},{"id":"SCTRDT","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCTRDT","designValue":"[SCTRDT]"-
     A                                      ,"refField":"DT8","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"true","zer-
     A                                      oFill":"true","curSym":"","units":"-
     A                                      ","negNum":"-999.00","edtWrd":"''  -
     A                                      /  /    ''"},"css class":"output-fi-
     A                                      eld","left":"5px","cursor column":"-
     A                                      12","top":"1px","cursor row":"11","-
     A                                      width":"70px","text align":"right",-
     A                                      "description":"TRANSACTION DATE","c-
     A                                      ss class 2":"profound-converted","g-
     A                                      rid":"SCR04S","column":"1"},{"id":"-
     A                                      SCFND2","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCFND2","des-
     A                                      ignValue":"[SCFND2]","refField":"FN-
     A                                      D","dataType":"reference","formatti-
     A                                      ng":"Number","numSep"')
     A                                  1  2HTML(':"false","zeroBalance":"false-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"999.00"},"css cl-
     A                                      ass":"output-field","left":"5px","c-
     A                                      ursor column":"24","top":"1px","cur-
     A                                      sor row":"11","width":"21px","text -
     A                                      align":"right","description":"FUND"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      ,"grid":"SCR04S","column":"2"},{"id-
     A                                      ":"SCEMPS","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCEMPS","-
     A                                      designValue":"[SCEMPS]","refField":-
     A                                      "EMP#","dataType":"reference","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"false","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"999.00"},"css class":"output-fie-
     A                                      ld","left":"5px","cursor column":"2-
     A                                      8","top":"1px","cursor row":"11","w-
     A                                      idth":"63px","text align":"right","-
     A                                      description":"Employer Number","css-
     A                                       class 2":"profound-converted","gri-
     A                                      d":"SCR04S","column":"3"},{"id":"SC-
     A                                      ENAM","field type":"output field","-
     A                                      value":{"fieldName":"SCENAM","desig-
     A                                      nValue":"[SCENAM]","refField":"DS30-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"5px","cursor column":"38",-
     A                                      "top":"1px","cursor row":"11","desc-
     A                                      ription":"EMPLOYER NAME","css class-
     A                                       2":"profound-converted","grid":"SC-
     A                                      R04S","column":"4"},{"id":"SCSTAT",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCSTAT","designValue-
     A                                      ":"[SCSTAT]","refField":"DS10","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"5px","cursor column":"69","top":-
     A                                      "1px","cursor row":"11","descriptio-
     A                                      n":"Status","css class 2":"profound-
     A                                      -converted","grid":"SCR04S","column-
     A                                      ":"5"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HHREC#         4S 0H
     A            MSGICNURL    128A  H
     A            Q1PGM1        10A  H
     A            SCCARR         5S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCEMP#    R        H      REFFLD(EMP#)
     A            SCEMPX    R        H      REFFLD(EMP#)
     A            SCENAM    R        H      REFFLD(DS30)
     A            SCFND     R        H      REFFLD(FND)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR04
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    23C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR04","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"23-23"},"items":[{"id":"W7417F_-
     A                                      SCR04_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"W7417F_SCR04_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"W7417F_SCR04_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"W7-
     A                                      417F_SCR04_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"W7417F_SCR04_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"W7417F_SCR04_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"W7417F_-
     A                                      SCR04_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"W7417F_SCR04_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"W7417F_SCR04_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"W7417-
     A                                      F_SCR04_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"W7417F_-
     A                                      SCR04_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"W7417F_S-
     A                                      CR04_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":"Tab 1","active tab-
     A                                      ":"0","left":"250px","top":"70px","-
     A                                      width":"970px","height":"657px","z -
     A                                      index":"8","locked in place":"true"-
     A                                      ,"css class":"tab-panel","css class-
     A                                       2":"stationary"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W7417F_SCR04_BtnHiddenSave","-
     A                                      value":"btnSave","top":"100px","res-
     A                                      ponse":{"fieldName":"btnSave","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"W7417F_SCR04_fkeyMenu","field typ-
     A                                      e":"menu","left":"10px","top":"120p-
     A                                      x","height":"350px","width":"230px"-
     A                                      ,"hover background color":"#9AAA61"-
     A                                      ,"hover text color":"#FFFFFF","bord-
     A                                      er color":"#4C6106","menu option in-
     A                                      dent":"10px","background color":"#7-
     A                                      58B27","css class":"action-menu","c-
     A                                      ss class 2":"stationary","z index":-
     A                                      "101"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W7417-
     A                                      F_SCR04_BtnHiddenRefresh","value":"-
     A                                      btnRefresh","top":"125px","response-
     A                                      ":{"fieldName":"btnRefresh","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W7417F_SCR04_BtnHid-
     A                                      denSearch","value":"btnSearch","top-
     A                                      ":"150px","response":{"fieldName":"-
     A                                      btnSearch","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      7417F_SCR04_BtnHiddenDiaryItems","v-
     A                                      alue":"btnDiary","top":"175px","res-
     A                                      ponse":{"fieldName":"btnDiary","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W7417F_SCR04_Btn-
     A                                      HiddenSystemMessages","value":"btnM-
     A                                      essage","top":"200px"')
     A                                  1  2HTML(',"response":{"fieldName":"btn-
     A                                      Message","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"W74-
     A                                      17F_SCR04_BtnHiddenWorkSubmitJob","-
     A                                      value":"btnWrksbmjob","top":"225px"-
     A                                      ,"response":{"fieldName":"btnWrkJob-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W7417F_SCR-
     A                                      04_BtnHiddenWorkPrinterOutput","val-
     A                                      ue":"btnWrkprtout","top":"250px","r-
     A                                      esponse":{"fieldName":"btnWrkPrnt",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W7417F_SCR04-
     A                                      _BtnHiddenImageQueue","value":"btnI-
     A                                      mgQue","top":"275px","response":{"f-
     A                                      ieldName":"btnImgQue","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W7417F_SCR04_BtnHiddenHel-
     A                                      p","value":"btnHelp","top":"300px",-
     A                                      "response":{"fieldName":"btnHelp","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"btnSubmit","field type":"butt-
     A                                      on","value":"Enter","shortcut key":-
     A                                      "Enter","left":"14px","top":"150px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF03","field type":"button","value-
     A                                      ":"Exit       ","shortcut key":"F3"-
     A                                      ,"left":"14px","top":"183px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnHELP",-
     A                                      "field type":"button","shortcut key-
     A                                      ":"Alt-F1","bypass validation":"tru-
     A                                      e","value":"HELP","response":{"fiel-
     A                                      dName":"*IN10","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"left":"14px","top":"-
     A                                      216px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR05
     A  10 11 20
     A  21 22 23
     A  24 25 67                            CA01(10 'Response Indicator *IN10')
     A  68                                  CA02(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    18 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR05","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"valid command key":-
     A                                      {"fieldName":"*IN11","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"overlay range"-
     A                                      :"1-18"},"items":[{"id":"W7417F_SCR-
     A                                      05_avKeys","field type":"output fie-
     A                                      ld","value":{"fieldName":"AV_KEYS",-
     A                                      "dataLength":"1134","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[AV_KEYS]"},"left":"0px","top-
     A                                      ":"0px","visibility":"hidden"},{"id-
     A                                      ":"W7417F_SCR05_action","field type-
     A                                      ":"html container","white space":"n-
     A                                      ormal","left":"0px","top":"10px","w-
     A                                      idth":"230px","css class":"action-p-
     A                                      anel-converted","height":"700px","h-
     A                                      tml":"<div class=\"top\"></div><div-
     A                                       class=\"imagetop\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_top.png-
     A                                      \" /></div><div class=\"menulinks\"-
     A                                      ></div><div class=\"imagebottom\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_bottom.png\" /></div><div cl-
     A                                      ass=\"bottom\"></div>"},{"field typ-
     A                                      e":"icon menu button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"32px","z index":"20"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1170px","id":"W7417F_SCR05_Btn-
     A                                      IconMenuSystemTools","tool tip":"Sy-
     A                                      stem Tools","icon source":"/profoun-
     A                                      dui/userdata/images/systool/systool-
     A                                      s.png","data function":"SystemToolb-
     A                                      arSystools","show down arrow":"Yes"-
     A                                      },{"field type":"panel","panel styl-
     A                                      e":"TransformButtonBar","id":"W7417-
     A                                      F_SCR05_ButtonBar","top":"35px","le-
     A                                      ft":"1036px","width":"187px","heigh-
     A                                      t":"28px","css class":"stationary",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-rep')
     A                                  1  2HTML('eat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1040px","id":"W-
     A                                      7417F_SCR05_BtnSave","tool tip":"Sa-
     A                                      ve","onclick":"SystemToolbarSave","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/save.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1066px",-
     A                                      "id":"W7417F_SCR05_BtnRefresh","too-
     A                                      l tip":"Refresh","onclick":"SystemT-
     A                                      oolbarRefresh","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/refresh.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1092px","id":"W7417F_SCR-
     A                                      05_BtnSearch","tool tip":"Search","-
     A                                      onclick":"SystemToolbarSearch","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/search.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1118px","-
     A                                      id":"W7417F_SCR05_BtnDiaryItems","t-
     A                                      ool tip":"Diary/Work Items - IDARTS-
     A                                      ","onclick":"SystemToolbarDiary","b-
     A                                      ackground image":{"fieldName":"DryI-
     A                                      cnURL","dataLength":"128","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none"}},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1144px","id":"-
     A                                      W7417F_SCR05_BtnSystemMessages","to-
     A                                      ol tip":"System Messages","onclick"-
     A                                      :"SystemToolbarMessages","backgroun-
     A                                      d image":{"fieldName"')
     A                                  1  2HTML(':"MsgIcnURL","dataLength":"12-
     A                                      8","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"}},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      96px","id":"W7417F_SCR05_BtnHelp","-
     A                                      tool tip":"Help","onclick":"SystemT-
     A                                      oolbarHelp","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/help.png'')"},{"id":"W7417F_SCR-
     A                                      05_ImgSysToolBottom","field type":"-
     A                                      image","image source":"/profoundui/-
     A                                      userdata/images/systool/butbarbot.p-
     A                                      ng","left":"1036px","top":"64px","w-
     A                                      idth":"187px","locked in place":"tr-
     A                                      ue","css class":"stationary","visib-
     A                                      ility":"hidden"},{"id":"W7417F_SCR0-
     A                                      5_MainTabPanel","field type":"tab p-
     A                                      anel","tab panel style":"Transform"-
     A                                      ,"tab names":{"fieldName":"SCPRDS",-
     A                                      "dataLength":"40","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"},"active ta-
     A                                      b":"0","left":"250px","top":"70px",-
     A                                      "width":"970px","height":"657px","z-
     A                                       index":"8","locked in place":"true-
     A                                      ","css class":"tab-panel","css clas-
     A                                      s 2":"stationary"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"W7417F_SCR05_BtnHiddenSave",-
     A                                      "value":"btnSave","top":"100px","re-
     A                                      sponse":{"fieldName":"btnSave","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant65","field type":"output-
     A                                       field","left":"281px","cursor colu-
     A                                      mn":"2","top":"110px","cursor row":-
     A                                      "1","css class":"top-line","value":-
     A                                      "js: currentUser()","css class 2":"-
     A                                      output-field","parent tab panel":"W-
     A                                      7417F_SCR05_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"SCR05_SCCONM","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCCONM","designValue":"[S-
     A                                      CCONM]","refField":"NAME","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"41-
     A                                      4px","cursor column":"21","top":"11-
     A                                      0px","cursor row":"1","css class 2"-
     A                                      :"top-line","css class 3":"HI","des-
     A                                      cription":"COMPANY NAME","parent ta-
     A                                      b panel":"W7417F_SCR05_MainTabPanel-
     A                                      ","parent tab":"0","css class 4":"p-
     A                                      rofound-converted"},{')
     A                                  1  2HTML('"id":"constant66","field type-
     A                                      ":"output field","left":"778px","cu-
     A                                      rsor column":"73","top":"110px","cu-
     A                                      rsor row":"1","css class":"top-line-
     A                                      ","value":"js: currentDate()","css -
     A                                      class 2":"output-field","parent tab-
     A                                       panel":"W7417F_SCR05_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"W7417F_SC-
     A                                      R05_fkeyMenu","field type":"menu","-
     A                                      left":"10px","top":"120px","height"-
     A                                      :"350px","width":"230px","hover bac-
     A                                      kground color":"#9AAA61","hover tex-
     A                                      t color":"#FFFFFF","border color":"-
     A                                      #4C6106","menu option indent":"10px-
     A                                      ","background color":"#758B27","css-
     A                                       class":"action-menu","css class 2"-
     A                                      :"stationary","z index":"101"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W7417F_SCR05_Btn-
     A                                      HiddenRefresh","value":"btnRefresh"-
     A                                      ,"top":"125px","response":{"fieldNa-
     A                                      me":"btnRefresh","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"SCR05_Q1PGM-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"Q1PGM","designValu-
     A                                      e":"[Q1PGM]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none","dataLength":"10"},"c-
     A                                      ss class":"output-field","left":"28-
     A                                      1px","cursor column":"2","top":"130-
     A                                      px","cursor row":"2","parent tab pa-
     A                                      nel":"W7417F_SCR05_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"constant67",-
     A                                      "field type":"output field","value"-
     A                                      :"WCPOLS Data Transmission Prompt",-
     A                                      "css class":"constant","left":"442p-
     A                                      x","cursor column":"25","top":"130p-
     A                                      x","cursor row":"2","css class 2":"-
     A                                      HI","parent tab panel":"W7417F_SCR0-
     A                                      5_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant68","field type":"out-
     A                                      put field","value":"SCR05","css cla-
     A                                      ss":"constant","left":"799px","curs-
     A                                      or column":"76","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"W74-
     A                                      17F_SCR05_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W7417-
     A                                      F_SCR05_BtnHiddenSearch","value":"b-
     A                                      tnSearch","top":"150px","response":-
     A                                      {"fieldName":"btnSearch","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant69","field type":"output field-
     A                                      ","value":"Group:","css class":"con-
     A                                      stant","visibility":{"fieldName":"N-
     A                                      67","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"281px","curs-
     A                                      or column":"2","top":')
     A                                  1  2HTML('"170px","cursor row":"4","par-
     A                                      ent tab panel":"W7417F_SCR05_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant70","field type":"output fiel-
     A                                      d","value":"Carrier #:","css class"-
     A                                      :"constant","visibility":{"fieldNam-
     A                                      e":"67","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"281px","-
     A                                      cursor column":"2","top":"170px","c-
     A                                      ursor row":"4","parent tab panel":"-
     A                                      W7417F_SCR05_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCR05_SCFND","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCFND","designValue":"[SC-
     A                                      FND]","refField":"FND","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"999.00"},"css cl-
     A                                      ass":"output-field","visibility":{"-
     A                                      fieldName":"N67","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "330px","cursor column":"9","top":"-
     A                                      170px","cursor row":"4","width":"21-
     A                                      px","text align":"right","parent ta-
     A                                      b panel":"W7417F_SCR05_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCR05_SC-
     A                                      NAME","field type":"output field","-
     A                                      value":{"fieldName":"SCNAME","desig-
     A                                      nValue":"[SCNAME]","refField":"NM60-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"visibility":{"fieldName":"N67","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"left":"358px","cursor col-
     A                                      umn":"13","top":"170px","cursor row-
     A                                      ":"4","description":"FUND NAME","pa-
     A                                      rent tab panel":"W7417F_SCR05_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"c-
     A                                      onstant71","field type":"output fie-
     A                                      ld","value":"Various Carrier IDs","-
     A                                      css class":"constant","visibility":-
     A                                      {"fieldName":"67 and 68","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"358px","cursor column":"13-
     A                                      ","top":"170px","cursor row":"4","p-
     A                                      arent tab panel":"W7417F_SCR05_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCR05_SCCARR","field type":"output -
     A                                      field","value":{"fieldName":"SCCARR-
     A                                      ","designValue":"[SCCARR]","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","dataLeng-
     A                                      th":"5","decPos":"0"},"css class":"-
     A                                      output-field","visibility":{"fieldN-
     A                                      ame":"67 and N68","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"358px","cursor colu')
     A                                  1  2HTML('mn":"13","top":"170px","curso-
     A                                      r row":"4","width":"35px","text ali-
     A                                      gn":"right","parent tab panel":"W74-
     A                                      17F_SCR05_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"constant72","field ty-
     A                                      pe":"output field","value":"Multipl-
     A                                      e Group Submission","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      67 and N68","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"400p-
     A                                      x","cursor column":"19","top":"170p-
     A                                      x","cursor row":"4","parent tab pan-
     A                                      el":"W7417F_SCR05_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W7417F_SCR05_BtnHiddenDiaryItems-
     A                                      ","value":"btnDiary","top":"175px",-
     A                                      "response":{"fieldName":"btnDiary",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W7417F_SCR05-
     A                                      _BtnHiddenSystemMessages","value":"-
     A                                      btnMessage","top":"200px","response-
     A                                      ":{"fieldName":"btnMessage","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant73","field type":"output fi-
     A                                      eld","value":"Total number of recor-
     A                                      ds processed:","css class":"constan-
     A                                      t","left":"295px","cursor column":"-
     A                                      4","top":"210px","cursor row":"6","-
     A                                      parent tab panel":"W7417F_SCR05_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCTOTR","field type":"output field-
     A                                      ","value":{"fieldName":"SCTOTR","de-
     A                                      signValue":"[SCTOTR]","dataType":"z-
     A                                      oned","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"true","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00","dataLength":"-
     A                                      9","decPos":"0"},"css class":"outpu-
     A                                      t-field","left":"540px","cursor col-
     A                                      umn":"39","top":"210px","cursor row-
     A                                      ":"6","width":"63px","text align":"-
     A                                      right","css class 2":"HI","parent t-
     A                                      ab panel":"W7417F_SCR05_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W7417F_SCR05_BtnHiddenWork-
     A                                      SubmitJob","value":"btnWrksbmjob","-
     A                                      top":"225px","response":{"fieldName-
     A                                      ":"btnWrkJob","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant74","f-
     A                                      ield type":"output field","value":"-
     A                                      Total number of header records   :"-
     A                                      ,"css class":"constan')
     A                                  1  2HTML('t","left":"295px","cursor col-
     A                                      umn":"4","top":"250px","cursor row"-
     A                                      :"8","parent tab panel":"W7417F_SCR-
     A                                      05_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCTOTH","field type":"output-
     A                                       field","value":{"fieldName":"SCTOT-
     A                                      H","designValue":"[SCTOTH]","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"999.00","dataLen-
     A                                      gth":"9","decPos":"0"},"css class":-
     A                                      "output-field","left":"540px","curs-
     A                                      or column":"39","top":"250px","curs-
     A                                      or row":"8","width":"63px","text al-
     A                                      ign":"right","css class 2":"HI","pa-
     A                                      rent tab panel":"W7417F_SCR05_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W7417F_SCR05_BtnHidd-
     A                                      enWorkPrinterOutput","value":"btnWr-
     A                                      kprtout","top":"250px","response":{-
     A                                      "fieldName":"btnWrkPrnt","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W7417F_SCR05_BtnHidden-
     A                                      ImageQueue","value":"btnImgQue","to-
     A                                      p":"275px","response":{"fieldName":-
     A                                      "btnImgQue","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant75","fie-
     A                                      ld type":"output field","value":"Br-
     A                                      eakdown of records:","css class":"c-
     A                                      onstant","left":"295px","cursor col-
     A                                      umn":"4","top":"290px","cursor row"-
     A                                      :"10","parent tab panel":"W7417F_SC-
     A                                      R05_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"W7417F_SCR0-
     A                                      5_BtnHiddenHelp","value":"btnHelp",-
     A                                      "top":"300px","response":{"fieldNam-
     A                                      e":"btnHelp","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant76","fi-
     A                                      eld type":"output field","value":"N-
     A                                      ew policies                  :","cs-
     A                                      s class":"constant","left":"316px",-
     A                                      "cursor column":"7","top":"310px","-
     A                                      cursor row":"11","parent tab panel"-
     A                                      :"W7417F_SCR05_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCTLNP","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCTLNP","designValue":"[SCTL-
     A                                      NP]","dataType":"zoned","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"true","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00","dataLength":"9",')
     A                                  1  2HTML('"decPos":"0"},"css class":"ou-
     A                                      tput-field","left":"540px","cursor -
     A                                      column":"39","top":"310px","cursor -
     A                                      row":"11","width":"63px","text alig-
     A                                      n":"right","css class 2":"HI","pare-
     A                                      nt tab panel":"W7417F_SCR05_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant77","field type":"output field-
     A                                      ","value":"Renewal policies        -
     A                                            :","css class":"constant","le-
     A                                      ft":"316px","cursor column":"7","to-
     A                                      p":"330px","cursor row":"12","paren-
     A                                      t tab panel":"W7417F_SCR05_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCTL-
     A                                      RP","field type":"output field","va-
     A                                      lue":{"fieldName":"SCTLRP","designV-
     A                                      alue":"[SCTLRP]","dataType":"zoned"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"true","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00","dataLength":"9","d-
     A                                      ecPos":"0"},"css class":"output-fie-
     A                                      ld","left":"540px","cursor column":-
     A                                      "39","top":"330px","cursor row":"12-
     A                                      ","width":"63px","text align":"righ-
     A                                      t","css class 2":"HI","parent tab p-
     A                                      anel":"W7417F_SCR05_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant78"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Cancellations                 :"-
     A                                      ,"css class":"constant","left":"316-
     A                                      px","cursor column":"7","top":"350p-
     A                                      x","cursor row":"13","parent tab pa-
     A                                      nel":"W7417F_SCR05_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCTLCX","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCTLCX","designValue":"[-
     A                                      SCTLCX]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00","dataLength":"9","decPos":"-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"540px","cursor column":"39","to-
     A                                      p":"350px","cursor row":"13","width-
     A                                      ":"63px","text align":"right","css -
     A                                      class 2":"HI","parent tab panel":"W-
     A                                      7417F_SCR05_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"constant79","field -
     A                                      type":"output field","value":"Reins-
     A                                      tatements                :","css cl-
     A                                      ass":"constant","left":"316px","cur-
     A                                      sor column":"7","top":"370px","curs-
     A                                      or row":"14","parent tab panel":"W7-
     A                                      417F_SCR05_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCTLRE","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCTLRE","designValue":"[SCTLRE]"-
     A                                      ,"dataType":"zoned","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"true","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"999.00",-
     A                                      "dataLength":"9","decPos":"0"},"css-
     A                                       class":"output-field","left":"540p-
     A                                      x","cursor column":"39","top":"370p-
     A                                      x","cursor row":"14",')
     A                                  1  2HTML('"width":"63px","text align":"-
     A                                      right","css class 2":"HI","parent t-
     A                                      ab panel":"W7417F_SCR05_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t80","field type":"output field","v-
     A                                      alue":"Endorsements                -
     A                                        :","css class":"constant","left":-
     A                                      "316px","cursor column":"7","top":"-
     A                                      390px","cursor row":"15","parent ta-
     A                                      b panel":"W7417F_SCR05_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCTLEN",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCTLEN","designValue-
     A                                      ":"[SCTLEN]","dataType":"zoned","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"true","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"999.00","dataLength":"9","decPo-
     A                                      s":"0"},"css class":"output-field",-
     A                                      "left":"540px","cursor column":"39"-
     A                                      ,"top":"390px","cursor row":"15","w-
     A                                      idth":"63px","text align":"right","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"W7417F_SCR05_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant81","fi-
     A                                      eld type":"output field","value":"T-
     A                                      he Information above can be used to-
     A                                       complete the NCCI Transmittal Lett-
     A                                      er.","css class":"constant","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      450px","cursor row":"18","css class-
     A                                       2":"BLU","parent tab panel":"W7417-
     A                                      F_SCR05_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"btnSubmit","field type"-
     A                                      :"button","value":"Enter","shortcut-
     A                                       key":"Enter","left":"14px","top":"-
     A                                      150px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF03","field type":"button",-
     A                                      "value":"Exit       ","shortcut key-
     A                                      ":"F3","left":"14px","top":"183px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      HELP","field type":"button","shortc-
     A                                      ut key":"Alt-F1","bypass validation-
     A                                      ":"true","value":"HELP","response":-
     A                                      {"fieldName":"*IN10","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"left":"14px","-
     A                                      top":"216px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCARR         5S 0H
     A            SCPRDS        40A  H
     A            SCTLCX         9S 0H
     A            SCTLEN         9S 0H
     A            SCTLNP         9S 0H
     A            SCTLRE         9S 0H
     A            SCTLRP         9S 0H
     A            SCTOTH         9S 0H
     A            SCTOTR         9S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFND     R        H      REFFLD(FND)
     A            SCNAME    R        H      REFFLD(NM60)
     A          R WDW01
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    16 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"WDW01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"4","window left":"9","valid comm-
     A                                      and key":{"fieldName":"*IN11","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"overl-
     A                                      ay range":"1-16"},"items":[{"id":"W-
     A                                      DW01","field type":"panel","panel s-
     A                                      tyle":"Transform Dialog","text alig-
     A                                      n":"center","left":"5px","top":"5px-
     A                                      ","height":"400px","width":"443px",-
     A                                      "z index":"8","locked in place":"tr-
     A                                      ue"},{"id":"constant82","field type-
     A                                      ":"output field","value":"File Alre-
     A                                      ady Exists","css class":"constant",-
     A                                      "left":"134px","cursor column":"17"-
     A                                      ,"top":"65px","cursor row":"1","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant83","field type":"outpu-
     A                                      t field","value":"WDW01","css class-
     A                                      ":"constant","left":"386px","cursor-
     A                                       column":"53","top":"65px","cursor -
     A                                      row":"1","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant84","field-
     A                                       type":"output field","value":"File-
     A                                       named","css class":"constant","lef-
     A                                      t":"43px","cursor column":"4","top"-
     A                                      :"125px","cursor row":"4","css clas-
     A                                      s 2":"profound-converted"},{"id":"W-
     A                                      DW01_SCFNAM","field type":"output f-
     A                                      ield","value":{"fieldName":"SCFNAM"-
     A                                      ,"dataLength":"100","trimLeading":"-
     A                                      false","trimTrailing":"false","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[SCFNAM]"},"css class":"outp-
     A                                      ut-field","left":"145px","cursor co-
     A                                      lumn":"15","top":"125px","cursor ro-
     A                                      w":"4","width":"275px","height":"35-
     A                                      px"},{"id":"constant85","field type-
     A                                      ":"output field","value":"in direct-
     A                                      ory","css class":"constant","left":-
     A                                      "45px","cursor column":"26","top":"-
     A                                      170px","cursor row":"4","css class -
     A                                      2":"profound-converted"},{"id":"WDW-
     A                                      01_SCLIB","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCLIB","da-
     A                                      taLength":"250","trimLeading":"fals-
     A                                      e","trimTrailing":"false","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none","designValue-
     A                                      ":"[SCLIB]"},"css class":"output-fi-
     A                                      eld","left":"145px","cursor column"-
     A                                      :"37","top":"170px","cursor row":"4-
     A                                      ","width":"275px","height":"35px"},-
     A                                      {"id":"constant86","field type":"ou-
     A                                      tput field","value":"already exists-
     A                                      .","css class":"constant","left":"4-
     A                                      5px","cursor column":"4","top":"215-
     A                                      px","cursor row":"6","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt87","field type":"output field","-
     A                                      value":"Press enter to continue and-
     A                                       ","css class":"constant","left":"1-
     A                                      60px","cursor column"')
     A                                  1  2HTML(':"21","top":"215px","cursor r-
     A                                      ow":"6","css class 2":"profound-con-
     A                                      verted"},{"id":"constant88","field -
     A                                      type":"output field","value":"overw-
     A                                      rite data in file OR press F12 to r-
     A                                      eturn to ","css class":"constant","-
     A                                      left":"45px","cursor column":"4","t-
     A                                      op":"255px","cursor row":"8","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant89","field type":"output -
     A                                      field","value":"previous screen.","-
     A                                      css class":"constant","left":"45px"-
     A                                      ,"cursor column":"4","top":"295px",-
     A                                      "cursor row":"10","css class 2":"pr-
     A                                      ofound-converted"},{"id":"constant9-
     A                                      0","field type":"output field","val-
     A                                      ue":"Press Enter to continue.","css-
     A                                       class":"constant","left":"135px","-
     A                                      cursor column":"17","top":"330px","-
     A                                      cursor row":"14","css class 2":"pro-
     A                                      found-converted"},{"id":"btnSubmit"-
     A                                      ,"field type":"button","value":"Ent-
     A                                      er","shortcut key":"Enter","left":"-
     A                                      15px","top":"360px","width":"80px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF03","field typ-
     A                                      e":"button","value":"Exit       ","-
     A                                      shortcut key":"F3","left":"105px","-
     A                                      top":"360px","width":"80px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF12","field type":"but-
     A                                      ton","value":"Cancel","shortcut key-
     A                                      ":"F12","left":"195px","top":"360px-
     A                                      ","width":"80px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nHELP","field type":"button","short-
     A                                      cut key":"Alt-F1","bypass validatio-
     A                                      n":"true","value":"HELP","response"-
     A                                      :{"fieldName":"*IN10","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"left":"285px"-
     A                                      ,"top":"360px","width":"80px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","visibility":"hi-
     A                                      dden","cursor":"default"}]}')
     A            SCFNAM       100A  H
     A            SCLIB        250A  H
     A          R WDW02
     A                                  1  2HTML('QPUIREC0    ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"WDW02"},"items":[{"id":"WDW01",-
     A                                      "field type":"panel","panel style":-
     A                                      "Transform Dialog","text align":"ce-
     A                                      nter","left":"35px","top":"35px","h-
     A                                      eight":"195px","width":"443px","z i-
     A                                      ndex":"8","value":"WCPOLS Job Submi-
     A                                      tted"},{"id":"constant83","field ty-
     A                                      pe":"output field","css class":"con-
     A                                      stant","value":"WDW02","cursor row"-
     A                                      :"1","cursor column":"53","left":"4-
     A                                      15px","top":"70px","css class 2":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      90","field type":"output field","cs-
     A                                      s class":"label","value":"Press Ent-
     A                                      er to continue.","cursor row":"14",-
     A                                      "cursor column":"17","left":"190px"-
     A                                      ,"top":"155px"},{"id":"btnSubmit","-
     A                                      field type":"button","css class":"b-
     A                                      utton","value":"Enter","shortcut ke-
     A                                      y":"Enter","left":"45px","top":"195-
     A                                      px","height":"23px","width":"80px",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"lblConst1","field typ-
     A                                      e":"output field","css class":"labe-
     A                                      l","value":"The WCPOLS submission f-
     A                                      ile creation has been submitted ","-
     A                                      left":"75px","top":"105px","width":-
     A                                      "380px","height":"15px","text align-
     A                                      ":"center"},{"id":"lblConst2","fiel-
     A                                      d type":"output field","css class":-
     A                                      "label","value":"to a job under W74-
     A                                      17C.","text align":"center","left":-
     A                                      "75px","top":"120px","height":"15px-
     A                                      ","width":"380px"}]}')
