     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 23
     A  24 25 26
     A  27 28 29                            CA01(10 'Response Indicator *IN10')
     A  30 32 75
     A  22 93                               CA02(11 'Response Indicator *IN11')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(75 'Response Indicator *IN75')
     A                                  1  2HTML('QPUIREC12   RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCFPFDC7    WCR0500C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     27RERRMS-
     A                                      GID  5    C6    SCFPFDC7    WCR0529-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     28REMSGID    5    C5    SCFYR-
     A                                      C7    WCR1185C6    WMESGGC5    *LIB-
     A                                      LC0    E1    3     25RERRMSGID  5  -
     A                                        C6    SCTPFDC7    WCR0500C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     29-
     A                                      RERRMSGID  5    C6    SCTPFDC7    W-
     A                                      CR0529C6    WMESGGC5    *LIBLC0    -
     A                                      E1    3     28RERRMSGID  5    C6   -
     A                                       SCDARTC7    WCR0501C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     32RERRMSG-
     A                                      ID  5    C6    SCDARTC7    WCR0517C-
     A                                      6    WMESGGC5    *LIBLC0    E1    3-
     A                                           23RERRMSGID  5    C6    SCDART-
     A                                      C7    WCR0694C6    WMESGGC5    *LIB-
     A                                      LC0    E1    3     24RERRMSGID  5  -
     A                                        C6    SCDARTC7    WCR2355C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     26-
     A                                      RERRMSGID  5    C6    SCDARTC7    W-
     A                                      C31349C6    WMESGGC5    *LIBLC0    -
     A                                      E1    3     30RERRMSGID  5    C6   -
     A                                       SCSTATC7    WCR1241C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     75')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN23","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN24","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN25","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN26","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN27","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN28","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN29","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN30","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN32","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N75","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"valid command key":{"fieldName-
     A                                      ":"*IN11","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"overlay range":"1-23"},"i-
     A                                      tems":[{"id":"W7412F_SCR01_avKeys",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"AV_KEYS","dataLength-
     A                                      ":"1134","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none","designValue":"[AV_K-
     A                                      EYS]"},"left":"0px","top":"0px","vi-
     A                                      sibility":"hidden"},{"id":"W7412F_S-
     A                                      CR01_action","field type":"html con-
     A                                      tainer","white space":"normal","lef-
     A                                      t":"0px","top":"10px","width":"230p-
     A                                      x","css class":"action-panel-conver-
     A                                      ted","height":"700px","html":"<div -
     A                                      class=\"top\"></div><div class=\"im-
     A                                      agetop\"><img src=\"/profoundui/use-
     A                                      rdata/images/bar_top.png\" /></div>-
     A                                      <div class=\"menulinks\"></div><div-
     A                                       class=\"imagebottom\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_bott-
     A                                      om.png\" /></div><div class=\"botto-
     A                                      m\"></div>"},{"field type":"icon me-
     A                                      nu button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"32px","z index":"20","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1170px-
     A                                      ","id":"W7412F_SCR01_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon source":"/profoundui/userdat-
     A                                      a/images/systool/systools.png","dat-
     A                                      a function":"SystemTo')
     A                                  1  2HTML('olbarSystools","show down arr-
     A                                      ow":"Yes"},{"field type":"panel","p-
     A                                      anel style":"TransformButtonBar","i-
     A                                      d":"W7412F_SCR01_ButtonBar","top":"-
     A                                      35px","left":"1036px","width":"187p-
     A                                      x","height":"28px","css class":"sta-
     A                                      tionary","visibility":"hidden","loc-
     A                                      ked in place":"true"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1040px","id":"W7412F_SCR01-
     A                                      _BtnSave","tool tip":"Save","onclic-
     A                                      k":"SystemToolbarSave","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/save.png'')"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1066px","id":"W7412-
     A                                      F_SCR01_BtnRefresh","tool tip":"Ref-
     A                                      resh","onclick":"SystemToolbarRefre-
     A                                      sh","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/refr-
     A                                      esh.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1092px","id":"W7412F_SCR01_BtnSearc-
     A                                      h","tool tip":"Search","onclick":"S-
     A                                      ystemToolbarSearch","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/search.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1118px","id":"W7412F-
     A                                      _SCR01_BtnDiaryItems","tool tip":"D-
     A                                      iary/Work Items - IDARTS","onclick"-
     A                                      :"SystemToolbarDiary","background i-
     A                                      mage":{"fieldName":"DryIcnURL","dat-
     A                                      aLength":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","heig')
     A                                  1  2HTML('ht":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1144p-
     A                                      x","id":"W7412F_SCR01_BtnSystemMess-
     A                                      ages","tool tip":"System Messages",-
     A                                      "onclick":"SystemToolbarMessages","-
     A                                      background image":{"fieldName":"Msg-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1196px","id":-
     A                                      "W7412F_SCR01_BtnHelp","tool tip":"-
     A                                      Help","onclick":"SystemToolbarHelp"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/help.pn-
     A                                      g'')"},{"id":"W7412F_SCR01_ImgSysTo-
     A                                      olBottom","field type":"image","ima-
     A                                      ge source":"/profoundui/userdata/im-
     A                                      ages/systool/butbarbot.png","left":-
     A                                      "1036px","top":"64px","width":"187p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"stationary","visibility":"hid-
     A                                      den"},{"id":"W7412F_SCR01_MainTabPa-
     A                                      nel","field type":"tab panel","tab -
     A                                      panel style":"Transform","tab names-
     A                                      ":{"fieldName":"SCPRDS","designValu-
     A                                      e":"[SCPRDS]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"active tab":"0","left":"250px"-
     A                                      ,"top":"70px","width":"970px","heig-
     A                                      ht":"657px","z index":"8","locked i-
     A                                      n place":"true","css class":"tab-pa-
     A                                      nel","css class 2":"stationary"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W7412F_SCR01_B-
     A                                      tnHiddenSave","value":"btnSave","to-
     A                                      p":"100px","response":{"fieldName":-
     A                                      "btnSave","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant1","field -
     A                                      type":"output field","left":"281px"-
     A                                      ,"cursor column":"2","top":"110px",-
     A                                      "cursor row":"1","css class":"top-l-
     A                                      ine","value":"js: currentUser()","c-
     A                                      ss class 2":"output-field","parent -
     A                                      tab panel":"W7412F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCCONM-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCCONM","designVal-
     A                                      ue":"[SCCONM]","refFi')
     A                                  1  2HTML('eld":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"414px","cu-
     A                                      rsor column":"21","top":"110px","cu-
     A                                      rsor row":"1","css class 2":"top-li-
     A                                      ne","css class 3":"HI","description-
     A                                      ":"COMPANY NAME","parent tab panel"-
     A                                      :"W7412F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 4":"profound--
     A                                      converted"},{"id":"constant2","fiel-
     A                                      d type":"output field","left":"778p-
     A                                      x","cursor column":"73","top":"110p-
     A                                      x","cursor row":"1","css class":"to-
     A                                      p-line","value":"js: currentDate()"-
     A                                      ,"css class 2":"output-field","pare-
     A                                      nt tab panel":"W7412F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"W74-
     A                                      12F_SCR01_fkeyMenu","field type":"m-
     A                                      enu","left":"10px","top":"120px","h-
     A                                      eight":"350px","width":"230px","hov-
     A                                      er background color":"#9AAA61","hov-
     A                                      er text color":"#FFFFFF","border co-
     A                                      lor":"#4C6106","menu option indent"-
     A                                      :"10px","background color":"#758B27-
     A                                      ","css class":"action-menu","css cl-
     A                                      ass 2":"stationary","z index":"101"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"W7412F_SCR-
     A                                      01_BtnHiddenRefresh","value":"btnRe-
     A                                      fresh","top":"125px","response":{"f-
     A                                      ieldName":"btnRefresh","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"Q1PGM-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"Q1PGM","designValu-
     A                                      e":"[Q1PGM]","refField":"DS10","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"130px","cursor row":"2","parent t-
     A                                      ab panel":"W7412F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCPRDS"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCPRDS","designValu-
     A                                      e":"[SCPRDS]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"414px","cursor column":"21","to-
     A                                      p":"130px","cursor row":"2","css cl-
     A                                      ass 2":"HI","description":"PROGRAM -
     A                                      NAME","parent tab panel":"W7412F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "visibility":"hidden","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant3","field type":"output field","-
     A                                      value":"SCR01","css class":"constan-
     A                                      t","left":"799px","cursor column":"-
     A                                      76","top":"130px","cursor row":"2",-
     A                                      "parent tab panel":"W7412F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-con')
     A                                  1  2HTML('verted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W7412F_SCR01_BtnHiddenSearch","v-
     A                                      alue":"btnSearch","top":"150px","re-
     A                                      sponse":{"fieldName":"btnSearch","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant4","field type":"outpu-
     A                                      t field","value":"Group:","css clas-
     A                                      s":"constant","left":"281px","curso-
     A                                      r column":"2","top":"170px","cursor-
     A                                       row":"4","parent tab panel":"W7412-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCFND","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CFND","designValue":"[SCFND]","refF-
     A                                      ield":"FND","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00"},"css class":"outpu-
     A                                      t-field","left":"337px","cursor col-
     A                                      umn":"10","top":"170px","cursor row-
     A                                      ":"4","width":"21px","text align":"-
     A                                      right","parent tab panel":"W7412F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCNAME","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCN-
     A                                      AME","designValue":"[SCNAME]","refF-
     A                                      ield":"NM60","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"372px","cursor -
     A                                      column":"15","top":"170px","cursor -
     A                                      row":"4","description":"FUND NAME",-
     A                                      "parent tab panel":"W7412F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W7412F_SCR01_BtnH-
     A                                      iddenDiaryItems","value":"btnDiary"-
     A                                      ,"top":"175px","response":{"fieldNa-
     A                                      me":"btnDiary","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant5","f-
     A                                      ield type":"output field","value":"-
     A                                      Employer/Div:","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"190px","cursor row":"5","-
     A                                      visibility":{"fieldName":"22","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"hidden","customFals-
     A                                      e":"visible"},"parent tab panel":"W-
     A                                      7412F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCEMP#","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCEMP#","designValue":"[SCEMP#]-
     A                                      ","refField":"EMP#","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","cu')
     A                                  1  2HTML('rSym":"","units":"","negNum":-
     A                                      "999.00"},"css class":"output-field-
     A                                      ","left":"386px","cursor column":"1-
     A                                      7","top":"190px","cursor row":"5","-
     A                                      width":"63px","text align":"right",-
     A                                      "visibility":{"fieldName":"22","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"hidden","customFal-
     A                                      se":"visible"},"parent tab panel":"-
     A                                      W7412F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCDIV","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCDIV","designValue":"[SCDIV]",-
     A                                      "refField":"DIV","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00"},"css class":"-
     A                                      output-field","left":"456px","curso-
     A                                      r column":"27","top":"190px","curso-
     A                                      r row":"5","width":"35px","text ali-
     A                                      gn":"right","visibility":{"fieldNam-
     A                                      e":"22","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"hidden-
     A                                      ","customFalse":"visible"},"parent -
     A                                      tab panel":"W7412F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCENAM-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCENAM","designVal-
     A                                      ue":"[SCENAM]","refField":"NAME","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"505px","cursor column":"34","t-
     A                                      op":"190px","cursor row":"5","visib-
     A                                      ility":{"fieldName":"22","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"hidden","customFalse":"v-
     A                                      isible"},"parent tab panel":"W7412F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W7412F_S-
     A                                      CR01_BtnHiddenSystemMessages","valu-
     A                                      e":"btnMessage","top":"200px","resp-
     A                                      onse":{"fieldName":"btnMessage","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"W7412F_SCR01_Bt-
     A                                      nHiddenWorkSubmitJob","value":"btnW-
     A                                      rksbmjob","top":"225px","response":-
     A                                      {"fieldName":"btnWrkJob","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant6","field type":"output field"-
     A                                      ,"value":"Type choices, press Enter-
     A                                      .","css class":"constant","left":"2-
     A                                      81px","cursor column":"2","top":"23-
     A                                      0px","cursor row":"7"')
     A                                  1  2HTML(',"css class 2":"BLU","parent -
     A                                      tab panel":"W7412F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W7412F_SCR01_BtnHiddenWor-
     A                                      kPrinterOutput","value":"btnWrkprto-
     A                                      ut","top":"250px","response":{"fiel-
     A                                      dName":"btnWrkPrnt","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      8","field type":"output field","val-
     A                                      ue":"Policy effective date range:",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"22","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"295px","cursor column":"4","top"-
     A                                      :"270px","cursor row":"9","parent t-
     A                                      ab panel":"W7412F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t7","field type":"output field","va-
     A                                      lue":"Policy year                  -
     A                                          :","css class":"constant","visi-
     A                                      bility":{"fieldName":"N22","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"295px","cursor column":"-
     A                                      4","top":"270px","cursor row":"9","-
     A                                      parent tab panel":"W7412F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCFPFD","field type":"date field",-
     A                                      "css class":"input","css class 2":"-
     A                                      date-field","value":{"fieldName":"S-
     A                                      CFPFD","designValue":"[SCFPFD]","re-
     A                                      fField":"DT8","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"false","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"-999.00","numBlankFill":"-
     A                                      true","edtWrd":"''  /  /    ''","da-
     A                                      teFormat":"m/d/Y"},"visibility":{"f-
     A                                      ieldName":"22","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"4-
     A                                      98px","cursor column":"33","top":"2-
     A                                      70px","cursor row":"9","width":"71p-
     A                                      x","text align":"right","css class -
     A                                      3":"HI","css class 4":"UL","error m-
     A                                      essage id":"WCR0500","error message-
     A                                       file":"WMESGG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"27","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"2 m-
     A                                      essages","error message id 2":"WCR0-
     A                                      529","error message file 2":"WMESGG-
     A                                      ","error message library 2":"*LIBL"-
     A                                      ,"error condition 2":{"fieldName":"-
     A                                      28","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"parent tab panel":"W7412F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 5":"profound-converted"},{-
     A                                      "id":"SCFYR","field type":"output f-
     A                                      ield","value":{"fieldName":"SCFYR",-
     A                                      "designValue":"[SCFYR')
     A                                  1  2HTML(']","refField":"FYR","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00"},"css-
     A                                       class":"output-field","visibility"-
     A                                      :{"fieldName":"N22","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"540px","cursor column":"39","to-
     A                                      p":"270px","cursor row":"9","width"-
     A                                      :"21px","text align":"right","descr-
     A                                      iption":"FUND YEAR","parent tab pan-
     A                                      el":"W7412F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted","error messages":"1 m-
     A                                      essage","error message id":"WCR1185-
     A                                      ","error message file":"WMESGG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"25","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      enhanced mode":"1"},{"id":"constant-
     A                                      9","field type":"output field","val-
     A                                      ue":"-","css class":"constant","vis-
     A                                      ibility":{"fieldName":"22","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"568px","cursor column":"-
     A                                      43","top":"270px","cursor row":"9",-
     A                                      "parent tab panel":"W7412F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCTPFD","field type":"date field"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "date-field","value":{"fieldName":"-
     A                                      SCTPFD","designValue":"[SCTPFD]","r-
     A                                      efField":"DT8","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"-999.00","numBlankFill":-
     A                                      "true","edtWrd":"''  /  /    ''","d-
     A                                      ateFormat":"m/d/Y"},"visibility":{"-
     A                                      fieldName":"22","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      604px","cursor column":"45","top":"-
     A                                      270px","cursor row":"9","width":"71-
     A                                      px","text align":"right","css class-
     A                                       3":"HI","css class 4":"UL","error -
     A                                      message id":"WCR0500","error messag-
     A                                      e file":"WMESGG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"29","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"2 -
     A                                      messages","error message id 2":"WCR-
     A                                      0529","error message file 2":"WMESG-
     A                                      G","error message library 2":"*LIBL-
     A                                      ","error condition 2":{"fieldName":-
     A                                      "28","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"W7412F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 5":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id"')
     A                                  1  2HTML(':"W7412F_SCR01_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W7412-
     A                                      F_SCR01_BtnHiddenHelp","value":"btn-
     A                                      Help","top":"300px","response":{"fi-
     A                                      eldName":"btnHelp","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant1-
     A                                      0","field type":"output field","val-
     A                                      ue":"Resolve policy page to DARTS  -
     A                                         :","css class":"constant","visib-
     A                                      ility":{"fieldName":"visScript","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"hidden / visib-
     A                                      le"},"left":"295px","cursor column"-
     A                                      :"4","top":"310px","cursor row":"11-
     A                                      ","parent tab panel":"W7412F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCDART","field type":"checkbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "checkbox","value":{"fieldName":"SC-
     A                                      DART","designValue":"[SCDART]","ref-
     A                                      Field":"FLAG","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","visibility":{"f-
     A                                      ieldName":"visScript","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"hidden / visible"},"left-
     A                                      ":"540px","top":"310px","width":"8p-
     A                                      x","css class 3":"HI","css class 4"-
     A                                      :"UL","error messages":"5 messages"-
     A                                      ,"parent tab panel":"W7412F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 5":"profound-converted","chec-
     A                                      ked value":"Y","unchecked value":"N-
     A                                      ","error message id":"WCR0501","err-
     A                                      or message file":"WMESGG","error me-
     A                                      ssage library":"*LIBL","error condi-
     A                                      tion":{"fieldName":"32","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error enha-
     A                                      nced mode":"0","error message id 2"-
     A                                      :"WCR0517","error message file 2":"-
     A                                      WMESGG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"23","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error enhanced mode 2":"-
     A                                      0","error message id 3":"WCR0694","-
     A                                      error message file 3":"WMESGG","err-
     A                                      or message library 3":"*LIBL","erro-
     A                                      r condition 3":{"fieldName":"24","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror enhanced mode 3":"0","error me-
     A                                      ssage id 4":"WCR2355","error messag-
     A                                      e file 4":"WMESGG","error message l-
     A                                      ibrary 4":"*LIBL","error condition -
     A                                      4":{"fieldName":"26","dataType":"ex-
     A                                      pression","formatting')
     A                                  1  2HTML('":"Indicator","indFormat":"1 -
     A                                      / 0"},"error enhanced mode 4":"0","-
     A                                      error message id 5":"WC31349","erro-
     A                                      r message file 5":"WMESGG","error m-
     A                                      essage library 5":"*LIBL","error co-
     A                                      ndition 5":{"fieldName":"30","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant11","field type":"output -
     A                                      field","value":"Resubmit policy for-
     A                                       interstate","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"93","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"295px","cursor colu-
     A                                      mn":"4","top":"350px","cursor row":-
     A                                      "13","parent tab panel":"W7412F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"constant12","field type":"ou-
     A                                      tput field","value":"coverage chang-
     A                                      e only           :","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      93","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"309px","curs-
     A                                      or column":"6","top":"370px","curso-
     A                                      r row":"14","parent tab panel":"W74-
     A                                      12F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCSTAT","field type":-
     A                                      "checkbox","css class":"input","css-
     A                                       class 2":"checkbox","value":{"fiel-
     A                                      dName":"SCSTAT","designValue":"[SCS-
     A                                      TAT]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase","dataLength":"1"},"text -
     A                                      transform":"uppercase","visibility"-
     A                                      :{"fieldName":"93","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"540px","top":"370px","width":"8p-
     A                                      x","css class 3":"UL","read only":{-
     A                                      "fieldName":"N93","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       4":{"fieldName":"N93","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"err-
     A                                      or message id":"WCR1241","error mes-
     A                                      sage file":"WMESGG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"75","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","description":"Resubmit-
     A                                       for Interstate Coverage only (Y/ )-
     A                                      ?","parent tab panel":"W7412F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 5":"profound-converted","ch-
     A                                      ecked value":"Y","unchecked value":-
     A                                      " "},{"id":"constant14","field type-
     A                                      ":"output field","value":" ","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"22","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"281-
     A                                      px","cursor column":"2","top":"550p-
     A                                      x","cursor row":"23","css class 2":-
     A                                      "BLU","parent tab pan')
     A                                  1  2HTML('el":"W7412F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t13","field type":"output field","v-
     A                                      alue":" ","css class":"constant","v-
     A                                      isibility":{"fieldName":"N22","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"281px","cursor column-
     A                                      ":"2","top":"550px","cursor row":"2-
     A                                      3","css class 2":"BLU","parent tab -
     A                                      panel":"W7412F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant16-
     A                                      ","field type":"output field","valu-
     A                                      e":" ","css class":"constant","visi-
     A                                      bility":{"fieldName":"22","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"351px","cursor column":"1-
     A                                      2","top":"550px","cursor row":"23",-
     A                                      "css class 2":"BLU","parent tab pan-
     A                                      el":"W7412F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant15","-
     A                                      field type":"output field","value":-
     A                                      " ","css class":"constant","visibil-
     A                                      ity":{"fieldName":"N22","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"351px","cursor column":"12"-
     A                                      ,"top":"550px","cursor row":"23","c-
     A                                      ss class 2":"BLU","parent tab panel-
     A                                      ":"W7412F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant17","fi-
     A                                      eld type":"output field","value":" -
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"N22","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"449px","cursor column":"26","-
     A                                      top":"550px","cursor row":"23","css-
     A                                       class 2":"BLU","parent tab panel":-
     A                                      "W7412F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"150px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF03","field type":"bu-
     A                                      tton","visibility":{"fieldName":"N2-
     A                                      2 or 22","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"value":"Exit",-
     A                                      "shortcut key":"F3","left":"14px","-
     A                                      top":"183px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF05","field type":"bu-
     A                                      tton","visibility":{"fieldName":"N2-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"value":"Resubmit","s-
     A                                      hortcut key":"F5","left":"14px","to-
     A                                      p":"216px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF12","field type":"butt-
     A                                      on","visibility":{"fi')
     A                                  1  2HTML('eldName":"22 or N22","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"value":"Cancel","shortcut key":-
     A                                      "F12","left":"14px","top":"249px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F13","field type":"button","value":-
     A                                      "Chg User Parms","shortcut key":"F1-
     A                                      3","left":"14px","top":"282px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnHELP-
     A                                      ","field type":"button","shortcut k-
     A                                      ey":"Alt-F1","bypass validation":"t-
     A                                      rue","value":"HELP","response":{"fi-
     A                                      eldName":"*IN10","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"left":"14px","top"-
     A                                      :"315px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"}]}-
     A                                      ')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCSTAT         1A  H
     A            VISSCRIPT      1A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDART    R        H      REFFLD(FLAG)
     A            SCDIV     R        H      REFFLD(DIV)
     A            SCEMP#    R        H      REFFLD(EMP#)
     A            SCENAM    R        H      REFFLD(NAME)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFPFD    R        H      REFFLD(DT8)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCTPFD    R        H      REFFLD(DT8)
     A          R SCR02S                    SFL
     A                                      SETOF(10)
     A            QPUI000001     1A  O  2  2
     A            S2DIV     R        H      REFFLD(DIV)
     A            S2EMP#    R        H      REFFLD(EMP#)
     A            S2FYR     R        H      REFFLD(FYR)
     A            S2NAME    R        H      REFFLD(NAME)
     A          R QSFLCTL001                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  10 11 05
     A  60                                  CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUICTL1    SCR02S    5    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LCLR    0    E1    3     05RSFLPAG -
     A                                         1    C1    7 RSFLSIZ    1    C4 -
     A                                         9999 0    3    ROVERLAY   0     -
     A                                      RWINDOW    0     RROWS      2    C1-
     A                                          1C2    17 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","show as window":-
     A                                      "true","window top":"3","window lef-
     A                                      t":"3","valid command key":{"fieldN-
     A                                      ame":"*IN11","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"overlay range":"1-17"}-
     A                                      ,"items":[{"id":"SCR02C","field typ-
     A                                      e":"panel","panel style":"Transform-
     A                                       Dialog","text align":"center","lef-
     A                                      t":"5px","top":"5px","height":"510p-
     A                                      x","width":"562px","z index":"8","l-
     A                                      ocked in place":"true"},{"id":"cons-
     A                                      tant18","field type":"output field"-
     A                                      ,"left":"29px","cursor column":"2",-
     A                                      "top":"65px","cursor row":"1","valu-
     A                                      e":"js: currentUser()","css class":-
     A                                      "output-field","css class 2":"profo-
     A                                      und-converted"},{"id":"constant19",-
     A                                      "field type":"output field","value"-
     A                                      :"INFORMATIONAL MESSAGE","css class-
     A                                      ":"constant","left":"211px","cursor-
     A                                       column":"28","top":"65px","cursor -
     A                                      row":"1","css class 2":"HI","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant20","field type":"output f-
     A                                      ield","left":"477px","cursor column-
     A                                      ":"66","top":"65px","cursor row":"1-
     A                                      ","value":"js: currentDate()","css -
     A                                      class":"output-field","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant21","field type":"output field",-
     A                                      "value":"Group:","css class":"const-
     A                                      ant","left":"29px","cursor column":-
     A                                      "2","top":"105px","cursor row":"3",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCR02C_SCFND","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCFND","designValue":"[SCFND]","r-
     A                                      efField":"FND","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"999.00"},"css class":"ou-
     A                                      tput-field","left":"78px","cursor c-
     A                                      olumn":"9","top":"105px","cursor ro-
     A                                      w":"3","width":"21px","text align":-
     A                                      "right","css class 2":"profound-con-
     A                                      verted"},{"id":"SCR02C_SCNAME","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCNAME","designValue":"[-
     A                                      SCNAME]","refField":"NM60","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"1-
     A                                      13px","cursor column":"14","top":"1-
     A                                      05px","cursor row":"3","description-
     A                                      ":"FUND NAME","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant22","-
     A                                      field type":"output field","value":-
     A                                      "The employer/s listed below have a-
     A                                       voluntary labor charge but no","cs-
     A                                      s class":"constant","left":"43px","-
     A                                      cursor column":"4","top":"145px","c-
     A                                      ursor row":"5","css class 2":"profo-
     A                                      und-converted"},{"id"')
     A                                  1  2HTML(':"constant23","field type":"o-
     A                                      utput field","value":"WC000311A end-
     A                                      orsement form is attached to the po-
     A                                      licy.","css class":"constant","left-
     A                                      ":"43px","cursor column":"4","top":-
     A                                      "165px","cursor row":"6","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant24","field type":"output fiel-
     A                                      d","value":"Press enter to continue-
     A                                       or F-12 to cancel.","css class":"c-
     A                                      onstant","left":"43px","cursor colu-
     A                                      mn":"4","top":"205px","cursor row":-
     A                                      "8","css class 2":"BLU","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant25","field type":"output field-
     A                                      ","value":"Employer#","css class":"-
     A                                      constant","left":"43px","cursor col-
     A                                      umn":"4","top":"245px","cursor row"-
     A                                      :"10","css class 2":"HI","css class-
     A                                       3":"profound-converted","css class-
     A                                       4":"subfile-heading"},{"id":"const-
     A                                      ant26","field type":"output field",-
     A                                      "value":"Div","css class":"constant-
     A                                      ","left":"134px","cursor column":"1-
     A                                      7","top":"245px","cursor row":"10",-
     A                                      "css class 2":"HI","css class 3":"p-
     A                                      rofound-converted","css class 4":"s-
     A                                      ubfile-heading"},{"id":"constant27"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Yr","css class":"constant","left-
     A                                      ":"176px","cursor column":"23","top-
     A                                      ":"245px","cursor row":"10","css cl-
     A                                      ass 2":"HI","css class 3":"profound-
     A                                      -converted","css class 4":"subfile--
     A                                      heading"},{"id":"constant28","field-
     A                                       type":"output field","value":"Empl-
     A                                      oyer Name","css class":"constant","-
     A                                      left":"204px","cursor column":"27",-
     A                                      "top":"245px","cursor row":"10","cs-
     A                                      s class 2":"HI","css class 3":"prof-
     A                                      ound-converted","css class 4":"subf-
     A                                      ile-heading"},{"id":"SCR02S","field-
     A                                       type":"grid","number of columns":"-
     A                                      4","record format name":"SCR02S","d-
     A                                      isplay subfile":"true","display con-
     A                                      trol record":"true","clear subfile"-
     A                                      :{"fieldName":"05","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"subfile -
     A                                      size":"9999","header height":"20","-
     A                                      row height":"20","css class":"subfi-
     A                                      legrid","css class 2":"profound-con-
     A                                      verted","parent tab panel":"W7412F_-
     A                                      SCR02C_MainTabPanel","parent tab":"-
     A                                      0","subfile end":{"fieldName":"60",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"sortable columns":"true","n-
     A                                      umber of rows":"8","top":"245px","l-
     A                                      eft":"38px","column widths":"77,49,-
     A                                      35,334"},{"id":"btnSubmit","field t-
     A                                      ype":"button","value":"Enter","shor-
     A                                      tcut key":"Enter","left":"14px","to-
     A                                      p":"470px","width":"80px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF12","field type":"butto-
     A                                      n","value":"Cancel","shortcut key":-
     A                                      "F12","left":"104px","top":"470px",-
     A                                      "width":"80px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default')
     A                                  1  2HTML('"},{"id":"btnHELP","field typ-
     A                                      e":"button","shortcut key":"Alt-F1"-
     A                                      ,"bypass validation":"true","value"-
     A                                      :"HELP","response":{"fieldName":"*I-
     A                                      N10","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"left":"194px","top":"470px","w-
     A                                      idth":"80px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","visibility":"hidden","cursor":"d-
     A                                      efault"},{"id":"S2EMP#","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"S2EMP#","designValue":"[S2EMP#]-
     A                                      ","refField":"EMP#","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00"},"css class"-
     A                                      :"output-field","left":"5px","curso-
     A                                      r column":"4","top":"1px","cursor r-
     A                                      ow":"11","width":"63px","text align-
     A                                      ":"right","css class 2":"profound-c-
     A                                      onverted","grid":"SCR02S","column":-
     A                                      "0"},{"id":"S2DIV","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      2DIV","designValue":"[S2DIV]","refF-
     A                                      ield":"DIV","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"true","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00"},"css class":"output-
     A                                      -field","left":"5px","cursor column-
     A                                      ":"15","top":"1px","cursor row":"11-
     A                                      ","width":"35px","text align":"righ-
     A                                      t","css class 2":"profound-converte-
     A                                      d","grid":"SCR02S","column":"1"},{"-
     A                                      id":"S2FYR","field type":"output fi-
     A                                      eld","value":{"fieldName":"S2FYR","-
     A                                      designValue":"[S2FYR]","refField":"-
     A                                      FYR","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"5px","cursor column":"22",-
     A                                      "top":"1px","cursor row":"11","widt-
     A                                      h":"21px","text align":"right","css-
     A                                       class 2":"profound-converted","gri-
     A                                      d":"SCR02S","column":"2"},{"id":"S2-
     A                                      NAME","field type":"output field","-
     A                                      value":{"fieldName":"S2NAME","desig-
     A                                      nValue":"[S2NAME]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"5px","cursor column":"27",-
     A                                      "top":"1px","cursor row":"11","css -
     A                                      class 2":"profound-converted","grid-
     A                                      ":"SCR02S","column":"3"}]}')
     A            SCFND     R        H      REFFLD(FND)
     A            SCNAME    R        H      REFFLD(NM60)
     A          R SCR02
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC1    ROVERLAY   0     -
     A                                      ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},"items":[{"i-
     A                                      d":"W7412F_SCR02_avKeys","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"AV_KEYS","dataLength":"1134","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[AV_KEYS]"},"le-
     A                                      ft":"0px","top":"0px","visibility":-
     A                                      "hidden"},{"id":"W7412F_SCR02_actio-
     A                                      n","field type":"html container","w-
     A                                      hite space":"normal","left":"0px","-
     A                                      top":"10px","width":"230px","css cl-
     A                                      ass":"action-panel-converted","heig-
     A                                      ht":"700px","html":"<div class=\"to-
     A                                      p\"></div><div class=\"imagetop\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_top.png\" /></div><div class-
     A                                      =\"menulinks\"></div><div class=\"i-
     A                                      magebottom\"><img src=\"/profoundui-
     A                                      /userdata/images/bar_bottom.png\" /-
     A                                      ></div><div class=\"bottom\"></div>-
     A                                      "},{"field type":"icon menu button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"32px",-
     A                                      "z index":"20","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1170px","id":"W7-
     A                                      412F_SCR02_BtnIconMenuSystemTools",-
     A                                      "tool tip":"System Tools","icon sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/systools.png","data function-
     A                                      ":"SystemToolbarSystools","show dow-
     A                                      n arrow":"Yes"},{"field type":"pane-
     A                                      l","panel style":"TransformButtonBa-
     A                                      r","id":"W7412F_SCR02_ButtonBar","t-
     A                                      op":"35px","left":"1036px","width":-
     A                                      "187px","height":"28px","css class"-
     A                                      :"stationary","visibility":"hidden"-
     A                                      ,"locked in place":"true"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1040px","id":"W7412F_-
     A                                      SCR02_BtnSave","tool tip":"Save","o-
     A                                      nclick":"SystemToolbarSave","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/save.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cur')
     A                                  1  2HTML('sor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1066px","id":"W7412F_SCR02_Bt-
     A                                      nRefresh","tool tip":"Refresh","onc-
     A                                      lick":"SystemToolbarRefresh","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/refresh.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1092px","i-
     A                                      d":"W7412F_SCR02_BtnSearch","tool t-
     A                                      ip":"Search","onclick":"SystemToolb-
     A                                      arSearch","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/search.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1118px","id":"W7412F_SCR02_Btn-
     A                                      DiaryItems","tool tip":"Diary/Work -
     A                                      Items - IDARTS","onclick":"SystemTo-
     A                                      olbarDiary","background image":{"fi-
     A                                      eldName":"DryIcnURL","dataLength":"-
     A                                      128","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"}},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1144px","id":"W7412F_SCR02_BtnSyste-
     A                                      mMessages","tool tip":"System Messa-
     A                                      ges","onclick":"SystemToolbarMessag-
     A                                      es","background image":{"fieldName"-
     A                                      :"MsgIcnURL","dataLength":"128","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"}},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1196px",-
     A                                      "id":"W7412F_SCR02_BtnHelp","tool t-
     A                                      ip":"Help","onclick":"SystemToolbar-
     A                                      Help","background ima')
     A                                  1  2HTML('ge":"url(''/profoundui/userda-
     A                                      ta/images/systool/help.png'')"},{"i-
     A                                      d":"W7412F_SCR02_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"W7412F_SCR02_MainTabPanel","fiel-
     A                                      d type":"tab panel","tab panel styl-
     A                                      e":"Transform","tab names":"Tab 1",-
     A                                      "active tab":"0","left":"250px","to-
     A                                      p":"70px","width":"970px","height":-
     A                                      "657px","z index":"8","locked in pl-
     A                                      ace":"true","css class":"tab-panel"-
     A                                      ,"css class 2":"stationary"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W7412F_SCR02_BtnHi-
     A                                      ddenSave","value":"btnSave","top":"-
     A                                      100px","response":{"fieldName":"btn-
     A                                      Save","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"W7412F_SCR02_fkeyMenu"-
     A                                      ,"field type":"menu","left":"10px",-
     A                                      "top":"120px","height":"350px","wid-
     A                                      th":"230px","hover background color-
     A                                      ":"#9AAA61","hover text color":"#FF-
     A                                      FFFF","border color":"#4C6106","men-
     A                                      u option indent":"10px","background-
     A                                       color":"#758B27","css class":"acti-
     A                                      on-menu","css class 2":"stationary"-
     A                                      ,"z index":"101"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W7412F_SCR02_BtnHiddenRefresh-
     A                                      ","value":"btnRefresh","top":"125px-
     A                                      ","response":{"fieldName":"btnRefre-
     A                                      sh","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"W7412F_S-
     A                                      CR02_BtnHiddenSearch","value":"btnS-
     A                                      earch","top":"150px","response":{"f-
     A                                      ieldName":"btnSearch","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"W7412F_SCR02_BtnHiddenDia-
     A                                      ryItems","value":"btnDiary","top":"-
     A                                      175px","response":{"fieldName":"btn-
     A                                      Diary","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W7412-
     A                                      F_SCR02_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName"')
     A                                  1  2HTML(':"btnMessage","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W7412F_SCR02_BtnHiddenWorkS-
     A                                      ubmitJob","value":"btnWrksbmjob","t-
     A                                      op":"225px","response":{"fieldName"-
     A                                      :"btnWrkJob","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W7412F_SCR02_BtnHiddenWorkPrinterO-
     A                                      utput","value":"btnWrkprtout","top"-
     A                                      :"250px","response":{"fieldName":"b-
     A                                      tnWrkPrnt","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      7412F_SCR02_BtnHiddenImageQueue","v-
     A                                      alue":"btnImgQue","top":"275px","re-
     A                                      sponse":{"fieldName":"btnImgQue","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W7412F_SCR02_B-
     A                                      tnHiddenHelp","value":"btnHelp","to-
     A                                      p":"300px","response":{"fieldName":-
     A                                      "btnHelp","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"btnSubmit","field -
     A                                      type":"button","value":"Enter","sho-
     A                                      rtcut key":"Enter","left":"14px","t-
     A                                      op":"150px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnHELP","field type":"but-
     A                                      ton","shortcut key":"Alt-F1","bypas-
     A                                      s validation":"true","value":"HELP"-
     A                                      ,"response":{"fieldName":"*IN10","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"le-
     A                                      ft":"14px","top":"183px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R WDWMSG
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC3    ROVERLAY   0     -
     A                                      RWINDOW    0     RASSUME    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"WDWMSG","overlay":"true","assum-
     A                                      e":"true","show as window":"true","-
     A                                      onload":"pui.buildFKeyMenu({skipHel-
     A                                      p: true, availableKeys: file + \"_\-
     A                                      " + format + \"_\" + \"avKeys\", fk-
     A                                      eyMenuId:file + \"_\" + format + \"-
     A                                      _\" + \"fkeyMenu\" })","valid comma-
     A                                      nd key":{"fieldName":"*IN11","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},"items-
     A                                      ":[{"id":"WDWMSG","field type":"pan-
     A                                      el","css class":"panel","value":"Po-
     A                                      licy Page","left":"315px","top":"16-
     A                                      0px","width":"541px","height":"235p-
     A                                      x","panel style":"Transform Dialog"-
     A                                      ,"z index":"8","text align":"left"}-
     A                                      ,{"id":"Constant001","field type":"-
     A                                      output field","css class":"output-f-
     A                                      ield","value":"*** ERROR ***","left-
     A                                      ":"395px","top":"200px","font size"-
     A                                      :"11px","width":"365px","text align-
     A                                      ":"center","cursor row":"1","cursor-
     A                                       column":"8","height":"15px"},{"id"-
     A                                      :"Constant001_copy","field type":"o-
     A                                      utput field","css class":"output-fi-
     A                                      eld","value":"NCCI policy record is-
     A                                       not available at this time.","font-
     A                                       size":"11px","text align":"center"-
     A                                      ,"cursor row":"1","cursor column":"-
     A                                      8","left":"395px","top":"265px","he-
     A                                      ight":"15px","width":"365px"},{"id"-
     A                                      :"Constant001_copy2","field type":"-
     A                                      output field","css class":"output-f-
     A                                      ield","value":"Please try again lat-
     A                                      er.","font size":"11px","text align-
     A                                      ":"center","cursor row":"1","cursor-
     A                                       column":"8","left":"395px","top":"-
     A                                      280px","height":"15px","width":"365-
     A                                      px"},{"id":"btnSubmit","field type"-
     A                                      :"button","css class":"button","val-
     A                                      ue":"OK","left":"530px","top":"350p-
     A                                      x","width":"100px","cursor":"defaul-
     A                                      t","shortcut key":"Enter","auto arr-
     A                                      ange":"true"}]}')
