     A                                      REF(*LIBL/WREFP)
     A          R SCR01
     A  09 40 71
     A  72 41                               CA01
     A                                  1  2HTML('QPUIREC4    RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C4    SCSTC7    WCR050-
     A                                      4C6    WMESGGC5    *LIBLC0    E1   -
     A                                       3     71RERRMSGID  5    C4    SCST-
     A                                      C7    WC30661C6    WMESGGC5    *LIB-
     A                                      LC0    E1    3     72')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","return cursor reco-
     A                                      rd":{"fieldName":"HREC","dataLength-
     A                                      ":"10","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none"},"return cursor field":{"fie-
     A                                      ldName":"HFLD","dataLength":"10","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none"},"-
     A                                      overlay range":"1-23"},"items":[{"i-
     A                                      d":"HREC","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"HREC","designValue":"[H-
     A                                      REC]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none","dataLength":"10"},"left":"0p-
     A                                      x","top":"-30px","css class":"profo-
     A                                      und-converted"},{"id":"HFLD","field-
     A                                       type":"output field","visibility":-
     A                                      "hidden","value":{"fieldName":"HFLD-
     A                                      ","designValue":"[HFLD]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"10"},"left":"0px","top":"-30px"-
     A                                      ,"css class":"profound-converted"},-
     A                                      {"id":"W7419F02_SCR01_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"W7419F02_SCR0-
     A                                      1_action","field type":"html contai-
     A                                      ner","white space":"normal","left":-
     A                                      "0px","top":"10px","width":"230px",-
     A                                      "css class":"action-panel-converted-
     A                                      ","height":"700px","html":"<div cla-
     A                                      ss=\"top\"></div><div class=\"image-
     A                                      top\"><img src=\"/profoundui/userda-
     A                                      ta/images/bar_top.png\" /></div><di-
     A                                      v class=\"menulinks\"></div><div cl-
     A                                      ass=\"imagebottom\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_bottom.-
     A                                      png\" /></div><div class=\"bottom\"-
     A                                      ></div>"},{"field type":"icon menu -
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "32px","z index":"20","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1170px","-
     A                                      id":"W7419F02_SCR01_BtnIconMenuSyst-
     A                                      emTools","tool tip":"System Tools",-
     A                                      "icon alignment":"middle left","ico-
     A                                      n width":"16px","icon height":"24px-
     A                                      ","icon source":"/profoundui/userda-
     A                                      ta/images/systool/systools.png","da-
     A                                      ta function":"SystemToolbarSystools-
     A                                      ","show down arrow":"Yes"},{"field -
     A                                      type":"panel","panel style":"Transf-
     A                                      ormButtonBar","id":"W7419F02_SCR01_-
     A                                      ButtonBar","top":"35px","left":"103-
     A                                      6px","width":"187px","height":"28px-
     A                                      ","css class":"stationary","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1040px",-
     A                                      "id":"W7419F02_SCR01_BtnSave","tool-
     A                                       tip":"Save","onclick":"SystemToolb-
     A                                      arSave","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      save.png'')"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1066px","id":"W7419F02_SCR01_BtnRe-
     A                                      fresh","tool tip":"Refresh","onclic-
     A                                      k":"SystemToolbarRefresh","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/refresh.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1092px","id":-
     A                                      "W7419F02_SCR01_BtnSearch","tool ti-
     A                                      p":"Search","onclick":"SystemToolba-
     A                                      rSearch","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /search.png'')"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"t')
     A                                  1  4HTML('rue","left":"1118px","id":"W7-
     A                                      419F02_SCR01_BtnDiaryItems","tool t-
     A                                      ip":"Diary/Work Items - IDARTS","on-
     A                                      click":"SystemToolbarDiary","backgr-
     A                                      ound image":{"fieldName":"DryIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1144px","id":"W7419-
     A                                      F02_SCR01_BtnSystemMessages","tool -
     A                                      tip":"System Messages","onclick":"S-
     A                                      ystemToolbarMessages","background i-
     A                                      mage":{"fieldName":"MsgIcnURL","dat-
     A                                      aLength":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1196px","id":"W7419F02_SC-
     A                                      R01_BtnHelp","tool tip":"Help","onc-
     A                                      lick":"SystemToolbarHelp","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/help.png'')"},{"i-
     A                                      d":"W7419F02_SCR01_ImgSysToolBottom-
     A                                      ","field type":"image","image sourc-
     A                                      e":"/profoundui/userdata/images/sys-
     A                                      tool/butbarbot.png","left":"1036px"-
     A                                      ,"top":"64px","width":"187px","lock-
     A                                      ed in place":"true","css class":"st-
     A                                      ationary","visibility":"hidden"},{"-
     A                                      id":"W7419F02_SCR01_MainTabPanel","-
     A                                      field type":"tab panel","tab panel -
     A                                      style":"Transform","tab names":{"fi-
     A                                      eldName":"SCPRDS","designValue":"[S-
     A                                      CPRDS]","refField":"NAME","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"a-
     A                                      ctive tab":"0","left":"250px","top"-
     A                                      :"70px","width":"970px","height":"6-
     A                                      57px","z index":"8","locked in plac-
     A                                      e":"true","css class":"tab-panel","-
     A                                      css class 2":"stationary"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W7419F02_SCR01_BtnHi-
     A                                      ddenSave","value":"btnSave","top":"-
     A                                      100px","response":{"fieldName":"btn-
     A                                      Save","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant1","field type-
     A                                      ":"output field","left":"281px","cu-
     A                                      rsor column":"2","top":"110px","cur-
     A                                      sor row":"1","css class":"top-line"-
     A                                      ,"value":"js: currentUser()","css c-
     A                                      lass 2":"output-field","parent tab -
     A                                      panel":"W7419F02_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"SCCONM",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCCONM","designValue-
     A                                      ":"[SCCONM]","refField":"NAME","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"414px","cursor column":"21","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss 2":"top-line","css class 3":"HI"-
     A                                      ,"parent tab panel":"W7419F02_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 4":"profound-converted"},{"-
     A                                      id":"constant2","field type":"outpu-
     A                                      t field","left":"778px","cursor col-
     A                                      umn":"73","top":"110px","cursor row-
     A                                      ":"1","css class":"top-line","value-
     A                                      ":"js: currentDate()","css class 2"-
     A                                      :"output-field","parent tab panel":-
     A                                      "W7419F02_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"W7419F02_SCR01_-
     A                                      fkeyMenu","field type":"menu","left-
     A                                      ":"10px","top":"120px","height":"35-
     A                                      0px","width":"230px","hover backgro-
     A                                      und color":"#9AAA61","hover text co-
     A                                      lor":"#FFFFFF","border color":"#4C6-
     A                                      106","menu option indent":"10px","b-
     A                                      ackground color":"#758B27","css cla-
     A                                      ss":"action-menu","css class 2":"st-
     A                                      ationary","z index":"101"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W7419F02_SCR01_BtnHi-
     A                                      ddenRefresh","value":"btnRefresh","-
     A                                      top":"125px","response":{"fieldName-
     A                                      ":"btnRefresh","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"Q1PGM","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"Q1PGM","designValue":"[Q1P-
     A                                      GM]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"10"},"css class-
     A                                      ":"output-field","left":"2')
     A                                  1  5HTML('81px","cursor column":"2","to-
     A                                      p":"130px","cursor row":"2","parent-
     A                                       tab panel":"W7419F02_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCP-
     A                                      RDS","field type":"output field","v-
     A                                      alue":{"fieldName":"SCPRDS","design-
     A                                      Value":"[SCPRDS]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"130px","cursor row":"2","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "W7419F02_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","visibility":"hidden","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"constant3","field type":"out-
     A                                      put field","value":"SCR01","css cla-
     A                                      ss":"constant","left":"799px","curs-
     A                                      or column":"76","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"W74-
     A                                      19F02_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"constant4","field t-
     A                                      ype":"output field","value":"Group:-
     A                                      ","css class":"constant","left":"28-
     A                                      1px","cursor column":"2","top":"150-
     A                                      px","cursor row":"3","parent tab pa-
     A                                      nel":"W7419F02_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCFND","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCFND","designValue":"[-
     A                                      SCFND]","refField":"FND","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00"},"css -
     A                                      class":"output-field","left":"337px-
     A                                      ","cursor column":"10","top":"150px-
     A                                      ","cursor row":"3","width":"21px","-
     A                                      text align":"right","parent tab pan-
     A                                      el":"W7419F02_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCNAME","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCNAME","designValue":"-
     A                                      [SCNAME]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none","dataLength":"55"},"css -
     A                                      class":"output-field","left":"365px-
     A                                      ","cursor column":"14","top":"150px-
     A                                      ","cursor row":"3","description":"F-
     A                                      UND NAME","parent tab panel":"W7419-
     A                                      F02_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCMODE","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCMODE","designValue":"[SCMODE]",-
     A                                      "refField":"PGM","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"764px","cur-
     A                                      sor column":"71","top":"150px","cur-
     A                                      sor row":"3","css class 2":"HI","pa-
     A                                      rent tab panel":"W7419F02_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W7419F02_SCR01_Btn-
     A                                      HiddenSearch","value":"btnSearch","-
     A                                      top":"150px","response":{"fieldName-
     A                                      ":"btnSearch","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant5","fi-
     A                                      eld type":"output field","value":"E-
     A                                      mp #:","css class":"constant","visi-
     A                                      bility":{"fieldName":"N41","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"281px","cursor column":"-
     A                                      2","top":"170px","cursor row":"4","-
     A                                      parent tab panel":"W7419F02_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCEDN","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCEDN","de-
     A                                      signValue":"[SCEDN]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none","dataLength":-
     A                                      "45"},"css class":"output-field","v-
     A                                      isibility":{"fieldName":"N41","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"337px","cursor column-
     A                                      ":"10","top":"170px","cursor row":"-
     A                                      4","parent tab panel":"W7419F02_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W7419F02_SCR-
     A                                      01_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt6","field type":"output field","v-
     A                                      alue":"Year :","css class":"constan-
     A                                      t","visibility":{"fieldName":"N41",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"281px","cursor c-
     A                                      olumn":"2","top":"190px","cursor ro-
     A                                      w":"5","parent tab panel":"W7419F02-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCFYR","field type":"out-
     A                                      put field","value":{"field')
     A                                  1  6HTML('Name":"SCFYR","designValue":"-
     A                                      [SCFYR]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00","dataLength":"3","decPos":-
     A                                      "0"},"css class":"output-field","vi-
     A                                      sibility":{"fieldName":"N41","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"337px","cursor column"-
     A                                      :"10","top":"190px","cursor row":"5-
     A                                      ","width":"21px","text align":"righ-
     A                                      t","parent tab panel":"W7419F02_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W7419F02_SCR-
     A                                      01_BtnHiddenSystemMessages","value"-
     A                                      :"btnMessage","top":"200px","respon-
     A                                      se":{"fieldName":"btnMessage","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W7419F02_SCR01_Bt-
     A                                      nHiddenWorkSubmitJob","value":"btnW-
     A                                      rksbmjob","top":"225px","response":-
     A                                      {"fieldName":"btnWrkJob","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant7","field type":"output field"-
     A                                      ,"value":"Type information, press E-
     A                                      nter.","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"230px","cursor row":"7","css clas-
     A                                      s 2":"BLU","parent tab panel":"W741-
     A                                      9F02_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"W741-
     A                                      9F02_SCR01_BtnHiddenWorkPrinterOutp-
     A                                      ut","value":"btnWrkprtout","top":"2-
     A                                      50px","response":{"fieldName":"btnW-
     A                                      rkPrnt","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant8","field ty-
     A                                      pe":"output field","value":"Exclude-
     A                                      d state:","css class":"constant","l-
     A                                      eft":"295px","cursor column":"4","t-
     A                                      op":"270px","cursor row":"9","paren-
     A                                      t tab panel":"W7419F02_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      ST","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCST","desig-
     A                                      nValue":"[SCST]","refField":"ST","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase","blankFill":"true"},"text t-
     A                                      ransform":"uppercase","left":"407px-
     A                                      ","cursor column":"20","top":"270px-
     A                                      ","cursor row":"9","width":"15px","-
     A                                      text align":"right","css class 3":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 4":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"c-
     A                                      ss class 5":"HI","error message id"-
     A                                      :"WCR0504","error message file":"WM-
     A                                      ESGG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      71","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"2 messages","-
     A                                      error message id 2":"WC30661","erro-
     A                                      r message file 2":"WMESGG","error m-
     A                                      essage library 2":"*LIBL","error co-
     A                                      ndition 2":{"fieldName":"72","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"descr-
     A                                      iption":"Excluded State","parent ta-
     A                                      b panel":"W7419F02_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"SCSTNM-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCSTNM","designVal-
     A                                      ue":"[SCSTNM]","refField":"DS40","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"435px","cursor column":"24","t-
     A                                      op":"270px","cursor row":"9","css c-
     A                                      lass 2":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      parent tab panel":"W7419F02_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W7419F02_SCR01_B-
     A                                      tnHiddenImageQueue","value":"btnImg-
     A                                      Que","top":"275px","response":{"fie-
     A                                      ldName":"btnImgQue","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","h')
     A                                  1  7HTML('eight":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"W7419F02_SCR-
     A                                      01_BtnHiddenHelp","value":"btnHelp"-
     A                                      ,"top":"300px","response":{"fieldNa-
     A                                      me":"btnHelp","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant11","f-
     A                                      ield type":"output field","value":"-
     A                                       ","css class":"constant","visibili-
     A                                      ty":{"fieldName":"N09 and N40","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"281px","cursor colum-
     A                                      n":"2","top":"550px","cursor row":"-
     A                                      23","css class 2":"BLU","parent tab-
     A                                       panel":"W7419F02_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t10","field type":"output field","v-
     A                                      alue":" ","css class":"constant","v-
     A                                      isibility":{"fieldName":"40","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"281px","cursor column"-
     A                                      :"2","top":"550px","cursor row":"23-
     A                                      ","css class 2":"BLU","parent tab p-
     A                                      anel":"W7419F02_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant9-
     A                                      ","field type":"output field","valu-
     A                                      e":" ","css class":"constant","visi-
     A                                      bility":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"281px","cursor column":"2-
     A                                      ","top":"550px","cursor row":"23","-
     A                                      css class 2":"BLU","parent tab pane-
     A                                      l":"W7419F02_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"btnSubmit","-
     A                                      field type":"button","value":"Enter-
     A                                      ","shortcut key":"Enter","left":"14-
     A                                      px","top":"150px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF03","field type-
     A                                      ":"button","visibility":{"fieldName-
     A                                      ":"09 or 40 or N09 and N40","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"value":"Exit","shortcut key":"-
     A                                      F3","left":"14px","top":"183px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF1-
     A                                      0","field type":"button","visibilit-
     A                                      y":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"v-
     A                                      alue":"Search","shortcut key":"F10"-
     A                                      ,"left":"14px","top":"216px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF12",-
     A                                      "field type":"button","visibility":-
     A                                      {"fieldName":"09 or 40 or N09 and N-
     A                                      40","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"value":"Cancel","sh-
     A                                      ortcut key":"F12","left":"14px","to-
     A                                      p":"249px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEDN         45A  H
     A            SCFYR          3S 0H
     A            SCNAME        55A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFND     R        H      REFFLD(FND)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCST      R        H      REFFLD(ST)
     A            SCSTNM    R        H      REFFLD(DS40)
     A          R SCR02
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"W7419F02_SCR02_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"W7419F02_SCR02_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W7419F02_SCR02_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"W7419F02_SCR02_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"W7419F02_SCR02_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"W7419F02_SCR02_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"W-
     A                                      7419F02_SCR02_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"W7419F02_SCR02_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"W7419F02_SCR02_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"W7419F02_SCR0-
     A                                      2_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"W7419F02_SCR02_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"W7419F02_SCR02_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W7419F02_SCR02_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant12","field type"-
     A                                      :"output field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentUser()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"W7419F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR02_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","parent tab panel":"W7419F02_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant13","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"W7419F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"W7419F02_-
     A                                      SCR02_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W7419F02_SCR02-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCR02_Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"W7419F02_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR02_-
     A                                      SCPRDS","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCPRDS","des-
     A                                      ignValue":"[SCPRDS]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"130px","cursor row":"2",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"W7419F02_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant14","field type":-
     A                                      "output field","value":"SCR02","css-
     A                                       class":"constant","left":"799px","-
     A                                      cursor column":"76","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "W7419F02_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR02_SCMODE","-
     A                                      field type":"output field"')
     A                                  1  5HTML(',"value":{"fieldName":"SCMODE-
     A                                      ","designValue":"[SCMODE]","refFiel-
     A                                      d":"PGM","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"764px","cursor colu-
     A                                      mn":"71","top":"150px","cursor row"-
     A                                      :"3","css class 2":"HI","parent tab-
     A                                       panel":"W7419F02_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W7419F02_SCR02_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W7419F-
     A                                      02_SCR02_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W7419F02_SCR02_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W7419F02_SCR02_BtnHidden-
     A                                      WorkSubmitJob","value":"btnWrksbmjo-
     A                                      b","top":"225px","response":{"field-
     A                                      Name":"btnWrkJob","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W7419F02_SCR02_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"250px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W7419F02_SCR02_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W7419-
     A                                      F02_SCR02_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"btnSubm-
     A                                      it","field type":"button","value":"-
     A                                      Enter","shortcut key":"Enter","left-
     A                                      ":"14px","top":"150px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF03","field-
     A                                       type":"button","value":"Exit","sho-
     A                                      rtcut key":"F3","left":"14px","top"-
     A                                      :"183px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF12","field type":"button-
     A                                      ","value":"Cancel","shortcut key":"-
     A                                      F12","left":"14px","top":"216px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR03
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"W7419F02_SCR03_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"W7419F02_SCR03_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"W7419F02_SCR03_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"W7419F02_SCR03_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"W7419F02_SCR03_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"W7419F02_SCR03_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"W-
     A                                      7419F02_SCR03_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"W7419F02_SCR03_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"W7419F02_SCR03_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"W7419F02_SCR0-
     A                                      3_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"W7419F02_SCR03_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"W7419F02_SCR03_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W7419F02_SCR03_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant15","field type"-
     A                                      :"output field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentUser()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"W7419F02_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR03_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","parent tab panel":"W7419F02_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant16","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"W7419F02_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"W7419F02_-
     A                                      SCR03_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W7419F02_SCR03-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCR03_Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"W7419F02_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR03_-
     A                                      SCPRDS","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCPRDS","des-
     A                                      ignValue":"[SCPRDS]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"130px","cursor row":"2",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"W7419F02_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant17","field type":-
     A                                      "output field","value":"SCR03","css-
     A                                       class":"constant","left":"799px","-
     A                                      cursor column":"76","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "W7419F02_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR03_SCMODE","-
     A                                      field type":"output field"')
     A                                  1  5HTML(',"value":{"fieldName":"SCMODE-
     A                                      ","designValue":"[SCMODE]","refFiel-
     A                                      d":"PGM","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"764px","cursor colu-
     A                                      mn":"71","top":"150px","cursor row"-
     A                                      :"3","css class 2":"HI","parent tab-
     A                                       panel":"W7419F02_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W7419F02_SCR03_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W7419F-
     A                                      02_SCR03_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W7419F02_SCR03_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W7419F02_SCR03_BtnHidden-
     A                                      WorkSubmitJob","value":"btnWrksbmjo-
     A                                      b","top":"225px","response":{"field-
     A                                      Name":"btnWrkJob","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W7419F02_SCR03_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"250px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W7419F02_SCR03_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"W7419-
     A                                      F02_SCR03_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"btnSubm-
     A                                      it","field type":"button","value":"-
     A                                      Enter","shortcut key":"Enter","left-
     A                                      ":"14px","top":"150px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF03","field-
     A                                       type":"button","value":"Exit","sho-
     A                                      rtcut key":"F3","left":"14px","top"-
     A                                      :"183px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF12","field type":"button-
     A                                      ","value":"Cancel","shortcut key":"-
     A                                      F12","left":"14px","top":"216px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
