     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20
     A  21 22 23
     A  24 25 26                            CA01(10 'Response Indicator *IN10')
     A  27 70                               CA02(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                  1  2HTML('QPUIREC14   RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C5  -
     A                                        SCDTEC7    WCR0500C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     21RERRMSG-
     A                                      ID  5    C6    SCFDATC7    WCR0500C-
     A                                      6    WMESGGC5    *LIBLC0    E1    3-
     A                                           24RERRMSGID  5    C6    SCFDAT-
     A                                      C7    WCR0750C6    WMESGGC5    *LIB-
     A                                      LC0    E1    3     26RERRMSGID  5  -
     A                                        C6    SCTDATC7    WCR0500C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    3     25-
     A                                      RERRMSGID  5    C6    SCTDATC7    W-
     A                                      CR0750C6    WMESGGC5    *LIBLC0    -
     A                                      E1    3     26RERRMSGID  5    C5   -
     A                                       SCFYRC7    WCR0517C6    WMESGGC5  -
     A                                        *LIBLC0    E1    3     20RERRMSGI-
     A                                      D  5    C6    SCSORTC7    WCR0752C6-
     A                                          WMESGGC5    *LIBLC0    E1    3 -
     A                                          22RERRMSGID  5    C6    SCFEMPC-
     A                                      7    WCR0750C6    WMESGGC5    *LIBL-
     A                                      C0    E1    3     27RERRMSGID  5   -
     A                                       C6    SCFDIVC7    WCR0750C6    WME-
     A                                      SGGC5    *LIBLC0    E1    3     27R-
     A                                      ERRMSGID  5    C6    SCTEMPC7    WC-
     A                                      R0750C6    WMESGGC5    *LIBLC0    E-
     A                                      1    3     27RERRMSGID  5    C6    -
     A                                      SCTDIVC7    WCR0750C6    WMESGGC5  -
     A                                        *LIBLC0    E1    3     27RERRMSGI-
     A                                      D  5    C6    SCFRPRC7    WCR0750C6-
     A                                          WMESGGC5    *LIBLC0    E1    3 -
     A                                          23RERRMSGID  5    C6    SCTOPRC-
     A                                      7    WCR0750C6    WMESGGC5    *LIBL-
     A                                      C0    E1    3     23')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN26","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"valid command key":{"fiel-
     A                                      dName":"*IN11","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"overlay range":"1-23-
     A                                      "},"items":[{"id":"W7430F_SCR01_avK-
     A                                      eys","field type":"output field","v-
     A                                      alue":{"fieldName":"AV_KEYS","dataL-
     A                                      ength":"1134","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none","designValue":"-
     A                                      [AV_KEYS]"},"left":"0px","top":"0px-
     A                                      ","visibility":"hidden"},{"id":"W74-
     A                                      30F_SCR01_action","field type":"htm-
     A                                      l container","white space":"normal"-
     A                                      ,"left":"0px","top":"10px","width":-
     A                                      "230px","css class":"action-panel-c-
     A                                      onverted","height":"700px","html":"-
     A                                      <div class=\"top\"></div><div class-
     A                                      =\"imagetop\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_top.png\" /><-
     A                                      /div><div class=\"menulinks\"></div-
     A                                      ><div class=\"imagebottom\"><img sr-
     A                                      c=\"/profoundui/userdata/images/bar-
     A                                      _bottom.png\" /></div><div class=\"-
     A                                      bottom\"></div>"},{"field type":"ic-
     A                                      on menu button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"32px","z index":"20","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      170px","id":"W7430F_SCR01_BtnIconMe-
     A                                      nuSystemTools","tool tip":"System T-
     A                                      ools","icon alignment":"middle left-
     A                                      ","icon width":"16px","icon height"-
     A                                      :"24px","icon source":"/profoundui/-
     A                                      userdata/images/systool/systools.pn-
     A                                      g","data function":"SystemToolbarSy-
     A                                      stools","show down arrow":"Yes"},{"-
     A                                      field type":"panel","panel style":"-
     A                                      TransformButtonBar","id":"W7430F_SC-
     A                                      R01_ButtonBar","top":"35px","left":-
     A                                      "1036px","width":"187px","height":"-
     A                                      28px","css class":"stationary","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1040-
     A                                      px","id":"W7430F_SCR01_BtnSave","to-
     A                                      ol tip":"Save","onclick":"SystemToo-
     A                                      lbarSave","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/save.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1066px","id":"W7430F_SCR01_BtnRe-
     A                                      fresh","tool tip":"Refresh","onclic-
     A                                      k":"SystemToolbarRefresh","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/refresh.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1092px","id":-
     A                                      "W7430F_SCR01_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"W7430F_SCR')
     A                                  1  4HTML('01_BtnDiaryItems","tool tip":-
     A                                      "Diary/Work Items - IDARTS","onclic-
     A                                      k":"SystemToolbarDiary","background-
     A                                       image":{"fieldName":"DryIcnURL","d-
     A                                      ataLength":"128","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"}},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1144px","id":"W7430F_SC-
     A                                      R01_BtnSystemMessages","tool tip":"-
     A                                      System Messages","onclick":"SystemT-
     A                                      oolbarMessages","background image":-
     A                                      {"fieldName":"MsgIcnURL","dataLengt-
     A                                      h":"128","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none"}},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1196px","id":"W7430F_SCR01_BtnH-
     A                                      elp","tool tip":"Help","onclick":"S-
     A                                      ystemToolbarHelp","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/help.png'')"},{"id":"W743-
     A                                      0F_SCR01_ImgSysToolBottom","field t-
     A                                      ype":"image","image source":"/profo-
     A                                      undui/userdata/images/systool/butba-
     A                                      rbot.png","left":"1036px","top":"64-
     A                                      px","width":"187px","locked in plac-
     A                                      e":"true","css class":"stationary",-
     A                                      "visibility":"hidden"},{"id":"W7430-
     A                                      F_SCR01_MainTabPanel","field type":-
     A                                      "tab panel","tab panel style":"Tran-
     A                                      sform","tab names":{"fieldName":"SC-
     A                                      PRDS","designValue":"[SCPRDS]","ref-
     A                                      Field":"NAME","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"active tab":"-
     A                                      0","left":"250px","top":"70px","wid-
     A                                      th":"970px","height":"657px","z ind-
     A                                      ex":"8","locked in place":"true","c-
     A                                      ss class":"tab-panel","css class 2"-
     A                                      :"stationary"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W7430F_SCR01_BtnHiddenSave","val-
     A                                      ue":"btnSave","top":"100px","respon-
     A                                      se":{"fieldName":"btnSave","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"S-
     A                                      CUSER","field type":"output field",-
     A                                      "value":{"fieldName":"SCUSER","desi-
     A                                      gnValue":"[SCUSER]","refField":"USE-
     A                                      R","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"110px","cursor row":"1","c-
     A                                      ss class 2":"top-line","parent tab -
     A                                      panel":"W7430F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"SCCONM","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCCONM","designValue":-
     A                                      "[SCCONM]","refField":"NAME","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "414px","cursor column":"21","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                       2":"top-line","css class 3":"HI","-
     A                                      description":"COMPANY NAME","parent-
     A                                       tab panel":"W7430F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 4"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant1","field type":"output field","-
     A                                      left":"778px","cursor column":"73",-
     A                                      "top":"110px","cursor row":"1","css-
     A                                       class":"top-line","value":"js: cur-
     A                                      rentDate()","css class 2":"output-f-
     A                                      ield","parent tab panel":"W7430F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"W7430F_SCR01_fkeyMenu","fie-
     A                                      ld type":"menu","left":"10px","top"-
     A                                      :"120px","height":"350px","width":"-
     A                                      230px","hover background color":"#9-
     A                                      AAA61","hover text color":"#FFFFFF"-
     A                                      ,"border color":"#4C6106","menu opt-
     A                                      ion indent":"10px","background colo-
     A                                      r":"#758B27","css class":"action-me-
     A                                      nu","css class 2":"stationary","z i-
     A                                      ndex":"101"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W7430F_SCR01_BtnHiddenRefresh","va-
     A                                      lue":"btnRefresh","top":"125px","re-
     A                                      sponse":{"fieldName":"btnRefresh","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"Q1PGM","field type":"output f-
     A                                      ield","value":{"fieldName":"Q1PGM",-
     A                                      "designValue":"[Q1PGM]","dataType":-
     A                                      "char","formatting":"Text"')
     A                                  1  5HTML(',"trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one","dataLength":"10"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"W74-
     A                                      30F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCPRDS","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCPRDS","designValue":"[SCPRDS]",-
     A                                      "refField":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"414px","cu-
     A                                      rsor column":"21","top":"130px","cu-
     A                                      rsor row":"2","css class 2":"HI","d-
     A                                      escription":"PROGRAM NAME","parent -
     A                                      tab panel":"W7430F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","visibility":"-
     A                                      hidden","css class 3":"profound-con-
     A                                      verted"},{"id":"constant2","field t-
     A                                      ype":"output field","value":"SCR01"-
     A                                      ,"css class":"constant","left":"799-
     A                                      px","cursor column":"76","top":"130-
     A                                      px","cursor row":"2","parent tab pa-
     A                                      nel":"W7430F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W7430F_SCR01_BtnHiddenSearch","-
     A                                      value":"btnSearch","top":"150px","r-
     A                                      esponse":{"fieldName":"btnSearch","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant4","field type":"outp-
     A                                      ut field","value":"Group:","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"70","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"281px-
     A                                      ","cursor column":"2","top":"170px"-
     A                                      ,"cursor row":"4","parent tab panel-
     A                                      ":"W7430F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"constant3","fie-
     A                                      ld type":"output field","value":"Gr-
     A                                      oup:","css class":"constant","visib-
     A                                      ility":{"fieldName":"N70","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"281px","cursor column":"2-
     A                                      ","top":"170px","cursor row":"4","p-
     A                                      arent tab panel":"W7430F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCFND","field type":"output field",-
     A                                      "value":{"fieldName":"SCFND","desig-
     A                                      nValue":"[SCFND]","refField":"FND",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00"},"css class":"output-field","le-
     A                                      ft":"337px","cursor column":"10","t-
     A                                      op":"170px","cursor row":"4","width-
     A                                      ":"21px","text align":"right","pare-
     A                                      nt tab panel":"W7430F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCN-
     A                                      AME","field type":"output field","v-
     A                                      alue":{"fieldName":"SCNAME","design-
     A                                      Value":"[SCNAME]","refField":"NM60"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"372px","cursor column":"15"-
     A                                      ,"top":"170px","cursor row":"4","de-
     A                                      scription":"FUND NAME","parent tab -
     A                                      panel":"W7430F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"W7430F_SCR01_BtnHiddenDiaryIt-
     A                                      ems","value":"btnDiary","top":"175p-
     A                                      x","response":{"fieldName":"btnDiar-
     A                                      y","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W7430F_SC-
     A                                      R01_BtnHiddenSystemMessages","value-
     A                                      ":"btnMessage","top":"200px","respo-
     A                                      nse":{"fieldName":"btnMessage","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant5","field type":"output -
     A                                      field","value":"Type information, p-
     A                                      ress Enter.","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"210px","cursor row":"6","cs-
     A                                      s class 2":"BLU","parent tab panel"-
     A                                      :"W7430F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      W7430F_SCR01_BtnHiddenWorkSubmitJob-
     A                                      ","value":"btnWrksbmjob","top":"225-
     A                                      px","response":{"fieldName":"btnWrk-
     A                                      Job","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"constant6","field type"-
     A                                      :"output field","value":"Losses as -
     A                                      of               :","css class":"co-
     A                                      nstant","left":"295px","cursor colu-
     A                                      mn":"4","top":"250px","cur')
     A                                  1  6HTML('sor row":"8","parent tab pane-
     A                                      l":"W7430F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCDTE","field -
     A                                      type":"date field","css class":"inp-
     A                                      ut","css class 2":"date-field","val-
     A                                      ue":{"fieldName":"SCDTE","designVal-
     A                                      ue":"[SCDTE]","refField":"DT8","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"false","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"-999.00"-
     A                                      ,"numBlankFill":"true","edtWrd":"''-
     A                                        /  /    ''","dateFormat":"m/d/Y"}-
     A                                      ,"left":"498px","cursor column":"33-
     A                                      ","top":"250px","cursor row":"8","w-
     A                                      idth":"71px","text align":"right","-
     A                                      css class 3":"HI","error message id-
     A                                      ":"WCR0500","error message file":"W-
     A                                      MESGG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "21","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"1 message","-
     A                                      parent tab panel":"W7430F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 4":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"W7430F_SCR01_BtnHi-
     A                                      ddenWorkPrinterOutput","value":"btn-
     A                                      Wrkprtout","top":"250px","response"-
     A                                      :{"fieldName":"btnWrkPrnt","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant7","field type":"output fiel-
     A                                      d","value":"Accident date range    -
     A                                          :","css class":"constant","visi-
     A                                      bility":{"fieldName":"70","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"295px","cursor column":"4-
     A                                      ","top":"270px","cursor row":"9","p-
     A                                      arent tab panel":"W7430F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCFDAT","field type":"date field","-
     A                                      css class":"input","css class 2":"d-
     A                                      ate-field","value":{"fieldName":"SC-
     A                                      FDAT","designValue":"[SCFDAT]","ref-
     A                                      Field":"DT8","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"-999.00","numBlankFill":"t-
     A                                      rue","edtWrd":"''  /  /    ''","dat-
     A                                      eFormat":"m/d/Y"},"visibility":{"fi-
     A                                      eldName":"70","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"49-
     A                                      8px","cursor column":"33","top":"27-
     A                                      0px","cursor row":"9","width":"71px-
     A                                      ","text align":"right","css class 3-
     A                                      ":"HI","error message id":"WCR0500"-
     A                                      ,"error message file":"WMESGG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"24","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"2 messages","error mess-
     A                                      age id 2":"WCR0750","error message -
     A                                      file 2":"WMESGG","error message lib-
     A                                      rary 2":"*LIBL","error condition 2"-
     A                                      :{"fieldName":"26","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"parent tab pane-
     A                                      l":"W7430F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 4":"profoun-
     A                                      d-converted"},{"id":"constant8","fi-
     A                                      eld type":"output field","value":"t-
     A                                      o","css class":"constant","visibili-
     A                                      ty":{"fieldName":"70","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"582px","cursor column":"45","-
     A                                      top":"270px","cursor row":"9","pare-
     A                                      nt tab panel":"W7430F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCT-
     A                                      DAT","field type":"date field","css-
     A                                       class":"input","css class 2":"date-
     A                                      -field","value":{"fieldName":"SCTDA-
     A                                      T","designValue":"[SCTDAT]","refFie-
     A                                      ld":"DT8","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"-999.00","numBlankFill":"true-
     A                                      ","edtWrd":"''  /  /    ''","dateFo-
     A                                      rmat":"m/d/Y"},"visibility":{"field-
     A                                      Name":"70","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"632px-
     A                                      ","cursor column":"49","top":"270px-
     A                                      ","cursor row":"9","width":"71px","-
     A                                      text align":"right","css class 3":"-
     A                                      HI","error message id":"WCR0500","e-
     A                                      rror message file":"WMESGG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"25","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"2 messages","error message-
     A                                       id 2":"WCR0750","error message fil-
     A                                      e 2":"WMESGG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"26","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"parent tab panel":-
     A                                      "W7430F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 4":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"W-
     A                                      7430F_SCR01_BtnHiddenImage')
     A                                  1  7HTML('Queue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant9","fie-
     A                                      ld type":"output field","value":"Po-
     A                                      licy year                :","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"N70","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"295-
     A                                      px","cursor column":"4","top":"290p-
     A                                      x","cursor row":"10","parent tab pa-
     A                                      nel":"W7430F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCFYR","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCFYR","designValue":-
     A                                      "[SCFYR]","refField":"FYR","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00","num-
     A                                      BlankFill":"true"},"visibility":{"f-
     A                                      ieldName":"N70","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      498px","cursor column":"33","top":"-
     A                                      290px","cursor row":"10","width":"2-
     A                                      2px","text align":"right","css clas-
     A                                      s 3":"HI","error message id":"WCR05-
     A                                      17","error message file":"WMESGG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"20","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"1 message","descript-
     A                                      ion":"FUND CENTURY AND YEAR","paren-
     A                                      t tab panel":"W7430F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 4-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"W7430F_SCR01_BtnHiddenH-
     A                                      elp","value":"btnHelp","top":"300px-
     A                                      ","response":{"fieldName":"btnHelp"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant10","field type":"o-
     A                                      utput field","value":"Sort selectio-
     A                                      n             :","css class":"const-
     A                                      ant","left":"295px","cursor column"-
     A                                      :"4","top":"330px","cursor row":"12-
     A                                      ","parent tab panel":"W7430F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCSORT","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCSO-
     A                                      RT","designValue":"[SCSORT]","refFi-
     A                                      eld":"FLAG","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase"},"text transf-
     A                                      orm":"uppercase","left":"498px","cu-
     A                                      rsor column":"33","top":"330px","cu-
     A                                      rsor row":"12","width":"8px","css c-
     A                                      lass 3":"HI","error message id":"WC-
     A                                      R0752","error message file":"WMESGG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"22",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"1 message","descr-
     A                                      iption":"SORT SELECT","parent tab p-
     A                                      anel":"W7430F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 4":"prof-
     A                                      ound-converted"},{"id":"constant11"-
     A                                      ,"field type":"output field","value-
     A                                      ":"(E=Employer number, P=Premium am-
     A                                      ount,","css class":"constant","left-
     A                                      ":"526px","cursor column":"37","top-
     A                                      ":"330px","cursor row":"12","parent-
     A                                       tab panel":"W7430F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant12","field type":"output field",-
     A                                      "value":" L=Loss ratio, F=Frequency-
     A                                       ratio)","css class":"constant","le-
     A                                      ft":"526px","cursor column":"37","t-
     A                                      op":"350px","cursor row":"13","pare-
     A                                      nt tab panel":"W7430F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant13","field type":"output field-
     A                                      ","value":"If Sort = E, then","css -
     A                                      class":"constant","left":"295px","c-
     A                                      ursor column":"4","top":"410px","cu-
     A                                      rsor row":"16","parent tab panel":"-
     A                                      W7430F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant14","field-
     A                                       type":"output field","value":"Empl-
     A                                      oyer / division range:","css class"-
     A                                      :"constant","left":"309px","cursor -
     A                                      column":"6","top":"430px","cursor r-
     A                                      ow":"17","parent tab panel":"W7430F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCFEMP","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCFEMP","designValue":"[SCFEMP]"-
     A                                      ,"refField":"EMP#","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00","numBlankFil-
     A                                      l":"true"},"left":"498px","cursor c-
     A                                      olumn":"33","top":"430px","cursor r-
     A                                      ow":"17","width":"64px","text align-
     A                                      ":"right","error message id":"WCR07-
     A                                      50","error message file":"WMESGG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"27","da-
     A                                      taType":"expression","form')
     A                                  1  8HTML('atting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"1 mes-
     A                                      sage","description":"From Employer -
     A                                      Number","parent tab panel":"W7430F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"SCFDIV","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCFDIV","designValue":"[SCFDIV]",-
     A                                      "refField":"DIV","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00","numBlankFill"-
     A                                      :"true"},"left":"568px","cursor col-
     A                                      umn":"43","top":"430px","cursor row-
     A                                      ":"17","width":"36px","text align":-
     A                                      "right","error message id":"WCR0750-
     A                                      ","error message file":"WMESGG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"27","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"1 message","descriptio-
     A                                      n":"From Division Number","parent t-
     A                                      ab panel":"W7430F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t15","field type":"output field","v-
     A                                      alue":"to","css class":"constant","-
     A                                      left":"617px","cursor column":"50",-
     A                                      "top":"430px","cursor row":"17","pa-
     A                                      rent tab panel":"W7430F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CTEMP","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCTEMP","-
     A                                      designValue":"[SCTEMP]","refField":-
     A                                      "EMP#","dataType":"reference","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"false","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"999.00","numBlankFill":"true"},"-
     A                                      left":"645px","cursor column":"54",-
     A                                      "top":"430px","cursor row":"17","wi-
     A                                      dth":"64px","text align":"right","e-
     A                                      rror message id":"WCR0750","error m-
     A                                      essage file":"WMESGG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"27","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"1 message","description":"To Emp-
     A                                      loyer Number","parent tab panel":"W-
     A                                      7430F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"SCTDIV","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCTDIV","designValue":"[SCT-
     A                                      DIV]","refField":"DIV","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"999.00","numBlan-
     A                                      kFill":"true"},"left":"715px","curs-
     A                                      or column":"64","top":"430px","curs-
     A                                      or row":"17","width":"36px","text a-
     A                                      lign":"right","error message id":"W-
     A                                      CR0750","error message file":"WMESG-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"27"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error messages":"1 message","desc-
     A                                      ription":"To Division Number","pare-
     A                                      nt tab panel":"W7430F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant16","field type":"output field-
     A                                      ","value":"Premium range           -
     A                                         :","css class":"constant","left"-
     A                                      :"295px","cursor column":"4","top":-
     A                                      "470px","cursor row":"19","parent t-
     A                                      ab panel":"W7430F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCFRPR"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCFRPR","design-
     A                                      Value":"[SCFRPR]","refField":"A112"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"true","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","numBlankFill":"true"},"left":-
     A                                      "498px","cursor column":"33","top":-
     A                                      "470px","cursor row":"19","width":"-
     A                                      106px","text align":"right","error -
     A                                      message id":"WCR0750","error messag-
     A                                      e file":"WMESGG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"23","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"1 -
     A                                      message","description":"FROM PREMIU-
     A                                      M","parent tab panel":"W7430F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"constant17","field type":"outp-
     A                                      ut field","value":"to","css class":-
     A                                      "constant","left":"617px","cursor c-
     A                                      olumn":"50","top":"470px","cursor r-
     A                                      ow":"19","parent tab panel":"W7430F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCTOPR","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCTOPR","designValue":"[SCTOPR]"-
     A                                      ,"refField":"A112","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"true","zeroBalance":"false","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"-999.00","numBlankFil-
     A                                      l":"true"},"left":"645px","cursor c-
     A                                      olumn":"54","top":"470px",')
     A                                  1  9HTML('"cursor row":"19","width":"10-
     A                                      6px","text align":"right","error me-
     A                                      ssage id":"WCR0750","error message -
     A                                      file":"WMESGG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"23","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"1 me-
     A                                      ssage","description":"TO PREMIUM","-
     A                                      parent tab panel":"W7430F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant18","field type":"output f-
     A                                      ield","value":"to","css class":"con-
     A                                      stant","left":"652px","cursor colum-
     A                                      n":"55","top":"470px","cursor row":-
     A                                      "19","parent tab panel":"W7430F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"btnSubmit","field type":"but-
     A                                      ton","value":"Enter","shortcut key"-
     A                                      :"Enter","left":"14px","top":"150px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF03","field type":"button","valu-
     A                                      e":"Exit","shortcut key":"F3","left-
     A                                      ":"14px","top":"183px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF13","field-
     A                                       type":"button","value":"Chg user p-
     A                                      arms","shortcut key":"F13","left":"-
     A                                      14px","top":"216px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnHELP","field ty-
     A                                      pe":"button","shortcut key":"Alt-F1-
     A                                      ","bypass validation":"true","value-
     A                                      ":"HELP","response":{"fieldName":"*-
     A                                      IN10","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"left":"14px","top":"249px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDTE     R        H      REFFLD(DT8)
     A            SCFDAT    R        H      REFFLD(DT8)
     A            SCFDIV    R        H      REFFLD(DIV)
     A            SCFEMP    R        H      REFFLD(EMP#)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFRPR    R        H      REFFLD(A112)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSORT    R        H      REFFLD(FLAG)
     A            SCTDAT    R        H      REFFLD(DT8)
     A            SCTDIV    R        H      REFFLD(DIV)
     A            SCTEMP    R        H      REFFLD(EMP#)
     A            SCTOPR    R        H      REFFLD(A112)
     A            SCUSER    R        H      REFFLD(USER)
