     A* (c) 2012 StoneRiver, Inc. All rights reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A****************************************************************
     A**   PRINTER FILE FOR LUBA-WC-1007                            **
     A**                                                            **
     A**   PROGRAMMER: C:190                PROJECT: 133WET         **
     A****************************************************************
     A** REVISIONS                                                  **
     A**                                                            **
     A**  03/22/12 C:280 PROJECT 133WMQ                             **
     A**                -CHANGE FONT FROM C0H40060 T1V10037         **
     A**                             TO   C0N20080 T1V10037         **
     A**                                                            **
     A****************************************************************
     A**
     A                                      REF(*LIBL/WREFP)
     A*  AGENT MASTER RECORD FORMAT *                                  *********
     A          R LUBAREC
     A*---------------------------------------------------------------
     A* EMPLOYEE SSN, EMPLOYER UI ACCOUNT NUMBER, EMPLOYER FEIN.
     A*---------------------------------------------------------------
     A            PRCSS#        11A  O      POSITION(0.29 5.7)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PR20A2        20A  O      POSITION(0.59 5.7)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRFEIN         9S 0O      POSITION(0.92 5.7)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A*---------------------------------------------------------------
     A* PURPOSE OF REPORT
     A*---------------------------------------------------------------
     A            P120A4         1A  O      POSITION(2.25 0.44)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            P220A4         1A  O      POSITION(2.27 2.68)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            P320A4         1A  O      POSITION(2.30 5.3)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            P420A4         1A  O      POSITION(2.45 0.44)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            P520A4         1A  O      POSITION(2.48 2.68)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            P620A4         1A  O      POSITION(2.65 0.44)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            P720A4         1A  O      POSITION(2.68 2.68)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A

     A*---------------------------------------------------------------
     A* DATE OF REPORT, DATE/TIME OF INJURY, NORMAL STARTING TIME,
     A* BACK TO WORK, AT SAME WAGES.
     A*---------------------------------------------------------------
     A            PRRPDT         8  0O      POSITION(3.1 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('  /  /    ')

     A            PRACDT         8  0O      POSITION(3.1 1.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('  /  /    ')

     A            PRTIME         4S 0O      POSITION(3.2 1.6)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('  :  ')

     A            PRTIAM         1A  O      POSITION(3.10 2.04)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A
     A            PRTIPM         1A  O      POSITION(3.23 2.04)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRNRTM         4S 0O      POSITION(3.10 2.65)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('  :  ')

     A            PRNRAM         1A  O      POSITION(3.11 3.37)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A
     A            PRNRPM         1A  O      POSITION(3.23 3.37)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*


     A            PRIRTN         8S 0O      POSITION(3.2 4.0)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('  /  /    ')

     A            PRATWG         1A  O      POSITION(3.00 4.97)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRATSG         1A  O      POSITION(3.00 5.42)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A*---------------------------------------------------------------
     A* DATE OF DEATH, DATE EMPLOYER KNEW OF INJURY, DATE DISABILITY,
     A* LAST FULL DAY PAID.
     A*---------------------------------------------------------------
     A            PRDOD          8S 0O      POSITION(3.62 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('  /  /    ')

     A            PRDTRP         8S 0O      POSITION(3.62 2.1)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('  /  /    ')

     A            PRDT1          8S 0O      POSITION(3.62 3.6)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('  /  /    ')

     A            PRFSDT         8S 0O      POSITION(3.62 4.9)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('  /  /    ')
     A*---------------------------------------------------------------
     A*EMPLOYEE NAME, SEX, PHONE.
     A*---------------------------------------------------------------
     A            CDFSN         15A  O      POSITION(4.0 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            CDMID          1A  O      POSITION(4.0 2.0)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            CDLSN         30A  O      POSITION(4.0 2.3)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRSEXM         1A  O      POSITION(3.92 3.98)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRSEXF         1A  O      POSITION(4.01 3.97)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRCLAR         3S 0O      POSITION(4.02 4.82)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A*                                     EDTWRD('0(   )')

     A            PRCLPH         7S 0O      POSITION(4.02 5.09)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('0   -    ')
     A*---------------------------------------------------------------
     A*ADDRESS, CITY, STATE, ZIP, PARISH OF INJURY
     A*---------------------------------------------------------------
     A            PRCLA1        40A  O      POSITION(4.3 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRCLA2        40A  O      POSITION(4.4 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRCLCY        25A  O      POSITION(4.4 2.5)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRCLST         2A  O      POSITION(4.4 3.85)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRCLZP         9S 0O      POSITION(4.4 4.00)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A**                                    FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('     -    ')

     A            PRATA3        20A  O      POSITION(4.4 5.02)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A*---------------------------------------------------------------
     A*  DATE HIRED, DATE OF BIRTH , OCCUPATION, DEPT/DIV EMPLOYED
     A*---------------------------------------------------------------
     A            PRDOH          8S 0O      POSITION(4.68 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('  /  /    ')

     A            PRCDOB         8S 0O      POSITION(4.68 1.3)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('  /  /    ')

     A            PROCDS        35A  O      POSITION(4.68 2.57)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A

     A            PRDEPT        10   O      POSITION(4.68 4.7)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A*---------------------------------------------------------------
     A*  PLACE OF INJURY, LOCATION,STREET,CITY,PARISH,STATE.
     A*---------------------------------------------------------------
     A            PRADRY         1A  O      POSITION(5.00 0.95)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRADRN         1A  O      POSITION(5.00 1.41)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            CMACNM        40A  O      POSITION(5.00 2.10)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A
     A            PRAADR        80A  O      POSITION(5.07 2.10)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A*---------------------------------------------------------------
     A* WHAT WORK ACTIVITY WAS EMPLOYEE DOING WHEN INCIDENT HAPPEN.
     A*---------------------------------------------------------------
     A            PRNI63        60A  O      POSITION(5.65 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRNI64        60A  O      POSITION(5.85 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A
     A*---------------------------------------------------------------
     A* WHAT CAUSED INCIDENT TO HAPPEN?
     A            PR80A1        80A  O      POSITION(7.10 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PR80A2        80A  O      POSITION(7.30 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A*---------------------------------------------------------------
     A*---------------------------------------------------------------
     A* PART OF BODY INJURED AND NATURE OF ILLNESS, DIAGONOSED DATE.
     A*---------------------------------------------------------------
     A            PRBPRT        30A  O      POSITION(7.9 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRNADS        30A  O      POSITION(7.9 3.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRNDT3         8  0O      POSITION(7.9 6.6)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('  /  /    ')
     A*---------------------------------------------------------------
     A* TREATING PHYSICIAN, INITIAL TREATMENT, HOSPITAL NAME.....
     A*---------------------------------------------------------------
     A            PRPNAM        35A  O      POSITION(8.2 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A
     A            PRPAD1        35A  O      POSITION(8.3 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRPCSZ        25A  O      POSITION(8.3 2.55)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRPZIP         9  0O      POSITION(8.3 3.64)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('     -    ')

     A            PRHOSN        40A  O      POSITION(8.2 4.80)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRHOSA        25A  O      POSITION(8.3 4.80)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRHOCT        18A  O      POSITION(8.3 6.30)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRHOSS         2A  O      POSITION(8.3 7.40)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A*---------------------------------------------------------------
     A*EMPLOYER NAME, PERSON COMPLETING THIS REPORT.
     A*---------------------------------------------------------------
     A            PRENAM        40A  O      POSITION(8.60 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRPRNM        40A  O      POSITION(8.60 4.75)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A*---------------------------------------------------------------
     A*EMPLOYER ADDRESS 1,ADDRESS 2, PHONE NUMBER.
     A*---------------------------------------------------------------
     A***         PRMAD1        40A  O      POSITION(8.90 0.4)
     A            PRMAD1        40A  O      POSITION(8.93 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A***         PRMAD2        40A  O      POSITION(8.95 0.4)
     A            PRMAD2        40A  O      POSITION(9.02 0.4)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A***         PRMCTY        25A  O      POSITION(8.90 2.45)
     A            PRMCTY        25A  O      POSITION(8.93 2.50)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A***         PRMST          2A  O      POSITION(8.90 3.53)
     A            PRMST          2A  O      POSITION(8.93 3.85)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A***         PRMZIP         9  0O      POSITION(8.90 3.68)
     A            PRMZIP         9  0O      POSITION(8.93 4.00)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('     -    ')
     A
     A            PRAREA         3S 0O      POSITION(9.00 4.75)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRPHN#         7S 0O      POSITION(9.00 5.20)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('0   -    ')

     A*---------------------------------------------------------------
     A*EMPLOYER'S MAILING ADDRESS, NATURE OF BUSINESS
     A*---------------------------------------------------------------
     A            PR40A1        35A  O      POSITION(9.30 0.35)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRNI25        15A  O      POSITION(9.30 2.90)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRNI20         2A  O      POSITION(9.30 3.80)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRN9N2         9  0O      POSITION(9.30 4.00)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTWRD('     -    ')

     A            PRNAOB        40A  O      POSITION(9.30 4.90)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A*
     A*---------------------------------------------------------------
     A*WAGE INFORMATION, AVERAGE WEEKLY WAGE.
     A*---------------------------------------------------------------
     A            PRWGP1         1A  O      POSITION(9.53 2.50)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRWGP2         1A  O      POSITION(9.53 2.90)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRWGP3         1A  O      POSITION(9.54 3.39)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRWGP4         1A  O      POSITION(9.55 3.97)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*

     A            PRCMRT         7S 2O      POSITION(9.60 5.85)
     A*
     A****** BEG CHG 03/22/12 ******************************************
     A*
     A***                                   FNTCHRSET(C0H40060 T1V10037)
     A                                      FNTCHRSET(C0N20080 T1V10037)
     A*
     A****** END CHG 03/22/12 ******************************************
     A*
     A                                      EDTCDE(B)
