     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 22
     A  23 25 26
     A  24                                  CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                  1  2HTML('QPUIREC6    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C5  -
     A                                        SCFYRC7    WCR0517C6    WMESGGC5 -
     A                                         *LIBLC0    E1    3     25RERRMSG-
     A                                      ID  5    C6    SCRPMYC7    WCR0500C-
     A                                      6    WMESGGC5    *LIBLC0    E1    3-
     A                                           26RERRMSGID  5    C5    SCDEVC-
     A                                      7    SCM0627C6    SCMESGC5    *LIBL-
     A                                      C0    E1    3     22RERRMSGID  5   -
     A                                       C5    SCDEVC7    SCM0503C6    SCME-
     A                                      SGC5    *LIBLC0    E1    3     23RE-
     A                                      RRMSGID  5    C6    SCHRDCC7    WCR-
     A                                      0501C6    WMESGGC5    *LIBLC0    E1-
     A                                          3     24')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN22","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN23","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN25","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN26","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"valid command-
     A                                       key":{"fieldName":"*IN11","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"overlay -
     A                                      range":"1-23"},"items":[{"id":"W820-
     A                                      1F_SCR01_avKeys","field type":"outp-
     A                                      ut field","value":{"fieldName":"AV_-
     A                                      KEYS","dataLength":"1134","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[AV_KEYS]"},"left":"0px-
     A                                      ","top":"0px","visibility":"hidden"-
     A                                      },{"id":"W8201F_SCR01_action","fiel-
     A                                      d type":"html container","white spa-
     A                                      ce":"normal","left":"0px","top":"10-
     A                                      px","width":"230px","css class":"ac-
     A                                      tion-panel-converted","height":"700-
     A                                      px","html":"<div class=\"top\"></di-
     A                                      v><div class=\"imagetop\"><img src=-
     A                                      \"/profoundui/userdata/images/bar_t-
     A                                      op.png\" /></div><div class=\"menul-
     A                                      inks\"></div><div class=\"imagebott-
     A                                      om\"><img src=\"/profoundui/userdat-
     A                                      a/images/bar_bottom.png\" /></div><-
     A                                      div class=\"bottom\"></div>"},{"fie-
     A                                      ld type":"icon menu button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"32px","z index-
     A                                      ":"20","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1170px","id":"W8201F_SCR-
     A                                      01_BtnIconMenuSystemTools","tool ti-
     A                                      p":"System Tools","icon alignment":-
     A                                      "middle left","icon width":"16px","-
     A                                      icon height":"24px","icon source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /systools.png","data function":"Sys-
     A                                      temToolbarSystools","show down arro-
     A                                      w":"Yes"},{"field type":"panel","pa-
     A                                      nel style":"TransformButtonBar","id-
     A                                      ":"W8201F_SCR01_ButtonBar","top":"3-
     A                                      5px","left":"1036px","width":"187px-
     A                                      ","height":"28px","css class":"stat-
     A                                      ionary","visibility":"hidden","lock-
     A                                      ed in place":"true"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1040px","id":"W8201F_SCR01_-
     A                                      BtnSave","tool tip":"Save","onclick-
     A                                      ":"SystemToolbarSave","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/save.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1066px","id":"W8201F-
     A                                      _SCR01_BtnRefresh","tool tip":"Refr-
     A                                      esh","onclick":"SystemToolbarRefres-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/refre-
     A                                      sh.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      092px","id":"W8201F_SCR01_BtnSearch-
     A                                      ","tool tip":"Search","onclick":"Sy-
     A                                      stemToolbarSearch","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/search.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1118px","id":"W8201F_-
     A                                      SCR01_BtnDiaryItems","tool tip":"Di-
     A                                      ary/Work Items - IDARTS","onclick":-
     A                                      "SystemToolbarDiary","background im-
     A                                      age":{"fieldName":"DryIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color')
     A                                  1  4HTML('":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"W8201F_SCR01_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"W8201-
     A                                      F_SCR01_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemToolbarHelp","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/help.png'')"}-
     A                                      ,{"id":"W8201F_SCR01_ImgSysToolBott-
     A                                      om","field type":"image","image sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/butbarbot.png","left":"1036p-
     A                                      x","top":"64px","width":"187px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      stationary","visibility":"hidden"},-
     A                                      {"id":"W8201F_SCR01_MainTabPanel","-
     A                                      field type":"tab panel","tab panel -
     A                                      style":"Transform","tab names":{"fi-
     A                                      eldName":"SCPRDS","designValue":"[S-
     A                                      CPRDS]","refField":"NAME","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"a-
     A                                      ctive tab":"0","left":"250px","top"-
     A                                      :"70px","width":"970px","height":"6-
     A                                      57px","z index":"8","locked in plac-
     A                                      e":"true","css class":"tab-panel","-
     A                                      css class 2":"stationary"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W8201F_SCR01_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"SCUSER","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CUSER","designValue":"[SCUSER]","re-
     A                                      fField":"USER","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"281px","curso-
     A                                      r column":"2","top":"110px","cursor-
     A                                       row":"1","css class 2":"top-line",-
     A                                      "parent tab panel":"W8201F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"SCCONM","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCCONM","d-
     A                                      esignValue":"[SCCONM]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"414px","cursor column"-
     A                                      :"21","top":"110px","cursor row":"1-
     A                                      ","css class 2":"top-line","css cla-
     A                                      ss 3":"HI","description":"COMPANY N-
     A                                      AME","parent tab panel":"W8201F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 4":"profound-converted"},-
     A                                      {"id":"constant1","field type":"out-
     A                                      put field","left":"778px","cursor c-
     A                                      olumn":"73","top":"110px","cursor r-
     A                                      ow":"1","css class":"top-line","val-
     A                                      ue":"js: currentDate()","css class -
     A                                      2":"output-field","parent tab panel-
     A                                      ":"W8201F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"W8201F_SCR01_fk-
     A                                      eyMenu","field type":"menu","left":-
     A                                      "10px","top":"120px","height":"350p-
     A                                      x","width":"230px","hover backgroun-
     A                                      d color":"#9AAA61","hover text colo-
     A                                      r":"#FFFFFF","border color":"#4C610-
     A                                      6","menu option indent":"10px","bac-
     A                                      kground color":"#758B27","css class-
     A                                      ":"action-menu","css class 2":"stat-
     A                                      ionary","z index":"101"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"W8201F_SCR01_BtnHidden-
     A                                      Refresh","value":"btnRefresh","top"-
     A                                      :"125px","response":{"fieldName":"b-
     A                                      tnRefresh","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"Q1PGM","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"Q1PGM","designValue":"[Q1PGM]"-
     A                                      ,"refField":"DS10","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"281px","c-
     A                                      ursor column":"2","top":"130px","cu-
     A                                      rsor row":"2","parent tab panel":"W-
     A                                      8201F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCPRDS","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCPRDS","designValue":"[SCPRDS]-
     A                                      ","refField":"NAME","dataT')
     A                                  1  5HTML('ype":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"414px","cursor column":"21",-
     A                                      "top":"130px","cursor row":"2","css-
     A                                       class 2":"HI","description":"PROGR-
     A                                      AM NAME","parent tab panel":"W8201F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","visibility":"hidden","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant2","field type":"output field-
     A                                      ","value":"SCR01","css class":"cons-
     A                                      tant","left":"799px","cursor column-
     A                                      ":"76","top":"130px","cursor row":"-
     A                                      2","parent tab panel":"W8201F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W8201F_SCR01_B-
     A                                      tnHiddenSearch","value":"btnSearch"-
     A                                      ,"top":"150px","response":{"fieldNa-
     A                                      me":"btnSearch","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant3","-
     A                                      field type":"output field","value":-
     A                                      "Group:","css class":"constant","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"170px","cursor row":"4","parent-
     A                                       tab panel":"W8201F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCFND-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCFND","designValu-
     A                                      e":"[SCFND]","refField":"FND","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"999.00"},-
     A                                      "css class":"output-field","left":"-
     A                                      337px","cursor column":"10","top":"-
     A                                      170px","cursor row":"4","width":"21-
     A                                      px","text align":"right","parent ta-
     A                                      b panel":"W8201F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCNAME",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCNAME","designValue-
     A                                      ":"[SCNAME]","refField":"NM60","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"372px","cursor column":"15","top-
     A                                      ":"170px","cursor row":"4","descrip-
     A                                      tion":"FUND NAME","parent tab panel-
     A                                      ":"W8201F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W8201F_SCR01_BtnHiddenDiaryItems",-
     A                                      "value":"btnDiary","top":"175px","r-
     A                                      esponse":{"fieldName":"btnDiary","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"W8201F_SCR01_B-
     A                                      tnHiddenSystemMessages","value":"bt-
     A                                      nMessage","top":"200px","response":-
     A                                      {"fieldName":"btnMessage","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant9","field type":"output field-
     A                                      ","value":"Type choices, press Ente-
     A                                      r.","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"2-
     A                                      10px","cursor row":"6","css class 2-
     A                                      ":"BLU","parent tab panel":"W8201F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"W8201F_SC-
     A                                      R01_BtnHiddenWorkSubmitJob","value"-
     A                                      :"btnWrksbmjob","top":"225px","resp-
     A                                      onse":{"fieldName":"btnWrkJob","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant4","field type":"output -
     A                                      field","value":"Policy year        -
     A                                              :","css class":"constant","-
     A                                      left":"295px","cursor column":"4","-
     A                                      top":"250px","cursor row":"8","pare-
     A                                      nt tab panel":"W8201F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCF-
     A                                      YR","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCFYR","desi-
     A                                      gnValue":"[SCFYR]","refField":"FYR"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"false","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"999-
     A                                      .00","numBlankFill":"true"},"left":-
     A                                      "498px","cursor column":"33","top":-
     A                                      "250px","cursor row":"8","width":"2-
     A                                      2px","text align":"right","css clas-
     A                                      s 3":"UL","css class 4":"HI","error-
     A                                       message id":"WCR0517","error messa-
     A                                      ge file":"WMESGG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"25","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"1-
     A                                       message","description":"FUND CENTU-
     A                                      RY AND YEAR","parent tab panel":"W8-
     A                                      201F_SCR01_MainTabPanel","')
     A                                  1  6HTML('parent tab":"0","css class 5"-
     A                                      :"profound-converted"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"W8201F_SCR01_BtnHiddenWo-
     A                                      rkPrinterOutput","value":"btnWrkprt-
     A                                      out","top":"250px","response":{"fie-
     A                                      ldName":"btnWrkPrnt","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"W8201F_SCR01_BtnHiddenImag-
     A                                      eQueue","value":"btnImgQue","top":"-
     A                                      275px","response":{"fieldName":"btn-
     A                                      ImgQue","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant5","field ty-
     A                                      pe":"output field","value":"Policy -
     A                                      inception month/year:","css class":-
     A                                      "constant","left":"295px","cursor c-
     A                                      olumn":"4","top":"290px","cursor ro-
     A                                      w":"10","parent tab panel":"W8201F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCRPMY","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCRPMY","designValue":"[SCRPMY]",-
     A                                      "refField":"RMY6","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"false","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"-999.00","numBlankFil-
     A                                      l":"true","edtWrd":"''  /    ''"},"-
     A                                      left":"498px","cursor column":"33",-
     A                                      "top":"290px","cursor row":"10","wi-
     A                                      dth":"50px","text align":"right","c-
     A                                      ss class 3":"UL","error message id"-
     A                                      :"WCR0500","error message file":"WM-
     A                                      ESGG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      26","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"1 message","d-
     A                                      escription":"INCEPTION MONTH/YEAR",-
     A                                      "parent tab panel":"W8201F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 4":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"W8201F_SCR01_BtnH-
     A                                      iddenHelp","value":"btnHelp","top":-
     A                                      "300px","response":{"fieldName":"bt-
     A                                      nHelp","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant6","field typ-
     A                                      e":"output field","value":"Report n-
     A                                      umber              :","css class":"-
     A                                      constant","left":"295px","cursor co-
     A                                      lumn":"4","top":"330px","cursor row-
     A                                      ":"12","parent tab panel":"W8201F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCRPT","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCRPT","designValue":"[SCRPT]","ref-
     A                                      Field":"FLAG","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","left":"498px","-
     A                                      cursor column":"33","top":"330px","-
     A                                      cursor row":"12","width":"8px","css-
     A                                       class 3":"UL","parent tab panel":"-
     A                                      W8201F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 4":"profound-co-
     A                                      nverted"},{"id":"constant7","field -
     A                                      type":"output field","value":"Tape -
     A                                      device                :","css class-
     A                                      ":"constant","left":"295px","cursor-
     A                                       column":"4","top":"370px","cursor -
     A                                      row":"14","parent tab panel":"W8201-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCDEV","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCDEV","designValue":"[SCDEV]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se","dataLength":"10"},"text transf-
     A                                      orm":"uppercase","left":"498px","cu-
     A                                      rsor column":"33","top":"370px","cu-
     A                                      rsor row":"14","width":"71px","css -
     A                                      class 3":"UL","css class 4":"HI","e-
     A                                      rror message id":"SCM0627","error m-
     A                                      essage file":"SCMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"22","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"SCM0503","error message file 2":"-
     A                                      SCMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"23","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"description":"TAPE DEVIC-
     A                                      E","parent tab panel":"W8201F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 5":"profound-converted"},{"-
     A                                      id":"constant8","field type":"outpu-
     A                                      t field","value":"Print hard copy  -
     A                                                :","css class":"constant"-
     A                                      ,"left":"295px","cursor column":"4"-
     A                                      ,"top":"410px","cursor row":"16","p-
     A                                      arent tab panel":"W8201F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCHRDC","field type":"chec')
     A                                  1  7HTML('kbox","css class":"input","cs-
     A                                      s class 2":"checkbox","value":{"fie-
     A                                      ldName":"SCHRDC","designValue":"[SC-
     A                                      HRDC]","refField":"FLAG","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"498px","top":"410px","width":"8p-
     A                                      x","css class 3":"UL","css class 4"-
     A                                      :"HI","error message id":"WCR0501",-
     A                                      "error message file":"WMESGG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"24","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"1 message","description"-
     A                                      :"HARD COPY","parent tab panel":"W8-
     A                                      201F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 5":"profound-conv-
     A                                      erted","checked value":"Y","uncheck-
     A                                      ed value":"N"},{"id":"btnSubmit","f-
     A                                      ield type":"button","value":"Enter"-
     A                                      ,"shortcut key":"Enter","left":"14p-
     A                                      x","top":"150px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnCF03","field type"-
     A                                      :"button","value":"Exit","shortcut -
     A                                      key":"F3","left":"14px","top":"183p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF13","field type":"button","val-
     A                                      ue":"Chg user parms","shortcut key"-
     A                                      :"F13","left":"14px","top":"216px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      HELP","field type":"button","shortc-
     A                                      ut key":"Alt-F1","bypass validation-
     A                                      ":"true","value":"HELP","response":-
     A                                      {"fieldName":"*IN10","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"left":"14px","-
     A                                      top":"249px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCDEV         10A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCHRDC    R        H      REFFLD(FLAG)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCRPMY    R        H      REFFLD(RMY6)
     A            SCRPT     R        H      REFFLD(FLAG)
     A            SCUSER    R        H      REFFLD(USER)
