     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20
     A  21 22 23
     A  24 25 26                            CA01(10 'Response Indicator *IN10')
     A  27 28 30
     A  32 41 42
     A  43 44 45                            CA02(11 'Response Indicator *IN11')
     A  47 90                               CA03(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(41 'Response Indicator *IN41')
     A                                      SETOF(42 'Response Indicator *IN42')
     A                                      SETOF(43 'Response Indicator *IN43')
     A                                      SETOF(44 'Response Indicator *IN44')
     A                                      SETOF(45 'Response Indicator *IN45')
     A                                      SETOF(47 'Response Indicator *IN47')
     A                                      SETOF(90 'Response Indicator *IN90')
     A                                  1  2HTML('QPUIREC17   RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCFYR1C7    WCR0517C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     20RERRMS-
     A                                      GID  5    C6    SCFYR1C7    WCR0694-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     21RERRMSGID  5    C6    SCFYR-
     A                                      1C7    WCR1057C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     26RERRMSGID  5 -
     A                                         C6    SCFYR1C7    MC40004C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     9-
     A                                      0RERRMSGID  5    C6    SCFYR1C7    -
     A                                      W300080C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     32RERRMSGID  5    C6  -
     A                                        SCFYR2C7    WCR0517C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     22RERRMS-
     A                                      GID  5    C6    SCFYR2C7    WCR0694-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     23RERRMSGID  5    C6    SCFYR-
     A                                      2C7    WCR1057C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     26RERRMSGID  5 -
     A                                         C6    SCFYR2C7    W300080C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     3-
     A                                      2RERRMSGID  5    C6    SCFYR3C7    -
     A                                      WCR0517C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     24RERRMSGID  5    C6  -
     A                                        SCFYR3C7    WCR0694C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     25RERRMS-
     A                                      GID  5    C6    SCFYR3C7    WCR1057-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      3     26RERRMSGID  5    C6    SCFYR-
     A                                      3C7    W300080C6    WMESGGC5    *LI-
     A                                      BLC0    E1    3     32RERRMSGID  5 -
     A                                         C6    SCEMP#C7    WCR0538C6    W-
     A                                      MESGGC5    *LIBLC0    E1    3     2-
     A                                      7RERRMSGID  5    C6    SCEFDTC7    -
     A                                      WCR0500C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     28RERRMSGID  5    C6  -
     A                                        SCAMT1C7    WCR0502C6    WMESGGC5-
     A                                          *LIBLC0    E1    3     30')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN26","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN28","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N30","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN3-
     A                                      2","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN41"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN42","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN43","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN44","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 16":{"fieldName":"*IN45","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       17":{"fieldName":"*IN47","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 1-
     A                                      8":{"fieldName":"*IN90","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"return curs-
     A                                      or record":{"fieldName":"HREC","dat-
     A                                      aLength":"10","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"none"},"return cursor field-
     A                                      ":{"fieldName":"HFLD","dataLength":-
     A                                      "10","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"n-
     A                                      one"},"valid command key":{"fieldNa-
     A                                      me":"*IN11","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"overlay range":"1-23"},-
     A                                      "items":[{"id":"HFLD","field type":-
     A                                      "output field","visibility":"hidden-
     A                                      ","value":{"fieldName":"HFLD","desi-
     A                                      gnValue":"[HFLD]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"left":"0px","top":"-30px","css c-
     A                                      lass":"profound-converted"},{"id":"-
     A                                      HREC","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"HREC","designValue":"[HREC]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"10"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"W8400F0_SCR01_av-
     A                                      Keys","field type":"output field","-
     A                                      value":{"fieldName":"AV_KEYS","data-
     A                                      Length":"1134","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none","designValue":-
     A                                      "[AV_KEYS]"},"left":"0px","top":"0p-
     A                                      x","visibility":"hidden"},{"id":"W8-
     A                                      400F0_SCR01_action","field type":"h-
     A                                      tml container","white space":"norma-
     A                                      l","left":"0px","top":"10px","width-
     A                                      ":"230px","css class":"action-panel-
     A                                      -converted","height":"700px","html"-
     A                                      :"<div class=\"top\"></div><div cla-
     A                                      ss=\"imagetop\"><img src=\"/profoun-
     A                                      dui/userdata/images/bar_top.png\" /-
     A                                      ></div><div class=\"menulinks\"></d-
     A                                      iv><div class=\"imagebottom\"><img -
     A                                      src=\"/profoundui/userdata/images/b-
     A                                      ar_bottom.png\" /></div><div class=-
     A                                      \"bottom\"></div>"},{"field type":"-
     A                                      icon menu button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"32px","z index":"20","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1170px","id":"W8400F0_SCR01_BtnIco-
     A                                      nMenuSystemTools","tool tip":"Syste-
     A                                      m Tools","icon alignment":"middle l-
     A                                      eft","icon width":"16px","icon heig-
     A                                      ht":"24px","icon source":"/profound-
     A                                      ui/userdata/images/systool/systools-
     A                                      .png","data function":"SystemToolba-
     A                                      rSystools","show down arrow":"Yes"}-
     A                                      ,{"field type":"panel","panel style-
     A                                      ":"TransformButtonBar","id":"W8400F-
     A                                      0_SCR01_ButtonBar","top":"35px","le-
     A                                      ft":"1036px","width":"187p')
     A                                  1  4HTML('x","height":"28px","css class-
     A                                      ":"stationary","visibility":"hidden-
     A                                      ","locked in place":"true"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1040px","id":"W8400F-
     A                                      0_SCR01_BtnSave","tool tip":"Save",-
     A                                      "onclick":"SystemToolbarSave","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/save.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1066px","id"-
     A                                      :"W8400F0_SCR01_BtnRefresh","tool t-
     A                                      ip":"Refresh","onclick":"SystemTool-
     A                                      barRefresh","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/refresh.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1092px","id":"W8400F0_SCR01-
     A                                      _BtnSearch","tool tip":"Search","on-
     A                                      click":"SystemToolbarSearch","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/search.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1118px","id-
     A                                      ":"W8400F0_SCR01_BtnDiaryItems","to-
     A                                      ol tip":"Diary/Work Items - IDARTS"-
     A                                      ,"onclick":"SystemToolbarDiary","ba-
     A                                      ckground image":{"fieldName":"DryIc-
     A                                      nURL","dataLength":"128","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"}},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1144px","id":"W-
     A                                      8400F0_SCR01_BtnSystemMessages","to-
     A                                      ol tip":"System Messages","onclick"-
     A                                      :"SystemToolbarMessages","backgroun-
     A                                      d image":{"fieldName":"MsgIcnURL","-
     A                                      dataLength":"128","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"}},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1196px","id":"W8400F0_-
     A                                      SCR01_BtnHelp","tool tip":"Help","o-
     A                                      nclick":"SystemToolbarHelp","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/help.png'')"},{-
     A                                      "id":"W8400F0_SCR01_ImgSysToolBotto-
     A                                      m","field type":"image","image sour-
     A                                      ce":"/profoundui/userdata/images/sy-
     A                                      stool/butbarbot.png","left":"1036px-
     A                                      ","top":"64px","width":"187px","loc-
     A                                      ked in place":"true","css class":"s-
     A                                      tationary","visibility":"hidden"},{-
     A                                      "id":"W8400F0_SCR01_MainTabPanel","-
     A                                      field type":"tab panel","tab panel -
     A                                      style":"Transform","tab names":{"fi-
     A                                      eldName":"SCPRDS","designValue":"[S-
     A                                      CPRDS]","refField":"NAME","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"a-
     A                                      ctive tab":"0","left":"250px","top"-
     A                                      :"70px","width":"970px","height":"6-
     A                                      57px","z index":"8","locked in plac-
     A                                      e":"true","css class":"tab-panel","-
     A                                      css class 2":"stationary"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"W8400F0_SCR01_BtnHid-
     A                                      denSave","value":"btnSave","top":"1-
     A                                      00px","response":{"fieldName":"btnS-
     A                                      ave","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"constant1","field type"-
     A                                      :"output field","left":"28')
     A                                  1  5HTML('1px","cursor column":"2","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss":"top-line","value":"js: current-
     A                                      User()","css class 2":"output-field-
     A                                      ","parent tab panel":"W8400F0_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"SCCONM","field type":"output f-
     A                                      ield","value":{"fieldName":"SCCONM"-
     A                                      ,"designValue":"[SCCONM]","refField-
     A                                      ":"NAME","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"414px","cursor colu-
     A                                      mn":"21","top":"110px","cursor row"-
     A                                      :"1","css class 2":"top-line","css -
     A                                      class 3":"HI","description":"COMPAN-
     A                                      Y NAME","parent tab panel":"W8400F0-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 4":"profound-converte-
     A                                      d"},{"id":"constant2","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"W8400F0_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"W8400F0_SC-
     A                                      R01_fkeyMenu","field type":"menu","-
     A                                      left":"10px","top":"120px","height"-
     A                                      :"350px","width":"230px","hover bac-
     A                                      kground color":"#9AAA61","hover tex-
     A                                      t color":"#FFFFFF","border color":"-
     A                                      #4C6106","menu option indent":"10px-
     A                                      ","background color":"#758B27","css-
     A                                       class":"action-menu","css class 2"-
     A                                      :"stationary","z index":"101"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"W8400F0_SCR01_Bt-
     A                                      nHiddenRefresh","value":"btnRefresh-
     A                                      ","top":"125px","response":{"fieldN-
     A                                      ame":"btnRefresh","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"Q1PGM","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"Q1PGM","designValue":"[-
     A                                      Q1PGM]","refField":"DS10","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"28-
     A                                      1px","cursor column":"2","top":"130-
     A                                      px","cursor row":"2","parent tab pa-
     A                                      nel":"W8400F0_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCPRDS","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCPRDS","designValue":"-
     A                                      [SCPRDS]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      414px","cursor column":"21","top":"-
     A                                      130px","cursor row":"2","css class -
     A                                      2":"HI","description":"PROGRAM NAME-
     A                                      ","parent tab panel":"W8400F0_SCR01-
     A                                      _MainTabPanel","parent tab":"0","vi-
     A                                      sibility":"hidden","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      3","field type":"output field","val-
     A                                      ue":"SCR01","css class":"constant",-
     A                                      "left":"799px","cursor column":"76"-
     A                                      ,"top":"130px","cursor row":"2","pa-
     A                                      rent tab panel":"W8400F0_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"W8400F0_SCR01_BtnHi-
     A                                      ddenSearch","value":"btnSearch","to-
     A                                      p":"150px","response":{"fieldName":-
     A                                      "btnSearch","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant4","fiel-
     A                                      d type":"output field","value":"Gro-
     A                                      up:","css class":"constant","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      170px","cursor row":"4","parent tab-
     A                                       panel":"W8400F0_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCFND","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCFND","designValue":-
     A                                      "[SCFND]","refField":"FND","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00"},"cs-
     A                                      s class":"output-field","left":"337-
     A                                      px","cursor column":"10","top":"170-
     A                                      px","cursor row":"4","width":"21px"-
     A                                      ,"text align":"right","parent tab p-
     A                                      anel":"W8400F0_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCNAME","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCNAME","designValue":-
     A                                      "[SCNAME]","refField":"NM60","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "372px","cursor column":"15","top":-
     A                                      "170px","cursor row":"4","descripti-
     A                                      on":"FUND NAME","parent tab panel":-
     A                                      "W8400F0_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cu')
     A                                  1  6HTML('rsor":"default","visibility":-
     A                                      "hidden","id":"W8400F0_SCR01_BtnHid-
     A                                      denDiaryItems","value":"btnDiary","-
     A                                      top":"175px","response":{"fieldName-
     A                                      ":"btnDiary","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "W8400F0_SCR01_BtnHiddenSystemMessa-
     A                                      ges","value":"btnMessage","top":"20-
     A                                      0px","response":{"fieldName":"btnMe-
     A                                      ssage","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant9","field typ-
     A                                      e":"output field","value":"Type cho-
     A                                      ices, press Enter.","css class":"co-
     A                                      nstant","left":"281px","cursor colu-
     A                                      mn":"2","top":"210px","cursor row":-
     A                                      "6","css class 2":"BLU","parent tab-
     A                                       panel":"W8400F0_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"W8400F0_SCR01_BtnHiddenWork-
     A                                      SubmitJob","value":"btnWrksbmjob","-
     A                                      top":"225px","response":{"fieldName-
     A                                      ":"btnWrkJob","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant5","fi-
     A                                      eld type":"output field","value":"P-
     A                                      olicy years                        -
     A                                                      :","css class":"con-
     A                                      stant","left":"295px","cursor colum-
     A                                      n":"4","top":"250px","cursor row":"-
     A                                      8","parent tab panel":"W8400F0_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCFYR1","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      FYR1","designValue":"[SCFYR1]","ref-
     A                                      Field":"BSCO","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase","blankFill"-
     A                                      :"true"},"text transform":"uppercas-
     A                                      e","left":"673px","cursor column":"-
     A                                      58","top":"250px","cursor row":"8",-
     A                                      "width":"22px","text align":"right"-
     A                                      ,"set focus":{"fieldName":"41","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 3":"HI","error messag-
     A                                      e id":"WCR0517","error message file-
     A                                      ":"WMESGG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"20","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"5 messag-
     A                                      es","error message id 2":"WCR0694",-
     A                                      "error message file 2":"WMESGG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"21","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 3":"WCR1057","erro-
     A                                      r message file 3":"WMESGG","error m-
     A                                      essage library 3":"*LIBL","error co-
     A                                      ndition 3":{"fieldName":"26","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       message id 4":"MC40004","error mes-
     A                                      sage file 4":"FSMESG","error messag-
     A                                      e library 4":"*LIBL","error conditi-
     A                                      on 4":{"fieldName":"90","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      age id 5":"W300080","error message -
     A                                      file 5":"WMESGG","error message lib-
     A                                      rary 5":"*LIBL","error condition 5"-
     A                                      :{"fieldName":"32","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"description":"F-
     A                                      und Year #1","parent tab panel":"W8-
     A                                      400F0_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 4":"profound-con-
     A                                      verted"},{"id":"SCFYR2","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCFYR2","designValue":"[SCF-
     A                                      YR2]","refField":"BSCO","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase","-
     A                                      blankFill":"true"},"text transform"-
     A                                      :"uppercase","left":"708px","cursor-
     A                                       column":"63","top":"250px","cursor-
     A                                       row":"8","width":"22px","text alig-
     A                                      n":"right","set focus":{"fieldName"-
     A                                      :"42","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"error message id":"WC-
     A                                      R0517","error message file":"WMESGG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"22",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"4 messages","erro-
     A                                      r message id 2":"WCR0694","error me-
     A                                      ssage file 2":"WMESGG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"23","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sage id 3":"WCR1057","error message-
     A                                       file 3":"WMESGG","error message li-
     A                                      brary 3":"*LIBL","error condition 3-
     A                                      ":{"fieldName":"26","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      id 4":"W300080","error message file-
     A                                       4":"WMESGG","error message library-
     A                                       4":"*LIBL","error conditi')
     A                                  1  7HTML('on 4":{"fieldName":"32","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"desc-
     A                                      ription":"Fund Year #2","parent tab-
     A                                       panel":"W8400F0_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"SCFYR3",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCFYR3","designV-
     A                                      alue":"[SCFYR3]","refField":"BSCO",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase","blankFill":"true"},"text-
     A                                       transform":"uppercase","left":"743-
     A                                      px","cursor column":"68","top":"250-
     A                                      px","cursor row":"8","width":"22px"-
     A                                      ,"text align":"right","set focus":{-
     A                                      "fieldName":"43","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"error mess-
     A                                      age id":"WCR0517","error message fi-
     A                                      le":"WMESGG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"24","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"4 mess-
     A                                      ages","error message id 2":"WCR0694-
     A                                      ","error message file 2":"WMESGG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"25"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error message id 3":"WCR1057","er-
     A                                      ror message file 3":"WMESGG","error-
     A                                       message library 3":"*LIBL","error -
     A                                      condition 3":{"fieldName":"26","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or message id 4":"W300080","error m-
     A                                      essage file 4":"WMESGG","error mess-
     A                                      age library 4":"*LIBL","error condi-
     A                                      tion 4":{"fieldName":"32","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"descript-
     A                                      ion":"Fund Year #3","parent tab pan-
     A                                      el":"W8400F0_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"W8400F0_SCR01_BtnHiddenWorkPrin-
     A                                      terOutput","value":"btnWrkprtout","-
     A                                      top":"250px","response":{"fieldName-
     A                                      ":"btnWrkPrnt","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"W8400F0_SCR01_BtnHiddenImageQueu-
     A                                      e","value":"btnImgQue","top":"275px-
     A                                      ","response":{"fieldName":"btnImgQu-
     A                                      e","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"constant6","field type":"-
     A                                      output field","value":"Employer num-
     A                                      ber (blank for all)                -
     A                                           :","css class":"constant","lef-
     A                                      t":"295px","cursor column":"4","top-
     A                                      ":"290px","cursor row":"10","parent-
     A                                       tab panel":"W8400F0_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCEM-
     A                                      P#","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCEMP#","des-
     A                                      ignValue":"[SCEMP#]","refField":"EM-
     A                                      P#","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00","numBlankFill":"true"},"lef-
     A                                      t":"673px","cursor column":"58","to-
     A                                      p":"290px","cursor row":"10","width-
     A                                      ":"64px","text align":"right","set -
     A                                      focus":{"fieldName":"44","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"WCR0538","error me-
     A                                      ssage file":"WMESGG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"27","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"1 message","description":"Employe-
     A                                      r Number","parent tab panel":"W8400-
     A                                      F0_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"W8400F-
     A                                      0_SCR01_BtnHiddenHelp","value":"btn-
     A                                      Help","top":"300px","response":{"fi-
     A                                      eldName":"btnHelp","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant7-
     A                                      ","field type":"output field","valu-
     A                                      e":"Rating effective date          -
     A                                                           :","css class"-
     A                                      :"constant","left":"295px","cursor -
     A                                      column":"4","top":"330px","cursor r-
     A                                      ow":"12","parent tab panel":"W8400F-
     A                                      0_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCEFDT","field type":"d-
     A                                      ate field","css class":"input","css-
     A                                       class 2":"date-field","value":{"fi-
     A                                      eldName":"SCEFDT","designValue":"[S-
     A                                      CEFDT]","refField":"DT8","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","cu')
     A                                  1  8HTML('rSym":"","units":"","negNum":-
     A                                      "-999.00","numBlankFill":"true","ed-
     A                                      tWrd":"''  /  /    ''","dateFormat"-
     A                                      :"m/d/Y"},"left":"673px","cursor co-
     A                                      lumn":"58","top":"330px","cursor ro-
     A                                      w":"12","width":"71px","text align"-
     A                                      :"right","set focus":{"fieldName":"-
     A                                      45","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 3":"HI","erro-
     A                                      r message id":"WCR0500","error mess-
     A                                      age file":"WMESGG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"28","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      1 message","description":"Effective-
     A                                       Date","parent tab panel":"W8400F0_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant10","field type":-
     A                                      "output field","value":"Enter follo-
     A                                      wing amounts in whole dollars.","cs-
     A                                      s class":"constant","left":"281px",-
     A                                      "cursor column":"2","top":"410px","-
     A                                      cursor row":"16","css class 2":"BLU-
     A                                      ","parent tab panel":"W8400F0_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"constant8","field type":"outpu-
     A                                      t field","value":"Group claims with-
     A                                       total incurred on Med and Comp <= -
     A                                      :","css class":"constant","left":"2-
     A                                      95px","cursor column":"4","top":"45-
     A                                      0px","cursor row":"18","parent tab -
     A                                      panel":"W8400F0_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCAMT1","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCAMT1","designVa-
     A                                      lue":"[SCAMT1]","refField":"A90","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"false","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"999.00-
     A                                      "},"left":"673px","cursor column":"-
     A                                      58","top":"450px","cursor row":"18"-
     A                                      ,"width":"64px","set focus":{"field-
     A                                      Name":"47","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 3":"HI-
     A                                      ","error message id":"WCR0502","err-
     A                                      or message file":"WMESGG","error me-
     A                                      ssage library":"*LIBL","error condi-
     A                                      tion":{"fieldName":"30","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      ages":"1 message","description":"Gr-
     A                                      oup Claims with Total Incurred on M-
     A                                      ed and Comp","parent tab panel":"W8-
     A                                      400F0_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 4":"profound-con-
     A                                      verted"},{"id":"btnSubmit","field t-
     A                                      ype":"button","value":"Enter","shor-
     A                                      tcut key":"Enter","left":"14px","to-
     A                                      p":"150px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF03","field type":"butt-
     A                                      on","value":"Exit","shortcut key":"-
     A                                      F3","left":"14px","top":"183px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF1-
     A                                      0","field type":"button","value":"S-
     A                                      earch","shortcut key":"F10","left":-
     A                                      "14px","top":"216px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF13","field t-
     A                                      ype":"button","value":"Chg user par-
     A                                      ms","shortcut key":"F13","left":"14-
     A                                      px","top":"249px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnHELP","field type-
     A                                      ":"button","shortcut key":"Alt-F1",-
     A                                      "bypass validation":"true","value":-
     A                                      "HELP","response":{"fieldName":"*IN-
     A                                      10","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"left":"14px","top":"282px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCAMT1    R        H      REFFLD(A90)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCEFDT    R        H      REFFLD(DT8)
     A            SCEMP#    R        H      REFFLD(EMP#)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFYR1    R        H      REFFLD(BSCO)
     A            SCFYR2    R        H      REFFLD(BSCO)
     A            SCFYR3    R        H      REFFLD(BSCO)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCPRDS    R        H      REFFLD(NAME)
