     A*%%TS  SD  20010108  082435  ANDERSON    REL-V4R4M0  5769-PW1
     A*  (C) Copyright Progressive Data Solutions, Inc., 2000
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/WREFP)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03(03 'Exit')
     A          R SCR01
     A*%%TS  SD  20010108  082435  ANDERSON    REL-V4R4M0  5769-PW1
     A                                      PUTOVR
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A                                      SETOF(23)
     A                                      SETOF(24)
     A                                      SETOF(25)
     A            Q1USER    R        O  1  2REFFLD(USER)
     A                                  1 26'CICenter Historical Data Export'
     A                                      DSPATR(HI)
     A                                  1 73DATE
     A                                      EDTWRD('  /  /  ')
     A                                  2  2'W8905C'
     A                                  2 76'SCR01'
     A                                  4  2'Type choices, press Enter.'
     A                                      COLOR(BLU)
     A                                  6  4'Prior monthend library . . . . :'
     A            SCMLIB        10A  B  6 37TEXT('Prior Monthend Library')
     A  21                                  ERRMSG('Library required.')
     A  22                                  ERRMSG('Library not found.')
     A                                      DSPATR(HI)
     A                                  8  4'Month-end date . . . . . . . . :'
     A            SCEFDT    R        B  8 37REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      TEXT('Effective Date')
     A                                      CHECK(RB)
     A  20                                  DSPATR(PC)
     A  20                                  DSPATR(RI)
     A N20                                  DSPATR(HI)
     A  23                                  ERRMSG('Changed to month-end date.')
     A  24                                  ERRMSGID(WCR0500 *LIBL/WMESGG)
     A                                      OVRDTA
     A                                 23  2'F3=Exit'
     A                                      COLOR(BLU)
