      * (c) 2021 Sapiens. All Rights Reserved.                             *
     A*****************************************************************
     A*  CREATED  01/17/14 C:282 PROJECT: 133MOH                      *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A* 03/23/21 C:180 Project 133WSE                                 *
     A*                Add service dates and invoice number.          *
     A*****************************************************************
     A                                      REF(FSREFP)
     A          R PB101                     TEXT('Fee Payment File')
      *
     A            B1CASE    R     S         REFFLD(CASE)
     A                                      COLHDG('Case')
     A            B1NAME    R               REFFLD(DS30)
     A                                      COLHDG('Full Name')
     A            B1NTWK    R               REFFLD(DS5)
     A                                      COLHDG('Network')
     A            B1#BIL    R     S         REFFLD(A90)
     A                                      COLHDG('Number of Bill')
     A            B1COST    R     S         REFFLD(A92)
     A                                      COLHDG('Cost of Nurses')
     A            B1FYR     R     S         REFFLD(FYR)
     A                                      COLHDG('Policy Year')
     A            B1CLM#    R               REFFLD(DS13)
     A                                      COLHDG('Claim Number')
     A            B1SS#     R               REFFLD(DS9)
     A                                      COLHDG('Social Security ' +
     A                                      'Number')
     A            B1DOI     R     S         REFFLD(DT7)
     A                                      COLHDG('Date of Injury')
     A            B1LSN     R               REFFLD(DS15)
     A                                      COLHDG('Last Name')
     A            B1FSN     R               REFFLD(DS15)
     A                                      COLHDG('First Name')
     A            B1CHRG    R     S         REFFLD(A92)
     A                                      COLHDG('Charged')
     A            B1PRFL    R               REFFLD(FLAG)
     A                                      COLHDG('Process Flag')
     A            B1PRDT    R     S         REFFLD(DT7)
     A                                      COLHDG('Process Date')
     A            B1USER    R               REFFLD(USER)
     A                                      COLHDG('Maint User')
     A            B1TIME    R     S         REFFLD(TIME)
     A                                      COLHDG('Maint Time')
     A            B1PGM     R               REFFLD(PGM)
     A                                      COLHDG('Maint Program')
      *** Begin add *** 03/23/21 *********************************
     A            B1FRDT    R     S         REFFLD(DT7)
     A                                      COLHDG('From Svc Date')
     A            B1TODT    R     S         REFFLD(DT7)
     A                                      COLHDG('To Svc Date')
     A            B1INV#    R               REFFLD(DS30)
     A                                      COLHDG('Invoice Number')
      *** End   add *** 03/23/21 *********************************
