     A** (C) COPYRIGHT INSURANCE ADMINISTRATIVE SYSTEMS, INC. 1987
     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1996.
     A**
     A**  WORKERS' COMPENSATION BILLING WORK FILE
     A*
     A          R PBL01                     PFILE(WABLP)
     A          K BLCO#
     A          K BLFND
     A          K BLFYR
     A          K BLEMP#
     A          K BLDIV
