     A*  (C) Copyright Progressive Data Solutions, Inc., 2004
     A*
     A*  Claims Eligibility File
     A*****************************************************************
     A*  Created on 04/21/2004 by C:62 for Project:51MFN
     A*****************************************************************
     A*  Purpose: This file is extracted from WCMS claims selecting
     A*           open claims.
     A*           It will be used to determine whether a Claimant's
     A*           monthly prescriptions are for their Injury, or other
     A*           medical issues outside of the On the Job Injury
     A*           and/or WC Coverage.
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*  08/07/07 C:193 Project: MC300                                *
     A*                 Claims Update/Eligibility File                *
     A*                                                               *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PCE01                     TEXT('Claimant Eligibility File')
     A            CECLM#        15A         COLHDG('Claim Number')
     A            CEDIAG         6A         COLHDG('Diagnosis code')
     A            CECLDT         8S 0       COLHDG('Close Date of Claim')
     A            CEACDT         8S 0       COLHDG('Accident Date')
     A            CELSN         30A         COLHDG('Claimant Last Name')
     A            CEFSN         15A         COLHDG('Claimant First Name')
     A            CESS#          9S 0       COLHDG('Claimant SS#')
     A            CELTFL         1A         COLHDG('Lost Time')
     A*** BEG ADD *** 08/07/07 **************************************
     A            CEADD         35A         COLHDG('Claimant Address')
     A            CECTY         30A         COLHDG('Claimant City')
     A            CEST           2A         COLHDG('Claimant State')
     A            CEZIP          9S 0       COLHDG('Claimant Zip')
     A            CEPHN         10S 0       COLHDG('Claimant Phone')
     A            CEDOB          8S 0       COLHDG('Claimant' 'Date of Birth')
     A            CESEX          1A         COLHDG('Claimant Sex')
     A            CEINJ         35A         COLHDG('Claimant' 'Injury +
     A                                      Description')
     A            CESTS          1A         COLHDG('Claim Status')
     A            CEETDT         8S 0       COLHDG('Claim Entry Date')
     A            CEPDEA         9S 0       COLHDG('Treating Dr DEA#')
     A            CERDE1         9S 0       COLHDG('Restricted Dr #1 DEA')
     A            CERDE2         9S 0       COLHDG('Restricted Dr #2 DEA')
     A            CERDE3         9S 0       COLHDG('Restricted Dr #3 DEA')
     A            CEEMPN        35A         COLHDG('Employer Name')
     A            CEADDR        35A         COLHDG('Employer Address')
     A            CEECTY        20A         COLHDG('Employer City')
     A            CEEST          2A         COLHDG('Employer State')
     A            CEEZIP         9S 0       COLHDG('Employer Zip')
     A            CEADJ         35A         COLHDG('Adjuster Name')
     A            CEAPHN        10S 0       COLHDG('Adjuster Phone#')
     A            CEAFAX        10S 0       COLHDG('Adjuster Fax#')
     A            CEAEML        35A         COLHDG('Adjuster Email')
     A            CEAEXT         4S 0       COLHDG('Adjuster Phone Ext')
     A            CECMGR        35A         COLHDG('Case Manager Name')
     A            CECPHN        10S 0       COLHDG('Case Manager Phone')
     A            CECFAX        10S 0       COLHDG('Case Manager Fax#')
     A            CECEML        35A         COLHDG('Case Manager Email')
     A            CECEXT         4S 0       COLHDG('Case Manager Ext')
     A            CESUB#         5A         COLHDG('Subscriber')
     A*** END ADD *** 08/07/07 **************************************
