     A*  (C) Copyright Progressive Data Systems, Inc., 1997
     A*
     A** WORKERS' COMPENSATION CLAIM DELETION FILE
     A*
     A          R PCM01                     PFILE(WACMP)
     A          K CMCO#
     A          K CMFND
     A          K CMEMP#
     A          K CMDIV
     A          K CMFYR
     A          K CMCASE
