     A*  (C) Copyright Progressive Data Systems, Inc., 2000
     A*
     A** WORKERS' COMPENSATION CLAIM TRANSFER FILE
     A*
     A          R PCT01                     PFILE(WACTP)
     A          K CTCO#
     A          K CTTRDT                    DESCEND
     A          K CTFND
     A          K CTXFYR
     A          K CTXCAS
