     A*  (C) Copyright Progressive Data Systems, Inc., 1995
     A*
     A** WORKERS' COMPENSATION CLAIM TRANSFER FILE
     A*
     A          R PCT01                     PFILE(WACTP)
     A          K CTCO#
     A          K CTFND
     A          K CTXEMP
     A          K CTXDIV
     A          K CTXFYR
     A          K CTXCAS
