      * (c) 2011 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*
     A* Gallagher-Basset 3rd Party Recovery File
     A*
     A*****************************************************************
     A* Created on 09/12/2016 by c:62 for Project 114WYV
     A*****************************************************************
     A* Revisions
     A*
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PGB301                    TEXT('Gallagher-Basset 3rd File')
     A            GB3CLM#       16A         COLHDG('Claim #')
     A            GB3TSEQ#       4S 0       COLHDG('Transaction Seq#')
     A            GB3TRDT        8S 0       COLHDG('Transaction Date')
     A            GB3REC#        6A         COLHDG('Recipient #')
     A            GB3RECTYP      2A         COLHDG('Record Type')
     A            GB3RSV1        2A         COLHDG('Reserved for Future' +
     A                                      'Use 1')
     A            GB3RECINFO    30A         COLHDG('Recipient Info')
     A            GB3CLMXRF     30A         COLHDG('Claim X-Reference #')
     A            GB3POL#       18A         COLHDG('Policy #')
     A            GB3POLEFDT     8S 0       COLHDG('Policy Effective' +
     A                                      'Date')
     A            GB3POLEFTM     4S 0       COLHDG('Policy Effective' +
     A                                      'Time')
     A            GB3POLEXDT     8S 0       COLHDG('Policy Expiration' +
     A                                      'Date')
     A            GB3POLEXTM     4S 0       COLHDG('Policy Expiration' +
     A                                      'Time')
     A            GB3RECOPT     10A         COLHDG('Recipient Optional' +
     A                                      'Information')
     A            GB3RECAMT1    19A         COLHDG('Recovery Amount 1')
     A            GB3RECAMT2    19A         COLHDG('Recovery Amount 2')
     A            GB3RECAMT3    19A         COLHDG('Recovery Amount 3')
     A            GB3RECAMT4    19A         COLHDG('Recovery Amount 4')
     A            GB3RECAMT5    19A         COLHDG('Recovery Amount 5')
     A            GB3RECAMT6    19A         COLHDG('Recovery Amount 6')
     A            GB3RECOTYP     1A         COLHDG('Recovery Type')
     A            GB3RECDT       8S 0       COLHDG('Recovery Date')
     A            GB3RECMSG     66A         COLHDG('Recovery Message')
     A            GB3RECCOST    19A         COLHDG('Recovery cost')
     A            GB3CLTCOD1    10A         COLHDG('Client Optional' +
     A                                      'Recovery Code 1')
     A            GB3CLTCOD2    10A         COLHDG('Client Optional' +
     A                                      'Recovery Code 2')
     A            GB3CLTCOD3    10A         COLHDG('Client Optional' +
     A                                      'Recovery Code 3')
     A            GB3CLTCOD4    10A         COLHDG('Client Optional' +
     A                                      'Recovery Code 4')
     A            GB3RSV2        4A         COLHDG('Reserved for Future' +
     A                                      'Use 2')
     A            GB3SUBFLG      1A         COLHDG('Subrogation Type')
     A            GB3INTUSE1     2A         COLHDG('GB Internal Use 1')
     A            GB3PLNSEQ#     2A         COLHDG('Plan Sequence #')
     A            GB3PLNCLT#     5A         COLHDG('Plan Client #')
     A            GB3LOSTDYS     4S 0       COLHDG('Lost Work Days')
     A            GB3FILLER   2265A         COLHDG('Filler')
     A            GB3POLDS      30A         COLHDG('Policy Number - 30')
     A            GB3RSV3      241A         COLHDG('Reserved for Future' +
     A                                      'Use 3')
     A            GB3INTUSE2     1A         COLHDG('GB Internal Use 2')
     A            GB3INTUSE3    16A         COLHDG('GB Internal Use 3')
     A            GB3RSV4       31A         COLHDG('Reserved for Fusture' +
     A                                      'Use 4')
     A            GB3PRFL   R               REFFLD(FLAG)
     A                                      COLHDG('Processed Flag')
