     A*****************************************************************
     A* (c) 2015 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A*****************************************************************
     A**   ICD10 CMS Holding File                                    **
     A**                                                             **
     A**   PROGRAMMER: C:53                                          **
     A**   CREATED:   4/27/15       PROJECT: WC2261                  **
     A*****************************************************************
     A** REVISIONS:
     A*****************************************************************
     A**
     A                                      REF(FSREFP)
     A          R PCM01                     TEXT('ICD10 CM Holding File')
     A            CMCODE    R               REFFLD(DS7)
     A                                      COLHDG('ICD10' 'CM Code')
     A            CMDSC1    R               REFFLD(DS50)
     A                                      COLHDG('ICD10 CM Short' 'Desc.')
     A            CMDSC2       100A
     A                                      COLHDG('ICD10 CM Long' 'Desc.')
