      * (c) 2024 Sapiens. All Rights Reserved.
     A*
     A** WORKERS' COMPENSATION EMPLOYER PREMIUM DETAIL FILE
     A*
     A* 05/26/99 C:112 Project: 65WDC
     A*
     A          R PMP01                     PFILE(WAMPP)
     A          K MPCO#
     A          K MPFND
     A          K MPEMP#
     A          K MPDIV
