      * (c) 2024 Sapiens. All Rights Reserved.
     A**
     A** WORKERS' COMP PREMIUM DETAIL FILE
     A**************************************************************
      * REVISIONS:
      *
      * 08/14/24 C:291 Project: WC2974                               *
      *                Recompile.
      *
      * 07/13/11 C:061 PROJECT WC2037
      *                RECOMPILE.
      *
     A**************************************************************
     A                                      REF(WREFP)
     A          R PMP01                     FORMAT(WDMPP)
