     A* (C) Copyright Progressive Data Solutions, Inc., 2002
     A*
     A* WORKERS' COMPENSATION SELF-REPORTING PAYROLL TRANSACTION
     A***************************************************************
      *
     A          R PSR01                     PFILE(WASRP)
     A          K SRCO#
     A          K SRFND
     A          K SRFYR
     A          K SREMP#
     A          K SRDIV
     A          K SRTODT                    DESCEND
     A          K SRCLAS
     A          K SRSPEC
     A          K SREFDT
      *
