     A* (c) 2010 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A* 09/17/10  C:220 Project:  132WOM                              *
     A*                 Added new record formats for page segment.    *
     A*                                                               *
     A* 09/07/07  C:65  Project:  Supp#60020                          *
     A*                 Fix a typo in final premium section of page 5.*
     A*                                                               *
     A*****************************************************************
      *
     A
     A
     A*____________________________________________________________________
     A*
     A          R NEWPAGE
     A                                      SKIPB(1)
     A*____________________________________________________________________
     A*
     A          R HEADLINE
     A                                      LINE( .70  .4 7.5 *HRZ .02)
     A          R CTRLINE1
     A                                      LINE(1.50 4.1 8   *VRT .02)
     A          R CTRLINE
     A                                      LINE(1.00 4.1 8.5 *VRT .02)
     A*____________________________________________________________________
     A*
     A          R HEADODD
     A                                  3  7'WORKERS COMPENSATION AND -
     A                                      EMPLOYERS LIABILITY INSURANCE -
     A                                      POLICY'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                  3105'WC 00 00 00 A'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                  5111'(Ed. 4-92)'
     A                                      FNTCHRSET(C0H20090 T1V10037)
     A          R HEADEVEN
     A                                  3  7'WC 00 00 00 A'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                  3 40'WORKERS COMPENSATION AND -
     A                                      EMPLOYERS LIABILITY INSURANCE -
     A                                      POLICY'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                  5  7'(Ed. 4-92)'
     A                                      FNTCHRSET(C0H20090 T1V10037)
     A*____________________________________________________________________
     A*
     A          R WC0000001
     A*____________________                                            ____
     A*
     A                                  9 25'WORKERS COMPENSATION AND -
     A                                      EMPLOYERS LIABILITY INSURANCE -
     A                                      POLICY'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A*____________________                                            ____
     A*
     A                                 13  7'In return for the payment of -
     A                                      the premium and subject'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 14  7'to all terms of this policy, -
     A                                      we agree with you as follows:'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 19 21'GENERAL SECTION'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 22  7'A.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 22 12'The Policy'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 23 12'This policy includes at its -
     A                                      effective date the Infor-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 24 12'mation Page and all endorse-
     A                                      ments and schedules'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 25 12'listed there. It is a contract-
     A                                       of insurance between'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 26 12'you (the employer named in -
     A                                      item 1 of the Informa-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 27 12'tion Page) and us (the -
     A                                      insurer named on the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 28 12'Information Page).  The -
     A                                      only agreements relating to'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 29 12'this insurance are stated -
     A                                      in this policy.  The terms'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 30 12'of this policy may not be -
     A                                      changed or waived except'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 31 12'by endorsement issued by -
     A                                      us to be part of this'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 32 12'policy.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 36  7'B.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 36 12'Who is Insured'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 37 12'You are insured if you -
     A                                      are an employer named in'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 38 12'item 1 of the Information-
     A                                       Page.  If that employer is'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 39 12'a partnership, and if you -
     A                                      are one of its partners,'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 40 12'you are insured, but only -
     A                                      in your capacity as an'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 41 12'employer of the partner-
     A                                      ship''s employees.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 45  7'C.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 45 12'Workers Compensation Law'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 46 12'Workers Compensation Law -
     A                                      means the workers or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 47 12'workmen''s compensation -
     A                                      law and occupational'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 48 12'disease law of each state -
     A                                      or territory named in item'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 49 12'3.A. of the Information -
     A                                      Page.  It includes any'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 50 12'amendments to that law -
     A                                      which are in effect during'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 51 12'the policy period.  It -
     A                                      does not include any federal'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 52 12'workers or workmen''s -
     A                                      compensation law, any'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 53 12'federal occupational -
     A                                      disease law or the provisions'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 54 12'of any law that provide -
     A                                      nonoccupational disability'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 55 12'benefits.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 59  7'D.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 59 12'State'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 60 12'State means any state of -
     A                                      the United States of'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 61 12'America, and the District -
     A                                      of Columbia.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 65  7'E.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 65 12'Locations'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 66 12'This policy covers all of -
     A                                      your workplaces listed in'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 67 12'items 1 or 4 of the Infor-
     A                                      mation Page; and it covers'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 68 12'all other workplaces in -
     A                                      item 3.A. states unless you'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 69 12'have other insurance or -
     A                                      are self-insured for such'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 70 12'workplaces.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A*____________________                                            ____
     A*
     A                                 13 87'PART ONE'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 14 73'WORKERS COMPENSATION INSURANCE'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 17 67'A.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 17 72'How This Insurance Applies'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 18 72'This workers compensation -
     A                                      insurance applies to'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 19 72'bodily injury by accident -
     A                                      or bodily injury by disease.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 20 72'Bodily injury includes -
     A                                      resulting death.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 22 72'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 22 75'Bodily injury by accident -
     A                                      must occur during the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 23 75'policy period.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 25 72'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 25 75'Bodily injury by -
     A                                      disease must be caused or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 26 75'aggravated by the -
     A                                      conditions of your employ-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 27 75'ment.  The employee''s last -
     A                                      day of last exposure'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 28 75'to the conditions causing -
     A                                      or aggravating such'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 29 75'bodily injury by disease must -
     A                                      occur during the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 30 75'policy period.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 34 67'B.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 34 72'We Will Pay'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 35 72'We will pay promptly when -
     A                                      due the benefits re-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 36 72'quired of you by the workers -
     A                                      compensation law.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 40 67'C.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 40 72'We Will Defend'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 41 72'We have the right and duty -
     A                                      to defend at our ex-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 42 72'pense any claim, proceeding -
     A                                      or suit against you for'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 43 72'benefits payable by this -
     A                                      insurance.  We have the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 44 72'right to investigate and -
     A                                      settle these claims, pro-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 45 72'ceedings or suits.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 47 72'We have no duty to defend a -
     A                                      claim, proceeding or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 48 72'suit that is not covered by -
     A                                      this insurance.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 52 67'D.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 52 72'We Will Also Pay'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 53 72'We will also pay these -
     A                                      costs, in addition to other'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 54 72'amounts payable under -
     A                                      this insurance, as part of'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 55 72'any claim, proceeding -
     A                                      or suit we defend:'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 57 72'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 57 75'reasonable expenses -
     A                                      incurred at our request,'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 58 75'but not loss of earnings;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 60 72'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 60 75'premiums for bonds -
     A                                      to release attachments and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 61 75'for appeal bonds in bond -
     A                                      amounts up to the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 62 75'amount payable under -
     A                                      this insurance;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 64 72'3.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 64 75'litigation costs -
     A                                      taxed against you;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 66 72'4.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 66 75'interest on a judgment -
     A                                      as required by law until'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 67 75'we offer the amount due -
     A                                      under this insurance;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 68 75'and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 70 72'5.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 70 75'expenses we incur.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 74 67'E.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 74 72'Other Insurance'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 75 72'We will not pay more than -
     A                                      our share of benefits'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 76 72'and costs covered by this -
     A                                      insurance and other'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A*____________________________________________________________________
     A*
     A          R WC0000002
     A*____________________                                            ____
     A*
     A                                  9 12'insurance or self-insurance.  -
     A                                      Subject to any limits of'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 10 12'liability that may apply, -
     A                                      all shares will be equal until'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 11 12'the loss is paid.  If any -
     A                                      insurance or self-insurance'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 12 12'is exhausted, the shares of -
     A                                      all remaining insurance'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 13 12'will be equal -
     A                                      until the loss is paid.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 17  7'F.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 17 12'Payments You Must Make'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 18 12'You are responsible for any -
     A                                      payments in excess'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 19 12'of the benefits regularly -
     A                                      provided by the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 20 12'workers compensation law -
     A                                      including those'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 21 12'required because:'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 23 12'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 23 15'of your serious and willful -
     A                                      misconduct;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 25 12'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 25 15'you knowingly employ an -
     A                                      employee in violation'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 26 15'of law;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 28 12'3.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 28 15'you fail to comply with a -
     A                                      health or safety law'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 29 15'or regulation; or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 31 12'4.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 31 15'you discharge, coerce or -
     A                                      otherwise discriminate'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 32 15'against any employee in -
     A                                      violation of the work-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 33 15'ers compensation law.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 35 12'If we make any payments in -
     A                                      excess of the benefits'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 36 12'regularly provided by the -
     A                                      workers compensation law'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 37 12'on your behalf, you will -
     A                                      reimburse us promptly.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 41  7'G.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 41 12'Recovery From Others'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 42 12'We have your rights, and -
     A                                      the rights of persons'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 43 12'entitled to the benefits of this -
     A                                      insurance, to recover'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 44 12'our payments from anyone -
     A                                      liable for the injury.  You'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 45 12'will do everything necessary to -
     A                                      protect those rights'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 46 12'for us and to help us enforce -
     A                                      them.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 50  7'H.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 50 12'Statutory Provisions'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 51 12'These statements apply where -
     A                                      they are required by'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 52 12'law.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 54 12'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 54 15'As between an injured worker -
     A                                      and us, we have'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 55 15'notice of the injury when -
     A                                      you have notice.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 57 12'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 57 15'Your default or the -
     A                                      bankruptcy or insolvency of'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 58 15'you or your estate will -
     A                                      not relieve us of our'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 59 15'duties under this insurance -
     A                                      after an injury occurs.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 61 12'3.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 61 15'We are directly and primarily -
     A                                      liable to any'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 62 15'person entitled to the benefits -
     A                                      payable by this'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 63 15'insurance.  Those persons may -
     A                                      enforce our'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 64 15'duties; so may an agency -
     A                                      authorized by law.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 65 15'Enforcement may be against us or -
     A                                      against'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 66 15'you and us.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 68 12'4.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 68 15'Jurisdiction over you is -
     A                                      jurisdiction over us for'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 69 15'purposes of the workers -
     A                                      compensation law.  We'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 70 15'are bound by decisions -
     A                                      against you under that'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 71 15'law, subject to the -
     A                                      provisions of this policy that'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 72 15'are not in conflict with -
     A                                      that law.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 74 12'5.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 74 15'This insurance conforms to -
     A                                      the parts of the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A*____________________                                            ____
     A*
     A                                  9 75'workers compensation law -
     A                                      that apply to:'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 11 75'a.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 11 78'benefits payable by this -
     A                                      insurance;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 13 75'b.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 13 78'special taxes, payments -
     A                                      into security or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 14 78'other special funds, and -
     A                                      assessments'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 15 78'payable by us under that law.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 17 72'6.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 17 75'Terms of this insurance -
     A                                      that conflict with the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 18 75'workers compensation law -
     A                                      are changed by this'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 19 75'statement to conform to that law.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 21 72'Nothing in these paragraphs -
     A                                      relieves you of your'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 22 72'duties under this policy.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 26 87'PART TWO'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 27 74'EMPLOYERS LIABILITY INSURANCE'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 30 67'A.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 30 72'How This Insurance Applies'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 31 72'This employers liability -
     A                                      insurance applies to bodily'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 32 72'injury by accident or -
     A                                      bodily injury by disease.  Bodily'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 33 72'injury includes resulting death.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 35 72'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 35 75'The bodily injury must -
     A                                      arise out of and in the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 36 75'course of the injured -
     A                                      employee''s employment'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 37 75'by you.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 39 72'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 39 75'The employment must be -
     A                                      necessary or inciden-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 40 75'tal to your work in a state -
     A                                      or territory listed in'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 41 75'Item 3.A. of the -
     A                                      Information Page.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 43 72'3.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 43 75'Bodily injury by accident -
     A                                      must occur during the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 44 75'policy period.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 46 72'4.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 46 75'Bodily injury by disease -
     A                                      must be caused or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 47 75'aggravated by the conditions -
     A                                      of your employ-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 48 75'ment.  The employee''s last day -
     A                                      of last exposure'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 49 75'to the conditions causing or -
     A                                      aggravating such'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 50 75'bodily injury by disease must -
     A                                      occur during the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 51 75'policy period.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 53 72'5.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 53 75'If you are sued, the -
     A                                      original suit and any'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 54 75'related legal actions for -
     A                                      damages for bodily'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 55 75'injury by accident or by -
     A                                      disease must be'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 56 75'brought in the -
     A                                      United States of America, its'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 57 75'territories or possessions, -
     A                                      or Canada.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 61 67'B.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 61 72'We Will Pay'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 62 72'We will pay all sums you -
     A                                      legally must pay as'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 63 72'damages because of bodily -
     A                                      injury to your employ-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 64 72'ees, provided the bodily -
     A                                      injury is covered by this'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 65 72'Employers Liability Insurance.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 67 72'The damages we will pay, -
     A                                      where recovery is'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 68 72'permitted by law, -
     A                                      include damages:'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 70 72'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 70 75'for which you are liable -
     A                                      to a third party by'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 71 75'reason of a claim or suit -
     A                                      against you by that'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 72 75'third party to recover the -
     A                                      damages claimed'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A*____________________________________________________________________
     A*
     A          R WC0000003
     A*____________________                                            ____
     A*
     A                                  9 15'against such third party -
     A                                      as a result of injury to'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 10 15'your employee;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 12 12'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 12 15'for care and loss of -
     A                                      services; and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 14 12'3.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 14 15'for consequential bodily -
     A                                      injury to a spouse,'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 15 15'child, parent, brother -
     A                                      or sister of the injured'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 16 15'employee;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 18 12'provided that these damages -
     A                                      are the direct conse-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 19 12'quence of bodily injury that -
     A                                      arises out of and in the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 20 12'course of the injured -
     A                                      employee''s employment by'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 21 12'you; and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 23 12'4.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 23 15'because of bodily injury -
     A                                      to your employee that'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 24 15'arises out of and in the -
     A                                      course of employment,'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 25 15'claimed against you in a -
     A                                      capacity other than as'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 26 15'employer.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 30  7'C.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 30 12'Exclusions'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 31 12'This insurance does not cover:'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 33 12'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 33 15'liability assumed under a -
     A                                      contract.  This exclu-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 34 15'sion does not apply to -
     A                                      a warranty that your'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 35 15'work will be done in a -
     A                                      workmanlike manner;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 37 12'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 37 15'punitive or exemplary -
     A                                      damages because of'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 38 15'bodily injury to an employee -
     A                                      employed in'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 39 15'violation of law;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 41 12'3.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 41 15'bodily injury to an -
     A                                      employee while employed in'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 42 15'violation of law with -
     A                                      your actual knowledge or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 43 15'the actual knowledge of -
     A                                      any of your executive'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 44 15'officers;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 46 12'4.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 46 15'any obligation imposed -
     A                                      by a workers compen-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 47 15'sation, occupational disease, -
     A                                      unemployment'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 48 15'compensation, or disability -
     A                                      benefits law, or any'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 49 15'similar law;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 51 12'5.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 51 15'bodily injury intentionally -
     A                                      caused or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 52 15'aggravated by you;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 54 12'6.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 54 15'bodily injury occurring -
     A                                      outside the United'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 55 15'States of America, its -
     A                                      territories or possessions,'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 56 15'and Canada.  This exclusion -
     A                                      does not apply to'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 57 15'bodily injury to a citizen -
     A                                      or resident of the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 58 15'United States of America -
     A                                      or Canada who is'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 59 15'temporarily outside these -
     A                                      countries;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 61 12'7.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 61 15'damages arising out of -
     A                                      coercion, criticism,'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 62 15'demotion, evaluation, -
     A                                      reassignment, discipline,'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 63 15'defamation, harassment, -
     A                                      humiliation, discrimi-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 64 15'nation against or -
     A                                      termination of any employee,'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 65 15'or any personnel practices, -
     A                                      policies, acts or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 66 15'omissions;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 68 12'8.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 68 15'bodily injury to any -
     A                                      person in work subject to'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 69 15'the Longshore and Harbor -
     A                                      Workers'' Compen-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 70 15'sation -
     A                                      Act (33 USC Sections 901-950), the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 71 15'Nonappropriated Fund -
     A                                      Instrumentalities Act'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 72 15'(5 USC Sections 8171-8173), -
     A                                      the Outer Conti-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A*____________________                                            ____
     A*
     A                                  9 75'nental Shelf Lands Act -
     A                                      (43 USC Sections'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 10 75'1331-1356), the Defense Base -
     A                                      Act (42 USC'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 11 75'Sections 1651-1654), the -
     A                                      Federal Coal Mine'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 12 75'Health and Safety Act -
     A                                      of 1969 (30 USC Sec-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 13 75'tions 901-942), any other -
     A                                      federal workers or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 14 75'workmen''s compensation law -
     A                                      or other federal'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 15 75'occupational disease law, -
     A                                      or any amendments'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 16 75'to these laws;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 18 72'9.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 18 75'bodily injury to any -
     A                                      person in work subject to'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 19 75'the Federal Employers'' -
     A                                      Liability Act (45 USC'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 20 75'Sections 51-60), any other -
     A                                      federal laws obli-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 21 75'gating an employer to pay -
     A                                      damages to an em-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 22 75'ployee due to bodily injury -
     A                                      arising out of or in the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 23 75'course of employment, -
     A                                      or any amendments'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 24 75'to those laws;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 26 72'10.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 26 75'bodily injury to a -
     A                                      master or member of the crew'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 27 75'of any vessel;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 29 72'11.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 29 75'fines or penalties imposed -
     A                                      for violation of'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 30 75'federal or state law; and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 32 72'12.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 32 75'damages payable under -
     A                                      the Migrant and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 33 75'Seasonal Agricultural -
     A                                      Worker Protection Act (29'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 34 75'USC Sections 1801-1872) -
     A                                      and under any other'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 35 75'federal law awarding -
     A                                      damages for violation of'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 36 75'those laws or regulations -
     A                                      issued thereunder,'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 37 75'and any amendments to those laws.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 41 67'D.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 41 72'We Will Defend'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 42 72'We have the right and -
     A                                      duty to defend, at our'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 43 72'expense, any claim, proceeding -
     A                                      or suit against you'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 44 72'for damages payable by -
     A                                      this insurance.  We have'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 45 72'the right to investigate -
     A                                      and settle these claims,'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 46 72'proceedings and suits.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 48 72'We have no duty to defend -
     A                                      a claim, proceeding or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 49 72'suit that is not covered -
     A                                      by this insurance.  We have'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 50 72'no duty to defend -
     A                                      or continue defending after we'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 51 72'have paid our applicable -
     A                                      limit of liability under this'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 52 72'insurance.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 56 67'E.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 56 72'We Will Also Pay'
     A                                      FNTCHRSET(C0H40000 T1V10037)
     A                                 57 72'We will also pay these -
     A                                      costs, in addition to other'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 58 72'amounts payable under -
     A                                      this insurance, as part of'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 59 72'any claim, proceeding, -
     A                                      or suit we defend:'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 61 72'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 61 75'reasonable expenses -
     A                                      incurred at our request,'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 62 75'but not loss of earnings;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 64 72'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 64 75'premiums for bonds to -
     A                                      release attachments and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 65 75'for appeal bonds in bond -
     A                                      amounts up to the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 66 75'limit of our liability -
     A                                      under this insurance;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 68 72'3.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 68 75'litigation costs taxed -
     A                                      against you;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 70 72'4.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 70 75'interest on a judgment -
     A                                      as required by law until'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 71 75'we offer the amount due -
     A                                      under this insurance;'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 72 75'and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 74 72'5.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 74 75'expenses we incur.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A*____________________________________________________________________
     A*
     A          R WC0000004
     A*____________________                                            ____
     A*
                                        9  7'F.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                        9 12'Other Insurance'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       10 12'We will not pay more -
                                            than our share of damages'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       11 12'and costs covered by -
                                            this insurance and other'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       12 12'insurance or self-insurance.  -
                                            Subject to any limits of'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       13 12'liability that apply, all -
                                            shares will be equal until the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       14 12'loss is paid.  If any -
                                            insurance or self-insurance is'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       15 12'exhausted, the shares of all -
                                            remaining insurance'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       16 12'and self-insurance will be -
                                            equal until the loss is'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       17 12'paid.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       21  7'G.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       21 12'Limits of Liability'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       22 12'Our liability to pay for -
                                            damages is limited.  Our limits'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       23 12'of liability are shown in -
                                            item 3.B. of the Information'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       24 12'Page.  They apply as -
                                            explained below.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       26 12'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       26 15'Bodily Injury by Accident.  -
                                            The limit shown for'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       27 15'"bodily injury by -
                                            accident-each accident" is'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       28 15'the most we will pay for -
                                            all damages covered'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       29 15'by this insurance because -
                                            of bodily injury to'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       30 15'one or more employees in -
                                            any one accident.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       32 15'A disease is not bodily -
                                            injury by accident'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       33 15'unless it results directly -
                                            from bodily injury by'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       34 15'accident.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       36 12'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       36 15'Bodily Injury by Disease.  -
                                            The limit shown for'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       37 15'"bodily injury by -
                                            disease-policy limit" is the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       38 15'most we will pay for all -
                                            damages covered by'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       39 15'this insurance and arising -
                                            out of bodily injury'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       40 15'by disease, regardless of -
                                            the number of em-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       41 15'ployees who sustain bodily -
                                            injury by disease.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       42 15'The limit shown for "bodily -
                                            injury by disease-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       43 15'each employee" is the most -
                                            we will pay for all'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       44 15'damages because of bodily -
                                            injury by disease'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       45 15'to any one employee.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       47 15'Bodily injury by disease -
                                            does not include'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       48 15'disease that results -
                                            directly from a bodily injury'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       49 15'by accident.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       51 12'3.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       51 15'We will not pay any -
                                            claims for damages after'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       52 15'we have paid the applicable -
                                            limit of our liability'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       53 15'under this insurance.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       57  7'H.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       57 12'Recovery From Others'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       58 12'We have your rights to -
                                            recover our payment from'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       59 12'anyone liable for an -
                                            injury covered by this insur-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       60 12'rance.  You will do -
                                            everything necessary to protect'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       61 12'those rights for us and -
                                            to help us enforce them.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       65  7'I.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       65 12'Actions Against Us'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       66 12'There will be no right of -
                                            action against us under'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       67 12'this insurance unless:'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       69 12'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       69 15'You have complied with -
                                            all the terms of this'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       70 15'policy; and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A*____________________                                            ____
     A*
                                        9 72'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                        9 75'The amount you owe has -
                                            been determined'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       10 75'with our consent or by actual -
                                            trial and final'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       11 75'judgment.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       13 72'This insurance does not -
                                            give anyone the right to'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       14 72'add us as a defendant in -
                                            an action against you to'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       15 72'determine your liability.  -
                                            The bankruptcy or insol-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       16 72'vency of you or your estate -
                                            will not relieve us of'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       17 72'our obligations under this Part.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       21 88'PART THREE'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       22 79'OTHER STATES INSURANCE'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       25 67'A.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       25 72'How This Insurance Applies'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       27 72'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       27 75'This other states insurance -
                                            applies only if one'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       28 75'or more states are shown -
                                            in Item 3.C. of the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       29 75'Information Page.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       31 72'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       31 75'If you begin work in -
                                            any one of those states'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       32 75'after the effective date -
                                            of this policy and are'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       33 75'not insured or are not -
                                            self-insured for such'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       34 75'work, all provisions of -
                                            the policy will apply as'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       35 75'though that state were -
                                            listed in Item 3.A. of the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       36 75'Information Page.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       38 72'3.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       38 75'We will reimburse you for -
                                            the benefits required'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       39 75'by the workers compensation -
                                            law of that state'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       40 75'if we are not permitted -
                                            to pay the benefits'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       41 75'directly to persons -
                                            entitled to them.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       43 72'4.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       43 75'If you have work on the -
                                            effective date of this'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       44 75'policy in any state not -
                                            listed in Item 3.A. of the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       45 75'Information Page, coverage -
                                            will not be afforded'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       46 75'for that state unless -
                                            we are notified within thirty'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       47 75'days.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       51 67'B.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       51 72'Notice'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       52 72'Tell us at once if you -
                                            begin work in any state listed'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       53 72'in Item 3.C. of the -
                                            Information Page.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       57 87'PART FOUR'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       58 75'YOUR DUTIES IF INJURY OCCURS'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       61 72'Tell us at once if injury -
                                            occurs that may be covered'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       62 72'by this policy.  Your other -
                                            duties are listed here.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       64 72'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       64 75'Provide for immediate -
                                            medical and other'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       65 75'services required by the -
                                            workers compensation'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       66 75'law.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       68 72'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       68 75'Give us or our agent -
                                            the names and addresses'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       69 75'of the injured persons and -
                                            of witnesses, and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       70 75'other information we may need.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       72 72'3.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       72 75'Promptly give us all -
                                            notices, demands and legal'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A*____________________________________________________________________
     A*
     A          R WC0000005
     A*____________________                                            ____
     A*
                                        9 15'papers related to the -
                                            injury, claim, proceeding'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       10 15'or suit.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       12 12'4.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       12 15'Cooperate with us and -
                                            assist us, as we may'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       13 15'request, in the investigation, -
                                            settlement or de-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       14 15'fense of any claim, -
                                            proceeding or suit.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       16 12'5.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       16 15'Do nothing after an -
                                            injury occurs that would'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       17 15'interfere with our -
                                            right to recover from others.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       19 12'6.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       19 15'Do not voluntarily make -
                                            payments, assume'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       20 15'obligations or incur -
                                            expenses, except at your'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       21 15'own cost.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       26 22'PART FIVE - PREMIUM'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       29  7'A.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       29 12'Our Manuals'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       30 12'All premium for this policy -
                                            will be determined by our'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       31 12'manuals of rules, rates, -
                                            rating plans and classifca-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       32 12'tions.  We may change our -
                                            manuals and apply the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       33 12'changes to this policy -
                                            if authorized by law or a'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       34 12'governmental agency -
                                            regulating this insurance.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       38  7'B.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       38 12'Classifications'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       39 12'Item 4 of the Information -
                                            Page shows the rate and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       40 12'premium basis for certain -
                                            business or work classifi-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       41 12'cations.  These classifications -
                                            were assigned based'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       42 12'on an estimate of the -
                                            exposures you would have'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       43 12'during the policy period.  -
                                            If your actual exposures'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       44 12'are not properly described by -
                                            those classifications,'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       45 12'we will assign proper -
                                            classifications, rates and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       46 12'premium basis by endorsement -
                                            to this policy.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       50  7'C.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       50 12'Remuneration'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       51 12'Premium for each work -
                                            classification is determined'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       52 12'by multiplying a rate -
                                            times a premium basis.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       53 12'Remuneration is the most -
                                            common premium basis.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       54 12'This premium basis includes -
                                            payroll and all other'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       55 12'remuneration paid or -
                                            payable during the policy'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       56 12'period for the services of:'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       58 12'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       58 15'all your officers and -
                                            employees engaged in'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       59 15'work covered by this -
                                            policy; and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       61 12'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       61 15'all other persons -
                                            engaged in work that could'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       62 15'make us liable under -
                                            Part One (Workers Com-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       63 15'pensation Insurance) of -
                                            this policy.  If you do'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       64 15'not have payroll records -
                                            for these persons, the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       65 15'contract price for their -
                                            services and materials may'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       66 15'be used as the premium -
                                            basis.  This paragraph 2'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       67 15'will not apply if you -
                                            give us proof that the employ-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       68 15'ers of these persons -
                                            lawfully secured their'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       69 15'workers compensation -
                                            obligations.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A*____________________                                            ____
     A*
                                        9 67'D.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                        9 72'Premium Payments'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       10 72'You will pay all premium -
                                            when due.  You will pay'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       11 72'the premium even if part -
                                            or all of a workers com-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       12 72'pensation law is not valid.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       16 67'E.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       16 72'Final Premium'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       17 72'The premium shown on the -
                                            Information Page,'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       18 72'schedules, and endorsements -
                                            is an estimate.  The'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       19 72'final premium will be -
                                            determined after this policy'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       20 72'ends by using the actual, -
                                            not the estimated, pre-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       21 72'mium basis and the proper -
                                            classifications and rates'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       22 72'that lawfully apply to -
                                            the business and work cov-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       23 72'vered by this policy.  -
                                            If the final premium is more'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       24 72'than the premium you paid -
                                            to us, you must pay us'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       25 72'the balance.  If it is less, -
                                            we will refund the balance'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       26 72'to you.  The final premium -
                                            will not be less than the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       27 72'highest minimum premium -
                                            for the classifications'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       28 72'covered by this policy.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       30 72'If this policy is cancelled, -
                                            final premium will be'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       31 72'determined in the following -
                                            way unless our manuals'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       32 72'provide otherwise:'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       34 72'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       34 75'If we cancel, final -
                                            premium will be calculated'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       35 75'pro rata based on the -
                                            time this policy was in'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       36 75'force.  Final premium will -
                                            not be less than the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       37 75'pro rata share of the -
                                            minimum premium.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       39 72'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       39 75'If you cancel, final -
                                            premium will be more than pro'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       40 75'rata; it will be based on -
                                            the time this policy was'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       41 75'in force, and increased -
                                            by our short-rate'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       42 75'cancellation table and -
                                            procedure.  Final premium'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       43 75'will not be less than -
                                            the minimum premium.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       47 67'F.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       47 72'Records'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       48 72'You will keep records of -
                                            information needed to'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       49 72'compute premium.  You will -
                                            provide us with copies'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       50 72'of those records when we -
                                            ask for them.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       54 67'G.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       54 72'Audit'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       55 72'You will let us examine -
                                            and audit all your records'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       56 72'that relate to this policy.  -
                                            These records include'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       57 72'ledgers, journals, registers, -
                                            vouchers, contracts, tax'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       58 72'reports, payroll and -
                                            disbursement records, and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       59 72'programs for storing and -
                                            retrieving data.  We may'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       60 72'conduct the audits during -
                                            regular business hours'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       61 72'during the policy period -
                                            and within three years after'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       62 72'the policy period ends.  -
                                            Information developed by'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       63 72'audit will be used to -
                                            determine final premium.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       64 72'Insurance rate service -
                                            organizations have the same'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       65 72'rights we have under this -
                                            provision.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A*____________________________________________________________________
     A*
     A          R WC0000006
     A*____________________                                            ____
     A*
                                        9 20'PART SIX - CONDITIONS'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       12  7'A.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       12 12'Inspection'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       13 12'We have the right, but -
                                            are not obliged to inspect'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       14 12'your workplaces at any time.  -
                                            Our inspections are'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       15 12'not safety inspections.  -
                                            They relate only to the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       16 12'insurability of the workplaces -
                                            and the premiums to'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       17 12'be charged.  We may give -
                                            you reports on the'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       18 12'conditions we find.  -
                                            We may also recommend'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       19 12'changes.  While they may -
                                            help reduce losses, we'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       20 12'do not undertake to perform -
                                            the duty of any person'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       21 12'to provide for the health -
                                            or safety of your employ-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       22 12'ees or the public.  We do -
                                            not warrant that your'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       23 12'workplaces are safe or -
                                            healthful or that they comply'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       24 12'with laws, regulations, -
                                            codes or standards.  Insur-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       25 12'ance rate service -
                                            organizations have the same'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       26 12'rights we have under -
                                            this provision.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       30  7'B.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       30 12'Long Term Policy'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       31 12'If the policy period is -
                                            longer than one year and'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       32 12'sixteen days, all provisions -
                                            of this policy will apply'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       33 12'as though a new policy -
                                            were issued on each annual'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       34 12'anniversary that this -
                                            policy is in force.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       38  7'C.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       38 12'Transfer of Your Rights and Duties'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       39 12'Your rights or duties under -
                                            this policy may not be'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       40 12'transferred without our -
                                            written consent.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A*____________________                                            ____
     A*
                                        9 72'If you die and we receive -
                                            notice within thirty days'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       10 72'after your death, we will -
                                            cover your legal represen-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       11 72'tative as insured.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       15 67'D.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       15 72'Cancellation'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       17 72'1.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       17 75'You may cancel this policy.  -
                                            You must mail or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       18 75'deliver advance written notice -
                                            to us stating '
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       19 75'when the cancellation is -
                                            to take effect.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       21 72'2.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       21 75'We may cancel this policy.  -
                                            We must mail or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       22 75'deliver to you not less -
                                            than ten days advance'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       23 75'written notice stating -
                                            when the cancellation is'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       24 75'to take effect.  Mailing -
                                            that notice to you at your'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       25 75'mailing address shown in -
                                            Item 1 of the Infor-'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       26 75'mation Page will be -
                                            sufficient to prove notice.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       28 72'3.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       28 75'The policy period will -
                                            end on the day and hour'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       29 75'stated in the cancellation -
                                            notice.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       31 72'4.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       31 75'Any of these provisions -
                                            that conflict with a law'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       32 75'that controls the cancellation -
                                            of the insurance'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       33 75'in this policy is changed -
                                            by this statement to'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       34 75'comply with the law.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       38 67'E.'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       38 72'Sole Representative'
     A                                      FNTCHRSET(C0H40000 T1V10037)
                                       39 72'The insured first named -
                                            in Item 1 of the Information'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       40 72'Page will act on behalf -
                                            of all insureds to change'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       41 72'this policy, receive return -
                                            premium, and give or'
     A                                      FNTCHRSET(C0H20000 T1V10037)
                                       42 72'receive notice of cancellation.'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A*____________________________________________________________________
     A*
     A          R FOOTER
     A            PAGE#          2  0  80 60EDTCDE(Z)
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                   + 0'of 6'
     A                                      FNTCHRSET(C0H20000 T1V10037)
     A                                 81  5'(c) 1991 National Council on -
     A                                      Compensation Insurance'
     A                                      FNTCHRSET(C0H20060 T1V10037)
     A**** Beg Add ***** 09/17/10 *************************************
     A          R NEWPAGE01
     A                                      ENDPAGE
     A*
     A          R WCPSG0001
     A*
     A                                      PAGSEG(&XPPLB/&XPNAM &XPHRZ &XPVRZ)
     A            XPPLB         10   P
     A            XPNAM          8   P
     A            XPHRZ          5S 3P
     A            XPVRZ          5S 3P
     A**** End Add ***** 09/17/10 *************************************
     A*
