     H* Copyright('(c) 2018 StoneRiver, Inc. All rights reserved. -
     H* StoneRiver is a trademark of StoneRiver, Inc.')
     A*
     A* WORKERS' COMP NCCI REPORTING WCPOLS RECORD TYPE BD
     H*****************************************************************
     H* DEDUCTIBLE ENDORSEMENT TEMPLATE - DELAWARE
     H*****************************************************************
     H*  SPECIAL FILE NOTES:                                          *
     H*                                                               *
     H*  USE THIS "FILE" AS AN EXTERNAL DATA STRUCTURE DESCRIPTION    *
     H*  WHEN CREATING THE NCCI REPORTING FILE                        *
     H*                                                               *
     H*  CREATED: 05/30/18  PROJECT: WC2607   C:65                    *
     H*                                                               *
     H*****************************************************************
     A* REVISIONS                                                     *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
      *
     A          R PBD                       TEXT('DE DEDUCTIBLE'+
                                            'ENDORSEMENT TEMPLATE')
      *
     A            PBDLNK        43A         COLHDG('LINK' 'DATA')
      *
     A            PBDST          2S         COLHDG('STATE')
      *
     A            PBDRTP         2A         COLHDG('RECORD TYPE')
      *
     A            PBDFU1         3A         COLHDG('FUTURE USE')
      *
     A            PBDEN#         8A         COLHDG('ENDORSEMENT ID#')
      *
     A            PBDBVI         1A         COLHDG('BUREAU VERSION ID')
      *
     A            PBDCVI        11A         COLHDG('CARRIER VERSION ID')
      *
     A            PBDDAC         6S         COLHDG('DEDUCTIBLE AMOUNT')
      *
     A            PBDPRP         5S         COLHDG('PREMIUM REDUCTION' +
                                            'PERCENTAGE')
      *
     A            PBDFU2       173A         COLHDG('FUTURE USE')
      *
     A            PBDNAM        34A         COLHDG('EMPLOYER' 'NAME')
      *
     A            PBDCGD         6S         COLHDG('ENDORSEMENT' +
                                            'EFFECTIVE' 'DATE')
      *
     A            PBDFU3         6A         COLHDG('FUTURE USE')
      *
