     A* (c) 2022 Sapiens. All Rights Reserved.                        *
     A*                                                               *
     A*  WORKERS' COMP NCCI REPORTING WCPOLS RECORD TYPE 13           *
     H*****************************************************************
     H*  Policy Period Endorsement (WC000405)                         *
     H*****************************************************************
     A*****************************************************************
     A*  Project:  WC2891       Programmer:  C:291                    *
     A*  Created:  11/15/22                                           *
     A*                                                               *
     H*****************************************************************
     H*  Special File Notes:                                          *
     H*  Use this "File" as an external data structure description    *
     H*  when creating the NCCI Reporting file.                       *
     H*****************************************************************
     H*
     A          R P13                       TEXT('POLICY PRD ENDORS')
     A            P13LNK        43A         TEXT('LINK DATA')
     A            P13FU1         2A         TEXT('FUTURE USE 1')
     A            P13RTP         2A         TEXT('RECORD TYPE')
     A            P13FU2         3A         TEXT('FUTURE USE 2')
     A            P13EN#         8A         TEXT('ENDORSMENT ID#')
     A            P13BVI         1A         TEXT('BUREAU VERSION ID')
     A            P13CVI        11A         TEXT('CARRIER VERSION ID')
     A            P13EF1         6S         TEXT('EFF DT OF 1ST POL PRD')
     A            P13EX1         6S         TEXT('EXP DT OF 1ST POL PRD')
     A            P13EF2         6S         TEXT('EFF DT OF 2ND POL PRD')
     A            P13EX2         6S         TEXT('EXP DT OF 2ND POL PRD')
     A            P13EF3         6S         TEXT('EFF DT OF 3RD POL PRD')
     A            P13EX3         6S         TEXT('EXP DT OF 3RD POL PRD')
     A            P13FU3       148A         TEXT('FUTURE USE 3')
     A            P13NAM        34A         TEXT('NAME OF INSURED')
     A            P13EFD         6S         TEXT('ENDORSMENT EFF. DATE')
     A            P13FU4         6A         TEXT('FUTURE USE 4')
