      * (c) 2010 StoneRiver, Inc. All rights Reserved.                *
      * StoneRiver is a trademark of StoneRiver, Inc.                 *
     A**                                                              *
     A** WCSTAT Record Format File - WCSTAT07A                        *
     A** ICR 7-A RECORD                                               *
     H*****************************************************************
     H*  Revisions:                                                   *
     H*                                                               *
     H* 11/23/10  C:190 Project: 139WPQ                               *
     H*                                                               *
     H*****************************************************************
     A          R PST7A                     TEXT('ICR 7-A RECORD')
     A            STLINK        40A         COLHDG('Link data')
     A            STRTYP         1A         COLHDG('Record type code')
     A            STSRTC         1A         COLHDG('Sub-record type code')
     A            STCLM#        12A         COLHDG('Claim #')
     A            STRTCD         2S 0       COLHDG('Reserve type code')
     A            STYRLE         4S 0       COLHDG('Year last exposed')
     A            STFUT1         8A         COLHDG('Future use')
     A            STCLCD         4S 0       COLHDG('Classification code')
     A            STFUT2         1A         COLHDG('Future use')
     A            STIJCD         2S 0       COLHDG('Injury code')
     A            STLCCD         2S 0       COLHDG('Loss coverage code')
     A            STTRCD         1S 0       COLHDG('Transaction type cd')
     A            STWRSX         1A         COLHDG('Workers sex')
     A            STACDT         6S 0       COLHDG('Accident date')
     A            STDCDT         6S 0       COLHDG('Deceased date')
     A            STRPDT         6S 0       COLHDG('Reported date')
     A            STBRDT         6S 0       COLHDG('Birth date')
     A            STFUT3         6A         COLHDG('Future use')
     A            STCLDT         4S 0       COLHDG('Closed date')
     A            STFUT4         5A         COLHDG('Future use')
     A            STSTCD         1S 0       COLHDG('Status code')
     A            STMSCD         1S 0       COLHDG('Method of' +
     A                                      'settlement code')
     A            STFUT5         2A         COLHDG('Future use')
     A            STLCAC         2S 0       COLHDG('Loss condition' +
     A                                      'code - Act')
     A            STLCTL         2S 0       COLHDG('Loss condition' +
     A                                      'code - Type of loss')
     A            STTYRC         2S 0       COLHDG('Loss condition code' +
     A                                      '- Type of recovery')
     A            STTYCV         2S 0       COLHDG('Loss condition code' +
     A                                      '- Type of coverage')
     A            STTYST         2S 0       COLHDG('Loss condition code' +
     A                                      '- Type of settlement')
     A            STFUT7         7A         COLHDG('Future use')
     A            STJRST         2S 0       COLHDG('Jurisdiction state')
     A            STMCCD         2S 0       COLHDG('Managed care' +
     A                                      'org type code')
     A            STLSID         1A         COLHDG('Lump sum indicator')
     A            STFRCD         2S 0       COLHDG('Fraudulent claim cd')
     A            STSSOI         1A         COLHDG('Social security' +
     A                                      'offset indicator')
     A            STFUT8       102A         COLHDG('Future use')
     A            STASWG         1A         COLHDG('ASWG unit' +
     A                                      'submission code')
