      * (c) 2010 StoneRiver, Inc. All rights Reserved.                *
      * StoneRiver is a trademark of StoneRiver, Inc.                 *
     A**                                                              *
     A** WCSTAT Record Format File - WCSTAG04                         *
     A** RECORD TYPE 04 - Exposure Record for GIC                     *
     H*****************************************************************
     H*  Revisions:                                                   *
     H*                                                               *
     H* 11/23/10  C:190 Project: 139WPQ                               *
     H*                                                               *
     H*****************************************************************
     A          R PST04                     TEXT('Exposure Record')
     A            STLINK        40A         COLHDG('Link data')
     A            STRTYP         1A         COLHDG('Record type code')
     A            STFUT1         1A         COLHDG('Future use')
     A            STEXDT         4S 0       COLHDG('Classification code')
     A            STFUT2         1A         COLHDG('Future use')
     A            STPRCD         1S 0       COLHDG('Previously reported' +
     A                                      'code')
     A            STEXAC         2S 0       COLHDG('Exposure act')
     A            STEMFR         4S 3       COLHDG('Exp. mod factor')
     A            STEMDT         6S 0       COLHDG('Exp. mod date')
     A            STREDT         6S 0       COLHDG('Rate eff. date')
     A            STEAMT        10S 0       COLHDG('Exposure amount')
     A            STPAMT         9S 0       COLHDG('Premium amount')
     A            STMNRT         7S 3       COLHDG('Manual rate')
     A            STSPCD         1S 0       COLHDG('Split period code')
     A            STFUT3        17A         COLHDG('Future use')
     A            STRTID         2S 0       COLHDG('Rating tier' +
     A                                      'ID code')
     A            STFUT4         8A         COLHDG('Future use')
     A            STUTCD         1A         COLHDG('Update type code')
     A            STFUT5         1A         COLHDG('Future use')
     A            STEXA2         2S 0       COLHDG('Exposure act')
     A            STFUT6       126A         COLHDG('Future use')
     A            STGRP#         3S 0       COLHDG('Group #')
     A            STFYR          3S 0       COLHDG('Policy year')
     A            STEMP#         9S 0       COLHDG('Employer #')
