     A*  (C) Copyright Progressive Data Solutions Inc., 2000          *
     A*****************************************************************
     A*  AGENCY BILLING DETAIL FILE
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*  01/25/00  C:33  PROJECT: WC899                               *
     A*                  ADD IDT AND ITIM FOR SEARCH                  *
     A*****************************************************************
     A
     A          R PAB01                     PFILE(WDABP)
     A          K ABCO#
     A          K ABFND
     A          K ABEMP#
     A          K ABDIV
     A          K ABFYR
     A***  BEGIN ADD  ***  01/25/00  *********************************
     A          K ABIDT
     A          K ABITIM
     A***  END   ADD  ***  01/25/00  *********************************
