     A*  (C) Copyright Progressive Data Solutions Inc., 2000          *
     A*
     A*  AGENCY BILLING DETAIL FILE
     A*
     A          R PAB01                     PFILE(WDABP)
     A          K ABCO#
     A          K ABFND
     A          K ABEMP#
     A          K ABDIV
     A          K ABARTY
