     A** (C) COPYRIGHT INSURANCE ADMINISTRATIVE SYSTEMS, INC. 1989
     A**
     A** PAYMENT/ADJUSTMENT CORRECTION/CHANGE DETAIL FILE
     A**
     A          R PAJ01                     PFILE(WDAJP)
     A          K AJCO#
     A          K AJFND
     A          K AJFYR
     A          K AJCASE
     A          K AJSEQ#
