     A*  (C) Copyright Progressive Data Systems, Inc., 1997
     A*
     A*  WORKERS' COMP DEPT LETTERS WORKFILE FOR PDFFORMS
     A*
     A          R PCL01                     PFILE(WDC3P)
     A          K CLCO#
     A          K CLFND
     A          K CLREQ#
     A          K CLDPCD
     A          K CLFLDR
     A          K CLDCID
