     A*  (C) Copyright Progressive Data Systems, Inc., 1994
     A**
     A** WORKERS' COMP EMPLOYER MASTER DETAIL FILE
     H*****************************************************************
     H*  SPECIAL FILE NOTES:                                          *
     H*                                                               *
     H*  THE FOLLOWING FILES/PROGRAMS MUST BE MODIFIED ANYTIME A NEW  *
     H*  FIELD IS ADDED TO WDCNP:                                     *
     H*                                                               *
     H*  - ANY FIELD THAT IS ADDED TO THIS FILE MUST ALSO BE ADDED    *
     H*    TO THE VERSION OF WDCNP IN THE QUOTE LIBRARY               *
     H*                                                               *
     H*  - NEW FIELD MUST BE ADDED TO CORRESPONDING FILES (WDCNP)     *
     H*    IN THE MONTHEND LIBRARY                                    *
     H*                                                               *
     H*  - NEW FIELD MUST BE ADDED TO CORRESPONDING FILES (WDCNP)     *
     H*    IN THE TEST ENVIRONMENT.                                   *
     H*                                                               *
     H*  - CHANGES MAY NEED TO BE MADE TO THE ROLLOVER PROGRAM        *
     H*    (W7820R) TO INITIALIZE THE NEW FIELD UPON ROLLOVER         *
     H*                                                               *
     H*  - EMPLOYER MASTER MAINTENANCE WILL NEED TO BE MODIFIED       *
     H*    TO ALLOW INPUT INTO THE NEW FIELD SO THAT THE USER CAN     *
     H*    ASSIGN THE FIELD A VALUE                                   *
     H*                                                               *
     H*  - RECOMPILE QUOTE TRANSFER PROGRAM (W8700R)                  *
     H*                                                               *
     H*  - AUDIT BILL CHANGES (W7720R, W7700R)                        *
     H*                                                               *
     H*  - ORIGINAL/REVISED BILL CHANGES (W8010R, W7610/20R)          *
     H*                                                               *
     H*  - DAILY BATCH PROGRAM MAY REFER WDCNP IN BASE (WFIL)         *
     H*    SPECIFICALLY IN ANY CPYF FOR MONTHEND,  IF A CLIENT        *
     H*    VERSION IS BEING CREATED CPYF MUST BE CHANGED              *
     H*    ACCORDINGLY                                                *
     H*                                                               *
     H*  - CHANGE OVRDBF COMMANDS IN QUOTE TRANSFER OVERRIDE PGM      *
     H*    (W8700C) TO REFER TO CHANGED FILE IN CORRECT LIBRARY       *
     H*                                                               *
     H*****************************************************************
     A                                      REF(WREFP)
     A          R PCB01                     TEXT('CONTR. BILLING DETAIL FILE')
     A            CBCO#     R               REFFLD(CO#)
     A            CBFND     R               REFFLD(FND)
     A            CBEMP#    R               REFFLD(EMP#)
     A            CBDIV     R               REFFLD(DIV)
     A            CBBLOP    R               REFFLD(FLAG)
     A                                      COLHDG('BILLING PLAN' '(T,F,M,R)')
     A            CBEFDT    R               REFFLD(DT)
     A                                      COLHDG('EFFECTIVE DT')
     A            CBEXDT    R               REFFLD(DT)
     A                                      COLHDG('EXPIRATION DT')
     A            CBLIRT        10  9       COLHDG('LIABILITY RATE')
     A            CBCLAL         9  0       COLHDG('CLAIMS ALLOWANCE')
     A            CBSTAT    R               REFFLD(STAT)
     A            CBUSER    R               REFFLD(USER)
     A                                      COLHDG('MAINT' 'USER')
     A            CBPGM     R               REFFLD(PGM)
     A                                      COLHDG('MAINT' 'PGM')
     A            CBTIME    R               REFFLD(TIME)
     A                                      COLHDG('MAINT' 'TIME')
     A            CBDT      R               REFFLD(DT)
     A                                      COLHDG('MAINT' 'DATE')
     A            CBIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            CBIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            CBITIM    R               REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
