      *
      *  DO NOT ADD ANY MORE FIELDS TO THIS FILE.
      *  MAXIMUM RECORD LENGTH IS CURRENTLY 4027.
      *  IF ANY FIELDS NEED TO BE ADDED, ADD THEM TO WDCLP2.
      *
      *  ================================================================
      *
      * (c) 2011 StoneRiver, Inc. All rights Reserved.
      * StoneRiver is a trademark of StoneRiver, Inc.
      *
      *  WORKERS' COMP CLAIM DEPT LETTERS WORKFILE - FOR SCREEN
      *
      *  11/22/94  C:30  Project:  WC376
      ********************************************************************
      * REVISIONS:                                                       *
     A*                                                                  *
     A* 10/04/11  C:251  PROJECT: 114IAH                                 *
     A*                  Add Darts Key and sequence number               *
     A*                                                                  *
     A* 05/27/03  C:61   PROJECT: WC1088                                 *
     A*                  Add Email addresses                             *
     A*                                                                  *
     A* 11/15/02  C:61   PROJECT: WC1088                                 *
     A*                  Add Email addresses                             *
      *                                                                  *
      * 05/06/99  C:35   PROJECT: WC577                                  *
      *                  ADDED FIELDS FOR AGENT FAX AREA CODE AND PHONE  *
      *                  NUMBER.                                         *
      *                                                                  *
      ********************************************************************
     A                                      REF(WREFP)
     A          R PCL01                     TEXT('CLAIM DEPT LETTER WORK FILE')
      *  KEY INFORMATION
     A            CLCO#     R               REFFLD(CO#)
     A                                      COLHDG('COMPANY' 'NUMBER')
     A            CLFND     R               REFFLD(FND)
     A                                      COLHDG('FUND')
     A            CLFYR     R               REFFLD(FYR)
     A                                      COLHDG('FUND' 'YEAR')
     A            CLFCLM    R               REFFLD(CASE)
     A                                      COLHDG('FROM CLAIM' 'NUMBER')
     A*           CLTCLM    R               REFFLD(CASE)
     A*                                     COLHDG('TO CLAIM' 'NUMBER')
     A            CLREQ#    R               REFFLD(SEQ#)
     A                                      COLHDG('REQUEST #')
     A            CLSEQ#    R               REFFLD(SEQ#)
     A            CLEMP#    R               REFFLD(EMP#)
     A                                      COLHDG('EMPLOYER' 'NUMBER')
     A            CLDIV     R               REFFLD(DIV)
     A                                      COLHDG('DIVISION')
     A*           CLCSST    R               REFFLD(FLAG)
     A*                                     COLHDG('CLAIM STATUS')
     A*           CLLTFL    R               REFFLD(FLAG)
     A*                                     COLHDG('LOST TIME')
     A*
     A*  Selected Documents
     A*
     A            CLDPCD    R               REFFLD(DPCD)
     A                                      COLHDG('DEPT' 'CODE')
     A            CLFLDR    R               REFFLD(FLDR)
     A                                      COLHDG('FOLDER')
     A            CLDCID    R               REFFLD(DCID)
     A                                      COLHDG('DOCUMENT ID')
     A            CL#CPY    R               REFFLD(SEQ#)
     A                                      COLHDG('# OF COPIES')
     A            CLSFLD    R               REFFLD(FLDR)
     A                                      TEXT('SAVE FOLDER NAME')
     A            CLSDOC    R               REFFLD(DCID)
     A                                      TEXT('SAVE DOCUMENT ID')
     A            CLDOVR    R               REFFLD(PGM)
     A                                      TEXT('DOCUMENT OVERLAY OBJECT')
     A*
     A*  COMPANY INFORMATION
     A*
     A            CLCNME    R               REFFLD(NAME)
     A                                      COLHDG('CO NAME')
     A            CLCAD1    R               REFFLD(ADR1)
     A                                      COLHDG('CO ADDR 1')
     A            CLCAD2    R               REFFLD(ADR2)
     A                                      COLHDG('CO ADDR 2')
     A            CLCCSZ    R               REFFLD(DS40)
     A                                      COLHDG('CO CITY/ST/ZIP')
     A            CLCFID    R               REFFLD(FEIN)
     A                                      COLHDG('CO FEIN')
     A*
     A*  FUND INFORMATION
     A*
     A            CLFNME    R               REFFLD(NM60)
     A                                      COLHDG('FND NAME')
     A            CLFSHN    R               REFFLD(NM30)
     A                                      COLHDG('FND SHORT NAME')
     A            CLFMA1    R               REFFLD(ADR1)
     A                                      COLHDG('FND MAIL ADDR 1')
     A            CLFMA2    R               REFFLD(ADR2)
     A                                      COLHDG('FND MAIL ADDR 2')
     A            CLFMCS    R               REFFLD(DS40)
     A                                      COLHDG('FND MAIL CITY/ST/ZIP')
     A            CLFPA1    R               REFFLD(ADR1)
     A                                      COLHDG('FND PHYS ADDR 1')
     A            CLFPA2    R               REFFLD(ADR2)
     A                                      COLHDG('FND PHYS ADDR 2')
     A            CLFPCS    R               REFFLD(DS40)
     A                                      COLHDG('FND PHYS CITY/ST/ZIP')
     A            CLPH1A    R               REFFLD(AREA)
     A                                      COLHDG('FND PHONE 1' 'AREA CD')
     A            CLFPH1    R               REFFLD(PHN#)
     A                                      COLHDG('FND INCOMING PHN #')
     A            CLFARE    R               REFFLD(AREA)
     A                                      COLHDG('FND AREA CODE')
     A            CLFPH2    R               REFFLD(PHN#)
     A                                      COLHDG('FND INCOMING OTHER #')
     A            CLFAXA    R               REFFLD(AREA)
     A                                      COLHDG('FND FAX' 'AREA CD')
     A            CLFAX     R               REFFLD(PHN#)
     A                                      COLHDG('FND FAX PHN#')
     A            CLANAM    R               REFFLD(NM50)
     A                                      COLHDG('FND ALT' 'NAME')
     A            CLAAD1    R               REFFLD(ADR1)
     A                                      COLHDG('FND ALT' 'ADDRESS 1')
     A            CLAAD2    R               REFFLD(ADR2)
     A                                      COLHDG('FND ALT' 'ADDRESS 2')
     A            CLACTY    R               REFFLD(CTY)
     A                                      COLHDG('FND ALT' 'CITY')
     A            CLAST     R               REFFLD(ST)
     A                                      COLHDG('FND ALT' 'STATE')
     A            CLAZIP    R               REFFLD(ZIP)
     A                                      COLHDG('FND ALT' 'ZIP CODE')
     A            CLIADR    R               REFFLD(ADR1)
     A                                      COLHDG('INTERNET' 'ADDRESS')
     A*  FUND AUXILIARY INFORMATION
     A            CLFUN1    R               REFFLD(DS30)
     A                                      COLHDG('FND USER NAME 1')
     A            CLFUN2    R               REFFLD(DS30)
     A                                      COLHDG('FND USER NAME 2')
     A            CLFUN3    R               REFFLD(DS30)
     A                                      COLHDG('FND USER NAME 3')
     A            CLFUN4    R               REFFLD(DS30)
     A                                      COLHDG('FND USER NAME 4')
     A            CLFUN5    R               REFFLD(DS30)
     A                                      COLHDG('FND USER NAME 5')
     A            CLFUN6    R               REFFLD(DS30)
     A                                      COLHDG('FND USER NAME 6')
     A            CLFUN7    R               REFFLD(DS30)
     A                                      COLHDG('FND USER NAME 7')
     A*  EMPLOYER INFORMATION
     A            CLEEMP    R               REFFLD(EMP#)
     A                                      COLHDG('EMPLR#')
     A            CLEDIV    R               REFFLD(DIV)
     A                                      COLHDG('EMPLR DIV')
     A            CLENME    R               REFFLD(NAME)
     A                                      COLHDG('EMPLR NAME')
     A            CLEMA1    R               REFFLD(ADR1)
     A                                      COLHDG('EMPLR MAIL ADDR 1')
     A            CLEMA2    R               REFFLD(ADR2)
     A                                      COLHDG('EMPLR MAIL ADDR 2')
     A            CLEMCS    R               REFFLD(DS40)
     A                                      COLHDG('EMP MAIL CITY/ST/ZIP')
     A            CLEPA1    R               REFFLD(ADR1)
     A                                      COLHDG('EMPLR PHYS ADDR 1')
     A            CLEPA2    R               REFFLD(ADR2)
     A                                      COLHDG('EMPLR PHYS ADDR 2')
     A            CLEPCS    R               REFFLD(DS40)
     A                                      COLHDG('EMP PHYS CITY/ST/ZIP')
     A            CLEARE    R               REFFLD(AREA)
     A                                      COLHDG('EMPLR AREA CODE')
     A            CLEPH#    R               REFFLD(PHN#)
     A                                      COLHDG('EMPLR PHONE #')
     A            CLEFXA    R               REFFLD(AREA)
     A                                      COLHDG('EMP FAX' 'AREA CODE')
     A            CLEFX#    R               REFFLD(PHN#)
     A                                      COLHDG('EMP FAX #')
     A            CLERGN    R               REFFLD(RGN#)
     A                                      COLHDG('EMPLR REGION')
     A            CLERGD    R               REFFLD(DS40)
     A                                      COLHDG('EMPLR REGION' 'DESC')
     A            CLEFID    R               REFFLD(FEIN)
     A                                      COLHDG('EMPLR FEDERAL ID')
     A            CLECNT    R               REFFLD(NAME)
     A                                      COLHDG('EMPLR CONTACT')
     A            CLEATT    R               REFFLD(NAME)
     A                                      COLHDG('EMPLR ATTENTION NAME')
     A            CLCNT3    R               REFFLD(NAME)
     A                                      COLHDG('EMP CONTACT' '3')
     A            CLEDBA    R               REFFLD(NAME)
     A                                      TEXT('EMP FEDERAL NAME')
     A            CLECM1    R               REFFLD(NM60)
     A                                      COLHDG('EMPLR SPEC INSTRUC 1')
     A            CLECM2    R               REFFLD(NM60)
     A                                      COLHDG('EMPLR SPEC INSTRUC 2')
     A            CLECM3    R               REFFLD(NM60)
     A                                      COLHDG('EMPLR SPEC INSTRUC 3')
     A            CLESEM    R               REFFLD(RISK#)
     A                                      COLHDG('EMPLR ST EMPLR#')
     A            CLECTY    R               REFFLD(CODE)
     A                                      COLHDG('EMPLR COUNTY CODE')
     A            CLECTD    R               REFFLD(DS40)
     A                                      COLHDG('EMPLR COUNTY' 'CODE DESC')
     A            CLECHP    R               REFFLD(RGN#)
     A                                      COLHDG('EMPLR CHAPTER')
     A            CLECHD    R               REFFLD(DS40)
     A                                      COLHDG('EMPLR CHAPTER' 'DESC')
     A            CLUWNC    R               REFFLD(STAF)
     A                                      TEXT('UNDERWRITER"S CODE')
     A            CLUWNM    R               REFFLD(NM50)
     A                                      TEXT('UNDERWRITER"S NAME')
     A            CLUWNX    R               REFFLD(PHN2)
     A                                      TEXT('UNDERWRITER"S EXT')
     A            CLLREP    R               REFFLD(STAF)
     A                                      COLHDG('LOSS CONTROL REP' +
     A                                      'STAFF CD')
     A            CLLREN    R               REFFLD(NAME)
     A                                      COLHDG('LOSS CONTROL REP' +
     A                                      'NAME')
     A            CLLREX    R               REFFLD(PHN2)
     A                                      COLHDG('LOSS CONTROL REP' +
     A                                      'STAFF CD EXT')
     A            CLSIC     R               REFFLD(SIC)
     A                                      COLHDG('SIC CODE')
     A            CLSICD    R               REFFLD(DS40)
     A                                      COLHDG('SIC CODE DESC')
     A            CLEFDT    R               REFFLD(DT8)
     A                                      COLHDG('EFFECTIVE' 'DATE')
     A            CLCADT    R               REFFLD(DT8)
     A                                      COLHDG('CANCELLATION' 'DATE')
     A*  EMPLOYER DETAIL INFORMATION
     A            CLEEAP    R               REFFLD(A112)
     A                                      COLHDG('EMP EST ANNUAL PRM')
     A            CLEPFD    R               REFFLD(DT8)
     A                                      COLHDG('POLICY FROM DATE')
     A            CLEPTD    R               REFFLD(DT8)
     A                                      COLHDG('POLICY TO DATE')
     A            CLEPRF    R               REFFLD(A53)
     A                                      COLHDG('EMPLR PRORATA FACTOR')
     A*  AGENT MASTER INFORMATION
     A            CLANME    R               REFFLD(NAME)
     A                                      COLHDG('AGENT NAME')
     A            CLAMA1    R               REFFLD(ADR1)
     A                                      COLHDG('AGENT MAIL ADDR 1')
     A            CLAMCS    R               REFFLD(DS40)
     A                                      COLHDG('AGT MAIL CITY/ST/ZIP')
     A            CLAPA1    R               REFFLD(ADR1)
     A                                      COLHDG('AGENT PHYS ADDR 1')
     A            CLAPCS    R               REFFLD(DS40)
     A                                      COLHDG('AGT PHYS CITY/ST/ZIP')
     A            CLAAR1    R               REFFLD(AREA)
     A                                      COLHDG('AGENT AREA CODE 1')
     A            CLAPH1    R               REFFLD(PHN#)
     A                                      COLHDG('AGENT PHONE 1')
     A            CLAAR2    R               REFFLD(AREA)
     A                                      COLHDG('AGENT AREA CODE 2')
     A            CLAPH2    R               REFFLD(PHN#)
     A                                      COLHDG('AGENT PHONE 2')
     A            CLASEC    R               REFFLD(NAME)
     A                                      COLHDG('AGENT SECRETARY')
     A            CLACNT    R               REFFLD(NAME)
     A                                      COLHDG('AGT MARKETING CNTCT')
     A            CLACM1    R               REFFLD(NM60)
     A                                      COLHDG('AGENT COMMENTS 1')
     A            CLACM2    R               REFFLD(NM60)
     A                                      COLHDG('AGENT COMMENTS 2')
     A*  AGENT ASSIGNMENT INFORMATION
     A            CLAFID    R               REFFLD(FEIN)
     A                                      COLHDG('AGENT FEDERAL ID')
     A            CLAMOD    R               REFFLD(MOD)
     A                                      COLHDG('AGENT MODIFIER')
     A*  AGENT HISTORY INFORMATION
     A            CLAAGT    R               REFFLD(AGT#)
     A                                      COLHDG('AGT #')
     A            CLAEFD    R               REFFLD(DT8)
     A                                      COLHDG('AGENT EFFECTIVE DATE')
     A            CLAPRO    R               REFFLD(AGT#)
     A*  CLAIMANT INFORMATION
     A            CLCLNM    R               REFFLD(NAME)
     A                                      COLHDG('CLAIMANT NAME')
     A            CLLAD1    R               REFFLD(ADR1)
     A                                      COLHDG('CLAIMANT ADDR 1')
     A            CLLAD2    R               REFFLD(ADR2)
     A                                      COLHDG('CLAIMANT ADDR 2')
     A            CLLCSZ    R               REFFLD(DS40)
     A                                      COLHDG('CLAIMANT CITY/ST/ZIP')
     A            CLSS#     R               REFFLD(SS#)
     A                                      COLHDG('CLAIMANT SS#')
     A            CLDTOB    R               REFFLD(DT8)
     A                                      COLHDG('CLMNT DATE OF BIRTH')
     A            CLAREA    R               REFFLD(A30)
     A                                      COLHDG('AREA' 'CODE')
     A            CLPHN#    R               REFFLD(PHN#)
     A                                      COLHDG('PHONE#')
     A            CLMSTS    R               REFFLD(FLAG)
     A                                      COLHDG('MARITAL' 'STATUS')
     A            CLMSTD    R               REFFLD(DS40)
     A                                      COLHDG('MARITAL' 'STATUS DESC')
     A            CLCNTY    R               REFFLD(DS10)
     A                                      COLHDG('COUNTY' 'CODE')
     A            CLCNTD    R               REFFLD(DS40)
     A                                      COLHDG('COUNTY' 'CODE DESC')
     A            CLWARA    R               REFFLD(A30)
     A                                      COLHDG('WORK AREA' 'CODE')
     A            CLWPH#    R               REFFLD(PHN#)
     A                                      COLHDG('WORK' 'PHONE#')
     A            CLACDT    R               REFFLD(DT8)
     A                                      COLHDG('ACCIDENT DATE')
     A            CLCLAS    R               REFFLD(CLAS)
     A                                      COLHDG('CLASS CODE')
     A            CLCLDS    R               REFFLD(DS30)
     A                                      COLHDG('CLASS' 'DESCRIPTION')
     A            CLSPEC    R               REFFLD(FLAG)
     A                                      COLHDG('PAYROLL CLS' 'SPEC DESG')
     A            CLAWW     R               REFFLD(A72)
     A                                      COLHDG('AVERAGE WEEKLY WAGE')
     A            CLACTM    R               REFFLD(TIME)
     A                                      COLHDG('ACCIDENT TIME')
     A            CLDTRP    R               REFFLD(DT8)
     A                                      COLHDG('DATE REPORTED')
     A            CLDTLW    R               REFFLD(DT8)
     A                                      COLHDG('DATE LAST WORKED')
     A            CLRTDT    R               REFFLD(DT8)
     A                                      COLHDG('RETURN TO WORK DATE')
     A            CLACDS    R               REFFLD(NM60)
     A                                      COLHDG('ACCIDENT DESCRIPTION')
     A            CLCLLT    R               REFFLD(FLAG)
     A                                      COLHDG('CLM LT' 'FLAG')
      *
     A            CLACL#    R               REFFLD(DS25)
     A                                      COLHDG('AGENCY CLAIM#')
     A            CLESPV    R               REFFLD(DS20)
     A                                      COLHDG('EMPLOYMENT SUPV NAME')
     A            CLECS#    R               REFFLD(DS10)
     A                                      COLHDG('EMPLOYER CLAIM#')
     A            CLOCDS    R               REFFLD(DS40)
     A                                      COLHDG('OCCUPATION DESC')
     A            CLOCCD    R               REFFLD(DS10)
     A                                      COLHDG('OCCUPATION CODE')
     A            CLOCCE    R               REFFLD(DS40)
     A                                      COLHDG('OCCUPATION' 'CODE DESC')
     A            CLDEPT    R               REFFLD(DS10)
     A                                      COLHDG('DEPARTMENT')
     A            CLDEPD    R               REFFLD(DS40)
     A                                      COLHDG('DEPARTMENT' 'DESC')
     A            CLHIDT    R               REFFLD(DT8)
     A                                      COLHDG('HIRE DATE')
     A            CLESTS    R               REFFLD(CODE)
     A                                      COLHDG('EMPLOYMENT STATUS')
     A            CLESTD    R               REFFLD(DS40)
     A                                      COLHDG('EMPLOYMENT' 'STATUS DESC')
     A            CLSHFT    R               REFFLD(FLAG)
     A                                      COLHDG('SHIFT')
     A            CLSHFD    R               REFFLD(DS40)
     A                                      COLHDG('SHIFT' 'DESC')
     A            CLACD2    R               REFFLD(DS60)
     A                                      COLHDG('ACC DESC 2')
     A            CLAMAN    R               REFFLD(STAF)
     A                                      COLHDG('ACCOUNT MGR')
     A            CLAMNA    R               REFFLD(NM30)
     A                                      COLHDG('ACCT MGR NAME')
     A            CLAMAX    R               REFFLD(PHN2)
     A                                      COLHDG('ACCT MGR EXT')
     A            CLNRSE    R               REFFLD(DS3)
     A                                      COLHDG('CASE NURSE')
     A            CLNRSN    R               REFFLD(NM30)
     A                                      COLHDG('NURSE NAME')
     A            CLNRSX    R               REFFLD(PHN2)
     A                                      COLHDG('NURSE EXT')
     A            CLDNY     R               REFFLD(FLAG)
     A                                      COLHDG('CLAIM DENIED')
     A            CLCVFL    R               REFFLD(FLAG)
     A                                      COLHDG('CONTROVERT FLAG')
     A            CLSUBR    R               REFFLD(FLAG)
     A                                      COLHDG('SUBROGATE FLAG')
     A            CLACQR    R               REFFLD(FLAG)
     A                                      COLHDG('ACQUIRED')
     A            CLSDF     R               REFFLD(FLAG)
     A                                      COLHDG('SDF FLAG')
     A            CLMCO     R               REFFLD(FLAG)
     A                                      COLHDG('MANAGED CARE')
     A            CLMCTP    R               REFFLD(CODE)
     A                                      COLHDG('MC ORGANIZATION TYPE')
     A            CLMCOD    R               REFFLD(DS40)
     A                                      COLHDG('MC ORGANIZATION DESC')
     A            CLPHYF    R               REFFLD(FEIN)
     A                                      COLHDG('PHY FEIN')
     A            CLPHYM    R               REFFLD(MOD)
     A                                      COLHDG('PHY MOD')
     A            CLPHYN    R               REFFLD(NAME)
     A                                      COLHDG('PHYSICIAN NAME')
     A            CLPHYA    R               REFFLD(ADR1)
     A                                      COLHDG('PHYSICIAN ADDRESS')
     A            CLPHYC    R               REFFLD(CTY)
     A                                      COLHDG('PHYSICIAN CITY')
     A            CLPHYS    R               REFFLD(ST)
     A                                      COLHDG('PHYSICIAN STATE')
     A            CLPHYZ    R               REFFLD(ZIP)
     A                                      COLHDG('PHYSICIAN ZIP')
     A            CLPHYR    R               REFFLD(AREA)
     A                                      COLHDG('PHYSICIAN AREA CODE')
     A            CLPHYP    R               REFFLD(PHN#)
     A                                      COLHDG('PHYSICIAN PHONE#')
     A            CLHOSF    R               REFFLD(FEIN)
     A                                      COLHDG('HOSPITAL FEIN')
     A            CLHOSM    R               REFFLD(MOD)
     A                                      COLHDG('HOSPITAL MOD')
     A            CLHOSN    R               REFFLD(NAME)
     A                                      COLHDG('HOSPITAL NAME')
     A            CLHOSA    R               REFFLD(ADR1)
     A                                      COLHDG('HOSPITAL ADDRESS')
     A            CLHOSC    R               REFFLD(CTY)
     A                                      COLHDG('HOSPITAL CITY')
     A            CLHOSS    R               REFFLD(ST)
     A                                      COLHDG('HOSPITAL STATE')
     A            CLHOSZ    R               REFFLD(ZIP)
     A                                      COLHDG('HOSPITAL ZIP')
     A            CLHOSR    R               REFFLD(AREA)
     A                                      COLHDG('HOSPITAL AREA CODE')
     A            CLHOSP    R               REFFLD(PHN#)
     A                                      COLHDG('HOSPITAL PHONE#')
     A            CLITRT    R               REFFLD(CODE)
     A                                      COLHDG('INITIAL TREATMENT')
     A            CLITRD    R               REFFLD(DS40)
     A                                      COLHDG('INITIAL TREATMENT' 'DESC')
     A            CLSGDT    R               REFFLD(DT8)
     A                                      COLHDG('SURGERY DATE')
     A            CLRLW     R               REFFLD(DT8)
     A                                      COLHDG('RELEASED' 'TO WORK DT')
     A            CLMMI     R               REFFLD(DT8)
     A                                      COLHDG('FINAL MMI DT')
     A            CLIPCT    R               REFFLD(PC52)
     A                                      COLHDG('PERCENT IMPAIRMENT')
     A            CLODIS    R               REFFLD(FLAG)
     A                                      COLHDG('OCCUPATIONAL DISEASE')
     A            CLYRLX    R               REFFLD(YR4)
     A                                      COLHDG('YEAR LAST EXPOSED')
     A            CLHCAP    R               REFFLD(FLAG)
     A                                      COLHDG('HANDICAP CLAIM')
     A            CLDTH     R               REFFLD(FLAG)
     A                                      COLHDG('DEATH CLAIM')
     A            CLDOD     R               REFFLD(DT8)
     A                                      COLHDG('DATE OF DEATH')
     A            CLPOI     R               REFFLD(FLAG)
     A                                      COLHDG('FULL WAGE PAID' 'ON INJ DT')
     A            CLFSAL    R               REFFLD(FLAG)
     A                                      COLHDG('FULL SALARY CONT')
     A            CLFSDT    R               REFFLD(DT8)
     A                                      COLHDG('FULL SALARY' 'PAID THRU')
     A            CLPRWW    R               REFFLD(A72)
     A                                      COLHDG('PRE INJ WEEKLY WAGE')
     A            CLWMTH    R               REFFLD(CODE)
     A                                      COLHDG('METHOD DETERMINING' 'PRE +
     A                                          INJ WAGE')
     A            CLWMTD    R               REFFLD(DS40)
     A                                      COLHDG('METHOD DETERMINING' 'PRE +
     A                                          INJ WAGE' 'DESC')
     A            CLPOWW    R               REFFLD(A72)
     A                                      COLHDG('POST INJ WEEKLY WAGE')
     A            CLCRT     R               REFFLD(A72)
     A                                      COLHDG('COMP RATE')
     A            CLWGPD    R               REFFLD(FLAG)
     A                                      COLHDG('WAGE PERIOD')
     A            CLWGPE    R               REFFLD(DS40)
     A                                      COLHDG('WAGE PERIOD' 'DESC')
     A            CLDBDT    R               REFFLD(DT8)
     A                                      COLHDG('DISABILITY DATE')
     A            CLRLWK    R               REFFLD(DT8)
     A                                      COLHDG('RELEASED TO WORK')
     A            CLERTW    R               REFFLD(DT8)
     A                                      COLHDG('ESTIMATED RTW DATE')
     A            CLRTW     R               REFFLD(DT8)
     A                                      COLHDG('ACTUAL RTW DATE')
     A*
     A*   MAINTENANCE INFORMATION
     A*
     A            CLSTAT    R               REFFLD(STAT)
     A            CLUSER    R               REFFLD(USER)
     A            CLPGM     R               REFFLD(PGM)
     A            CLTIME    R               REFFLD(TIME)
     A            CLDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            CLIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            CLIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PGM')
     A            CLITIM    R               REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
     A            CLIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'ENTRY' 'DATE')
     A            CLOUTQ    R               REFFLD(OUTQ)
     A                                      COLHDG('DOCUMENT' 'OUTPUT QUEUE')
      **** BEGIN ADD **** 05/06/99 *********************************************
     A            CLAARF    R               REFFLD(AREA)
     A                                      COLHDG('AGENT FAX' 'AREA CODE')
     A            CLAPHF    R               REFFLD(PHN#)
     A                                      COLHDG('AGENT FAX' 'PHONE NUMBER')
      **** END   ADD **** 05/06/99 *********************************************
     A******* BEG ADD **** 11/15/02 **************************************
      *                                                                ***
     A            CLUPEM    R               REFFLD(DS60)
     A                                      COLHDG('USER EMAIL')
      *                                                                ***
     A            CLEMEM    R               REFFLD(DS60)
     A                                      COLHDG('EMPLOYER EMAIL')
      *                                                                ***
     A            CLAGEM    R               REFFLD(DS60)
     A                                      COLHDG('AGENT EMAIL')
      *                                                                ***
     A            CLAPEM    R               REFFLD(DS60)
     A                                      COLHDG('PRODUCER EMAIL')
      *                                                                ***
     A            CLC1EM    R               REFFLD(DS60)
     A                                      COLHDG('EMPLOYER PRIMARY' +
     A                                      'CONTACT #1 EMAIL')
      *                                                                ***
     A            CLC2EM    R               REFFLD(DS60)
     A                                      COLHDG('EMPLOYER PRIMARY' +
     A                                      'CONTACT #2 EMAIL')
      *                                                                ***
     A            CLC3EM    R               REFFLD(DS60)
     A                                      COLHDG('EMPLOYER PRIMARY' +
     A                                      'CONTACT #3 EMAIL')
      *                                                                ***
     A******* END ADD **** 11/15/02 **************************************
     A******* BEG ADD **** 05/27/03 **************************************
      *                                                                ***
     A            CLUWEM    R               REFFLD(DS60)
     A                                      COLHDG('UNDERWRITER' +
     A                                      'EMAIL')
      *                                                                ***
     A            CLLREM    R               REFFLD(DS60)
     A                                      COLHDG('LOSS CONTROL' +
     A                                      'REP EMAIL')
      *                                                                ***
     A            CLAMEM    R               REFFLD(DS60)
     A                                      COLHDG('ACCOUNT MGR' +
     A                                      'EMAIL')
      *                                                                ***
     A******* END ADD **** 05/27/03 **************************************
     A*** Beg Add **** 10/04/11 ******************************************
      *                                                                ***
     A            CLDKEY    R               REFFLD(DS40)
     A                                      COLHDG('DARTS Key')
      *                                                                ***
     A            CLDSQ#    R     S         REFFLD(A50)
     A                                      COLHDG('DARTS Sequence' +
     A                                      'Number')
      *                                                                ***
     A*** End Add **** 10/04/11 ******************************************
