     A* ** ======================================================= **
      * (c) 2009 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*                                                              *
     A*     MEDICARE 2ND PAY DATA ERROR DETAIL FILE                  *
     A*                                                              *
     A*    06/12/09  C:33   PROJECT: WC1819                          *
     A*                                                              *
     A*                                                              *
     A** ========================================================= **
     A* REVISIONS:                                                   *
     A*                                                              *
     A*                                                              *
     A** ========================================================= **
     A          R PE501                     PFILE(WDE5P)
     A          K E5CO#
     A          K E5FND
     A          K E5FYR
     A          K E5CASE
     A          K E5EXDT
     A          K E5CODE
