      * (c) 2015 StoneRiver, Inc. All rights Reserved.
      * StoneRiver is a trademark of StoneRiver, Inc.
      *
      *  WORKERS' COMPENSATION EMPLOYER A/R BATCH FILE
      *
     A          R PEA01                     PFILE(WDEAP)
     A          K EACO#
     A          K EASTAT
     A          K EAFND
     A          K EAEMP#
     A          K EADIV
     A          K EAFYR
     A          K EAPODT
