      * (c) 2024 Sapiens. All Rights Reserved.                             *
     A*
     A** EMPLOYER DETAIL HISTORY FILE
     A*
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A* 08/14/24  C:291 PROJECT: WC2974                               *
     A*                 Add fields for Balance to Increased Limit     *
     A*                 Minimum.                                      *
     A*                                                               *
     A* 02/27/24  C:333 PROJECT: WC2953                               *
     A*                 PREMIUM HISTORY BALANCE TO MINIMUM.           *
     A*                                                               *
     A* 01/29/19 C:291 Project: WC2206                                *
     A*                Add Exp Mod 1 Not Rated                        *
     A*                                                               *
     A* 02/01/18 C:136 Project: 148WAH                                *
     A*                Add fields for Policy Fee                      *
     A*                                                               *
     A* 09/14/16 C:136 Project: WC2070                                *
     A*                Add new fields for Audit Noncompliance         *
     A*                                                               *
     A* 04/27/16 C:306 Project: WC2424                                *
     A*                Adding new fields for Experience Modifiers -   *
     A*                Not Final status                               *
     A*                                                               *
     A* 04/19/16 C:242 Project: WC2069                                *
     A*                Add Billing Fees to Premium History            *
     A*                                                               *
     A* 07/13/11 C:061 PROJECT WC2037
     A*                Add fields:
     A*                 -Unearned premium surcharge written amount
     A*                 -Unearned premium surcharge written change
     A*                  amount
     A*
     A* 12/17/10  C:255  PROJECT: 71WLD                                    *
     A*                  1) Added new fields for Estimated and Audited     *
     A*                     non premium.                                   *
     A*                  2) Corrected order of fields to make it compatible*
     A*                     with WDEHP.                                    *
     A*                                                                    *
     A* 11/10/10  C:65   PROJECT: 139WPL                                   *
     A*                  Added new fields for HCN CREDIT.                  *
     A*                                                                    *
     A* 11/09/10  C:65   PROJECT: SUPPORT                                  *
     A*                  Added MISSING FIELDS FROM WDEHP.                  *
     A*                                                                    *
     A* 06/21/10 C:255 PROJECT:  114WVY                                    *
     A*                  Add new fields by renaming fields of Empl-        *
     A*                  oyer detail history file for split deviations     *
     A*                                                                    *
     A**********************************************************************
     A                                      FIFO
     A          R PEQ01                     PFILE(WDEHP)
     A            EQCO#                     RENAME(EHCO#)
     A            EQFND                     RENAME(EHFND)
     A            EQFYR                     RENAME(EHFYR)
     A            EQEMP#                    RENAME(EHEMP#)
     A            EQDIV                     RENAME(EHDIV)
     A            EQEFDT                    RENAME(EHEFDT)
     A            EQTRDT                    RENAME(EHTRDT)
     A            EQFAF                     RENAME(EHFAF)
     A            EQBSCD                    RENAME(EHBSCD)
     A            EQPFDT                    RENAME(EHPFDT)
     A            EQPTDT                    RENAME(EHPTDT)
     A            EQANDT                    RENAME(EHANDT)
     A            EQPROR                    RENAME(EHPROR)
     A            EQWMPR                    RENAME(EHWMPR)
     A            EQXMPR                    RENAME(EHXMPR)
     A            EQIMPR                    RENAME(EHIMPR)
     A            EQJMPR                    RENAME(EHJMPR)
     A            EQWSPR                    RENAME(EHWSPR)
     A            EQXSPR                    RENAME(EHXSPR)
     A            EQISPR                    RENAME(EHISPR)
     A            EQJSPR                    RENAME(EHJSPR)
     A            EQWNMP                    RENAME(EHWNMP)
     A            EQXNMP                    RENAME(EHXNMP)
     A            EQINMP                    RENAME(EHINMP)
     A            EQJNMP                    RENAME(EHJNMP)
     A            EQWAPR                    RENAME(EHWAPR)
     A            EQXAPR                    RENAME(EHXAPR)
     A            EQIAPR                    RENAME(EHIAPR)
     A            EQJAPR                    RENAME(EHJAPR)
     A            EQWMNP                    RENAME(EHWMNP)
     A            EQIMNP                    RENAME(EHIMNP)
     A            EQPRTD                    RENAME(EHPRTD)
     A            EQASP1                    RENAME(EHASP1)
     A            EQCREF                    RENAME(EHCREF)
     A            EQCREX                    RENAME(EHCREX)
     A            EQWDC1                    RENAME(EHWDC1)
     A            EQXDC1                    RENAME(EHXDC1)
     A            EQIDC1                    RENAME(EHIDC1)
     A            EQJDC1                    RENAME(EHJDC1)
     A            EQASP2                    RENAME(EHASP2)
     A            EQDVEF                    RENAME(EHDVEF)
     A            EQDVEX                    RENAME(EHDVEX)
     A            EQWDC2                    RENAME(EHWDC2)
     A            EQXDC2                    RENAME(EHXDC2)
     A            EQIDC2                    RENAME(EHIDC2)
     A*** BEGIN DEL ***  12/17/10  ************************************
     A*** BEG ADD ***** 06/21/10 ******************************************
     A*********** EQD1W2                    RENAME(EHD1W2)
     A*********** EQD2W2                    RENAME(EHD2W2)
     A*********** EQD1I2                    RENAME(EHD1I2)
     A*********** EQD2I2                    RENAME(EHD2I2)
     A*** END ADD ***** 06/21/10 ******************************************
     A*** END   DEL ***  12/17/10  ************************************
     A            EQJDC2                    RENAME(EHJDC2)
     A            EQASP3                    RENAME(EHASP3)
     A            EQDISC                    RENAME(EHDISC)
     A            EQWDC3                    RENAME(EHWDC3)
     A            EQXDC3                    RENAME(EHXDC3)
     A            EQIDC3                    RENAME(EHIDC3)
     A            EQJDC3                    RENAME(EHJDC3)
     A            EQEXM1                    RENAME(EHEXM1)
     A            EQEMD1                    RENAME(EHEMD1)
     A            EQWXP1                    RENAME(EHWXP1)
     A            EQXXP1                    RENAME(EHXXP1)
     A            EQIXP1                    RENAME(EHIXP1)
     A            EQJXP1                    RENAME(EHJXP1)
     A            EQEXM2                    RENAME(EHEXM2)
     A            EQEMD2                    RENAME(EHEMD2)
     A            EQWXP2                    RENAME(EHWXP2)
     A            EQXXP2                    RENAME(EHXXP2)
     A            EQIXP2                    RENAME(EHIXP2)
     A            EQJXP2                    RENAME(EHJXP2)
     A            EQEXM3                    RENAME(EHEXM3)
     A            EQEMD3                    RENAME(EHEMD3)
     A            EQWXP3                    RENAME(EHWXP3)
     A            EQXXP3                    RENAME(EHXXP3)
     A            EQIXP3                    RENAME(EHIXP3)
     A            EQJXP3                    RENAME(EHJXP3)
     A            EQILCD                    RENAME(EHILCD)
     A            EQILEF                    RENAME(EHILEF)
     A            EQILEX                    RENAME(EHILEX)
     A            EQWIN1                    RENAME(EHWIN1)
     A            EQXIN1                    RENAME(EHXIN1)
     A            EQIIN1                    RENAME(EHIIN1)
     A            EQJIN1                    RENAME(EHJIN1)
     A            EQDCDE                    RENAME(EHDCDE)
     A            EQDDCT                    RENAME(EHDDCT)
     A            EQCXBL                    RENAME(EHCXBL)
     A            EQDCEF                    RENAME(EHDCEF)
     A            EQDCEX                    RENAME(EHDCEX)
     A            EQWDCT                    RENAME(EHWDCT)
     A            EQXDCT                    RENAME(EHXDCT)
     A            EQIDCT                    RENAME(EHIDCT)
     A            EQJDCT                    RENAME(EHJDCT)
     A            EQASPM                    RENAME(EHASPM)
     A            EQMCEF                    RENAME(EHMCEF)
     A            EQMCEX                    RENAME(EHMCEX)
     A            EQWDCM                    RENAME(EHWDCM)
     A            EQXDCM                    RENAME(EHXDCM)
     A            EQIDCM                    RENAME(EHIDCM)
     A            EQJDCM                    RENAME(EHJDCM)
     A            EQASPS                    RENAME(EHASPS)
     A            EQSCEF                    RENAME(EHSCEF)
     A            EQSCEX                    RENAME(EHSCEX)
     A            EQWDCS                    RENAME(EHWDCS)
     A            EQXDCS                    RENAME(EHXDCS)
     A            EQIDCS                    RENAME(EHIDCS)
     A            EQJDCS                    RENAME(EHJDCS)
     A            EQRTCD                    RENAME(EHRTCD)
     A            EQSTAT                    RENAME(EHSTAT)
     A            EQUSER                    RENAME(EHUSER)
     A            EQPGM                     RENAME(EHPGM)
     A            EQTIME                    RENAME(EHTIME)
     A            EQDT                      RENAME(EHDT)
     A            EQIUSR                    RENAME(EHIUSR)
     A            EQIDT                     RENAME(EHIDT)
     A            EQDBCR                    RENAME(EHDBCR)
     A            EQWDCR                    RENAME(EHWDCR)
     A            EQXDCR                    RENAME(EHXDCR)
     A            EQIDCR                    RENAME(EHIDCR)
     A            EQJDCR                    RENAME(EHJDCR)
     A            EQWDC                     RENAME(EHWDC)
     A            EQXDC                     RENAME(EHXDC)
     A            EQIDC                     RENAME(EHIDC)
     A            EQJDC                     RENAME(EHJDC)
     A            EQWSBJ                    RENAME(EHWSBJ)
     A            EQXSBJ                    RENAME(EHXSBJ)
     A            EQISBJ                    RENAME(EHISBJ)
     A            EQJSBJ                    RENAME(EHJSBJ)
     A            EQWMPM                    RENAME(EHWMPM)
     A            EQXMPM                    RENAME(EHXMPM)
     A            EQIMPM                    RENAME(EHIMPM)
     A            EQJMPM                    RENAME(EHJMPM)
     A            EQWFRS                    RENAME(EHWFRS)
     A            EQXFRS                    RENAME(EHXFRS)
     A            EQIFRS                    RENAME(EHIFRS)
     A            EQJFRS                    RENAME(EHJFRS)
     A            EQDEV2                    RENAME(EHDEV2)
     A            EQWDV2                    RENAME(EHWDV2)
     A            EQXDV2                    RENAME(EHXDV2)
     A            EQIDV2                    RENAME(EHIDV2)
     A            EQJDV2                    RENAME(EHJDV2)
     A*** BEG ADD ***** 12/16/97 ***********************************************
     A            EQD2EF                    RENAME(EHD2EF)
     A            EQD2EX                    RENAME(EHD2EX)
     A            EQSDEF                    RENAME(EHSDEF)
     A            EQSDEX                    RENAME(EHSDEX)
     A            EQRWFL                    RENAME(EHRWFL)
     A            EQRWDT                    RENAME(EHRWDT)
     A            EQTXPR                    RENAME(EHTXPR)
     A            EQLFEF                    RENAME(EHLFEF)
     A            EQAVCC                    RENAME(EHAVCC)
     A            EQWIN2                    RENAME(EHWIN2)
     A            EQXIN2                    RENAME(EHXIN2)
     A            EQIIN2                    RENAME(EHIIN2)
     A            EQJIN2                    RENAME(EHJIN2)
     A*** END ADD ***** 12/16/97 ***********************************************
     A*** BEGIN ADD ***  12/17/10  ************************************
     A            EQI2CD    R               RENAME(EHI2CD)
     A            EQI2EF    R               RENAME(EHI2EF)
     A            EQI2EX    R               RENAME(EHI2EX)
     A            EQFAF2    R               RENAME(EHFAF2)
     A*** END ADD *****  12/17/10  ************************************
     A*** BEGIN ADD ***  06/16/99  ************************************
     A            EQWVPC                    RENAME(EHWVPC)
     A            EQFWAT                    RENAME(EHFWAT)
     A            EQWMIN                    RENAME(EHWMIN)
     A            EQWWAV                    RENAME(EHWWAV)
     A            EQXWAV                    RENAME(EHXWAV)
     A            EQIWAV                    RENAME(EHIWAV)
     A            EQJWAV                    RENAME(EHJWAV)
     A            EQWADL                    RENAME(EHWADL)
     A            EQXADL                    RENAME(EHXADL)
     A            EQIADL                    RENAME(EHIADL)
     A            EQJADL                    RENAME(EHJADL)
     A*** END ADD *****  06/16/99  ************************************
      **** BEGIN ADD **** 08/12/99 *********************************************
     A            EQWBDC                    RENAME(EHWBDC)
     A            EQXBDC                    RENAME(EHXBDC)
     A            EQIBDC                    RENAME(EHIBDC)
     A            EQJBDC                    RENAME(EHJBDC)
     A            EQWTDC                    RENAME(EHWTDC)
     A            EQXTDC                    RENAME(EHXTDC)
     A            EQITDC                    RENAME(EHITDC)
     A            EQJTDC                    RENAME(EHJTDC)
      **** END   ADD **** 08/12/99 *********************************************
      **** BEGIN ADD **** 05/11/00 *********************************************
     A            EQREVF                    RENAME(EHREVF)
      **** END   ADD **** 05/11/00 *********************************************
      **** BEGIN ADD **** 04/04/01 *********************************************
     A            EQNWRW                    RENAME(EHNWRW)
      **** END ADD ****** 04/04/01 *********************************************
      **** BEG ADD ****** 10/01/01 *********************************************
     A            EQWLOS                    RENAME(EHWLOS)
     A            EQXLOS                    RENAME(EHXLOS)
     A            EQILOS                    RENAME(EHILOS)
     A            EQJLOS                    RENAME(EHJLOS)
      **** END ADD ****** 10/01/01 *********************************************
     A*** BEG ADD ***** 12/17/10 ******************************************
     A            EQPRTF                    RENAME(EHPRTF)
     A            EQWVFL                    RENAME(EHWVFL)
     A*** END ADD ***** 12/17/10 ******************************************
      **** BEG ADD ****** 01/17/03 *********************************************
     A            EQWTER                    RENAME(EHWTER)
     A            EQXTER                    RENAME(EHXTER)
     A            EQITER                    RENAME(EHITER)
     A            EQJTER                    RENAME(EHJTER)
      **** END ADD ****** 01/17/03 *********************************************
      **** BEG ADD ****** 01/29/03 *********************************************
     A            EQWRP1                    RENAME(EHWRP1)
     A            EQXRP1                    RENAME(EHXRP1)
     A            EQIRP1                    RENAME(EHIRP1)
     A            EQJRP1                    RENAME(EHJRP1)
     A            EQWRP2                    RENAME(EHWRP2)
     A            EQXRP2                    RENAME(EHXRP2)
     A            EQIRP2                    RENAME(EHIRP2)
     A            EQJRP2                    RENAME(EHJRP2)
     A            EQWRP3                    RENAME(EHWRP3)
     A            EQXRP3                    RENAME(EHXRP3)
     A            EQIRP3                    RENAME(EHIRP3)
     A            EQJRP3                    RENAME(EHJRP3)
      **** END ADD ****** 01/29/03 *********************************************
     A***  Begin Add  ***  01/08/04  **************************************
     A            EQDCD2                    RENAME(EHDCD2)
     A            EQ2DEF                    RENAME(EH2DEF)
     A            EQ2DEX                    RENAME(EH2DEX)
     A            EQDD2P                    RENAME(EHDD2P)
     A            EQWDD2                    RENAME(EHWDD2)
     A            EQXDD2                    RENAME(EHXDD2)
     A            EQIDD2                    RENAME(EHIDD2)
     A            EQJDD2                    RENAME(EHJDD2)
     A***  End   Add  ***  01/08/04  **************************************
     A*** BEG ADD ***** 09/01/04 ******************************************
     A            EQWVLC                    RENAME(EHWVLC)
     A*** BEG ADD ***** 12/17/04 ******************************************
     A            EQIVLC                    RENAME(EHIVLC)
     A*** END ADD ***** 12/17/04 ******************************************
     A            EQXVLC                    RENAME(EHXVLC)
     A            EQJVLC                    RENAME(EHJVLC)
     A*** END ADD ***** 09/01/04 ******************************************
     A*** BEG ADD ***** 01/07/05 ******************************************
     A            EQWDTR                    RENAME(EHWDTR)
     A            EQXDTR                    RENAME(EHXDTR)
     A            EQIDTR                    RENAME(EHIDTR)
     A            EQJDTR                    RENAME(EHJDTR)
     A*** END ADD ***** 01/07/05 ******************************************
     A*** BEG ADD ***** 12/17/10 ******************************************
     A            EQCMUL                    RENAME(EHCMUL)
     A*** END ADD ***** 12/17/10 ******************************************
     A*** BEG ADD ***** 01/24/06 ******************************************
     A            EQWRPR                    RENAME(EHWRPR)
     A            EQXRPR                    RENAME(EHXRPR)
     A*** BEG DEL ***** 12/17/10 ******************************************
     A*****       EQPRTF                    RENAME(EHPRTF)
     A*** END DEL ***** 12/17/10 ******************************************
     A*** END ADD ***** 01/24/06 ******************************************
     A*** BEG ADD ***** 06/30/06 ******************************************
     A            EQWHXM                    RENAME(EHWHXM)
     A            EQXHXM                    RENAME(EHXHXM)
     A            EQIHXM                    RENAME(EHIHXM)
     A            EQJHXM                    RENAME(EHJHXM)
     A*** END ADD ***** 06/30/06 ******************************************
     A*** BEG ADD ***** 07/07/06 ******************************************
     A            EQARCA                    RENAME(EHARCA)
     A            EQARCP                    RENAME(EHARCP)
     A            EQAREF                    RENAME(EHAREF)
     A            EQAREX                    RENAME(EHAREX)
     A            EQWARC                    RENAME(EHWARC)
     A            EQXARC                    RENAME(EHXARC)
     A            EQIARC                    RENAME(EHIARC)
     A            EQJARC                    RENAME(EHJARC)
     A*** END ADD ***** 07/07/06 ******************************************
     A*** BEGIN ADD *** 04/06/07 ******************************************
     A            EQWSRA                    RENAME(EHWSRA)
     A            EQXSRA                    RENAME(EHXSRA)
     A*** END ADD ***** 04/06/07 ******************************************
     A*** BEGIN ADD *** 11/09/10 ******************************************
     A            EQPCT1                    RENAME(EHPCT1)
     A            EQPCT2                    RENAME(EHPCT2)
     A            EQSTFC                    RENAME(EHSTFC)
     A*** END ADD ***** 11/09/10 ******************************************
     A*** BEG ADD ***** 12/17/10 ******************************************
     A            EQD1S2                    RENAME(EHD1S2)
     A            EQD1D2                    RENAME(EHD1D2)
     A            EQD1X2                    RENAME(EHD1X2)
     A            EQD1W2                    RENAME(EHD1W2)
     A            EQD1C2                    RENAME(EHD1C2)
     A            EQD1I2                    RENAME(EHD1I2)
     A            EQD1H2                    RENAME(EHD1H2)
     A            EQD2S2                    RENAME(EHD2S2)
     A            EQD2D2                    RENAME(EHD2D2)
     A            EQD2X2                    RENAME(EHD2X2)
     A            EQD2W2                    RENAME(EHD2W2)
     A            EQD2C2                    RENAME(EHD2C2)
     A            EQD2I2                    RENAME(EHD2I2)
     A            EQD2H2                    RENAME(EHD2H2)
     A            EQHCN                     RENAME(EHHCN)
     A*** END ADD ***** 12/17/10 ******************************************
     A*** BEGIN ADD *** 11/10/10 ******************************************
     A            EQWHCN                    RENAME(EHWHCN)
     A            EQXHCN                    RENAME(EHXHCN)
     A            EQIHCN                    RENAME(EHIHCN)
     A            EQJHCN                    RENAME(EHJHCN)
     A*** END ADD ***** 11/10/10 ******************************************
     A*** BEG ADD ***** 12/17/10 ******************************************
     A            EQNPRM                    RENAME(EHNPRM)
     A            EQPRM                     RENAME(EHPRM)
     A*** END ADD ***** 12/17/10 ******************************************
     A****** beg add *** 04/17/11 *********************************************
     A            EQWUSA    R     S         RENAME(EHWUSA)
     A            EQXUSA    R     S         RENAME(EHXUSA)
     A****** end add *** 04/17/11 *********************************************
     A*** BEG ADD ***** 04/19/16 ******************************************
     A            EQW1AS    R     S         RENAME(EHW1AS)
     A            EQX1AS    R     S         RENAME(EHX1AS)
     A            EQI1AS    R     S         RENAME(EHI1AS)
     A            EQJ1AS    R     S         RENAME(EHJ1AS)
     A            EQW2AS    R     S         RENAME(EHW2AS)
     A            EQX2AS    R     S         RENAME(EHX2AS)
     A            EQI2AS    R     S         RENAME(EHI2AS)
     A            EQJ2AS    R     S         RENAME(EHJ2AS)
     A            EQW3AS    R     S         RENAME(EHW3AS)
     A            EQX3AS    R     S         RENAME(EHX3AS)
     A            EQI3AS    R     S         RENAME(EHI3AS)
     A            EQJ3AS    R     S         RENAME(EHJ3AS)
     A            EQW4AS    R     S         RENAME(EHW4AS)
     A            EQX4AS    R     S         RENAME(EHX4AS)
     A            EQI4AS    R     S         RENAME(EHI4AS)
     A            EQJ4AS    R     S         RENAME(EHJ4AS)
     A            EQW5AS    R     S         RENAME(EHW5AS)
     A            EQX5AS    R     S         RENAME(EHX5AS)
     A            EQI5AS    R     S         RENAME(EHI5AS)
     A            EQJ5AS    R     S         RENAME(EHJ5AS)
     A            EQW6AS    R     S         RENAME(EHW6AS)
     A            EQX6AS    R     S         RENAME(EHX6AS)
     A            EQI6AS    R     S         RENAME(EHI6AS)
     A            EQJ6AS    R     S         RENAME(EHJ6AS)
     A            EQW7AS    R     S         RENAME(EHW7AS)
     A            EQX7AS    R     S         RENAME(EHX7AS)
     A            EQI7AS    R     S         RENAME(EHI7AS)
     A            EQJ7AS    R     S         RENAME(EHJ7AS)
     A            EQWSF     R     S         RENAME(EHWSF )
     A            EQXSF     R     S         RENAME(EHXSF )
     A            EQISF     R     S         RENAME(EHISF )
     A            EQJSF     R     S         RENAME(EHJSF )
     A            EQWMF     R     S         RENAME(EHWMF )
     A            EQXMF     R     S         RENAME(EHXMF )
     A            EQIMF     R     S         RENAME(EHIMF )
     A            EQJMF     R     S         RENAME(EHJMF )
     A
     A
     A*** END ADD ***** 04/19/16 ******************************************
     A*** BEG ADD ***** 04/27/16 ******************************************
     A            EQEXMD1NF R     S         RENAME(EHEXMD1NF)
     A            EQEXMD2NF R     S         RENAME(EHEXMD2NF)
     A            EQEXMD3NF R     S         RENAME(EHEXMD3NF)
     A*** END ADD ***** 04/27/16 ******************************************
      *** beg add ***** 09/14/16 ******************************************
     A            EQWANC    R     S         RENAME(EHWANC)
     A            EQXANC    R     S         RENAME(EHXANC)
     A            EQIANC    R     S         RENAME(EHIANC)
     A            EQJANC    R     S         RENAME(EHJANC)
      *** beg add ***** 09/14/16 ******************************************
     A*** Beg Add ***** 02/01/18 ******************************************
     A            EQWPF     R     S         RENAME(EHWPF)
     A            EQXPF     R     S         RENAME(EHXPF)
     A            EQIPF     R     S         RENAME(EHIPF)
     A            EQJPF     R     S         RENAME(EHJPF)
     A*** End Add ***** 02/01/18 ******************************************
     A*** Beg Add ***** 01/29/19 ******************************************
     A            EQNOEXM1  R     S         RENAME(EHNOEXM1)
     A*** End Add ***** 01/29/19 ******************************************
     A*** Beg Add ***** 02/27/24 ******************************************
     A            EQWBAL    R     S         RENAME(EHWBAL)
     A            EQWAMAN   R     S         RENAME(EHWAMAN)
     A            EQWASTD   R     S         RENAME(EHWASTD)
     A            EQWANORM  R     S         RENAME(EHWANORM)
     A            EQWAANN   R     S         RENAME(EHWAANN)
     A            EQWASBJ   R     S         RENAME(EHWASBJ)
     A            EQWAMOD   R     S         RENAME(EHWAMOD)
     A            EQWAIL1   R     S         RENAME(EHWAIL1)
     A            EQWAIL2   R     S         RENAME(EHWAIL2)
     A            EQWADC1   R     S         RENAME(EHWADC1)
     A            EQWADC2   R     S         RENAME(EHWADC2)
     A            EQWADC3   R     S         RENAME(EHWADC3)
     A            EQWADV2   R     S         RENAME(EHWADV2)
     A            EQWADCT   R     S         RENAME(EHWADCT)
     A            EQWADD2   R     S         RENAME(EHWADD2)
     A            EQWADCM   R     S         RENAME(EHWADCM)
     A            EQWADCS   R     S         RENAME(EHWADCS)
     A            EQWADC    R     S         RENAME(EHWADC)
     A            EQWAWAV   R     S         RENAME(EHWAWAV)
     A            EQWATCA   R     S         RENAME(EHWATCA)
     A            EQWAPRD   R     S         RENAME(EHWAPRD)
     A            EQWAPRF   R     S         RENAME(EHWAPRF)
     A            EQWAXPA   R     S         RENAME(EHWAXPA)
     A            EQWAVLC   R     S         RENAME(EHWAVLC)
     A            EQWAARC   R     S         RENAME(EHWAARC)
     A            EQWAD12   R     S         RENAME(EHWAD12)
     A            EQWAD22   R     S         RENAME(EHWAD22)
     A            EQWAHCN   R     S         RENAME(EHWAHCN)
     A            EQWAUSA   R     S         RENAME(EHWAUSA)
     A            EQWAXP1   R     S         RENAME(EHWAXP1)
     A            EQWAXP2   R     S         RENAME(EHWAXP2)
     A            EQWAXP3   R     S         RENAME(EHWAXP3)
     A            EQWARP1   R     S         RENAME(EHWARP1)
     A            EQWARP2   R     S         RENAME(EHWARP2)
     A            EQWARP3   R     S         RENAME(EHWARP3)
     A            EQWALOS   R     S         RENAME(EHWALOS)
     A*** End Add ***** 02/27/24 ******************************************
     A*** Beg Add ***** 08/14/24 ******************************************
     A            EQWBIL    R     S         RENAME(EHWBIL)
     A            EQIBIL    R     S         RENAME(EHIBIL)
     A            EQWBIL2   R     S         RENAME(EHWBIL2)
     A            EQIBIL2   R     S         RENAME(EHIBIL2)
     A*** End Add ***** 08/14/24 ******************************************
     A          K EQCO#
     A          K EQFND
     A          K EQEMP#
     A          K EQDIV
     A          K EQFYR
     A          K EQTRDT
     A          O EQTRDT                    COMP(EQ 0)
