      * (c) 2024 Sapiens. All Rights Reserved.                             *
     A*
     A** EMPLOYER DETAIL HISTORY FILE
     A*
     A          R PEH01                     PFILE(WDEHP)
     A          K EHCO#
     A          K EHFND
     A          K EHFYR
     A          K EHEMP#
     A          K EHDIV
     A          K EHDT
