     A*  (C) Copyright Progressive Data Systems, Inc., 1993
     A**
     A** WORKERS' COMP EMPLOYER EARS FACTOR FILE
     A**
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PER01                     TEXT('EMPLOYER EARS FACTOR FILE')
     A            ERCO#     R               REFFLD(CO#)
     A            ERFND     R               REFFLD(FND)
     A            ERFYR     R               REFFLD(FYR)
     A            EREMP#    R               REFFLD(EMP#)
     A            ERDIV     R               REFFLD(DIV)
     A            ERCLAS    R               REFFLD(CLAS)
     A            EREFDT    R               REFFLD(DT)
     A                                      COLHDG('EFFECTIVE' 'DATE')
     A            ERSPEC    R               REFFLD(FLAG)
     A                                      COLHDG('SPECIAL DES')
     A            EREARF         7  5       TEXT('EXP ADJ RATING FACTOR')
     A                                      COLHDG('EXP ADJ' 'RATING FACTOR')
     A            ERAAPR    R               REFFLD(A112)
     A                                      COLHDG('AUDITED PAYROLL')
     A            ERAMPR    R               REFFLD(A112)
     A                                      COLHDG('EARS RATE X' 'AUD PYRL')
     A            ERSTAT    R               REFFLD(STAT)
     A            ERUSER    R               REFFLD(USER)
     A            ERPGM     R               REFFLD(PGM)
     A            ERTIME    R               REFFLD(TIME)
     A            ERDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            ERIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL USER')
     A            ERIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL PROGRAM')
