     A*  (C) COPYRIGHT FISERV INSURANCE SOLUTION INC., 2006
     A****************************************************************
     A** NEW YORK NON-SUBJECT EXECUTIVE OFFICERS COVERAGE ENDORSEMENT*
     A****************************************************************
     A*
     A          R PN101                     PFILE(WDN1P)
     A          K N1CO#
     A          K N1FND
     A          K N1FYR
     A          K N1EMP#
     A          K N1DIV
     A          K N1SEQ#
