     A* (c) 2018 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A*
     A*  NCCI REPORTING - SUBMISSION HISTORY DETAIL
     A*
     A*  DESCRIPTION:  THIS FILE CONTAINS THE DETAIL OF ALL
     A*                SUBMISSIONS BASED FROM THE SUBMISSION HISTORY
     A*                MASTER FILE.  UNIQUE ID FIELD WILL LINK TO
     A*                AUXILIARY DATA FILES (WXNHP, WXNAP, ETC).
     A*
     A*  PROJECT:  SUPP#64177/WC1633     DATE:  07/09/08
     A*  PGMR:     C:65
     A*
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PS101                     TEXT('NCCI SUBM HISTORY DETAIL')
     A            S1CO#     R               REFFLD(CO#)
     A            S1FND     R               REFFLD(FND)
     A            S1EMP#    R               REFFLD(EMP#)
     A            S1DIV     R               REFFLD(DIV)
     A            S1FYR     R               REFFLD(FYR)
     A            S1TYPE    R               REFFLD(FLAG)
     A                                      COLHDG('SUBMISSION' 'TYPE')
     A            S1ST      R               REFFLD(ST)
     A                                      COLHDG('STATE')
     A            S1SBDT    R               REFFLD(DT)
     A                                      COLHDG('SUBMISSION' 'DATE')
     A            S1SBTM    R               REFFLD(TIME)
     A                                      COLHDG('SUBMISSION' 'TIME')
     A            S1CODE    R               REFFLD(FLAG)
     A                                      COLHDG('TRANSACTION' 'CODE')
     A            S1UNID    R               REFFLD(A120)
     A                                      COLHDG('UNIQUE' 'IDENTIFIER')
     A            S1PFDT    R               REFFLD(DT)
     A                                      COLHDG('POLICY' 'EFF' 'DATE')
     A            S1AGT#    R               REFFLD(AGT#)
     A                                      COLHDG('AGENT#')
     A            S1DOC     R               REFFLD(DCID)
     A                                      COLHDG('DOCUMENT' 'ID')
     A            S1FOLD    R               REFFLD(FLDR)
     A                                      COLHDG('FOLDER')
     A            S1DT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            S1TIME    R               REFFLD(TIME)
     A                                      COLHDG('TIME' 'MAINTAINED')
     A            S1USER    R               REFFLD(USER)
     A                                      COLHDG('USER' 'MAINTAINED')
     A            S1PGM     R               REFFLD(PGM)
     A                                      COLHDG('PROGRAM' 'MAINTAINED')
     A            S1IUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            S1IDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'ENTRY' 'DATE')
     A            S1ITIM    R               REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
     A            S1IPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PROGRAM')
