     A* (c) 2022 Sapiens. All Rights Reserved.                             *
     A*                                                                    *
     A* Settlement Tracking File                                           *
     A**********************************************************************
     A* Created on 12/06/2022 by C:291 for Project C152WBZ                 *
     A**********************************************************************
     A* Revisions:                                                         *
     A*                                                                    *
     A**********************************************************************
     A*
     A          R PST01                     PFILE(WDSTLTRK)
     A          K STCO#
     A          K STFND
     A          K STFYR
     A          K STCASE
     A          K STDT
     A          K STTIME
