     A*  (C) Copyright Fiserv Insurance Systems, Inc., 2006
     A**
     A** ISO ClaimSearch Match Summary file
     A**
     A********************************************************************
     A* Created: 01/06/06  C:53 Project: WC1247                          *
     A********************************************************************
     A* Modifications:                                                   *
     A*                                                                  *
     A* 00/00/00  C:00  Project: xxxxx                                   *
     A********************************************************************
     A                                      REF(WREFP)
     A          R PIM01                     TEXT('ISO MATCH FILE')
     A*
     A            IMCO#     R               REFFLD(CO#)
     A            IMFND     R               REFFLD(FND)
     A            IMFYR     R               REFFLD(FYR)
     A            IMCASE    R               REFFLD(CASE)
     A            IMSEQ#    R               REFFLD(A30)
     A                                      COLHDG('SEQUENCE #')
     A            IMISO#        11A         COLHDG('ISO SEQUENCE #')
     A            IMMRC1    R               REFFLD(CODE)
     A                                      COLHDG('ISO MATCH' 'REASON CODE 1')
     A            IMMRC2    R               REFFLD(CODE)
     A                                      COLHDG('ISO MATCH' 'REASON CODE 2')
     A            IMMRC3    R               REFFLD(CODE)
     A                                      COLHDG('ISO MATCH' 'REASON CODE 3')
     A            IMMRC4    R               REFFLD(CODE)
     A                                      COLHDG('ISO MATCH' 'REASON CODE 4')
     A            IMMRC5    R               REFFLD(CODE)
     A                                      COLHDG('ISO MATCH' 'REASON CODE 5')
