     A*  (C) Copyright Fiserv Insurance Systems, Inc., 2006
     A**
     A** ISO ClaimSearch Match file - loss location
     A**
     A********************************************************************
     A* Created: 01/06/06  C:53 Project: WC1247                          *
     A********************************************************************
     A* Modifications:                                                   *
     A*                                                                  *
     A* 00/00/00  C:00  Project: xxxxx                                   *
     A********************************************************************
     A                                      REF(WREFP)
     A          R PIM01                     TEXT('ISO MATCH FILE')
     A*
     A            IMCO#     R               REFFLD(CO#)
     A            IMFND     R               REFFLD(FND)
     A            IMFYR     R               REFFLD(FYR)
     A            IMCASE    R               REFFLD(CASE)
     A            IMSEQ#    R               REFFLD(A30)
     A                                      COLHDG('SEQUENCE #')
     A            IMLAD1        50A         COLHDG('LOSS LOC ADDRESS')
     A            IMLAD2        50A         COLHDG('LOSS LOC ADDRESS 2')
     A            IMLCTY        25A         COLHDG('LOSS LOC CITY')
     A            IMLST          2A         COLHDG('LOSS LOC ST')
     A            IMLZIP         9A         COLHDG('LOSS LOC ZIP')
