     A*  (C) Copyright Fiserv Insurance Solutions, Inc., 2005
     A*
     A*  WORKERS' COMP MEMBER EXPERIENCE WORK FILE
     A*
     A*  09/09/05  C: 132  PROJECT: WC1329
     A*                    Created for pgm W8904RYE for Client 129
     A*                    for Pgm W8904RYE, create CICenter Year
     A*                     End Starting Claim records in WHCLP.
     A*
     A          R PE201                     PFILE(WFE2P)
     A          K E2CO#
     A          K E2FND
     A          K E2CASE
     A          K E2EMP#
     A          K E2DIV
     A          K E2FYR
