      * (c) 2024 Sapiens. All Rights Reserved.                             *
     H*
     H*  EXPERIENCE BY PAYROLL CLASS OUTFILE
     H*****************************************************************
     H* REVISIONS:                                                    *
     H*                                                               *
     A* 06/17/24  C:344 PROJECT: WC2952                               *
     A*                 Expand rate field from 7.2 to 8.3 zoned.      *
     H*                                                               *
     H* 04/20/09 C:190 PROJECT: WC1473                                *
     H*                ADD FIELD FOR CLASS DESC EXTENSION             *
     H*                                                               *
     H* 05/23/08 C:136 PROJECT: 93WHJ                                 *
     H*                ADD FIELD FOR S/R PAYROLLS                     *
     H*                                                               *
     H* 05/01/07  C:191  Project: 93WGV SEQ.# 56719                   *
     H*                  Add Payroll Effective Date                   *
     H*                                                               *
     H* 03/16/06  C:132  Project: WC741 SEQ.#  49658                  *
     H*                  Add Payroll Effective Date                   *
     H*                                                               *
     H* 03/10/05  C:61   Project: WC741                               *
     H*                  Add policy Effective Date                    *
     H*                                                               *
     H* 01/14/05  C:33   Project: WC1252                              *
     H*                  Add Anniversary Rating date fields.          *
     H*                                                               *
     H* 08/15/01  C:90   PROJECT: WC1035                              *
     H*                  Expand rate field from 5.2 to 7.2            *
     H*                                                               *
     H* 06/28/99  C:35   PROJECT: SUPPORT WA102 #18540                *
     H*                  ADD FIELD FOR SPECIAL DESIGNATION.           *
     H*                                                               *
     H*****************************************************************
     A                                      REF(WREFP)
     A          R PEX01                     TEXT('EXPERIENCE BY PAYROLL CLASS')
     A            EXCO#     R     S         REFFLD(CO#)
     A            EXCNAM    R               REFFLD(DS40)
     A                                      COLHDG('COMPANY NAME')
     A            EXGRP     R     S         REFFLD(FND)
     A            EXGNAM    R               REFFLD(DS40)
     A                                      COLHDG('GROUP NAME')
     A            EXFYR     R     S         REFFLD(FYR)
     A            EXASOF    R     S         REFFLD(DT8)
     A                                      COLHDG('AS OF DATE')
     A            EXCLAS    R     S         REFFLD(CLAS)
     A            EXCDES    R               REFFLD(DS40)
     A                                      COLHDG('CLASS DESCRIPTION')
      **** BEGIN CHG **** 06/17/24 ************************************
      **** BEGIN CHG **** 08/15/01 ************************************
     A*********** EXARAT    R     S         REFFLD(A52)
     A*********** EXARAT    R     S         REFFLD(A72)
      **** END   CHG **** 08/15/01 ************************************
     A            EXARAT         8S 3
      **** END   CHG **** 06/17/24 ************************************
     A                                      COLHDG('PAYROLL RATE')
     A            EXEMP#    R     S         REFFLD(EMP#)
     A            EXDIV     R     S         REFFLD(DIV)
     A            EXENAM    R               REFFLD(DS40)
     A                                      COLHDG('EMPLOYER NAME')
     A            EXPYRL    R     S         REFFLD(A132)
     A                                      COLHDG('TOTAL PAYROLL')
     A            EXMAN     R     S         REFFLD(A132)
     A                                      COLHDG('MANUAL PREMIUM')
     A            EXNORM    R     S         REFFLD(A132)
     A                                      COLHDG('NORMAL PREMIUM')
     A            EXWRIT    R     S         REFFLD(A132)
     A                                      COLHDG('WRITTEN PREMIUM')
     A            EXEXM1    R     S         REFFLD(PC54)
     A                                      COLHDG('EXP MOD 1')
     A            EXEXD1    R     S         REFFLD(DT8)
     A                                      COLHDG('EXP MOD 1 EFF DT')
     A            EXEXM2    R     S         REFFLD(PC54)
     A                                      COLHDG('EXP MOD 2')
     A            EXEXD2    R     S         REFFLD(DT8)
     A                                      COLHDG('EXP MOD 2 EFF DT')
     A            EXEXM3    R     S         REFFLD(PC54)
     A                                      COLHDG('EXP MOD 3')
     A            EXEXD3    R     S         REFFLD(DT8)
     A                                      COLHDG('EXP MOD 3 EFF DT')
     A            EXEARN    R     S         REFFLD(A132)
     A                                      COLHDG('EARNED PRM FOR CLASS')
     A            EX#CLM    R     S         REFFLD(A90)
     A                                      COLHDG('NUMBER OF CLAIMS')
     A            EXTOTI    R     S         REFFLD(A132)
     A                                      COLHDG('TOTAL INCURRED')
     A            EXLOSS    R     S         REFFLD(A72)
     A                                      COLHDG('LOSS RATIO')
     A            EXFREQ    R     S         REFFLD(A72)
     A                                      COLHDG('FREQUENCY RATIO')
     A            EXRGN#    R     S         REFFLD(RGN#)
     A                                      COLHDG('REGION CODE')
     A            EXRDES    R               REFFLD(DS30)
     A                                      COLHDG('REGION  DESCRIPTION')
     A            EXAGT#    R     S         REFFLD(AGT#)
     A            EXANAM    R               REFFLD(DS40)
     A                                      COLHDG('AGENT NAME')
     A            EXRST     R               REFFLD(ST)
     A                                      COLHDG('RATING STATE')
      **** BEGIN ADD **** 06/28/99 *********************************************
     A            EXSPEC    R               REFFLD(FLAG)
     A                                      COLHDG('SPECIAL DES')
      **** END   ADD **** 06/28/99 *********************************************
     A***  Begin Add  ***  01/14/05  **************************************
     A            EXANDT    R     S         REFFLD(DT8)
     A                                      COLHDG('ANNIVERSARY' 'RATING DATE')
     A***  BEGIN CHG  ***  06/17/24  **************************************
     A*********** EXANRT    R     S         REFFLD(A72)
     A            EXANRT         8S 3
      ***  END   CHG  ***  06/17/24  **************************************
     A                                      COLHDG('RATE AS' 'OF ARD')
     A***  End   Add  ***  01/14/05  **************************************
     A            EXPFD     R     S         REFFLD(DT8)
     A                                      COLHDG('POLICY FROM DATE')
      ***  End   Add  ***  03/10/05  **************************************
      ***** BEG ADD ***** 03/17/06 ****************************************
     A            EXPYED    R     S         REFFLD(DT8)
     A                                      COLHDG('PAYROLL' 'EFF DATE')
     A                                      TEXT('Payroll Effective Date')
      ***** END ADD ***** 03/17/06 ****************************************
      *** BEG ADD ****** 05/01/07 **********************************************
     A            EXEMPY         7S 0       COLHDG('# OF EMPLOYEE')
     A            EXLCM          5S 4       COLHDG('LOSS COST' 'MULTIPLIER')
      *** END ADD ****** 05/01/07 **********************************************
      *** BEG ADD ***** 05/23/08 ***********************************************
     A            EXSRPY        13S 2       COLHDG('S/R PAYROLL')
      *** END ADD ***** 05/23/08 ***********************************************
      *** BEG ADD ***** 04/20/09 ***********************************************
     A            EXEXT          5A         COLHDG('CLASS DESC EXTENSION')
      *** END ADD ***** 04/20/09 ***********************************************
