     A*  (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC., 1997
     A*
     A*  NCCI ANNUAL CALL #5 SUMMARY FILE
     A*****************************************************************
     A*  DESCRIPTIONS:                                                *
     A*  THIS FILE CONTAINS CUMULATIVE REPORTING INFORMATION FOR      *
     A*  BUILDING ANNUAL CALL #5 FOR NCCI.                            *
     A*                                                               *
     A*  CREATED: 03/28/97       PROJECT: 68AZA       PROGRAMMER: 57  *
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*  XX/XX/XX C:XX PROJECT XXXXX                                  *
     A*                XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX   *
     A*****************************************************************
     A
     A                                      REF(WREFP)
     A
     A          R PF501                     TEXT('NCCI CALL #5')
     A
     A            F5CO#     R               REFFLD(CO#)
     A            F5FND     R               REFFLD(FND)
     A            F5ST      R               REFFLD(ST)
     A            F5RYR          4S 0       COLHDG('REPORTING' 'YEAR')
     A            F5FYR     R               REFFLD(FYR)
     A                                      COLHDG('POLICY' 'EFFECTIVE' +
     A                                      'DATE')
     A            F5PDSR        12S 0       COLHDG('STD AT NCCI' 'DSR LEVEL' +
     A                                      'COLUMN (1)')
     A            F5PCMP        12S 0       COLHDG('STD AT COMPANY' 'LEVEL' +
     A                                      'COLUMN (2)')
     A            F5PNET        12S 0       COLHDG('NET PREMIUM' ' ' +
     A                                      'COLUMN (3)')
     A            F5PDTT        12S 0       COLHDG('TOTAL PAID' ' ' +
     A                                      'COLUMN (4)=(9+10)')
     A            F5OUTT        12S 0       COLHDG('OUTSTAND TOTAL' 'W/O IBNR' +
     A                                      'COLUMN (5)=(11+12)')
     A            F5IBTT        12S 0       COLHDG('TOTAL IBNR' 'INDEM + MED' +
     A                                      'COLUMN (6)=(13+14)')
     A            F5INCT        12S 0       COLHDG('TOTAL INCURRED' 'INCLUDING -
     A                                      IBNR' 'COLUMN (7)=(4+5+6)')
     A            F5CLTT         7S 0       COLHDG('CLAIMS COUNT' 'TOTAL' +
     A                                      'COLUMN (8)=(19+20)')
     A            F5PDIT        12S 0       COLHDG('PAID INDEMNITY' 'TOTAL' +
     A                                      'COLUMN (9)=(21+21A)')
     A            F5PDMT        12S 0       COLHDG('PAID MEDICAL' 'TOTAL' +
     A                                      'COLUMN (10)=(22+22A)')
     A            F5OUIT        12S 0       COLHDG('OUTSTAND INDEMNITY' +
     A                                      'W/O IBNR' 'COLUMN (11)')
     A            F5OUMT        12S 0       COLHDG('OUTSTAND MEDICAL' +
     A                                      'W/O IBNR' 'COLUMN (12)')
     A            F5IBIN        12S 0       COLHDG('IBNR INDEMNITY' ' ' +
     A                                      'COLUMN (13)')
     A            F5IBMD        12S 0       COLHDG('IBNR MEDICAL' ' ' +
     A                                      'COLUMN (14)')
     A            F5CLCO         7S 0       COLHDG('CLAIMS COUNT' 'OPEN' +
     A                                      'COLUMN (19)')
     A            F5CLCC         7S 0       COLHDG('CLAIMS COUNT' 'CLOSED' +
     A                                      'COLUMN (20)')
     A            F5PDIO        12S 0       COLHDG('PAID INDEMITY' 'OPEN' +
     A                                      'COLUMN (21A)')
     A            F5PDIC        12S 0       COLHDG('PAID INDEMNITY' 'CLOSED' +
     A                                      'COLUMN (21)')
     A            F5PDMO        12S 0       COLHDG('PAID MEDICAL' 'OPEN' +
     A                                      'COLUMN (22A)')
     A            F5PDMC        12S 0       COLHDG('PAID MEDICAL' 'CLOSED' +
     A                                      'COLUMN (22)')
     A            F5ALPD        12S 0       COLHDG('ALAE' 'PAID' 'COLUMN (23)')
     A            F5ALCS        12S 0       COLHDG('ALAE' 'CASE' 'COLUMN (24)')
     A            F5ALBI        12S 0       COLHDG('ALAE' 'BULK + IBNR' +
     A                                      'COLUMN (25)')
     A            F5ALTT        12S 0       COLHDG('ALAE' 'TOTAL' +
     A                                      'COL (26)=(23+24+25)')
     A            F5USER    R               REFFLD(USER)
     A            F5PGM     R               REFFLD(PGM)
     A            F5TIME    R               REFFLD(TIME)
     A            F5DT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
