     A* (C) Copyright Fiserv Insurance Solutions, Inc. 2006
      *****************************************************************
     A* FL PREMIUM WITHOUT DEDUCTIBLE DISCOUNT REPORT FILE
     H*****************************************************************
      * REVISIONS:                                                    *
      *                                                               *
      * CREATED BY C:136 08/18/06 PROJECT: 139WEE                     *
      *****************************************************************
     A                                      REF(WREFP)
     A          R PFD0P                     TEXT('FL PREM W/O DED')
     A            FDCO#     R     S         REFFLD(CO#)
     A            FDFND     R     S         REFFLD(FND)
     A            FDEMP#    R     S         REFFLD(EMP#)
     A            FDDIV     R     S         REFFLD(DIV)
     A            FDFYR     R     S         REFFLD(FYR)
     A            FDRPDT    R     S         REFFLD(DT8)
     A                                      COLHDG('RPT DATE')
     A            FDSEQ#    R     S         REFFLD(A90)
     A                                      COLHDG('SEQ #')
     A            FDEAWO    R     S         REFFLD(A112)
     A                                      COLHDG('EARM W/O DED')
     A            FDEAWD    R     S         REFFLD(A112)
     A                                      COLHDG('EARN WITH DED')
     A            FDWPWO    R     S         REFFLD(A112)
     A                                      COLHDG('WRTN W/O DED')
     A            FDWPWD    R     S         REFFLD(A112)
     A                                      COLHDG('WRTN WITH DED')
     A            FDRATI        11S 7       COLHDG('WPWO/WPWD')
     A            FDMPWD    R               REFFLD(A112)
     A                                      COLHDG('MAN PREM W/O DED')
     A            FDMPWO    R               REFFLD(A112)
     A                                      COLHDG('MAN PREM W/O DED')
     A            FDERRF    R               REFFLD(FLAG)
     A                                      COLHDG('ERROR FLAG')
     A            FDIUSR    R               REFFLD(USER)
     A                                      COLHDG('INIT USER')
     A            FDIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INIT PGM')
     A            FDIDT     R               REFFLD(DT7)
     A                                      COLHDG('INIT DATE')
     A            FDITIM    R               REFFLD(TIME)
     A                                      COLHDG('INIT TIME')
