     A* (C) Copyright Progressive Data Systems, Inc., 2000
     A*
     A* WFMOP - OUTFILE - WC Policy and Premium
     A*****************************************************************
     A*                                                               *
     A* PROGRAM DESCRIPTION:                                          *
     A*                                                               *
     A* THIS PROGRAM IS AN OUTPUT FILE FROM THE MONTHLY INTERIM       *
     A* REPORT.                                                       *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A* REVISIONS:                                                    *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
      *
     A                                      REF(WREFP)
      *
     A          R PMO01                     TEXT('Mth Intr Pol+Prem Outfile')
      *
     A            MOCO#     R     S         REFFLD(CO#)
     A                                      COLHDG('COMPANY NUMBER')
      *
     A            MOCNAM    R               REFFLD(NAME)
     A                                      COLHDG('COMPANY' 'NAME')
      *
     A            MOFND     R     S         REFFLD(FND)
     A                                      COLHDG('FUND')
      *
     A            MOFNAM    R               REFFLD(NM60)
     A                                      COLHDG('GROUP' 'NAME')
      *
     A            MOEMP#    R     S         REFFLD(EMP#)
     A                                      COLHDG('EMPLOYER NUMBER')
      *
     A            MODIV     R     S         REFFLD(DIV)
     A                                      COLHDG('DIVISION')
      *
     A            MOFYR     R     S         REFFLD(FYR)
     A                                      COLHDG('FUND YEAR')
      *
     A            MOAGT#         5S 0
     A                                      COLHDG('AGENT' 'NUMBER')
      *
     A            MOANAM    R               REFFLD(NAME)
     A                                      COLHDG('AGENT' 'NAME')
      *
     A            MOPOL#        15A
     A                                      COLHDG('POLICY' 'NUMBER')
      *
     A            MORPFD         8S 0
     A                                      COLHDG('RPT PERIOD' 'FROM DATE')
      *
     A            MORPTD         8S 0
     A                                      COLHDG('RPT PERIOD' 'TO DATE')
      *
     A            MOJRST         2A
     A                                      COLHDG('RATING' 'STATE')
      *
     A            MOENAM    R               REFFLD(NAME)
     A                                      COLHDG('EMPLOYER NAME')
      *
     A            MOEFNM    R               REFFLD(NAME)
     A                                      COLHDG('EMPLOYER' 'FEDERAL NAME')
      *
     A            MOEAD1    R               REFFLD(ADR1)
     A                                      COLHDG('EMPLOYER' 'ADDRESS 1')
      *
     A            MOEAD2    R               REFFLD(ADR2)
     A                                      COLHDG('EMPLOYER' 'ADDRESS 2')
      *
     A            MOECSZ        40A
     A                                      COLHDG('EMP CTY ST ZIP')
      *
     A            MODDHD    R               REFFLD(DS30)
     A                                      COLHDG('DEDUCT DISC HEADING')
      *
     A            MODDCT         5S 2
     A                                      COLHDG('DEDUCTIBLE' 'DISCOUNT' +
     A                                             'PERCENT')
      *
     A            MO1AHD    R               REFFLD(DS30)
     A                                      COLHDG('SUBJ PREM 1A' 'CRED HEAD')
      *
     A            MOASPM         5S 2
     A                                      COLHDG('SUBJ PREMIUM' 'CREDIT +
     A                                             1A' 'PERCENT')
      *
     A            MO1BHD    R               REFFLD(DS30)
     A                                      COLHDG('SUBJ PREM 1B' 'CRED HEAD')
      *
     A            MOASPS         5S 2
     A                                      COLHDG('SUBJ PREMIUM' 'CREDIT +
     A                                             1B' 'PERCENT')
      *
     A            MOCAHD    R               REFFLD(DS30)
     A                                      COLHDG('CONTRACT ADJ HEADING')
      *
     A            MOASP1         5S 2
     A                                      COLHDG('CONTRACTORS' 'ADJ CREDIT')
      *
     A            MODV1H    R               REFFLD(DS30)
     A                                      COLHDG('DEVIATION 1 HEADING')
      *
     A            MOASP2         5S 2
     A                                      COLHDG('DEVIATION 1')
      *
     A            MODSHD    R               REFFLD(DS30)
     A                                      COLHDG('DISCOUNT HEADING')
      *
     A            MOASP3         5S 2
     A                                      COLHDG('DISCOUNT')
      *
     A            MODCH     R               REFFLD(DS30)
     A                                      COLHDG('DEBT CRED HEADING')
      *
     A            MODBCR         5S 4
     A                                      COLHDG('SCHEDULE DB/CR' 'FACTOR')
      *
     A            MODV2H    R               REFFLD(DS30)
     A                                      COLHDG('DEVIATION 2 HEADING')
      *
     A            MODEV2         5S 2
     A                                      COLHDG('DEVIATION 2')
      *
     A            MOTXHD    R               REFFLD(DS30)
     A                                      COLHDG('TAX HEADING')
      *
     A            MOTXPC         6  4
     A                                      COLHDG('TAX PERC')
      *
     A            MOLPCT         3S 2
     A                                      COLHDG('INCREASED' 'LIMITS' '%')
      *
     A            MODFBM         9S 5
     A                                      COLHDG('DISC FACT' 'BEFOR MODIFIER')
      *
     A            MOEXPM         5S 4
     A                                      COLHDG('EXPERIENCE' 'MODIFIER')
      *
     A            MODFAM         9S 5
     A                                      COLHDG('DISC FACT' 'AFTER MODIFIER')
      *
     A            MOPBAL        11S 2
     A                                      COLHDG('PREVIOUS' 'BALANCE')
      *
     A            MOMJAN    R               REFFLD(FLAG)
     A                                      COLHDG('JAN MISSING')
      *
     A            MOMFEB    R               REFFLD(FLAG)
     A                                      COLHDG('FEB MISSING')
      *
     A            MOMMAR    R               REFFLD(FLAG)
     A                                      COLHDG('MAR MISSING')
      *
     A            MOMAPR    R               REFFLD(FLAG)
     A                                      COLHDG('APR MISSING')
      *
     A            MOMMAY    R               REFFLD(FLAG)
     A                                      COLHDG('MAY MISSING')
      *
     A            MOMJUN    R               REFFLD(FLAG)
     A                                      COLHDG('JUN MISSING')
      *
     A            MOMJUL    R               REFFLD(FLAG)
     A                                      COLHDG('JUL MISSING')
      *
     A            MOMAUG    R               REFFLD(FLAG)
     A                                      COLHDG('AUG MISSING')
      *
     A            MOMSEP    R               REFFLD(FLAG)
     A                                      COLHDG('SEP MISSING')
      *
     A            MOMOCT    R               REFFLD(FLAG)
     A                                      COLHDG('OCT MISSING')
      *
     A            MOMNOV    R               REFFLD(FLAG)
     A                                      COLHDG('NOV MISSING')
      *
     A            MOMDEC    R               REFFLD(FLAG)
     A                                      COLHDG('DEC MISSING')
      *
     A            MOLJAN    R               REFFLD(FLAG)
     A                                      COLHDG('JAN LATE')
      *
     A            MOLFEB    R               REFFLD(FLAG)
     A                                      COLHDG('FEB LATE')
      *
     A            MOLMAR    R               REFFLD(FLAG)
     A                                      COLHDG('MAR LATE')
      *
     A            MOLAPR    R               REFFLD(FLAG)
     A                                      COLHDG('APR LATE')
      *
     A            MOLMAY    R               REFFLD(FLAG)
     A                                      COLHDG('MAY LATE')
      *
     A            MOLJUN    R               REFFLD(FLAG)
     A                                      COLHDG('JUN LATE')
      *
     A            MOLJUL    R               REFFLD(FLAG)
     A                                      COLHDG('JUL LATE')
      *
     A            MOLAUG    R               REFFLD(FLAG)
     A                                      COLHDG('AUG LATE')
      *
     A            MOLSEP    R               REFFLD(FLAG)
     A                                      COLHDG('SEP LATE')
      *
     A            MOLOCT    R               REFFLD(FLAG)
     A                                      COLHDG('OCT LATE')
      *
     A            MOLNOV    R               REFFLD(FLAG)
     A                                      COLHDG('NOV LATE')
      *
     A            MOLDEC    R               REFFLD(FLAG)
     A                                      COLHDG('DEC LATE')
      *
     A            MOCKNM    R               REFFLD(NAME)
     A                                      COLHDG('MAKE CHECK PAY NAME')
      *
     A            MOAAD1    R               REFFLD(ADR1)
     A                                      COLHDG('ACCTING ADDRESS')
      *
     A            MOAAD2    R               REFFLD(ADR2)
     A                                      COLHDG('ACCTING ADDRESS 2')
      *
     A            MOACTY    R               REFFLD(CTY)
     A                                      COLHDG('ACCOUNTING CITY')
      *
     A            MOAST     R               REFFLD(ST)
     A                                      COLHDG('ACCOUNTING STATE')
      *
     A            MOAZIP         9S 0
     A                                      COLHDG('ACCOUNTING ZIP CODE')
      *
      *
     A            MOUSER    R               REFFLD(USER)
     A            MOPGM     R               REFFLD(PGM)
     A            MOTIME    R               REFFLD(TIME)
     A            MODT      R               REFFLD(DT7S)
      *
