     A*  (C) Copyright Progressive Data Solutions, Inc., 2000
     A*****************************************************************
     A*  CALCULATED VS. BILLED PREMIUM REPORT WORKFILE
     A*****************************************************************
     A*  DESCRIPTION:                                                 *
     A*        This file will contain the information from the last   *
     A*        Calculated vs. Billed Premium Report run.              *
     A*                                                               *
     A*  PROGRAMMER: C:90                                             *
     A*  CREATED:    06/30/00    PROJECT: WC1000                      *
     A*                                                               *
     A*****************************************************************
     A
     A          R PPC01                     TEXT('CALC VS BILLED PREM WORKFILE')
     A            PCCO#          3S 0       COLHDG('Company#')
     A            PCCNAM        40A         COLHDG('Company Name')
     A            PCFND          3S 0       COLHDG('Group')
     A            PCFNAM        40A         COLHDG('Group Name')
     A            PCEMP#         9S 0       COLHDG('Employer')
     A            PCDIV          5S 0       COLHDG('Division')
     A            PCFYR          3S 0       COLHDG('Policy Year')
     A            PCENAM        40A         COLHDG('Employer Name')
     A            PCAGT#         5S 0       COLHDG('Agent #')
     A            PCAGNM        40A         COLHDG('Agent Name')
     A            PCPFDT         8S 0       COLHDG('Policy Eff. Date')
     A            PCPTDT         8S 0       COLHDG('Policy Exp. Date')
     A            PCCXDT         8S 0       COLHDG('Cancel date')
     A            PCCPRM        11S 2       COLHDG('Calculated Premium')
     A            PCBPRM        11S 2       COLHDG('Billed Premium')
     A            PCDIFF        11S 2       COLHDG('Difference in prem.')
     A            PCAUDS         1A         COLHDG('Audit Status')
     A            PCBSCD         3S 0       COLHDG('Billing Sched. Code')
     A            PCBCDS        40A         COLHDG('Billing Schd Cd Desc')
     A            PCBSFL         1A         COLHDG('Billing Sched. Type')
     A            PCARSM         1A         COLHDG('Summarized A/R Flag')
     A            PCDT           8S 0       COLHDG('Last run date')
     A            PCTIME         6S 0       COLHDG('Last run time')
     A            PCPGM         10A         COLHDG('Program name')
     A            PCUSER        10A         COLHDG('User name')
