     A* (C) Copyright FISERV Insurance Solutions, Inc., 1999 - 2008
     A****************************************************************
     A** SURPLUS DISTRIBUTIONS REPORT WORKFILE
     A****************************************************************
     A*  PROGRAMMER: C 183                                           *
     A*  CREATED:    12/26/07                                        *
     A*  PROJECT#:   81WZB                                           *
     A*                                                              *
     A****************************************************************
     A*  REVISIONS:                                                  *
     A*                                                              *
     A****************************************************************
     A                                      ALTSEQ(QSYSTRNTBL)
     A          R PSD01                     PFILE(WFSDP)
     A          K SDCO#
     A          K SDCUST
     A          K SDFND
     A          K SDEMP#
     A          K SDDIV
     A          K SDFYR
