      * (c) 2018 StoneRiver, Inc. All rights Reserved.
      * StoneRiver is a trademark of StoneRiver, Inc.
      * Portal Application xRef File
      *=====================================================
      * Revisions:
      *
      *=====================================================
     A                                      REF(WREFP)
     A          R PEM01                     TEXT('Portal Application')
     A            EMCO#     R     S         REFFLD(CO#)
     A            EMAPP#         9S 0       COLHDG('App Number')
     A            EMFND     R     S         REFFLD(FND)
     A            EMEMP#    R     S         REFFLD(EMP#)
     A            EMFYR     R     S         REFFLD(FYR)
     A            EMCURRENT      1A         COLHDG('Currently' 'Selected')
     A            EMSTAT         1A         COLHDG('A/I Status')
     A            EMPREM        15S 2       COLHDG('PREMIUM')
     A            EMUSER    R               REFFLD(USER)
     A            EMPGM     R               REFFLD(PGM)
     A            EMTIME    R     S         REFFLD(TIME)
     A            EMDT      R     S         REFFLD(DT)
     A            EMIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            EMIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PROGRAM')
     A            EMITIM    R     S         REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
     A            EMIDT     R     S         REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            EMVALID        1A         COLHDG('VALIDATION STATUS')
     A            EMVALRSN     500A         COLHDG('VALIDATION REASON')
