      * (c) 2019 StoneRiver, Inc. All rights Reserved.
      * StoneRiver is a trademark of StoneRiver, Inc.
      * Portal Default Master
      *=====================================================
      * Revisions:
      *
      *=====================================================
     A          R PDF01                     PFILE(WIRATDFT)
     A          K DFCO#
     A          K DFFND
     A          K DFST
     A          K DFKEY
     A          K DFEFDT
