     A****************************************************************
     A*  (C) Copyright Fiserv Insurance Solution Inc., 2006          *
     A****************************************************************
     A* WORKERS' COMP PROFESSIONAL EMPLOYER ENDORSEMENT SCHEDULE FILE*
     A****************************************************************
     A*  REVISIONS:                                                  *
     A*                                                              *
     A*  11/22/06 C:184 PROJECT: WC1505                              *
     A*                 Added an employer effective date field to    *
     A*                 allow only changed employers to print on     *
     A*                 midterm endorsement.                         *
     A*                                                              *
     A* ------------------------------------------------------------ *
     A*  NOTE: PLEASE ADD COMMENTS TO THE TOP OF REVISIONS.          *
     A* ------------------------------------------------------------ *
     A****************************************************************
     A                                      REF(WREFP)
     A          R PLP01                     TEXT('ALTERNATE EMPLOYERS')
     A            LPCO#     R               REFFLD(CO#)
     A                                      COLHDG('COMPANY #')
     A            LPFND     R               REFFLD(FND)
     A                                      COLHDG('GROUP')
     A            LPEMP#    R               REFFLD(EMP#)
     A                                      COLHDG('EMPLOYER #')
     A            LPDIV     R               REFFLD(DIV)
     A                                      COLHDG('DIVISION')
     A            LPFYR     R               REFFLD(FYR)
     A                                      COLHDG('POLICY YEAR')
     A            LPSEQ#    R               REFFLD(CER#)
     A                                      COLHDG('ALT EMPLR #')
     A            LPNAM1    R               REFFLD(NAME)
     A                                      COLHDG('ALT EMPLR NAME')
     A            LPADR1    R               REFFLD(ADR1)
     A                                      COLHDG('ALT EMPLR' 'ADDRESS 1')
     A            LPADR2    R               REFFLD(ADR2)
     A                                      COLHDG('ALT EMPLR' 'ADDRESS 2')
     A            LPCTY     R               REFFLD(CTY)
     A                                      COLHDG('ALT EMPLR CITY')
     A            LPST      R               REFFLD(ST)
     A                                      COLHDG('ALT EMPLR STATE')
     A            LPZIP     R               REFFLD(ZIP)
     A                                      COLHDG('ALT EMPLR ZIP')
     A            LPEMST    R               REFFLD(ST)
     A                                      COLHDG('STATE OF SLPC/' 'TEMP EMPL')
     A            LPPROJ    R               REFFLD(NM60)
     A                                      COLHDG('PROJECT OR CONTRACT')
     A            LPUSER    R               REFFLD(USER)
     A                                      COLHDG('USER')
     A            LPPGM     R               REFFLD(PGM)
     A                                      COLHDG('PROGRAM')
     A            LPTIME    R               REFFLD(TIME)
     A                                      COLHDG('TIME' 'MAINTAINED')
     A            LPDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            LPIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            LPIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PROGRAM')
     A            LPITM     R               REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
     A            LPIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            LPEFDT         7S 0       COLHDG('EMPLOYER EFFECTIVE')
