      * (c) 2012 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*
     A** WORKERS' COMPENSATION AGENT COMMISSIONS FILE
     A******************************************************************
     A* REVISIONS:                                                     *
     A*                                                                *
     A* 08/09/05  C:09   PROJECT: 129WFH                               *
     A*                  Add new logical to accumulate prior amounts   *
     A*                  for policy year, employer/division and        *
     A*                  primary vs. secondary agent identifier.       *
     A******************************************************************
     A*
     A          R PAC01                     PFILE(WMACP)
     A          K ACCO#
     A          K ACFND
     A          K ACFYR
     A          K ACEMP#
     A          K ACDIV
     A          K ACAGT2
