      * (c) 2012 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*
     A** WORKERS' COMPENSATION AGENT COMMISSIONS FILE
     A*
     A*  06/02/08  C:191  Project: 132WKE
     A*
     A* REVISIONS:
     A*
     A          R PAC01                     PFILE(WMACP)
     A          K ACCO#
     A          K ACFND
     A          K ACAGT#
     A          K ACCHCK
