     A*****************************************************************
     A*  (c) Copyright Progressive Data Solutions, Inc., 2005
     A*
     A*  WORKERS' COMPENSATION AUTO DARTS CONTROL FILE
     A*****************************************************************
     A*  DESCRIPTION:                                                 *
     A*    AUDIT TRACKING CONTROL INFO                                *
     A*****************************************************************
     A*  CREATED: 02/09/05       PROJECT: WC1128               C: 58  *
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A* 02/01/10  C:247  Project: 25WQO:                              *
     A*                  New Auto diary features                      *
     A*
     A*****************************************************************
     A
     A                                      REF(WREFP)
     A
     A          R PAD01                     TEXT('AUTO DARTS CONTROL +
     A                                            FILE')
     A
     A            ADCO#     R               REFFLD(CO#)
     A                                      TEXT('Company number')
     A                                      COLHDG('CO#')
     A            ADFND     R               REFFLD(FND)
     A                                      TEXT('Group')
     A                                      COLHDG('GRP')
     A            ADKEY     R               REFFLD(DS10)
     A                                      TEXT('Key field')
     A                                      COLHDG('Record key')
     A            ADRMCD    R               REFFLD(RMCD)
     A                                      TEXT('Remark code')
     A                                      COLHDG('RMK CD')
     A            ADDESC    R               REFFLD(DS60)
     A                                      TEXT('Description')
     A                                      COLHDG('Description')
     A            ADSLVL    R               REFFLD(A30)
     A                                      TEXT('DARTS security level')
     A                                      COLHDG('Sec' 'Lev')
     A            ADDIUS    R               REFFLD(CODE)
     A                                      TEXT('Diary To code')
     A                                      COLHDG('Diary' 'To')
     A            ADDIAU    R               REFFLD(CODE)
     A                                      TEXT('Alt diary user flag')
     A                                      COLHDG('Alt' 'Flag')
     A            ADUSR     R               REFFLD(USER)
     A                                      TEXT('Alternate diary user')
     A                                      COLHDG('Alt' 'Diary User')
     A            ADDIDY    R               REFFLD(DYS)
     A                                      TEXT('Number of days to diary')
     A                                      COLHDG('# Days' 'to Diary')
     A            ADDIDT    R               REFFLD(FLAG)
     A                                      TEXT('Basis date')
     A                                      COLHDG('Basis')
     A            ADOCUR    R               REFFLD(FLAG)
     A                                      TEXT('Occurence flag')
     A                                      COLHDG('Occur' 'Flag')
     A            ADLTFL    R               REFFLD(FLAG)
     A                                      TEXT('Lost time flag')
     A                                      COLHDG('LT' 'Flag')
     A            ADCSTS    R               REFFLD(FLAG)
     A                                      TEXT('Claim status flag')
     A                                      COLHDG('Stat' 'Flag')
     A            ADAMT     R               REFFLD(A90)
     A                                      TEXT('Amount criteria')
     A                                      COLHDG('Amt criteria')
     A            ADRECD    R               REFFLD(CODE)
     A                                      TEXT('Reserve code criteria')
     A                                      COLHDG('Rsv' 'Code')
     A            ADBR2     R               REFFLD(CODE)
     A                                      TEXT('Payment value 1 criteria')
     A                                      COLHDG('Pmt' 'Val1')
     A            ADCNT     R               REFFLD(A30)
     A                                      TEXT('Count criteria')
     A                                      COLHDG('Count')
     A            ADCIND    R               REFFLD(CODE)
     A                                      TEXT('Claim indicator')
     A                                      COLHDG('Clm' 'Ind')
     A            ADSTAT    R               REFFLD(STAT)
     A                                      TEXT('Status')
     A                                      COLHDG('Sts')
     A*
     A            ADUSER    R               REFFLD(USER)
     A                                      TEXT('Maint user name')
     A                                      COLHDG('Maint user')
     A            ADPGM     R               REFFLD(PGM)
     A                                      TEXT('Updating program')
     A                                      COLHDG('Update Pgm')
     A            ADTIME    R               REFFLD(TIME)
     A                                      TEXT('Time updated')
     A                                      COLHDG('Update Time')
     A            ADDT      R               REFFLD(DT)
     A                                      TEXT('Date updated')
     A                                      COLHDG('Update Date')
     A            ADIUSR    R               REFFLD(USER)
     A                                      COLHDG('Initial User')
     A                                      TEXT('Initial user')
     A            ADIPGM    R               REFFLD(PGM)
     A                                      TEXT('Initial program')
     A                                      COLHDG('Init Pgm')
     A            ADITIM    R               REFFLD(TIME)
     A                                      TEXT('Initial time')
     A                                      COLHDG('Init Time')
     A            ADIDT     R               REFFLD(DT)
     A                                      TEXT('Initial date')
     A                                      COLHDG('Initial'  'Date')
     A            ADJRST    R               REFFLD(CODE)
     A                                      TEXT('Jusridiction St')
     A                                      COLHDG('Jur' 'St')
     A******* Beg add ********* 02/01/10 **************************
     A            ADWKPD    R     S         REFFLD(WKS)
     A                                      TEXT('# Weeks paid')
     A                                      COLHDG('# weeks' 'paid')
     A            ADGRET    R     S         REFFLD(PC52)
     A                                      TEXT('% Group retention')
     A                                      COLHDG('% Grp ret')
     A            ADTOTP    R     S         REFFLD(A112)
     A                                      TEXT('Total paid amount')
     A                                      COLHDG('Tot paid' 'Amount')
     A            ADNCC1    R               REFFLD(CODE)
     A                                      TEXT('NCCI code 1')
     A                                      COLHDG('NCCI' 'Code 1')
     A            ADNCC2    R               REFFLD(CODE)
     A                                      TEXT('NCCI code 2')
     A                                      COLHDG('NCCI' 'Code 2')
     A            ADNCC3    R               REFFLD(CODE)
     A                                      TEXT('NCCI code 3')
     A                                      COLHDG('NCCI' 'Code 3')
     A            ADBR2A    R               REFFLD(CODE)
     A                                      TEXT('PV1 Code 2')
     A                                      COLHDG('PV1 Code 2')
     A            ADBR2B    R               REFFLD(CODE)
     A                                      TEXT('PV1 Code 2')
     A                                      COLHDG('PV1 Code 2')
     A            ADBR2C    R               REFFLD(CODE)
     A                                      TEXT('PV1 Code 3')
     A                                      COLHDG('PV1 Code 3')
     A            ADBR2D    R               REFFLD(CODE)
     A                                      TEXT('PV1 Code 4')
     A                                      COLHDG('PV1 Code 4')
     A******* End add ********* 02/01/10 **************************
