     A*  (C) Copyright Progressive Data Systems, Inc., 1988
     A** (C) COPYRIGHT INSURANCE ADMINISTRATIVE SYSTEMS, INC. 1987
     A**
     A** WORKERS' COMPENSATION REGION MASTER RECORD
     A*
     A          R PAE01                     PFILE(WMAEP)
     A          K AECO#
     A          K AEAREA
