     A*  (C) Copyright Progressive Data Solutions, Inc., 1997
     A*
     A** WORKERS' COMPENSATION AGENT MASTER RECORD
     A*
     A          R PAG01                     PFILE(WMAGP)
     A          K AGCO#
     A          K AGFEIN
     A          K AGMOD
