      * (c) 2012 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*                                                               *
     A*  WORKERS' COMPENSATION AUDIT TRACKING LOG FILE
     A*****************************************************************
     A*  DESCRIPTIONS:                                                *
     A*    FILE FOR TRACKING AUDIT REQUESTS                           *
     A*****************************************************************
     A*  CREATED: 12/27/96       PROJECT: CM025       PROGRAMMER: 57  *
     A*****************************************************************
     A*                                                               *
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*  11/06/06 C:132 PROJECT: 71WHM                                *
     A*                 Add - Audit Calculate Date   : AUTYPA         *
     A*                 Add - Audit Print Date       : AUAPDT         *
     A*                 Chg DESC - AUPRDT to "Final Audit Print Date" *
     A*                                                               *
     A*  03/23/05 C:53 PROJECT: WC1196                                *
     A*                ADDED TYPE OF AUDIT           : AUTYPA         *
     A*                                                               *
     A*  12/17/98 C:90 PROJECT: 81WOJ                                 *
     A*                ADDED ORIGINAL AUDIT COMPANY  : AUOCO          *
     A*                                                               *
     A*  03/04/98 C:87 PROJECT WC630                                  *
     A*                ADDED CANX AUDIT REQUEST FLAG : AUCXFL         *
     A*                ADDED POLICY EXPIRATION DATE  : AUPTDT         *
     A*                ADDED AUDIT ATTEMPT DATE      : AUATDT         *
     A*                ADDED AUDIT CONTESTED FLAG    : AUCNFL         *
     A*                                                               *
     A*****************************************************************
     A
     A                                      REF(WREFP)
     A
     A          R PAU01                     TEXT('AUDIT LOG FILE')
     A
     A            AUCO#     R               REFFLD(CO#)
     A            AUFND     R               REFFLD(FND)
     A            AUFYR     R               REFFLD(FYR)
     A            AUEMP#    R               REFFLD(EMP#)
     A            AUDIV     R               REFFLD(DIV)
     A            AUACO     R               REFFLD(STAF)
     A                                      COLHDG('AUDIT' 'COMPANY')
     A            AURQDT    R               REFFLD(DT)
     A                                      COLHDG('REQUEST''DATE')
     A            AURCVD    R               REFFLD(DT)
     A                                      COLHDG('AUDIT RECD' 'DATE')
     A            AUPRDT    R               REFFLD(DT)
     A                                      COLHDG('FINAL AUDIT' 'PRINT DATE')
     A            AURVFL    R               REFFLD(FLAG)
     A                                      COLHDG('RE-AUDITED' 'Y/N')
     A            AUMAIL    R               REFFLD(DT)
     A                                      COLHDG('AUDIT MAILED' 'DATE')
     A            AUCNTD    R               REFFLD(DT)
     A                                      COLHDG('CONTESTED' 'DATE')
     A            AUATTM    R               REFFLD(CNT)
     A                                      COLHDG('AUDIT ATTEMPTS')
     A            AUSTAF    R               REFFLD(STAF)
     A            AUREP     R               REFFLD(STAF)
     A            AUCOM1    R               REFFLD(DS40)
     A                                      COLHDG('CONTEST' 'COMMENT 1')
     A            AUCOM2    R               REFFLD(DS40)
     A                                      COLHDG('CONTEST' 'COMMENT 2')
     A            AUCOM3    R               REFFLD(DS40)
     A                                      COLHDG('CONTEST' 'COMMENT 3')
     A            AUCOM4    R               REFFLD(DS40)
     A                                      COLHDG('CONTEST' 'COMMENT 4')
     A            AURSGN    R               REFFLD(FLAG)
     A                                      COLHDG('REASSIGNED' 'Y/N')
     A            AUREFL    R               REFFLD(FLAG)
     A                                      COLHDG('AUDIT REVISED' 'Y/N')
     A            AUSTAT    R               REFFLD(STAT)
     A            AUUSER    R               REFFLD(USER)
     A            AUPGM     R               REFFLD(PGM)
     A            AUTIME    R               REFFLD(TIME)
     A            AUDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            AUCXFL    R               REFFLD(FLAG)
     A                                      COLHDG('CANX AUD' 'RQST FLAG')
     A            AUPTDT    R               REFFLD(DT)
     A                                      COLHDG('POLICY EXP' 'DATE')
     A            AUATDT    R               REFFLD(DT)
     A                                      COLHDG('AUDIT ATTEMPT' 'DATE')
     A            AUCNFL    R               REFFLD(FLAG)
     A                                      COLHDG('AUDIT' 'CONTESTED')
     A            AUOCO     R               REFFLD(STAF)
     A                                      COLHDG('ORIGINAL' 'AUDIT' 'COMPANY')
     A            AUTYPA    R               REFFLD(CODE)
     A                                      COLHDG('TYPE OF AUDIT')
     A            AUACDT    R               REFFLD(DT7S)
     A                                      TEXT('Date of Audit Calculation')
     A                                      COLHDG('DATE AUDIT' 'CALCULATION')
     A            AUAPDT    R               REFFLD(DT7S)
     A                                      COLHDG('AUDIT' 'PRINT DATE')
