     A*  (C) Copyright Progressive Data Solutions, Inc., 1998
     A*                                                               *
     A*  WORKERS' COMPENSATION AUDIT TRACKING CONTROL FILE
     A*****************************************************************
     A*  DESCRIPTION:                                                 *
     A*    AUDIT TRACKING CONTROL INFO                                *
     A*****************************************************************
     A*  CREATED: 02/02/98       PROJECT: WC630       PROGRAMMER: 87  *
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*  11/27/06 C:136 PROJECT: 71WHL                                *
     A*                 ADD FIELDS FOR AUDIT DIARY AND STAFF CODES    *
     A*****************************************************************
     A
     A                                      REF(WREFP)
     A
     A          R PAX01                     TEXT('AUDIT TRACKING CONTROL +
     A                                            FILE')
     A
     A            AXCO#     R               REFFLD(CO#)
     A            AXFND     R               REFFLD(FND)
     A            AXAACD    R               REFFLD(RMCD)
     A                                      COLHDG('AUDIT ATT' 'DARTS CODE')
     A            AXFRCD    R               REFFLD(RMCD)
     A                                      COLHDG('FINAL AUD RVSD' 'DARTS CD')
     A            AXFMCD    R               REFFLD(RMCD)
     A                                      COLHDG('FIN AUD MAILED' 'DARTS CD')
     A            AXACCD    R               REFFLD(RMCD)
     A                                      COLHDG('AUDIT CONTESTED' 'CODE')
     A            AXRCCD    R               REFFLD(RMCD)
     A                                      COLHDG('FINAL AUD RCVD' 'DARTS CD')
     A            AXCCCD    R               REFFLD(RMCD)
     A                                      COLHDG('CLR CNTSTD INFO' 'DARTS CD')
     A            AXREAR    R               REFFLD(RMCD)
     A                                      COLHDG('REASSIGN' ' AUDIT REP')
     A            AXUSER    R               REFFLD(USER)
     A            AXPGM     R               REFFLD(PGM)
     A            AXDT      R               REFFLD(DT)
     A            AXTIME    R               REFFLD(TIME)
     A            AXIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL USER')
     A            AXIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL DATE')
      *** BEG ADD ***** 11/27/06 ***********************************************
     A            AXIADC    R               REFFLD(RMCD)
     A                                      COLHDG('INIT AUD' 'DARTS CODE')
     A            AXRADC    R               REFFLD(RMCD)
     A                                      COLHDG('REV AUD' 'DARTS CODE')
     A            AXDASC    R               REFFLD(STAF)
     A                                      COLHDG('DFLT AUD' 'STAF CODE')
      *** END ADD ***** 11/27/06 ***********************************************
