      * (c) 2012 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*********************************************************************
     A** WORKERS' COMPENSATION BANK INFORMATION FILE - LOGICAL            *
     A*                                                                   *
     A*  03/27/06 C:132 Project: W025  47283                              *
     A*                                                                   *
     A*  REVISIONS:                                                       *
     A*                                                                   *
     A*********************************************************************
     A          R PBI01                     PFILE(WMBIP)
     A          K BICO#
     A          K BIACCT
     A          K BIAPPL
     A          K BIFND
     A          K BIEFDT                    DESCEND
