     A*(C) Copyright Progressive Data Solutions Inc., 1987,88,91,95,97
     A****************************************************************
     A*  REVISIONS:                                                  *
     A*                                                              *
     A*  02/16/95 C:24 PROJECT WC367                                 *
     A*                ADD FUND TO THE KEY.                          *
     A*                                                              *
     A****************************************************************
     A*
     A          R PBX01                     PFILE(WMBXP)
     A          K BXCO#
     A*** BEGIN ADD *** 02/16/95 ****************************************
     A          K BXFND
     A*** END ADD ***** 02/16/95 ****************************************
     A          K BXTYPE
     A          K BXEFDT
     A          K BXBSCD
