      * (c) 2022 Sapiens. All Rights Reserved.                             *
     A**
     A** WORKERS' COMP CLAIMANT DEMOGRAPHICS FILE
     A*****************************************************************
     A****              I M P O R T A N T    N O T E               ****
     A****                                                         ****
     A****  BEFORE MAKING DATA BASE CHANGES TO THIS FILE, YOU NEED ****
     A****  TO INFORM THE FEE SCHEDULE PROJECT LEADER BECAUSE IT   ****
     A****  WILL AFFECT THE FSMS SYSTEM !!!!!!!!!                  ****
     A****                                                         ****
     A*****************************************************************

      *****************************************************************
      *  SPECIAL FILE NOTES:                                          *
      *                                                               *
      *  THE FOLLOWING FILES/PROGRAMS MUST BE MODIFIED ANYTIME A NEW  *
      *  FIELD IS ADDED TO WMCDP:                                     *
      *                                                               *
      *  - NEW FIELD MUST BE ADDED TO CORRESPONDING FILES IN THE      *
      *    TEST ENVIRONMENT.                                          *
      *                                                               *
      *  - CLIENT 03: NEW FIELD MUST BE ADDED TO CORRESPONDING FILES  *
      *    IN WPEACOCK                                                *
      *                                                               *
      *****************************************************************
      * REVISIONS:                                                    *
      *                                                               *
      * 02/14/22 C:079 Project: WC2797                                *
      *                IAIABC 3.1.4 New Fields                        *
      *                                                               *
      * 07/25/16 C:136 Project: 114WYQ                                *
      *                Add Disable SMS Texting Flag                   *
      *                                                               *
      * 05/09/16  C:300  PROJECT: 114WXV                              *
      *                  Add Cell Number to Claimant Demographics.    *
      *                                                               *
      * 01/09/13  C:284  Project: 146WFQ                              *
      *                  Transform: Add Height and Weight Fields      *
      *                                                               *
      * 01/31/12  C:189  Project: WC2109                              *
      *                  Transform: Add Clm Contacts email fields     *
      *                                                               *
      * 12/13/10  C:198  Project: WC1963                              *
      *                  Add new field to store HICN#                 *
      *                                                               *
      * 10/05/09  C:33   Project: WC1770                              *
      *                  Add new field to store the Medical           *
      *                   Beneficiary flag.                           *
      *                                                               *
      * 11/06/02  C:53   PROJECT: WC909                               *
      *                  OUT-OF-COUNTRY CITY/PROVINCE/POSTAL CODE.    *
      *                                                               *
      * 04/25/02  C:35   PROJECT: WC909                               *
      *                  ADDED OUT-OF-COUNTRY ZIP AND COUNTRY CODE.   *
      *                                                               *
      * 07/06/00  C:35   PROJECT: ADDED CLAIMANT ID NUMBER AND TYPE.  *
      *                                                               *
      *****************************************************************

     A                                      REF(WREFP)
     A          R PCD01                     TEXT('CLAIMANT DEMOGRAPHICS FILE')
     A            CDSS#     R               REFFLD(SS#)
     A            CDLSN     R               REFFLD(LSN)
     A            CDFSN     R               REFFLD(FSN)
     A            CDMID     R               REFFLD(MID)
     A            CDADR1    R               REFFLD(ADR1)
     A            CDADR2    R               REFFLD(ADR2)
     A            CDCTY     R               REFFLD(CTY)
     A            CDST      R               REFFLD(ST)
     A            CDZIP     R               REFFLD(ZIP)
     A            CDDTOB    R               REFFLD(DT)
     A                                      COLHDG('DATE OF' 'BIRTH')
     A            CDSEX     R               REFFLD(FLAG)
     A                                      COLHDG('GENDER')
     A            CDSTAT    R               REFFLD(STAT)
     A            CDUSER    R               REFFLD(USER)
     A            CDPGM     R               REFFLD(PGM)
     A            CDTIME    R               REFFLD(TIME)
     A            CDDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            CDAREA    R               REFFLD(A30)
     A                                      COLHDG('AREA' 'CODE')
     A            CDPHN#    R               REFFLD(PHN#)
     A                                      COLHDG('PHONE#')
     A            CDMSTS    R               REFFLD(FLAG)
     A                                      COLHDG('MARITAL' 'STATUS')
     A            CDCNTY    R               REFFLD(DS10)
     A                                      COLHDG('COUNTY' 'CODE')
     A            CDWARA    R               REFFLD(A30)
     A                                      COLHDG('WORK AREA' 'CODE')
     A            CDWPH#    R               REFFLD(PHN#)
     A                                      COLHDG('WORK' 'PHONE#')
     A            CDIUSR    R               REFFLD(USER)
     A            CDIPGM    R               REFFLD(PGM)
     A            CDITM     R               REFFLD(TIME)
     A            CDIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            CDIDTP    R               REFFLD(FLAG)
     A                                      COLHDG('CLAIMANT ID TYPE')
     A            CDID#     R               REFFLD(DS15)
     A                                      COLHDG('CLAIMANT ID#')
     A            CDOZIP         9A         COLHDG('OUT OF COUNTRY' 'ZIP CODE')
     A            CDCTRY         3A         COLHDG('COUNTRY CODE')
     A            CDADR3    R               REFFLD(DS40)
     A                                      COLHDG('CITY/PROV/POSTAL CD')
     A            CDMDBN    R               REFFLD(FLAG)
     A                                      COLHDG('Medical' 'Beneficiary' -
     A                                      'Flag')
     A            CDHICN        12A
     A                                      COLHDG('Health Insurance' -
     A                                      'claim number')
     A*** Beg Add *** 01/31/12 **********************************************
     A            CDEMAD    R               REFFLD(DS60)
     A                                      COLHDG('Claimant E-mail' -
     A                                      'Address')
     A*** End Add *** 01/31/12 **********************************************
     A*** Beg Add *** 01/09/13 **********************************************
     A            CDHEIGT   R               REFFLD(DS5)
     A                                      COLHDG('Claimant Height')
     A
     A            CDWGT     R               REFFLD(DS3)
     A                                      COLHDG('Claimant Weight')
     A*** End Add *** 01/09/13 **********************************************
     A*** Beg Add *** 05/09/16 *************************************************
     A            CDCARA    R     S         REFFLD(AREA)
     A                                      COLHDG('CELL PHONE' 'AREA CODE')
     A            CDCPHN    R     S         REFFLD(PHN#)
     A                                      COLHDG('CELL PHONE' 'NUMBER')
     A*** End Add *** 05/09/16 *************************************************
     A*** Beg Add ***** 007/25/16 **********************************************
     A            CDDISSMS  R               REFFLD(FLAG)
     A                                      COLHDG('Disable' 'SMS Flag')
     A*** End Add ***** 007/25/16 **********************************************
     A*** Beg Add ***** 02/14/22 ***********************************************
     A            CDEDUL         2S 0       COLHDG('Employee Education'      +
     A                                             'Level')
     A*** End Add ***** 02/14/22 ***********************************************
