      * Copyright('(c) 2022 Sapiens. All Rights Reserved.')                *
      *
      * Carrier Info File
      *****************************************************************
      * REVISIONS:
      *
      * 03/07/22  C:340 PROJECT: WC2843
      *                 Created.
      *
      *****************************************************************
      *
     A                                      REF(WREFP)
     A          R PCG01                     TEXT('Carrrier Info File')
      *
     A            CGCO#          3S 0       COLHDG('COMPANY')
      *
     A            CGCAR#         5S 0       COLHDG('CARRIER #')
      *
     A            CGNAME        60A         COLHDG('CARRIER NAME')
      *
     A            CGDT           7S 0       COLHDG('DATE')
     A
      *
     A            CGTIME         6S 0       COLHDG('TIME')
     A
      *
     A            CGPGM     R               REFFLD(PGM)
     A                                      COLHDG('PROGRAM')
      *
     A            CGUSER    R               REFFLD(USER)
     A                                      COLHDG('USER')
      *
     A            CGIDT          7S 0       COLHDG('INITIAL' 'DATE')
     A
      *
     A            CGITM          6S 0       COLHDG('INITIAL' 'TIME')
     A
      *
     A            CGIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PROGRAM')
      *
     A            CGIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
      *
