     A*  (C) Copyright Fiserv, Inc.,  2007
     A****************************************************************
     A*  Claims User Security File                                   *
     A****************************************************************
     A*  CREATED  :                                                  *
     A*                                                              *
     A*  05/25/07  C:191 PROJECT: WC1515                             *
     A*                                                              *
     A*                                                              *
     A*  REVISIONS:                                                  *
     A*                                                              *
     A*  XX/XX/XX  C:XXX PROJECT: XXXXXX                             *
     A*                                                              *
     A****************************************************************
     A                                      REF(WREFP)
     A          R PCU01                     TEXT('CLAIMS USER SECURITY FILE')
     A            CUCO#     R               REFFLD(CO#)
     A            CUFND     R               REFFLD(FND)
     A            CUFYR     R               REFFLD(FYR)
     A            CUCASE    R               REFFLD(CASE)
     A            CUCNAM        45A         COLHDG('CLAIMANT' 'NAME')
     A            CUAUSR    R               REFFLD(USER)
     A                                      COLHDG('AUTHORISED' 'USER')
     A            CUSTAT    R               REFFLD(CODE)
     A                                      COLHDG('STATUS')
     A            CUPGM     R               REFFLD(PGM)
     A                                      COLHDG('LAST MAINTENANCE' 'PROGRAM')
     A            CUUSER    R               REFFLD(USER)
     A                                      COLHDG('LAST MAINTENANCE' 'USER')
     A            CUDT      R               REFFLD(DT)
     A                                      COLHDG('LAST MAINTENANCE' 'DATE')
     A            CUTIME    R               REFFLD(TIME)
     A                                      COLHDG('LAST MAINTENANCE' 'TIME')
     A            CUIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL ENTRY' 'PROGRAM')
     A            CUIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL ENTRY' 'USER')
     A            CUIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL ENTRY' 'DATE')
     A            CUITM     R               REFFLD(TIME)
     A                                      COLHDG('INITIAL ENTRY' 'TIME')
