     A*  (C) Copyright Progressive Data Solutions, Inc., 1991, 1992, 2003, 2004
     A**
     A** Direct Debit Employer Maintenance
     A*****************************************************************
     A*  REVISIONS                                                    *
     A*                                                               *
     A*  01/14/04 C:136 PROJECT: WC1116                               *
     A*                 ADD START AND END DATE FIELDS                 *
     A*                                                               *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PDB01                     TEXT('DIRECT DEBIT EMP MAINT')
     A            DBCO#     R               REFFLD(CO#)
     A            DBFND     R               REFFLD(FND)
     A            DBEMP#    R               REFFLD(EMP#)
     A            DBDIV     R               REFFLD(DIV)
     A            DBCSFL    R               REFFLD(FLAG)
     A                                      COLHDG('CHECKING/' 'SAVINGS FLAG')
     A            DBDFII         8S         COLHDG('DFI IDENTIFICATION')
     A            DBTRCD         1S         COLHDG('TRANSIT/ROUTING' 'CHK DGT')
     A            DBDFIA        17A         COLHDG('DFI ACCOUNT NUMBER')
     A            DBPRED    R               REFFLD(DT)
     A                                      COLHDG('PRENOTIFICATION DATE')
     A            DB1STD    R               REFFLD(DT)
     A                                      COLHDG('DATE OF' 'FIRST TRANSFER')
     A            DBLSTD    R               REFFLD(DT)
     A                                      COLHDG('DATE OF' 'LAST TRANSFER')
     A            DBSTAT    R               REFFLD(STAT)
     A            DBUSER    R               REFFLD(USER)
     A                                      COLHDG('MAINTENANCE USER')
     A            DBPGM     R               REFFLD(PGM)
     A                                      COLHDG('MAINTENANCE PGM')
     A            DBTIME    R               REFFLD(TIME)
     A                                      COLHDG('TIME' 'MAINTAINED')
     A            DBDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            DBCXDT    R               REFFLD(DT)
     A                                      COLHDG('CANCELLATION' 'DATE')
     A            DBIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL USER')
     A            DBIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL PGM')
     A            DBITM     R               REFFLD(TIME)
     A                                      COLHDG('INITIAL TIME')
     A            DBIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL DATE')
     A            DBEFDT         7S 0
     A                                      COLHDG('EFF DATE')
     A            DBEXDT         7S 0
     A                                      COLHDG('EXP DATE')
