     A*  (C) Copyright Progressive Data Systems, Inc., 1994
     A** WORKERS' COMP DEPARTMENT CODE FILE
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*****************************************************************
     A**
     A                                      REF(WREFP)
     A          R PDE01                     TEXT('DEPT CODE FILE')
     A            DECO#     R               REFFLD(CO#)
     A            DEDEPT    R               REFFLD(CODE)
     A                                      COLHDG('DEPARTMENT')
     A            DEDPCD    R               REFFLD(DPCD)
     A                                      TEXT('DEPT CODE')
     A            DEDPNM    R               REFFLD(DS40)
     A                                      TEXT('DEPT NAME')
     A            DESTAT    R               REFFLD(STAT)
     A            DEUSER    R               REFFLD(USER)
     A            DEPGM     R               REFFLD(PGM)
     A            DETIME    R               REFFLD(TIME)
     A            DEDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            DEIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            DEIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'ENTRY' 'DATE')
