      * (c) 2015 StoneRiver, Inc. All rights Reserved.
      * StoneRiver is a trademark of StoneRiver, Inc.
      *
      *  Workers' Compensation Employer Account's Rec File
      *
      *  Created on 08/18/2015 by C:279 for Support: 36421
     A************************************************************
     A* Revisions:                                               *
     A*                                                          *
     A*                                                          *
     A************************************************************
     A          R PEA01                     PFILE(WMEAP)
     A          K EACO#
     A          K EAFND
     A          K EAFYR
     A          K EAEMP#
     A          K EAPODT
     A          K EATRDT
     A          K EADIV
