     A* (c) 2018 StoneRiver, Inc. All rights Reserved.                *
     A* StoneRiver is a trademark of StoneRiver, Inc.                 *
     A****************************************************************
     A** WORKERS' COMPENSATION EMPLOYER MASTER FILE
     A****************************************************************
     A*
     A          R PEM01                     PFILE(WMEMP)
     A          K EMCO#
     A          K EMPST
     A          K EMCNTY
