      * (c) 2025 Sapiens. All Rights Reserved.
      *
      *  WORKERS' COMPENSATION ENDORSEMENT FILE
      *-----------------------------------------------------
      * REVISIONS:
      *
      * 07/31/25  C:300 Support: 117577 (AmWins)
      *                 Waiver of Subrogation MTE not attaching WC890600B
      *                 Add ENWVFL waiver change flag
      *
      * 02/24/25  C:65  PROJECT: PHW#118336  (CAREWEST)
      *                 ADD LARGE FIELDS FOR BEFORE/AFTER INFORMATION.
      *
      * 10/13/09  C:61  PROJECT: C139WLR
      *                 Add flag to indicate "CLT139 Misc End Process".
      *
      * 08/17/05  C:61  PROJECT: WC1266
      *                 Add flag to indicated "Rescission of Deletion
      *                 of Division" processing.
      *
      * 05/21/04  C:65  PROJECT: WC1202
      *                 ADD AFTER FIELDS FOR EXTENDED EMPLOYER NAMES.
      *
      * 05/15/04  C:61  PROJECT: WC1223
      *                 Add field for "Update mailing addr on all
      *                 entity / locations ?".
      *
      * 05/14/04  C:65  PROJECT: WC1202
      *                 ADD FIELDS FOR EXTENDED EMPLOYER NAMES.
     A*                                                               *
     A* 06/05/02  C:132 PROJECT WC1065                                *
     A*                - Add Agency Address Change Code               *
     A*                                                               *
     A* 03/29/01 C:09 PROJECT: CM027                                  *
     A*               ADDED FIELD TO HOLD THE VALUE OF THE OLD AGENT  *
     A*               NUMBER SINCE ENAGT# AND ENAGT2 WILL HAVE THE    *
     A*               SAME VALUE (ENAGT# PRINTS ON THE FORM SHOWING   *
     A*               THE MOST CURRENT AGENT, ENAGT2 IS THE NEW AGT)  *
     A*                                                               *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PEN01                     TEXT('ENDORSEMENT FILE')
     A            ENCO#     R               REFFLD(CO#)
     A            ENFND     R               REFFLD(FND)
     A            ENEMP#    R               REFFLD(EMP#)
     A            ENDIV     R               REFFLD(DIV)
     A            ENFYR     R               REFFLD(FYR)
     A                                      COLHDG('ENDORSEMENT' 'FUND YEAR')
     A            ENJOB     R               REFFLD(A60)
     A                                      COLHDG('JOB NUMBER')
     A            ENEND#    R               REFFLD(SEQ#)
     A                                      COLHDG('END#')
     A            ENREQ#    R               REFFLD(SEQ#)
     A                                      COLHDG('REQ#')
     A            ENSEQ#    R               REFFLD(SEQ#)
     A            ENEEDT    R               REFFLD(DT)
     A                                      COLHDG('ENDORSEMENT' 'EFF DT')
     A*** OLD FIELD VALUES
     A            ENNAM1    R               REFFLD(NAME)
     A                                      COLHDG('BF EMPLOYER' 'NAME')
     A            ENFDN1    R               REFFLD(NAME)
     A                                      COLHDG('BF FEDERAL' 'EMPLR' 'NAME')
     A            ENCON1    R               REFFLD(NAME)
     A                                      COLHDG('BF CONTACT' 'PERSON')
     A            ENATT1    R               REFFLD(NAME)
     A                                      COLHDG('BF ATTENTION' 'NAME')
     A            ENCN31    R               REFFLD(NAME)
     A                                      COLHDG('BF CONTACT' 'NAME 3')
     A            ENFEN1    R               REFFLD(FEIN)
     A                                      COLHDG('BF EMPLOYER' 'FED ID #')
     A            ENTOB1    R               REFFLD(FLAG)
     A                                      COLHDG('BF TYPE OF' 'BUSINESS')
     A            ENMA11    R               REFFLD(ADR1)
     A                                      COLHDG('BF MAILING' 'ADDRESS 1')
     A            ENMA21    R               REFFLD(ADR2)
     A                                      COLHDG('BF MAILING' 'ADDRESS 2')
     A            ENMCT1    R               REFFLD(CTY)
     A                                      COLHDG('BF MAILING' 'CITY')
     A            ENMST1    R               REFFLD(ST)
     A                                      COLHDG('BF MAILING' 'STATE')
     A            ENMZP1    R               REFFLD(ZIP)
     A                                      COLHDG('BF MAILING' 'ZIP CODE')
     A            ENPA11    R               REFFLD(ADR1)
     A                                      COLHDG('BF PHYSICAL' 'ADDRESS 1')
     A            ENPA21    R               REFFLD(ADR2)
     A                                      COLHDG('BF PHYSICAL' 'ADDRESS 2')
     A            ENPCT1    R               REFFLD(CTY)
     A                                      COLHDG('BF PHYSICAL' 'CITY')
     A            ENPST1    R               REFFLD(ST)
     A                                      COLHDG('BF PHYSICAL' 'STATE')
     A            ENPZP1    R               REFFLD(ZIP)
     A                                      COLHDG('BF PHYSICAL' 'ZIP CODE')
     A            ENCNT1    R               REFFLD(CODE)
     A                                      COLHDG('BF' 'COUNTY' 'CODE')
     A            ENOFI1    R               REFFLD(FEIN)
     A                                      COLHDG('BF OTHER' 'EMPLR FED ID #')
     A            ENOFN1    R               REFFLD(NAME)
     A                                      COLHDG('BF OTHER' 'FED EMPLR NAME')
     A            ENOEN1    R               REFFLD(NAME)
     A                                      COLHDG('BF OTHER' 'EMPLOYER NAME')
     A            ENOM11    R               REFFLD(ADR1)
     A                                      COLHDG('BF OTHER' 'MAIL ADDRESS 1')
     A            ENOM21    R               REFFLD(ADR2)
     A                                      COLHDG('BF OTHER' 'MAIL ADDRESS 2')
     A            ENOMC1    R               REFFLD(CTY)
     A                                      COLHDG('BF OTHER' 'MAIL CITY')
     A            ENOMS1    R               REFFLD(ST)
     A                                      COLHDG('BF OTJER' 'MAIL STATE')
     A            ENOMZ1    R               REFFLD(ZIP)
     A                                      COLHDG('BF OTHER' 'MAIL ZIP CODE')
     A            ENOP11    R               REFFLD(ADR1)
     A                                      COLHDG('BF OTHER' 'PHYSICAL ADDR 1')
     A            ENOP21    R               REFFLD(ADR2)
     A                                      COLHDG('BF OTHER' 'PHYSICAL ADDR 2')
     A            ENOPC1    R               REFFLD(CTY)
     A                                      COLHDG('BF OTHER' 'PHYSICAL CITY')
     A            ENOPS1    R               REFFLD(ST)
     A                                      COLHDG('BF OTHER' 'PHYSICAL STATE')
     A            ENOPZ1    R               REFFLD(ZIP)
     A                                      COLHDG('BF OTHER' 'PHYSICAL ZIP')
     A            ENOCN1    R               REFFLD(CODE)
     A                                      COLHDG('BF OTHER' 'COUNTY CODE')
     A            ENOC11    R               REFFLD(NAME)
     A                                      COLHDG('BF OTHER' -
     A                                      'CONTACT 1 NAME CHG')
     A            ENOC21    R               REFFLD(NAME)
     A                                      COLHDG('BF OTHER' -
     A                                      'CONTACT 2 NAME CHG')
     A            ENOC31    R               REFFLD(NAME)
     A                                      COLHDG('BF OTHER' -
     A                                      'CONTACT 3 NAME CHG')
     A            ENIC11    R               REFFLD(CODE)
     A                                      COLHDG('BF INCR' 'LIMIT' 'CODE 1')
     A            ENID11    R               REFFLD(DS30)
     A                                      COLHDG('BF INCR' 'LIMIT' 'DESC 1')
     A            ENIC21    R               REFFLD(CODE)
     A                                      COLHDG('BF INCR' 'LIMIT' 'CODE 2')
     A            ENID21    R               REFFLD(DS30)
     A                                      COLHDG('BF INCR' 'LIMIT' 'DESC 2')
     A            ENEM11    R               REFFLD(PC54)
     A                                      COLHDG('BF' 'EXP MOD 1')
     A            ENEM21    R               REFFLD(PC54)
     A                                      COLHDG('BF' 'EXP MOD 2')
     A            ENEM31    R               REFFLD(PC54)
     A                                      COLHDG('BF' 'EXP MOD 3')
     A            ENED11    R               REFFLD(DT8)
     A                                      COLHDG('BF' 'EXP MOD DT 1')
     A            ENED21    R               REFFLD(DT8)
     A                                      COLHDG('BF' 'EXP MOD DT 2')
     A            ENED31    R               REFFLD(DT8)
     A                                      COLHDG('BF' 'EXP MOD DT 3')
     A            ENNOB1    R               REFFLD(DS40)
     A                                      COLHDG('BF NATURE' 'OF BUS.')
     A            ENPOL1        17A         COLHDG('BF' 'POLICY #')
     A            ENCAR1    R               REFFLD(CLAS)
     A                                      COLHDG('BF CARR #')
     A            ENPFD1    R               REFFLD(DT)
     A                                      COLHDG('BF EFF DT')
     A            ENPTD1    R               REFFLD(DT)
     A                                      COLHDG('BF EXP DT')
     A            ENRSK1    R               REFFLD(DS15)
     A                                      COLHDG('BF NCCI RISK ID')
     A            ENAGT#    R               REFFLD(AGT#)
     A                                      COLHDG('BF AGT#' 'ASSIGNED BY FUND')
     A            ENAGNM    R               REFFLD(NAME)
     A                                      TEXT('BF AGENT NAME')
     A*** NEW FIELD VALUES
     A            ENNAM2    R               REFFLD(NAME)
     A                                      COLHDG('AF EMPLOYER' 'NAME')
     A            ENFDN2    R               REFFLD(NAME)
     A                                      COLHDG('AF FEDERAL' 'EMPLR' 'NAME')
     A            ENCON2    R               REFFLD(NAME)
     A                                      COLHDG('AF CONTACT' 'PERSON')
     A            ENATT2    R               REFFLD(NAME)
     A                                      COLHDG('AF ATTENTION' 'NAME')
     A            ENCN32    R               REFFLD(NAME)
     A                                      COLHDG('AF CONTACT' 'NAME 3')
     A            ENFEN2    R               REFFLD(FEIN)
     A                                      COLHDG('AF EMPLOYER' 'FED ID #')
     A            ENTOB2    R               REFFLD(FLAG)
     A                                      COLHDG('AF TYPE OF' 'BUSINESS')
     A            ENMA12    R               REFFLD(ADR1)
     A                                      COLHDG('AF MAILING' 'ADDRESS 1')
     A            ENMA22    R               REFFLD(ADR2)
     A                                      COLHDG('AF MAILING' 'ADDRESS 2')
     A            ENMCT2    R               REFFLD(CTY)
     A                                      COLHDG('AF MAILING' 'CITY')
     A            ENMST2    R               REFFLD(ST)
     A                                      COLHDG('AF MAILING' 'STATE')
     A            ENMZP2    R               REFFLD(ZIP)
     A                                      COLHDG('AF MAILING' 'ZIP CODE')
     A            ENPA12    R               REFFLD(ADR1)
     A                                      COLHDG('AF PHYSICAL' 'ADDRESS 1')
     A            ENPA22    R               REFFLD(ADR2)
     A                                      COLHDG('AF PHYSICAL' 'ADDRESS 2')
     A            ENPCT2    R               REFFLD(CTY)
     A                                      COLHDG('AF PHYSICAL' 'CITY')
     A            ENPST2    R               REFFLD(ST)
     A                                      COLHDG('AF PHYSICAL' 'STATE')
     A            ENPZP2    R               REFFLD(ZIP)
     A                                      COLHDG('AF PHYSICAL' 'ZIP CODE')
     A            ENCNT2    R               REFFLD(CODE)
     A                                      COLHDG('AF' 'COUNTY' 'CODE')
     A            ENOFI2    R               REFFLD(FEIN)
     A                                      COLHDG('AF OTHER' 'EMPLR FED ID #')
     A            ENOFN2    R               REFFLD(NAME)
     A                                      COLHDG('AF OTHER' 'FED EMPLR NAME')
     A            ENOEN2    R               REFFLD(NAME)
     A                                      COLHDG('AF OTHER' 'EMPLOYER NAME')
     A            ENOM12    R               REFFLD(ADR1)
     A                                      COLHDG('AF OTHER' 'MAIL ADDRESS 1')
     A            ENOM22    R               REFFLD(ADR2)
     A                                      COLHDG('AF OTHER' 'MAIL ADDRESS 2')
     A            ENOMC2    R               REFFLD(CTY)
     A                                      COLHDG('AF OTHER' 'MAIL CITY')
     A            ENOMS2    R               REFFLD(ST)
     A                                      COLHDG('AF OTJER' 'MAIL STATE')
     A            ENOMZ2    R               REFFLD(ZIP)
     A                                      COLHDG('AF OTHER' 'MAIL ZIP CODE')
     A            ENOP12    R               REFFLD(ADR1)
     A                                      COLHDG('AF OTHER' 'PHYSICAL ADDR 1')
     A            ENOP22    R               REFFLD(ADR2)
     A                                      COLHDG('AF OTHER' 'PHYSICAL ADDR 2')
     A            ENOPC2    R               REFFLD(CTY)
     A                                      COLHDG('AF OTHER' 'PHYSICAL CITY')
     A            ENOPS2    R               REFFLD(ST)
     A                                      COLHDG('AF OTHER' 'PHYSICAL STATE')
     A            ENOPZ2    R               REFFLD(ZIP)
     A                                      COLHDG('AF OTHER' 'PHYSICAL ZIP')
     A            ENOCN2    R               REFFLD(CODE)
     A                                      COLHDG('AF OTHER' 'COUNTY CODE')
     A            ENOC12    R               REFFLD(NAME)
     A                                      COLHDG('AF OTHER' -
     A                                      'CONTACT 1 NAME CHG')
     A            ENOC22    R               REFFLD(NAME)
     A                                      COLHDG('AF OTHER' -
     A                                      'CONTACT 2 NAME CHG')
     A            ENOC32    R               REFFLD(NAME)
     A                                      COLHDG('AF OTHER' -
     A                                      'CONTACT 3 NAME CHG')
     A            ENIC12    R               REFFLD(CODE)
     A                                      COLHDG('AF INCR' 'LIMIT' 'CODE 1')
     A            ENID12    R               REFFLD(DS30)
     A                                      COLHDG('AF INCR' 'LIMIT' 'DESC 1')
     A            ENIC22    R               REFFLD(CODE)
     A                                      COLHDG('AF INCR' 'LIMIT' 'CODE 2')
     A            ENID22    R               REFFLD(DS30)
     A                                      COLHDG('AF INCR' 'LIMIT' 'DESC 2')
     A            ENEM12    R               REFFLD(PC54)
     A                                      COLHDG('AF' 'EXP MOD 1')
     A            ENEM22    R               REFFLD(PC54)
     A                                      COLHDG('AF' 'EXP MOD 2')
     A            ENEM32    R               REFFLD(PC54)
     A                                      COLHDG('AF' 'EXP MOD 3')
     A            ENED12    R               REFFLD(DT8)
     A                                      COLHDG('AF' 'EXP MOD DT 1')
     A            ENED22    R               REFFLD(DT8)
     A                                      COLHDG('AF' 'EXP MOD DT 2')
     A            ENED32    R               REFFLD(DT8)
     A                                      COLHDG('AF' 'EXP MOD DT 3')
     A            ENNOB2    R               REFFLD(DS40)
     A                                      COLHDG('AF NATURE' 'OF BUS.')
     A            ENPOL2        17A         COLHDG('AF' 'POLICY #')
     A            ENCAR2    R               REFFLD(CLAS)
     A                                      COLHDG('AF CARR #')
     A            ENPFD2    R               REFFLD(DT)
     A                                      COLHDG('AF EFF DT')
     A            ENPTD2    R               REFFLD(DT)
     A                                      COLHDG('AF EXP DT')
     A            ENRSK2    R               REFFLD(DS15)
     A                                      COLHDG('AF NCCI RISK ID')
     A            ENAGT2    R               REFFLD(AGT#)
     A                                      COLHDG('AF AGT#' 'ASSIGNED BY FUND')
     A            ENAGN2    R               REFFLD(NAME)
     A                                      TEXT('AF AGENT NAME')
     A*** CHANGE TYPE FLAGS
     A            ENNCFL    R               REFFLD(FLAG)
     A                                      COLHDG('NAME CHANGE')
     A            ENFIFL    R               REFFLD(FLAG)
     A                                      COLHDG('FED ID #' 'CHANGE')
     A            ENCNFL    R               REFFLD(FLAG)
     A                                      COLHDG('CONTACT NAME CHANGE')
     A            ENATFL    R               REFFLD(FLAG)
     A                                      COLHDG('ATTN NAME CHANGE')
     A            ENC3FL    R               REFFLD(FLAG)
     A                                      COLHDG('CONTACT 3 NAME CHG')
     A            ENTBFL    R               REFFLD(FLAG)
     A                                      COLHDG('TYP OF BUSINESS CHG')
     A            ENAOFL    R               REFFLD(FLAG)
     A                                      COLHDG('ADDL OFFICER CHG')
     A            ENNOFL    R               REFFLD(FLAG)
     A                                      COLHDG('NOMINAL/' 'OWNERSHIP CHG')
     A            ENADFL    R               REFFLD(FLAG)
     A                                      COLHDG('ADDRESS CHANGE')
     A            ENPAFL    R               REFFLD(FLAG)
     A                                      COLHDG('PHYSICAL' 'ADDR CHG')
     A            ENMAFL    R               REFFLD(FLAG)
     A                                      COLHDG('MAILING' 'ADDR CHG')
     A            ENCNTF    R               REFFLD(FLAG)
     A                                      COLHDG('COUNTY CHG')
     A            ENCBAF    R               REFFLD(FLAG)
     A                                      COLHDG('CHG BOTH' 'ADDR FLG')
     A            ENELTP    R               REFFLD(FLAG)
     A                                      COLHDG('ENTITY/LOCATION TYPE')
     A            ENELID    R               REFFLD(CTGY)
     A                                      COLHDG('ENTITY/LOCATION ID')
     A            ENAELF    R               REFFLD(FLAG)
     A                                      COLHDG('ADDITION' 'OF ENT/LOC')
     A            ENCELF    R               REFFLD(FLAG)
     A                                      COLHDG('CHANGE' 'OF ENT/LOC')
     A            ENDELF    R               REFFLD(FLAG)
     A                                      COLHDG('DELETION' 'OF ENT/LOC')
     A            ENELDD    R               REFFLD(DT)
     A                                      COLHDG('DELETION DATE')
     A            ENELDR    R               REFFLD(DS30)
     A                                      COLHDG('DELETION REASON')
     A            ENMSFL    R               REFFLD(FLAG)
     A                                      COLHDG('MISCELLANEOUS' 'CHG FLG')
     A            ENADDF    R               REFFLD(FLAG)
     A                                      COLHDG('ADDITION OF' 'DIV FLAG')
     A            ENDLDF    R               REFFLD(FLAG)
     A                                      COLHDG('DELETION OF' 'DIV FLAG')
     A            ENILFL    R               REFFLD(FLAG)
     A                                      COLHDG('INCR LMT' 'CHANGE')
     A            ENERFL    R               REFFLD(FLAG)
     A                                      COLHDG('EXP RATE MOD' 'CHG FLG')
     A            ENCRFL    R               REFFLD(FLAG)
     A                                      COLHDG('PAY CLASS/RATE' 'CHG FLG')
     A            ENIAPF    R               REFFLD(FLAG)
     A                                      COLHDG('INTERIM ADJ' 'OF PREM' -
     A                                      'CHG FLAG')
     A            ENNOBF    R               REFFLD(FLAG)
     A                                      COLHDG('NATURE OF' 'BUSINESS' -
     A                                      'CHG FLAG')
     A            ENRIDF    R               REFFLD(FLAG)
     A                                      COLHDG('RISK ID' 'CHG FLAG')
     A            ENCIFL    R               REFFLD(FLAG)
     A                                      COLHDG('CERT OF INS CHANGE')
     A            ENCMFL    R               REFFLD(FLAG)
     A                                      COLHDG('CONT RATE MOD' 'CHG FLG')
     A*** OTHER STANDARD INFO
     A            ENRMCD    R               REFFLD(RMCD)
     A                                      COLHDG('REMARK CODE')
     A            ENFNNM    R               REFFLD(NM60)
     A                                      COLHDG('FUND NAME')
     A            ENRUSR    R               REFFLD(NAME)
     A                                      COLHDG('USER REQUESTING' 'ENDOR.')
     A            ENBLIN        50          TEXT('BEFORE CHG LINE')
     A            ENALIN        50          TEXT('AFTER CHG LINE')
     A            ENDSC1    R   60          REFFLD(DS30)
     A                                      TEXT('FORM DESC LINE 1')
     A            ENDSC2    R   60          REFFLD(DS30)
     A                                      TEXT('FORM DESC LINE 2')
     A            ENDSC3    R   60          REFFLD(DS30)
     A                                      TEXT('FORM DESC LINE 3')
     A            ENSTAT    R               REFFLD(STAT)
     A            ENUSER    R               REFFLD(USER)
     A            ENPGM     R               REFFLD(PGM)
     A            ENTIME    R               REFFLD(TIME)
     A            ENDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A*** BEGIN ADD ***  03/29/01  ************************************
     A            ENAGT1    R               REFFLD(AGT#)
     A                                      TEXT('BEFORE AGENT #')
     A*** END ADD *****  03/29/01  ************************************
      *
     A*** BEGIN ADD ***  06/05/02  ************************************
     A            ENAAFL    R               REFFLD(FLAG)
     A                                      TEXT('AGENCY ADDRESS CHG FLAG')
     A                                      COLHDG('Agcy Adress' 'Change Flag')
      *
     A            ENAMA1    R               REFFLD(ADR1)
     A                                      COLHDG('BF AGENCY MAILING' +
     A                                      'ADDRESS 1')
     A            ENAMC1    R               REFFLD(CTY)
     A                                      COLHDG('BF AGENCY MAILING' 'CITY')
     A            ENAMS1    R               REFFLD(ST)
     A                                      COLHDG('BF AGENCY MAILING' 'STATE')
     A            ENAMZ1         9S
     A                                      COLHDG('BF AGENCY MAILING' +
     A                                      'ZIP CODE')
      *
     A            ENAMA2    R               REFFLD(ADR1)
     A                                      COLHDG('AF AGENCY MAILING' +
     A                                      'ADDRESS 1')
     A            ENAMC2    R               REFFLD(CTY)
     A                                      COLHDG('AF AGENCY MAILING' 'CITY')
     A            ENAMS2    R               REFFLD(ST)
     A                                      COLHDG('AF AGENCY MAILING' 'STATE')
     A            ENAMZ2         9S
     A                                      COLHDG('AF AGENCY MAILING' +
     A                                      'ZIP CODE')
      *
     A            ENAPA1    R               REFFLD(ADR1)
     A                                      COLHDG('BF AGENCY PHYSICAL' +
     A                                      'ADDRESS 1')
     A            ENAPC1    R               REFFLD(CTY)
     A                                      COLHDG('BF AGENCY PHYSICAL' 'CITY')
     A            ENAPS1    R               REFFLD(ST)
     A                                      COLHDG('BF AGENCY PHYSICAL' 'STATE')
     A            ENAPZ1         9S
     A                                      COLHDG('BF AGENCY PHYSICAL' +
     A                                      'ZIP CODE')
      *
     A            ENAPA2    R               REFFLD(ADR1)
     A                                      COLHDG('AF AGENCY PHYSICAL' +
     A                                      'ADDRESS 1')
     A            ENAPC2    R               REFFLD(CTY)
     A                                      COLHDG('AF AGENCY PHYSICAL' 'CITY')
     A            ENAPS2    R               REFFLD(ST)
     A                                      COLHDG('AF AGENCY PHYSICAL' 'STATE')
     A            ENAPZ2         9S
     A                                      COLHDG('AF AGENCY PHYSICAL' +
     A                                      'ZIP CODE')
     A            ENAACG    R               REFFLD(RMCD)
     A                                      COLHDG('AGENCY ADDRESS' +
     A                                      'CHANGE CODE')
     A*** END ADD *****  06/05/02  ************************************
      ****** BEG ADD **** 05/14/04 ************************************
      *
     A            ENENM1    R               REFFLD(NM50)
     A                                      COLHDG('EMPLR NAME' ' 1ST PART')
     A            ENENM2    R               REFFLD(NM50)
     A                                      COLHDG('EMPLR NAME' ' 2ND PART')
      *
     A            ENEFN1    R               REFFLD(NM50)
     A                                      COLHDG('EMPLR FED NAME' '1ST PART')
     A            ENEFN2    R               REFFLD(NM50)
     A                                      COLHDG('EMPLR FED NAME' '2ND PART')
      *
      ****** END ADD **** 05/14/04 ************************************
      ****** beg add **** 05/15/04 ************************************
      *
     A            ENUMFL    R               REFFLD(FLAG)
     A                                      COLHDG('Update' 'mail addr' +
     A                                      'all ent/loc (Y/N)?')
      ****** end add **** 05/15/04 ************************************
      ****** BEG ADD **** 05/21/04 ************************************
     A            ENANM1    R               REFFLD(NM50)
     A                                      COLHDG('AFTER EMP NAME' ' 1ST PART')
     A            ENANM2    R               REFFLD(NM50)
     A                                      COLHDG('AFTER EMP NAME' ' 2ND PART')
      *
     A            ENAFN1    R               REFFLD(NM50)
     A                                      COLHDG('AFTER FED NAME' '1ST PART')
     A            ENAFN2    R               REFFLD(NM50)
     A                                      COLHDG('AFTER FED NAME' '2ND PART')
      ****** END ADD **** 05/21/04 ************************************
      ****** BEG ADD **** 08/17/05 ************************************
      *
     A            ENRDDF    R               REFFLD(FLAG)
     A                                      COLHDG('Recission of' +
     A                                      'Deletion of Division')
      *
      ****** END ADD **** 08/17/05 ************************************
      ****** BEG ADD **** 10/13/09 ************************************
      *
     A            ENMISC    R               REFFLD(FLAG)
     A                                      COLHDG('CLT139 Misc ' +
     A                                      'Endorsement')
      *
      ****** END ADD **** 10/13/09 ************************************
     A*** BEGIN ADD ***  02/24/25  *************************************
     A            ENBEFORE    1000A         TEXT('LARGE BEFORE CHG LINE')
     A            ENAFTER     1000A         TEXT('LARGE AFTER CHG LINE')
     A*** END ADD *****  02/24/25  *************************************
      ****Begin Add **** 07/31/25 **************************************
     A            ENWVFL    R               REFFLD(FLAG)
     A                                      COLHDG('Waiver' 'Change' 'Flag')
      ****End   Add **** 07/31/25 **************************************
