      * (c) 2010 StoneRiver, Inc. All rights Reserved.                *
      * StoneRiver is a trademark of StoneRiver, Inc.                 *
     A*                                                               *
     A* WXFDP - FEE INVOICE DETAIL OUTFILE                            *
     H*****************************************************************
     A* FEE INFORMATION TABLE                                         *
     A*                                                               *
     A*  PROJECT:  WC1851            PROGRAMMER:  C:189               *
     A*  CREATED:  01/25/10                                           *
     H*****************************************************************
     A*
     A*  WORKERS' COMPENSATION CASH FLOW FEE FILE
     A*
     A          R PFF01                     PFILE(WMFFP)
     A          K FFCO#
     A          K FFFND
     A          K FFEMP#
     A          K FFDIV
     A          K FFFYR
     A          K FFEFDT                    DESCEND
