     A* (c) 2019 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*****************************************************************
     A* IDC Quarterly Log File Logical by CO/FND/FYR/CASE                  *
     A**********************************************************************
     A* Created on 06/18/2019 by C:79 for Project WC2604                   *
     A**********************************************************************
     A* Revisions:                                                         *
     A*                                                                    *
     A**********************************************************************
     A          R PQT01                     PFILE(WMIDCQT)
     A          K QTCO#
     A          K QTFND
     A          K QTFYR
     A          K QTCASE
     A          K QTBCHID                   DESCEND
     A          S QTSTS                     COMP(NE 'Z')
