     A*
     A*  (C) Copyright Progressive Data Solutions, Inc., 2001
     A*
     A*  INSTALLMENT FEE INFORMATION FILE
     A*
     A*****************************************************************
     A*  PROGRAMMER: 90                                               *
     A*  CREATED:    06/28/01                                         *
     A*  PROJECT#:   96WEG                                            *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A          R PIF01                     PFILE(WMIFP)
     A          K IFCO#
     A          K IFFND
     A          K IFST
     A          K IFEFDT                    DESCEND
