      * (c) 2010 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A**
     A** LIFETIME BENEFITS FILE

     A******************************************************************
     A* REVISIONS:                                                    *
     A* 08/10/10  C:190  PROJECT: 25WQC                               *
     A*                  Additional Changes                           *
     A*                                                               *
     A******************************************************************

     A                                      REF(WREFP)
     A          R PLB01                     TEXT('LIFETIME BENEFITS')
     A            LBCO#     R     S         REFFLD(CO#)
     A                                      COLHDG('Company')
     A            LBFND     R     S         REFFLD(FND)
     A                                      COLHDG('Fund')
     A            LBFYR     R     S         REFFLD(FYR)
     A                                      COLHDG('Fund Year')
     A            LBCASE    R     S         REFFLD(CASE)
     A                                      COLHDG('Case')
     A            LBLYRS    R     S         REFFLD(FYR)
     A                                      COLHDG('Lifetime Years')
     A            LBORDT    R     S         REFFLD(DT)
     A                                      COLHDG('Effective date')
     A            LBWRAT    R     S         REFFLD(A92)
     A                                      COLHDG('Weekly Rate')
     A            LBYRAT    R     S         REFFLD(A112)
     A                                      COLHDG('Yearly Rate')
     A            LBIUSR    R               REFFLD(USER)
     A                                      COLHDG('Initial User')
     A            LBIPGM    R               REFFLD(PGM)
     A                                      COLHDG('Initial program')
     A            LBIDT     R     S         REFFLD(DT)
     A                                      COLHDG('Initial Date')
     A            LBITM     R     S         REFFLD(TIME)
     A                                      COLHDG('Initial Time')
     A            LBUSER    R               REFFLD(USER)
     A                                      COLHDG('User')
     A            LBPGM     R               REFFLD(PGM)
     A                                      COLHDG('Program')
     A            LBDT      R     S         REFFLD(DT)
     A                                      COLHDG('Date')
     A            LBTM      R     S         REFFLD(TIME)
     A                                      COLHDG('Time')
     A*** beg   add ***  08/10/10  ************************************
     A            LBCRT     R     S         REFFLD(A72)
     A                                      COLHDG('Compensation rate')
     A*** END   add ***  08/10/10  ************************************
