     A*****************************************************************
     A* (c) 2022 Sapiens. All Rights Reserved.                             *
     A*****************************************************************
     A*    EDI LOG FILE                                               *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*
     A* 02/14/22 C:079 Project: WC2797
     A*                Added new field(s) for 3.1.4
     A*
     A* 05/30/18 C:079 Project: WC2515
     A*                Added new field(s) for 3.1
     A*                                                               *
     A*  04/25/07 C:185 Project: WC1177                               *
     A*                 Added 'EDI Release 3' Fields.                 *
     A*                                                               *
     A*  04/25/07 C:185 Project: WC1177                               *
     A*                 Added 'EDI Release 3' Fields.                 *
     A*                                                               *
     A*  04/05/02 C:53  Project: 81WCT                                *
     A*                 Added EDI Bill flag (EDI check request issued)*
     A*                                                               *
     A*  10/20/00 C:15  Project: WC985                                *
     A*                 Added 'EDI Release' flag.                     *
     A*                                                               *
     A*  11/23/98 C:31  Project: 87MGR                                *
     A*                 V4: Wrk Hist: addtl dates                     *
     A*                 1. Text for LGDSQH changed                    *
     A*****************************************************************
     A*
     A                                      REF(WREFP)
     A          R PLG01                     TEXT('EDI Record')
     A            LGCO#     R               REFFLD(CO#)
     A            LGFND     R               REFFLD(FND)
     A            LGFYR     R               REFFLD(FYR)
     A            LGCASE    R               REFFLD(CASE)
     A            LGTSET    R    3A         REFFLD(CODE)
     A                                      COLHDG('TRANSACTIONS' 'SET ID')
     A            LGMTC     R               REFFLD(CODE)
     A                                      COLHDG('MAINTENANCE' 'TYPE' 'CODE')
     A            LGJST     R               REFFLD(ST)
     A                                      COLHDG('JURISDICTION' 'STATE')
     A            LGDUE     R               REFFLD(DT)
     A                                      COLHDG('SUBMISSION' 'DUE' 'DATE')
     A            LGSTS     R    2A         REFFLD(STAT)
     A                                      COLHDG('ENTRY STATUS')
     A            LGSTAT    R               REFFLD(FLAG)
     A                                      COLHDG('RELEASE/' 'HOLD' 'STATUS')
     A            LGEXDT    R               REFFLD(DT)
     A                                      COLHDG('DATE' 'OF' 'EXTRACT')
     A            LGMTCD    R               REFFLD(DT)
     A                                      COLHDG('MTC' 'DATE')
     A            LGSENT    R               REFFLD(DT)
     A                                      COLHDG('DATE' 'SENT TO' 'STATE')
     A            LGARCV    R               REFFLD(DT)
     A                                      COLHDG('DATE' 'ACK' 'RECEIVED')
     A            LGAENT    R               REFFLD(DT)
     A                                      COLHDG('DATE' 'ACK' 'ENTERED')
     A            LGDSQA    R               REFFLD(A50)
     A                                      COLHDG('DARTS' 'SEQ #')
     A                                      TEXT('MAN ADJUSTER DIARY          ')
     A            LGDSQB    R               REFFLD(A50)
     A                                      COLHDG('DARTS' 'SEQ #')
     A                                      TEXT('MAN SUPERVISOR DIARY        ')
     A            LGDSQC    R               REFFLD(A50)
     A                                      COLHDG('DARTS' 'SEQ #')
     A                                      TEXT('MAN LATE REVIEWER DIARY     ')
     A            LGDSQD    R               REFFLD(A50)
     A                                      COLHDG('DARTS' 'SEQ #')
     A                                      TEXT('COND ADJUSTER DIARY         ')
     A            LGDSQE    R               REFFLD(A50)
     A                                      COLHDG('DARTS' 'SEQ #')
     A                                      TEXT('COND SUPERVISOR DIARY       ')
     A            LGDSQF    R               REFFLD(A50)
     A                                      COLHDG('DARTS' 'SEQ #')
     A                                      TEXT('COND LATE REVIEWER DIARY    ')
     A            LGDSQG    R               REFFLD(A50)
     A                                      COLHDG('DARTS' 'SEQ #')
     A                                      TEXT('ERROR ADJUSTER DIARY        ')
     A            LGDSQH    R               REFFLD(A50)
     A                                      COLHDG('WORK HISTORY' 'SEQ #')
     A*** BEGIN ADD *** 11/23/98 **************************************
     A*********                             TEXT('WORK HISTORY SEQ #')
     A                                      TEXT('EDI LOG SEQ#')
     A*** END ADD *** 11/23/98 ****************************************
     A            LGDSQI    R               REFFLD(A50)
     A                                      COLHDG('DARTS' 'SEQ #')
     A                                      TEXT('FUTURE USE                  ')
     A            LGDSQJ    R               REFFLD(A50)
     A                                      COLHDG('DARTS' 'SEQ #')
     A                                      TEXT('FUTURE USE                  ')
     A            LGDSQK    R               REFFLD(A50)
     A                                      COLHDG('DARTS' 'SEQ #')
     A                                      TEXT('FUTURE USE                  ')
     A            LGDSQL    R               REFFLD(A50)
     A                                      COLHDG('DARTS' 'SEQ #')
     A                                      TEXT('FUTURE USE                  ')
     A            LGDSQM    R               REFFLD(A50)
     A                                      COLHDG('DARTS' 'SEQ #')
     A                                      TEXT('A49 PMT SUMMARY RECORD SEQ# ')
     A            LGHCPY    R    3A         REFFLD(CODE)
     A                                      COLHDG('HARDCOPY' 'FORMAT')
     A            LGSCHP    R               REFFLD(DT)
     A                                      COLHDG('DATE' 'PAPER TO' 'PRINT')
     A            LGPRSQ    R               REFFLD(A50)
     A                                      COLHDG('FROI HARDCOPY' 'DARTS SEQ#')
     A*
     A            LGIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'CREATION' 'USER')
     A            LGIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'CREATION' 'DATE')
     A            LGITM     R               REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'CREATION' 'TIME')
     A            LGIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'CREATION' 'PGM')
     A            LGUSER    R               REFFLD(USER)
     A                                      COLHDG('LAST' 'MAINTENANCE' 'USER')
     A            LGDT      R               REFFLD(DT)
     A                                      COLHDG('LAST' 'MAINTENANCE' 'DATE')
     A            LGTIME    R               REFFLD(TIME)
     A                                      COLHDG('LAST' 'MAINTENANCE' 'TIME')
     A            LGPGM     R               REFFLD(PGM)
     A                                      COLHDG('LAST' 'MAINTENANCE' 'PGM')
     A*** BEGIN ADD *** 10/20/00 **************************************
     A            LGRLS     R               REFFLD(FLAG)
     A                                      COLHDG('EDI Release Flag')
     A*   Release Flag values
     A*               1 = Release 1
     A*               2 = Release 2
     A*** END ADD ***** 10/20/00 **************************************
     A*** BEG ADD *** 04/05/02 **************************************
     A            LGBLFL    R               REFFLD(FLAG)
     A                                      COLHDG('EDI Bill Flag')
     A*   Bill Flag values
     A*           'Y'= EDI check request issue, ' '= Not issued
     A*** END ADD *** 04/05/02 **************************************
     A*** BEG ADD *** 04/25/07 **************************************
     A
     A            LGMTCC         2A         COLHDG('Maintenance Type'          +
     A                                      'Correction Code')
     A
     A            LGMTC2         7S         COLHDG('Maintenance Type'          +
     A                                      'Correction Code' 'Date')
     A
     A*** END ADD *** 04/25/07 **************************************
     A*** Beg Add *** 05/30/18 **************************************
     A            LGAQSC         1A         COLHDG('Aquisition Status'         +
     A                                      'Code')
     A*** End Add *** 05/30/18 **************************************
     A*** Beg Add *** 02/14/22 **************************************
     A            LGBCRC         1A         COLHDG('Benefit Change'            +
     A                                      'Reason Code')
     A*** End Add *** 02/14/22 **************************************
