     A** (C) COPYRIGHT INSURANCE ADMINISTRATIVE SYSTEMS, INC. 1989
     A**
     A** WORKERS' COMP LATE PAYMENT FILE
     A                                      REF(WREFP)
     A          R PLP01                     TEXT('LATE PAYMENT FILE')
     A            LPCO#     R               REFFLD(CO#)
     A            LPFND     R               REFFLD(FND)
     A            LPFYR     R               REFFLD(FYR)
     A            LPCASE    R               REFFLD(CASE)
     A            LPSEQ#    R               REFFLD(SEQ#)
     A            LPTRDT    R               REFFLD(DT)
     A                                      COLHDG('TRANSACTION DATE')
     A            LPCODE    R               REFFLD(CODE)
     A                                      COLHDG('LATE CODE')
     A            LPDUE     R               REFFLD(DT)
     A                                      COLHDG('DUE DATE')
     A            LPSTAT    R               REFFLD(STAT)
     A            LPUSER    R               REFFLD(USER)
     A            LPPGM     R               REFFLD(PGM)
     A            LPTIME    R               REFFLD(TIME)
     A            LPDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
