     A*  (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC., 1987-1999
     A*
     A*  PREMIUM FINANCE LOGICAL FILE
     A*
     A                                      ALTSEQ(QSYSTRNTBL)
     A          R PPF01                     PFILE(WMPFP)
     A          K PFCO#
     A          K PFFND
     A          K PFFCOD
     A          K PFEFDT
