     A* (c) 2009 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A*****************************************************************
     A* WMPXPE - Payroll Classification - Extension Expanded Description
     A*****************************************************************
     A* Revisions
     A*
     A* 07/22/09 C:136 Project: 136WED
     A*               -Add an effective date field that will pull in
     A*                from the extension file.
     A*               -Add status field for future use.
     A*
     A* Created: 06/24/05   C:33    Project: 109WDZ
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PPX01E                    TEXT('PAYROLL CLASS - MULTIPLE -
     A                                      DESCRIPTION FILE')
     A            PXCO#     R               REFFLD(CO#)
     A                                      COLHDG('COMPANY' 'NUMBER')
     A            PXCLAS    R               REFFLD(CLAS)
     A                                      COLHDG('PAYROLL' 'CLASS')
     A            PXEXT     R               REFFLD(CLA2)
     A                                      COLHDG('CLASS DESC' 'EXTENSION')
     A            PXST      R               REFFLD(ST)
     A                                      COLHDG('STATE')
     A            PXEXDS       300A
     A                                      COLHDG('PAYROLL CLASS' 'EXPANDED' +
     A                                      'DESCRIPTION')
     A            PXPGM     R               REFFLD(PGM)
     A                                      COLHDG('PROGRAM')
     A            PXUSER    R               REFFLD(USER)
     A                                      COLHDG('USER')
     A            PXDT      R               REFFLD(DT)
     A                                      COLHDG('DATE')
     A            PXTIME    R               REFFLD(TIME)
     A                                      COLHDG('TIME')
     A            PXIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL PROGRAM')
     A            PXIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL USER')
     A            PXIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL DATE')
     A            PXITIM    R               REFFLD(TIME)
     A                                      COLHDG('INITIAL TIME')
     A            PXEFDT    R     S         REFFLD(DT)
     A                                      COLHDG('EFFECTIVE' 'DATE')
     A            PXSTAT    R               REFFLD(FLAG)
     A                                      COLHDG('STATUS')
      *
     A          K PXCO#
     A          K PXCLAS
     A          K PXEXT
     A          K PXST
     A          K PXEFDT
