     A*  (C) Copyright Progressive Data Systems, Inc., 1994
     A**
     A** WORKERS' COMP REPORT DEFINITION MASTER FILE
     A*
     A          R PRD01                     PFILE(WMRDP)
     A          K RDKEY
