     A*  (C) Copyright Progressive Data Systems, Inc., 1988
     A** WORKERS' COMPENSATION RESERVE HISTORY RECORD
     A*
     A          R PRH01                     PFILE(WMRHP)
     A          K RHCO#
     A          K RHFND
     A          K RHFYR
     A          K RHCASE
