     A*  (C) Copyright Progressive Data Solutions Inc., 1996
     A** CLAIM STAFF CODE DEFINITION FILE
     A*
     A          R PSF01                     PFILE(WMSFP)
     A          K SFCO#
     A          K SFTYPE
     A          K SFSTAF
     A          K SFFND
     A          K SFFEMP
