     A*  (C) Copyright Progressive Data Solutions, Inc., 1996
     A*
     A*  NCCI REPORTING - SUBMISSION HISTORY
     A*
     A*****************************************************************
     A*                                                               *
     A* 07/11/94 C:24 PROJECT 03AZK                                   *
     A*               NEW HISTORY FILE FOR NCCI REPORTING.            *
     A*                                                               *
     A*****************************************************************
     A          R PSH01                     PFILE(WMSHP)
     A          K SHCO#
     A          K SHFND
     A          K SHEMP#
     A          K SHSBDT
     A          K SHUNID
     A          S SHSTAT                    COMP(EQ '4')
