     A*  (C) Copyright STONERIVER, INC. 2009
     A*
     A*  WCSTAT EXTRACT DATA CONTROL HISTORY LOGICAL
     A*****************************************************************
     A*  DESCRIPTION:                                                 *
     A*    FILE FOR TRACKING WCSTAT DATA EXTRACTIONS FOR SUBMISSION   *
     A*      SSCO#/SSRPMY/SSFND **DESCEND**                           *
     A*****************************************************************
     A*  CREATED: 04/23/09       PROJECT: 139WKB      PROGRAMMER: 65  *
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*****************************************************************
     A          R PSS01                     PFILE(WMSSP)
     A          K SSCO#
     A          K SSRPMY                    DESCEND
     A          K SSFND
