     A*==============================================================*
     A* (c) 2019 StoneRiver, Inc. All rights Reserved.               *
     A* StoneRiver is a trademark of SToneRiver, Inc.                *
     A*                                                              *
     A* Visit Tracking Detail LOGICAL = CO#/CAT/TYPE                 *
     A*                                                              *
     A*==============================================================*
     A* Created on 12/02/2014 by c:242 for Project 114WGU            *
     A*==============================================================*
     A* Revisions:                                                   *
     A*                                                              *
     A****************************************************************
     A          R PVI01                     PFILE(WMVIP)
     A          K VICO#
     A          K VICAT
     A          K VITYPE
