     A*==============================================================*
     A* (c) 2019 StoneRiver, Inc. All rights Reserved.               *
     A* StoneRiver is a trademark of SToneRiver, Inc.                *
     A*                                                              *
     A* Visit Tracking Detail Logical =                              *
     A*       CO#/ASSIGN/VSDT                                        *
     A*                                                              *
     A*==============================================================*
     A* Created on 02/09/2015 by c:62 for Project 114WGU             *
     A*==============================================================*
     A* Revisions:                                                   *
     A*                                                              *
     A****************************************************************
     A          R PVI01                     PFILE(WMVIP)
     A          K VICO#
     A          K VIASSIGN
     A          K VIVSDT
