     A                                      REF(*LIBL/WREFP)
     A                                      INDARA
     A          R SCR01
     A  20 69                               CA01
     A                                  1  2HTML('QPUIREC1    RERRMSGID  5    C-
     A                                      11   SCMODE_copyC7    WCR1058C6    -
     A                                      WMESGGC5    *LIBLC0    E1    3     -
     A                                      20')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"document.body.-
     A                                      style.background = \"#EBF5FF\";","c-
     A                                      olumn widths":"119,108,108,108,108"-
     A                                      ,"font size":"11px","overlay":"fals-
     A                                      e"},"items":[{"id":"HREC","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"HREC","-
     A                                      designValue":"[HREC]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "10"},"left":"0px","top":"-30px","f-
     A                                      ont family":"Trebuchet MS"},{"id":"-
     A                                      HFLD","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"HFLD","designValue":"[HFLD]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"10"},"left":"0px","-
     A                                      top":"-30px","font family":"Trebuch-
     A                                      et MS"},{"id":"ApTitle","field type-
     A                                      ":"output field","css class":"outpu-
     A                                      tField","value":{"fieldName":"TxTit-
     A                                      le","dataLength":"40","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[TxTitle]"},"left":"25px","-
     A                                      top":"20px","color":"#FFFFFF","css -
     A                                      class 2":"transform-outputField","h-
     A                                      eight":"25px","width":"205px","z in-
     A                                      dex":"3","locked in place":"true","-
     A                                      font size":"16px"},{"id":"Hyperlink-
     A                                      2_copy","field type":"hyperlink","c-
     A                                      ss class":"link","left":"15px","top-
     A                                      ":"35px","width":"1px","height":"1p-
     A                                      x","locked in place":"true"},{"id":-
     A                                      "Image1","field type":"image","left-
     A                                      ":"11px","top":"65px","image source-
     A                                      ":"/profoundui/userdata/images/bar_-
     A                                      top.png","width":"228px","locked in-
     A                                       place":"true","height":"15px"},{"i-
     A                                      d":"Image3","field type":"image","l-
     A                                      eft":"11px","top":"215px","image so-
     A                                      urce":"/profoundui/userdata/images/-
     A                                      bar_bottom.png","width":"228px","he-
     A                                      ight":"20px","locked in place":"tru-
     A                                      e","z index":"3"},{"id":"SCPRDS","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCPRDS","refField":"NA-
     A                                      ME","trimLeading":"true","trimTrail-
     A                                      ing":"true","dataType":"reference",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[SCPRDS]"},"-
     A                                      css class":"outputField","left":"25-
     A                                      px","cursor column":"21","top":"111-
     A                                      5px","cursor row":"2","font family"-
     A                                      :"Trebuchet MS","css class 2":"HI",-
     A                                      "description":"PROGRAM NAME","font -
     A                                      size":"18px","visibility":"hidden",-
     A                                      "locked in place":"true","width":"6-
     A                                      0px"},{"id":"SCMSG1","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCMSG1","designValue":"[SCMSG1]","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"no-
     A                                      ne","dataLength":"10","decPos":"0",-
     A                                      "refField":"DS10"},"css class":"out-
     A                                      putField","left":"105px","cursor co-
     A                                      lumn":"2","top":"1115px","cursor ro-
     A                                      w":"3","font family":"Trebuchet MS"-
     A                                      ,"css class 2":{"fieldName":"69","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"RI","customFalse-
     A                                      ":""},"description":"EXCESS REIN","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","width":"55px"},{"id":"S-
     A                                      CMSG2","field type":"output field",-
     A                                      "value":{"fieldName":"SCMSG2","desi-
     A                                      gnValue":"[SCMSG2]","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"50","decPos":"0","refField":"NM-
     A                                      50"},"css class":"outputField","lef-
     A                                      t":"30px","cursor column":"20","top-
     A                                      ":"1145px","cursor row":"3","font f-
     A                                      amily":"Trebuchet MS","css class 2"-
     A                                      :"HI","visibility":"hidden","descri-
     A                                      ption":"BARCODE FILE IN/OUT STATUS"-
     A                                      ,"locked in place":"true","width":"-
     A                                      60px"},{"id":"SCMODE_copy","field t-
     A                                      ype":"output field","css class":"ou-
     A                                      tputField","description":"ADD/UPDAT-
     A                                      E MODE","value":{"fieldName":"SCMOD-
     A                                      E","designValue":"[SCMODE]","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none","d-
     A                                      ataLength":"10","decPos":"0","refFi-
     A                                      eld":"NM10"},"font family":"Trebuch-
     A                                      et MS","cursor row":"3","cursor col-
     A                                      umn":"71","error messages":"1 messa-
     A                                      ge","error message id":"WCR1058","e-
     A                                      rror message file":"WMESGG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"20","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"left":"1-
     A                                      05px","top":"1145px","visibility":"-
     A                                      hidden","locked in place":"true","w-
     A                                      idth":"55px"},{"id":"SCUSER_copy","-
     A                                      field type":"output field","css cla-
     A                                      ss":"outputField","value":{"fieldNa-
     A                                      me":"SCUSER","designValue":"[SCUSER-
     A                                      ]","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"none","dataLength":"10","decPos":-
     A                                      "0","refField":"USER"},"color":"#00-
     A                                      0000","font family":"Trebuchet MS",-
     A                                      "cursor row":"1","cursor column":"2-
     A                                      ","left":"35px","top":"1170px","vis-
     A                                      ibility":"hidden","locked ')
     A                                  1  4HTML('in place":"true","width":"60p-
     A                                      x"},{"id":"Panel1","field type":"pa-
     A                                      nel","left":"10px","top":"10px","wi-
     A                                      dth":"230px","height":"1217px","pan-
     A                                      el style":"Transform Action Panel",-
     A                                      "z index":"1","color":"#000000","lo-
     A                                      cked in place":"true"},{"id":"apMen-
     A                                      u","field type":"menu","css class":-
     A                                      "transform-action-menu","left":"11p-
     A                                      x","top":"80px","width":"226px","he-
     A                                      ight":"130px","choices":"Option 1,O-
     A                                      ption 2,Option 3,Option 4,Option 5"-
     A                                      ,"border color":"#4C6106","backgrou-
     A                                      nd color":"#758B27","hover backgrou-
     A                                      nd color":"#9AAA61","hover text col-
     A                                      or":"#FFFFFF","animate":"true","cho-
     A                                      ice values":"OPT1,OPT2,OPT3,OPT4,OP-
     A                                      T5","description":"Action Panel Men-
     A                                      u","locked in place":"true","menu r-
     A                                      esponse":{"fieldName":"scSelOpt","d-
     A                                      ataLength":"10","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"id":"ApHe-
     A                                      ading1","field type":"output field"-
     A                                      ,"css class":"outputField","value":-
     A                                      {"fieldName":"TxHeading1","dataLeng-
     A                                      th":"40","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none","designValue":"[TxHe-
     A                                      ading1]"},"left":"25px","top":"250p-
     A                                      x","color":"#FFFFFF","css class 2":-
     A                                      "transform-outputField","width":"12-
     A                                      5px","locked in place":"true"},{"id-
     A                                      ":"ApField1","field type":"output f-
     A                                      ield","css class":"outputField","va-
     A                                      lue":{"fieldName":"TxField1","dataL-
     A                                      ength":"40","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none","designValue":"[T-
     A                                      xField1]"},"left":"25px","top":"270-
     A                                      px","color":"#FFFFFF","css class 2"-
     A                                      :"transform-outputField","width":"1-
     A                                      25px","locked in place":"true"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SCSELOPT      10A  H
     A            TXFIELD1      40A  H
     A            TXHEADING1    40A  H
     A            TXTITLE       40A  H
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCMSG1    R        H      REFFLD(DS10)
     A            SCMSG2    R        H      REFFLD(NM50)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
