     A*  (C) COPYRIGHT FISERV INSURANCE SOLUTION INC., 2006
     A****************************************************************
     A*  IOWA BENEFIT LEVEL SELECTION ENDORSEMENT                    *
     A*****************************************************************
     A*  CREATED: 11/20/06  PROGRAMMER: 184                           *
     A*  PROJECT: WC1505    FILE: WPBSL3                              *
     A*****************************************************************
     A*
     A*
     A          R PBS01                     PFILE(WPBSP)
     A          K BSCO#
     A          K BSFND
     A          K BSEMP#
     A          K BSDIV
