     A****************************************************************
     A*  (C) Copyright Fiserv Insurance Solution Inc., 2006          *
     A****************************************************************
     A*  IOWA BENEFIT LEVEL SELECTION ENDORSEMENT                    *
     A****************************************************************
     A*  REVISIONS:                                                  *
     A*                                                              *
     A*  11/20/06 C:184 PROJECT: WC1505                              *
     A*                 Added an Benefit level selection.            *
     A*                                                              *
     A* ------------------------------------------------------------ *
     A*  NOTE: PLEASE ADD COMMENTS TO THE TOP OF REVISIONS.          *
     A* ------------------------------------------------------------ *
     A****************************************************************
     A                                      REF(WREFP)
     A          R PBS01                     TEXT('ALTERNATE EMPLOYERS')
     A            BSCO#     R               REFFLD(CO#)
     A                                      COLHDG('COMPANY #')
     A            BSFND     R               REFFLD(FND)
     A                                      COLHDG('GROUP')
     A            BSEMP#    R               REFFLD(EMP#)
     A                                      COLHDG('EMPLOYER #')
     A            BSDIV     R               REFFLD(DIV)
     A                                      COLHDG('DIVISION')
     A            BSFYR     R               REFFLD(FYR)
     A                                      COLHDG('POLICY YEAR')
     A            BSSEQ#    R               REFFLD(CER#)
     A                                      COLHDG('ALT EMPLR #')
     A            BSPNAM    R               REFFLD(NAME)
     A                                      COLHDG('PERSONS')
     A            BSPRBD    R               REFFLD(A112)
     A                                      COLHDG('PAYROLL FOR BEF DTR')
     A            BSUSER    R               REFFLD(USER)
     A                                      COLHDG('USER')
     A            BSPGM     R               REFFLD(PGM)
     A                                      COLHDG('PROGRAM')
     A            BSTIME    R               REFFLD(TIME)
     A                                      COLHDG('TIME' 'MAINTAINED')
     A            BSDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            BSIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            BSIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PROGRAM')
     A            BSITM     R               REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
     A            BSIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
