     A          R SFLSTATE                  SFL
     A            QPUI000001     1A  O  2  2
     A            OUTSTCFORM   310A  H
     A            OUTSTEFFDT     8S 0H
     A            OUTSTFFORM   310A  H
     A            OUTSTGRP       4A  H
     A            OUTSTRRN       9S 0H
     A            OUTSTSTATE     2A  H
     A            STATECOPY      1A  H
     A            STATEDELT      1A  H
     A            STATEEDIT      1A  H
     A          R QSFLCTL001                SFLCTL(SFLSTATE)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLRCDSETUP')
     A          R RCDSETUP
     A                                  1  2HTML('QPUICTL1    SFLSTATE  5    RS-
     A                                      FLDSP    0    FDSPST     RSFLDSPCTL-
     A                                       0    FDSPSTCTL  RSFLCLR    0    FC-
     A                                      LRST     RSFLPAG    1    C1    6 RS-
     A                                      FLSIZ    1    C1    7 0    3    ROV-
     A                                      ERLAY   0     RWINDOW    0     RASS-
     A                                      UME    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"rcdSetup","description":"cancel-
     A                                      lation/reinstatement setup ","overl-
     A                                      ay":"true","show as window":"true",-
     A                                      "onload":"fillDetailBox(''SflStateS-
     A                                      etup'',1,''OutStateRRN''); ","assum-
     A                                      e":"true"},"items":[{"id":"DlgCRSet-
     A                                      up","field type":"panel","css class-
     A                                      ":"dialog","value":"First Report of-
     A                                       Injury Forms Setup","left":"260px"-
     A                                      ,"top":"150px","width":"970px","hei-
     A                                      ght":"415px","panel style":"Transfo-
     A                                      rm Dialog","z index":"8","descripti-
     A                                      on":"Cx/Re setup  dialog","locked i-
     A                                      n place":"true"},{"id":"HdgStateFor-
     A                                      mSetup","field type":"output field"-
     A                                      ,"css class":"heading","value":"Tem-
     A                                      plate Information","left":"275px","-
     A                                      top":"185px","description":"State f-
     A                                      orm setup grid heading","heading ty-
     A                                      pe":"Section Header"},{"id":"SflSta-
     A                                      teSetup","field type":"grid","css c-
     A                                      lass":"subfilegrid","left":"275px",-
     A                                      "top":"220px","number of rows":"7",-
     A                                      "number of columns":"6","column wid-
     A                                      ths":"45,38,95,314,314,133","column-
     A                                       headings":"Group,State, Effective -
     A                                      Date,FROI Default Form,FROI Client -
     A                                      Form,","header height":"21","row he-
     A                                      ight":"20","csv export":"true","exp-
     A                                      ort with headings":"true","sortable-
     A                                       columns":"true","resizable columns-
     A                                      ":"true","movable columns":"true","-
     A                                      height":"141px","width":"940px","he-
     A                                      ader text align":"left,right,left,l-
     A                                      eft,,right","record format name":"s-
     A                                      flState","description":"state form -
     A                                      setup grid","display subfile":{"fie-
     A                                      ldName":"dspSt","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"display contro-
     A                                      l record":{"fieldName":"dspStCtl","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"clear subfile":{"fieldName":"cl-
     A                                      rSt","customTrue":"","customFalse":-
     A                                      "","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"position at top":"true","-
     A                                      subfile record number":{"fieldName"-
     A                                      :"rrnSt","dataLength":"5","decPos":-
     A                                      "0","numSep":"false","zeroBalance":-
     A                                      "false","numBlankFill":"false","zer-
     A                                      oFill":"false","curSym":"","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      egNum":"-999.00","units":""},"curso-
     A                                      r record number":{"fieldName":"rrnS-
     A                                      tRow","dataLength":"5","decPos":"0"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","numBlankFill":"false","zeroFi-
     A                                      ll":"false","curSym":"","dataType":-
     A                                      "zoned","formatting":"Number","negN-
     A                                      um":"-999.00","units":""},"place cu-
     A                                      rsor":"true","onrowclick":"fillDeta-
     A                                      ilBox(''SflStateSetup'',row,''OutSt-
     A                                      ateRRN''); ","row selection":"singl-
     A                                      e","export file name":"data","filte-
     A                                      r option":"true","find option":"tru-
     A                                      e"},{"id":"BtnCXStateSetupAdd","fie-
     A                                      ld type":"button","cs')
     A                                  1  2HTML('s class":"button","value":"Ad-
     A                                      d","left":"1115px","top":"365px","w-
     A                                      idth":"100px","description":"cancel-
     A                                      lation state setup add button","res-
     A                                      ponse":{"fieldName":"btnStAdd","cus-
     A                                      tomTrue":"","customFalse":"","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "LblDtlSetupState","field type":"ou-
     A                                      tput field","css class":"label","va-
     A                                      lue":"State","left":"325px","top":"-
     A                                      395px","width":"35px","description"-
     A                                      :"state setup state label"},{"id":"-
     A                                      LblDtlSetupEffDate","field type":"o-
     A                                      utput field","css class":"label","d-
     A                                      escription":"state setup Eff Date l-
     A                                      abel","value":"Effective Date","lef-
     A                                      t":"370px","top":"395px","width":"9-
     A                                      0px"},{"id":"LblDtlSetupCxForm","fi-
     A                                      eld type":"output field","css class-
     A                                      ":"label","description":"state setu-
     A                                      p cx form label","value":"FROI Defa-
     A                                      ult Form","left":"275px","top":"435-
     A                                      px","width":"325px"},{"id":"DtlOutS-
     A                                      tateState","field type":"output fie-
     A                                      ld","css class":"output-field","lef-
     A                                      t":"325px","top":"410px","width":"3-
     A                                      5px","height":"15px","description":-
     A                                      "state setup detail state"},{"id":"-
     A                                      DtlOutStateEffDate","field type":"o-
     A                                      utput field","css class":"output-fi-
     A                                      eld","description":"state setup det-
     A                                      ail eff date","left":"370px","top":-
     A                                      "410px","height":"15px","width":"90-
     A                                      px"},{"id":"DtlOutStateFROIForm","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"output-field","description":"st-
     A                                      ate setup detail cancellation form"-
     A                                      ,"left":"275px","top":"450px","heig-
     A                                      ht":"15px","width":"935px"},{"id":"-
     A                                      LblDtlSetupCxFormClient","field typ-
     A                                      e":"output field","css class":"labe-
     A                                      l","description":"state setup CX Fo-
     A                                      rm Client label","value":"FROI Clie-
     A                                      nt Form","left":"275px","top":"475p-
     A                                      x","width":"325px"},{"id":"DtlOutSt-
     A                                      ateFROIFormClient","field type":"ou-
     A                                      tput field","css class":"output-fie-
     A                                      ld","description":"state setup deta-
     A                                      il client cancellation form","left"-
     A                                      :"275px","top":"490px","height":"15-
     A                                      px","width":"935px"},{"id":"BtnCRCa-
     A                                      ncel","field type":"button","css cl-
     A                                      ass":"button","value":"Cancel","lef-
     A                                      t":"990px","top":"530px","width":"1-
     A                                      00px","response":{"fieldName":"btnC-
     A                                      ancel","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"description":"Screen cancel bu-
     A                                      tton"},{"id":"BtnCRSave","field typ-
     A                                      e":"button","css class":"button","d-
     A                                      escription":"Screen Save button","v-
     A                                      alue":"Save","response":{"fieldName-
     A                                      ":"btnSave","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"left":"1105px","top":"530-
     A                                      px","width":"100px"},{"id":"LblDtlS-
     A                                      etupGroup","field type":"output fie-
     A                                      ld","css class":"label","descriptio-
     A                                      n":"state setup group')
     A                                  1  2HTML(' label","value":"Group","left-
     A                                      ":"275px","top":"395px","width":"40-
     A                                      px"},{"id":"DtlOutStateGroup","fiel-
     A                                      d type":"output field","css class":-
     A                                      "output-field","description":"state-
     A                                       setup detail state","left":"275px"-
     A                                      ,"top":"410px","height":"15px","wid-
     A                                      th":"40px"},{"id":"OutOutputType","-
     A                                      field type":"output field","css cla-
     A                                      ss":"output-field","value":{"fieldN-
     A                                      ame":"scOutType","dataLength":"100"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[scOutType]"}-
     A                                      ,"left":"320px","top":"125px","visi-
     A                                      bility":"hidden"},{"id":"OutStateSt-
     A                                      ate","field type":"output field","c-
     A                                      ss class":"output-field","value":{"-
     A                                      fieldName":"outStState","dataLength-
     A                                      ":"2","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[outStSt-
     A                                      ate]"},"left":"0px","top":"5px","de-
     A                                      scription":"setup state","width":"3-
     A                                      0px","text align":"center","grid":"-
     A                                      SflStateSetup","column":"1"},{"id":-
     A                                      "OutStateEffDate","field type":"out-
     A                                      put field","css class":"output-fiel-
     A                                      d","description":"setup effective d-
     A                                      ate","value":{"fieldName":"outStEff-
     A                                      Dt","dataLength":"8","decPos":"0","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","numBlankFill":"false","zeroFill-
     A                                      ":"false","edtWrd":"''  /  /    ''"-
     A                                      ,"curSym":"","dataType":"zoned","fo-
     A                                      rmatting":"Number","negNum":"-999.0-
     A                                      0","units":"","designValue":"[outSt-
     A                                      EffDt]"},"left":"10px","top":"5px",-
     A                                      "width":"80px","text align":"right"-
     A                                      ,"grid":"SflStateSetup","column":"2-
     A                                      "},{"id":"OutStateFROIForm","field -
     A                                      type":"output field","css class":"o-
     A                                      utput-field","description":"state F-
     A                                      ROI form","value":{"fieldName":"out-
     A                                      StFForm","dataLength":"310","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[outStFForm]"},"left"-
     A                                      :"0px","top":"5px","width":"305px",-
     A                                      "grid":"SflStateSetup","column":"3"-
     A                                      },{"id":"OutStateRRN","field type":-
     A                                      "output field","css class":"output--
     A                                      field","description":"state rrn","v-
     A                                      alue":{"fieldName":"outStRRN","data-
     A                                      Length":"9","decPos":"0","numSep":"-
     A                                      false","zeroBalance":"false","numBl-
     A                                      ankFill":"false","zeroFill":"true",-
     A                                      "curSym":"","dataType":"zoned","for-
     A                                      matting":"Number","negNum":"-999.00-
     A                                      ","units":"","designValue":"[outStR-
     A                                      RN]"},"left":"190px","top":"5px","w-
     A                                      idth":"75px","visibility":"hidden",-
     A                                      "grid":"SflStateSetup","column":"3"-
     A                                      },{"id":"OutStateFROIFormClient","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"output-field","de')
     A                                  1  2HTML('scription":"state re form","v-
     A                                      alue":{"fieldName":"outStCForm","da-
     A                                      taLength":"310","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[outStCForm]"},"left":"5px","top"-
     A                                      :"5px","width":"305px","grid":"SflS-
     A                                      tateSetup","column":"4"},{"id":"Lnk-
     A                                      StateEdit","field type":"hyperlink"-
     A                                      ,"css class":"link","value":"Edit",-
     A                                      "left":"5px","top":"5px","descripti-
     A                                      on":"state setup edit link","respon-
     A                                      se":{"fieldName":"stateEdit","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"grid":"S-
     A                                      flStateSetup","column":"5"},{"id":"-
     A                                      LnkStateDelete","field type":"hyper-
     A                                      link","css class":"link","descripti-
     A                                      on":"state setup delete link","valu-
     A                                      e":"Delete","response":{"fieldName"-
     A                                      :"stateDelt","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"left":"35px","top":"5px"-
     A                                      ,"grid":"SflStateSetup","column":"5-
     A                                      "},{"id":"LnkStateCopy","field type-
     A                                      ":"hyperlink","css class":"link","d-
     A                                      escription":"state setup copy link"-
     A                                      ,"value":"Copy","response":{"fieldN-
     A                                      ame":"stateCopy","customTrue":"","c-
     A                                      ustomFalse":"","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"left":"75px","top":"-
     A                                      5px","grid":"SflStateSetup","column-
     A                                      ":"5"},{"id":"OutStateGroup","field-
     A                                       type":"output field","css class":"-
     A                                      output-field","description":"setup -
     A                                      group","value":{"fieldName":"outStG-
     A                                      rp","dataLength":"4","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[outStGrp]"},"text align":"r-
     A                                      ight","left":"5px","top":"5px","wid-
     A                                      th":"35px","grid":"SflStateSetup","-
     A                                      column":"0"}]}')
     A            BTNCANCEL      1A  H
     A            BTNSAVE        1A  H
     A            BTNSTADD       1A  H
     A            CLRST          1A  H
     A            DSPST          1A  H
     A            DSPSTCTL       1A  H
     A            RRNST          5S 0H
     A            RRNSTROW       5S 0H
     A            SCOUTTYPE    100A  H
     A          R RCDSTWIN
     A                                  1  2HTML('QPUIREC9    ROVERLAY   0     -
     A                                      RWINDOW    0     REMSG      2    C1-
     A                                      8   DrpStateSetupGroupFMSSTGRP   FE-
     A                                      RSTGRP   REMSG      2    C20   TxbS-
     A                                      tateSetupEffDateFMSSTEFFDT FERSTEFF-
     A                                      DT REMSG      2    C27   TxbStateSe-
     A                                      tupCxFormTemplateFMSSTCXTEM FERSTCX-
     A                                      TEM REMSG      2    C23   TxbStateS-
     A                                      etupCxFormPathFMSSTCXPTH FERSTCXPTH-
     A                                       REMSG      2    C33   TxbStateSetu-
     A                                      pCxFormTemplateClientFMSSTCXTEMCFER-
     A                                      STCXTEMCREMSG      2    C29   TxbSt-
     A                                      ateSetupCxFormPathClientFMSSTCXPTHC-
     A                                      FERSTCXPTHCREMSG      2    C23   Dr-
     A                                      pStateSetupState_copyFMSSTSTATE FER-
     A                                      STSTATE ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"rcdStWin","description":"State -
     A                                      setup add/edit window","overlay":"t-
     A                                      rue","show as window":"true"},"item-
     A                                      s":[{"id":"DlgStateSetupWindow","fi-
     A                                      eld type":"panel","css class":"dial-
     A                                      og","value":"Template Information S-
     A                                      etup","left":"275px","top":"180px",-
     A                                      "width":"825px","height":"240px","p-
     A                                      anel style":"Transform Dialog","z i-
     A                                      ndex":"8","description":"State form-
     A                                       setup window","locked in place":"t-
     A                                      rue"},{"id":"LblStateSetupGroup","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"label","value":"Group","left":"-
     A                                      290px","top":"215px","width":"150px-
     A                                      ","description":"State setup Group -
     A                                      label"},{"id":"LblStateSetupState",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"label","description":"State s-
     A                                      etup State label","value":"State","-
     A                                      left":"525px","top":"215px","width"-
     A                                      :"150px"},{"id":"LblStateSetupEffDa-
     A                                      te","field type":"output field","cs-
     A                                      s class":"label","description":"Sta-
     A                                      te setup Eff Date label","value":"E-
     A                                      ffective Date","left":"695px","top"-
     A                                      :"215px","width":"150px"},{"id":"Dr-
     A                                      pStateSetupGroup","field type":"sel-
     A                                      ect box","css class":"dropdown","va-
     A                                      lue":{"fieldName":"scStGrp","dataLe-
     A                                      ngth":"3","decPos":"0","numSep":"fa-
     A                                      lse","zeroBalance":"false","numBlan-
     A                                      kFill":"false","zeroFill":"true","c-
     A                                      urSym":"","dataType":"zoned","forma-
     A                                      tting":"Number","negNum":"-999.00",-
     A                                      "units":"","designValue":"[scStGrp]-
     A                                      "},"left":"290px","top":"230px","wi-
     A                                      dth":"220px","description":"State s-
     A                                      etup group dropdown","choices datab-
     A                                      ase file":"WMFNP","choice options f-
     A                                      ield":"DIGITS(FNFND) || '' - '' || -
     A                                      FNNAME","choice values field":"DIGI-
     A                                      TS(FNFND)","order by":"DIGITS(FNFND-
     A                                      )","blank option":"true","blank opt-
     A                                      ion label":"All Groups","choices se-
     A                                      lection criteria":{"fieldName":"fnd-
     A                                      Choices","dataLength":"200","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none"},-
     A                                      "disabled":{"fieldName":"steEditMde-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"error message":{"fieldName":-
     A                                      "msStGrp","dataLength":"200","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      ,"error condition":{"fieldName":"er-
     A                                      StGrp","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error enhanced mode":"1","erro-
     A                                      r messages":"1 message"},{"id":"Txb-
     A                                      StateSetupEffDate","field type":"da-
     A                                      te field","css class":"date-field",-
     A                                      "value":{"fieldName":"scStEffDt","d-
     A                                      ataLength":"8","decPo')
     A                                  1  2HTML('s":"0","numSep":"false","zero-
     A                                      Balance":"false","numBlankFill":"fa-
     A                                      lse","zeroFill":"false","edtWrd":"'-
     A                                      '  /  /    ''","curSym":"","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      egNum":"-999.00","units":"","design-
     A                                      Value":"[scStEffDt]"},"left":"695px-
     A                                      ","top":"230px","width":"80px","des-
     A                                      cription":"State setup effective da-
     A                                      te text box","disabled":{"fieldName-
     A                                      ":"steEditM1","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error message":{-
     A                                      "fieldName":"msStEffdt","dataLength-
     A                                      ":"200","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"},"error condition":{"-
     A                                      fieldName":"erStEffDt","customTrue"-
     A                                      :"","customFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error enhanced-
     A                                       mode":"1","error messages":"1 mess-
     A                                      age","text align":"right"},{"id":"L-
     A                                      blStateSetupCxForm","field type":"o-
     A                                      utput field","css class":"label","d-
     A                                      escription":"State setup Cx Form la-
     A                                      bel","value":"FROI Form","left":"29-
     A                                      0px","top":"255px","width":"215px"}-
     A                                      ,{"id":"TxbStateSetupCxFormTemplate-
     A                                      ","field type":"textbox","css class-
     A                                      ":"textbox","value":{"fieldName":"s-
     A                                      cStCXTem","dataLength":"60","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[scStCXTem]"},"left":-
     A                                      "305px","top":"270px","required":"f-
     A                                      alse","width":"290px","description"-
     A                                      :"State Setup cx form template text-
     A                                       box","error message":{"fieldName":-
     A                                      "msStCxTem","dataLength":"200","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "},"error condition":{"fieldName":"-
     A                                      erStCXTem","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error enhanced mode":"1","-
     A                                      error messages":"1 message","disabl-
     A                                      ed":"true"},{"id":"TxbStateSetupCxF-
     A                                      ormPath","field type":"textbox","cs-
     A                                      s class":"textbox","description":"S-
     A                                      tate Setup cx form path text box","-
     A                                      value":{"fieldName":"scStCXPth","da-
     A                                      taLength":"250","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scStCXPth]"},"required":"false",-
     A                                      "left":"620px","top":"270px","width-
     A                                      ":"445px","error message":{"fieldNa-
     A                                      me":"msStCXPth","dataLength":"200",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataT')
     A                                  1  2HTML('ype":"char","formatting":"Tex-
     A                                      t","textTransform":"none"},"error c-
     A                                      ondition":{"fieldName":"erStCXPth",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror enhanced mode":"1","error messa-
     A                                      ges":"1 message","disabled":"true"}-
     A                                      ,{"id":"LblCancellationDefTemplate"-
     A                                      ,"field type":"output field","css c-
     A                                      lass":"label","description":"Def ca-
     A                                      ncellation template label","value":-
     A                                      "Default Template","left":"305px","-
     A                                      top":"285px","width":"110px","css c-
     A                                      lass 2":"sublabel"},{"id":"LblCance-
     A                                      llationDefPath","field type":"outpu-
     A                                      t field","css class":"label","descr-
     A                                      iption":"Def cancellation path labe-
     A                                      l","value":"Default Path","left":"6-
     A                                      20px","top":"285px","width":"110px"-
     A                                      ,"css class 2":"sublabel"},{"id":"T-
     A                                      xbStateSetupCxFormTemplateClient","-
     A                                      field type":"textbox","css class":"-
     A                                      textbox","description":"State Setup-
     A                                       client cx form template text box",-
     A                                      "value":{"fieldName":"scStCXTemC","-
     A                                      dataLength":"60","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none","designValue-
     A                                      ":"[scStCXTemC]"},"required":"false-
     A                                      ","left":"305px","top":"305px","wid-
     A                                      th":"290px","error message":{"field-
     A                                      Name":"msStCXTemC","dataLength":"20-
     A                                      0","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"},"error condition":{"field-
     A                                      Name":"erStCXTemC","customTrue":"",-
     A                                      "customFalse":"","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error enhanced mod-
     A                                      e":"1","error messages":"1 message"-
     A                                      },{"id":"TxbStateSetupCxFormPathCli-
     A                                      ent","field type":"textbox","css cl-
     A                                      ass":"textbox","description":"State-
     A                                       Setup client cx form path text box-
     A                                      ","value":{"fieldName":"scStCXPthC"-
     A                                      ,"dataLength":"250","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[scStCXPthC]"},"required":"fa-
     A                                      lse","left":"620px","top":"305px","-
     A                                      width":"445px","error message":{"fi-
     A                                      eldName":"msStCXPthC","dataLength":-
     A                                      "200","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"},"error condition":{"fi-
     A                                      eldName":"erStCXPthC","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error enhanced -
     A                                      mode":"1","error messages":"1 messa-
     A                                      ge"},{"id":"LblCancellationCltTempl-
     A                                      ate","field type":"output field","c-
     A                                      ss class":"label","de')
     A                                  1  2HTML('scription":"Clt cancellation -
     A                                      template label","value":"Client Tem-
     A                                      plate","left":"305px","top":"320px"-
     A                                      ,"width":"110px","css class 2":"sub-
     A                                      label"},{"id":"LblCancellationCltPa-
     A                                      th","field type":"output field","cs-
     A                                      s class":"label","description":"Clt-
     A                                       cancellation path label","value":"-
     A                                      Client Path","left":"620px","top":"-
     A                                      320px","width":"110px","css class 2-
     A                                      ":"sublabel"},{"id":"BtnStateSetupC-
     A                                      ancel","field type":"button","css c-
     A                                      lass":"button","value":"Cancel","le-
     A                                      ft":{"fieldName":"stCancLeft","data-
     A                                      Length":"5","decPos":"0","numSep":"-
     A                                      false","zeroBalance":"false","numBl-
     A                                      ankFill":"false","zeroFill":"false"-
     A                                      ,"noExtraSpaces":"false","curSym":"-
     A                                      ","dataType":"zoned","formatting":"-
     A                                      Number","negNum":"-999.00","units":-
     A                                      "px","designValue":"715px"},"top":"-
     A                                      375px","width":"110px","description-
     A                                      ":"State setup cancel button","resp-
     A                                      onse":{"fieldName":"btnStCanc","cus-
     A                                      tomTrue":"","customFalse":"","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "BtnStateSetupAdd","field type":"bu-
     A                                      tton","css class":"button","value":-
     A                                      "Save / Add Next","left":"840px","t-
     A                                      op":"375px","width":"110px","descri-
     A                                      ption":"State setup add/save button-
     A                                      ","response":{"fieldName":"btnStAdd-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      visibility":{"fieldName":"dspStAdd"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"}},{"id":"BtnStateSetupSave"-
     A                                      ,"field type":"button","css class":-
     A                                      "button","value":{"fieldName":"btnN-
     A                                      ame","dataLength":"20","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[btnName]"},"left":"965px"-
     A                                      ,"top":"375px","width":"110px","des-
     A                                      cription":"State setup save button"-
     A                                      ,"response":{"fieldName":"btnStSave-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      shortcut key":"Enter"},{"id":"TxbCX-
     A                                      FormHidden","field type":"textbox",-
     A                                      "css class":"textbox","value":{"fie-
     A                                      ldName":"scCXForm","dataLength":"60-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[scCXForm]"}-
     A                                      ,"left":"40px","top":"150px","requi-
     A                                      red":"false","width":"350px","visib-
     A                                      ility":"hidden"},{"id":"TxbREFormHi-
     A                                      dden","field type":"textbox","css c-
     A                                      lass":"textbox","value":{"fieldName-
     A                                      ":"scREForm","dataLength":"60","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"fal')
     A                                  1  2HTML('se","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scREForm]"},"left":"430px","top"-
     A                                      :"150px","required":"false","width"-
     A                                      :"400px","visibility":"hidden"},{"i-
     A                                      d":"DrpStateSetupState_copy","field-
     A                                       type":"select box","css class":"dr-
     A                                      opdown","description":"State setup -
     A                                      state dropdown","value":{"fieldName-
     A                                      ":"scStState","dataLength":"2","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[scStState]"},"dis-
     A                                      abled":{"fieldName":"steEditMde","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"error messages":"1 message","err-
     A                                      or message":{"fieldName":"msStState-
     A                                      ","dataLength":"200","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"},"error -
     A                                      condition":{"fieldName":"erStState"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror enhanced mode":"1","choices da-
     A                                      tabase file":"STSTL3","choice optio-
     A                                      ns field":"TRIM(STKEY) || '' - ''  -
     A                                      || TRIM(STNAME)","choice values fie-
     A                                      ld":"STKEY","choices selection crit-
     A                                      eria":"ststat <> ''I'' and stnst <>-
     A                                       ''  ''","blank option":"true","bla-
     A                                      nk option label":"All States","orde-
     A                                      r by":"STKEY","left":"525px","top":-
     A                                      "230px","width":"155px"}]}')
     A            BTNNAME       20A  H
     A            BTNSTADD       1A  H
     A            BTNSTCANC      1A  H
     A            BTNSTSAVE      1A  H
     A            DSPSTADD       1A  H
     A            ERSTCXPTH      1A  H
     A            ERSTCXPTHC     1A  H
     A            ERSTCXTEM      1A  H
     A            ERSTCXTEMC     1A  H
     A            ERSTEFFDT      1A  H
     A            ERSTGRP        1A  H
     A            ERSTSTATE      1A  H
     A            FNDCHOICES   200A  H
     A            MSSTCXPTH    200A  H
     A            MSSTCXPTHC   200A  H
     A            MSSTCXTEM    200A  H
     A            MSSTCXTEMC   200A  H
     A            MSSTEFFDT    200A  H
     A            MSSTGRP      200A  H
     A            MSSTSTATE    200A  H
     A            SCCXFORM      60A  H
     A            SCREFORM      60A  H
     A            SCSTCXPTH    250A  H
     A            SCSTCXPTHC   250A  H
     A            SCSTCXTEM     60A  H
     A            SCSTCXTEMC    60A  H
     A            SCSTEFFDT      8S 0H
     A            SCSTGRP        3S 0H
     A            SCSTSTATE      2A  H
     A            STCANCLEFT     5S 0H
     A            STEEDITM1      1A  H
     A            STEEDITMDE     1A  H
