     A*************************************************************************
     A* (c) 2014 StoneRiver, Inc. All rights reserved.                        *
     A* StoneRiver is a trademark of StoneRiver, Inc.                         *
     A*************************************************************************
     A*  WTRPTVSTP - Claim Detail Maintenance Screen                          *
     A*                                                                       *
     A*************************************************************************
     A*  Created on 12/09/2014 by c:62 for Project 114WGU                     *
     A*************************************************************************
     A* Revisions:                                                          *
     A*                                                                       *
     A*************************************************************************
     A                                      REF(*LIBL/WREFP)
     A                                      INDARA
     A          R RCDARUPLD
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RASSUME    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdArUpld","onload":"          -
     A                                                        ","description":"-
     A                                      Visit Tracking Report - Prompt","ov-
     A                                      erlay":"true","assume":"true","desi-
     A                                      gn overlay formats":"RcdVstTrk0"},"-
     A                                      items":[{"id":"HdgArBatchUpload","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"heading","value":"A/R Batch Upl-
     A                                      oad","left":"250px","top":"10px","d-
     A                                      escription":"A/R Batch Upload - Pro-
     A                                      mpt","z index":"11","width":"195px"-
     A                                      ,"heading type":"Page Title"},{"id"-
     A                                      :"TabArBatchUpload","field type":"t-
     A                                      ab panel","css class":"tab-panel","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"610px","tab names-
     A                                      ":"A/R Batch Upload","z index":"0",-
     A                                      "tab panel style":"CompSuite Tab Pa-
     A                                      nel","active tab":{"fieldName":"Tab-
     A                                      Index","dataLength":"5","decPos":"0-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","dataType":"zoned","formatting":"-
     A                                      Number","units":"","negNum":"-999.0-
     A                                      0"},"ontabclick":"pui.click(\"BtnTa-
     A                                      bClick\")"}]}')
     A            TABINDEX       5S 0H
     A          R RCDARUPLD0
     A                                  1  2HTML('QPUIREC4    ROVERLAY   0     -
     A                                      RASSUME    0     RROWS      2    C1-
     A                                          1C1    1 REMSG      2    C13   -
     A                                      TxbImportPathFMGIMPPATH FERIMPPATH -
     A                                      ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdArUpld0","overlay":"true","e-
     A                                      xternal css":"label","onload":"docu-
     A                                      ment.body.style.background = \"#EBF-
     A                                      5FF\"; fillDetailBox(''sflPayValue'-
     A                                      ',1,''OutPayRRN#'', ''WPICLMPV01'')-
     A                                      ;       fillDetailBox(''sflPayValue-
     A                                      Edi'',1,''OutPayRRN#E'', ''WPICLMPV-
     A                                      01'');                             -
     A                                           ","description":"Visit Trackin-
     A                                      g Report - Prompt 2","assume":"true-
     A                                      ","overlay range":"1-1","design ove-
     A                                      rlay formats":"RcdVstTrk","header t-
     A                                      ext align":"Left,Right","csv file n-
     A                                      ame":"Payment Value 1 Codes","selec-
     A                                      tion value":"A"},"items":[{"id":"Bt-
     A                                      nCancel","field type":"button","css-
     A                                       class":"button","value":"Cancel","-
     A                                      left":"990px","top":"640px","width"-
     A                                      :"100px","cursor":"default","descri-
     A                                      ption":"Cancel Button","response":{-
     A                                      "fieldName":"ExitNow","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"shortcut key"-
     A                                      :"F3","visibility":"visible","tab i-
     A                                      ndex":"18"},{"id":"LblImportPath","-
     A                                      field type":"output field","css cla-
     A                                      ss":"label","value":"Import File Pa-
     A                                      th Name","left":"260px","top":"120p-
     A                                      x","width":"145px"},{"id":"TxbImpor-
     A                                      tPath","field type":"textbox","css -
     A                                      class":"input","value":{"fieldName"-
     A                                      :"scImpPath","dataLength":"255","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[scImpPath]"},"re-
     A                                      quired":"false","left":"260px","top-
     A                                      ":"135px","width":"915px","css clas-
     A                                      s 2":"textbox","error messages":"1 -
     A                                      message","tab index":"6","contains -
     A                                      match":"true","error message":{"fie-
     A                                      ldName":"mgImpPath","dataLength":"1-
     A                                      00","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"},"error condition":{"fiel-
     A                                      dName":"erImpPath","customTrue":"",-
     A                                      "customFalse":"","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error enhanced mod-
     A                                      e":"1"},{"id":"BtnExitButtonAll_cop-
     A                                      y","field type":"button","css class-
     A                                      ":"button","cursor":"default","desc-
     A                                      ription":"Submit button","value":"S-
     A                                      ubmit","response":{"fieldName":"Sub-
     A                                      mit","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"shortcut key":"Enter","left":"-
     A                                      1100px","top":"640px","width":"100p-
     A                                      x","visibility":"visible","tab inde-
     A                                      x":"19"},{"id":"Image1","field type-
     A                                      ":"image","css class":"image","left-
     A                                      ":"410px","top":"125px","height":"8-
     A                                      px","width":"8px","image source":"/-
     A                                      profoundui/userdata/images/asterisk-
     A                                      _orange_small.png","css class 2":"r-
     A                                      equired-icon"}]}')
     A            ERIMPPATH      1A  H
     A            EXITNOW        1A  H
     A            MGIMPPATH    100A  H
     A            SCIMPPATH    255A  H
     A            SUBMIT         1A  H
