      * (c) 2023 Sapiens. All Rights Reserved.                             *
     A** WORKERS' COMP PAYMENT VALUE 1 (BR-2 CODE) TABLE FILE
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*****************************************************************
     A*                                                               *
     A* 02/28/23 C:344 Project: WC2430                                *
     A*                Add Lump Sum Indicator Flag and                *
     A*                State Specific Include/ Exclude Flag fields.   *
     A*                                                               *
     A* 12/10/20 C:062 Project: 89WCR                                 *
     A*                Add ALAE Exclusion Flag.                       *
     A*                                                               *
     A* 12/06/19 C:079 Project: 129WVK                                *
     A*                Add Vocational Rehab Paid Under Comp field     *
     A*                                                               *
     A* 08/19/19 C:079 Project: WC2604                                *
     A*                Add IDC field                                  *
     A*                                                               *
     A* 08/04/14 C:300 Project: WC2247                                *
     A*                Add field B2EXWDC.                             *
     A*                                                               *
     A* 10/14/10 C:190 Project: WC1953                                *
     A*                Add feild B2CCW.                               *
     A*                                                               *
     A* 03/10/10 C:242 Project: 25WRK                                 *
     A*                Claims Diary Retrofit.                         *
     A*                                                               *
     A* 07/21/09 C:198 SUPPORT:  68101                                *
     A*                Added EDI Recovery code.                       *
     A*                                                               *
     A* 08/09/07 C:191 PROJECT:  WC1453                               *
     A*                Add field for EFT flag;This flag will determine*
     A*                If payments with the assigned Payment Value 1 code
     A*                are eligible to be processed as an EFT payment.*
     A*                                                               *
     A* 04/25/05 C:156 PROJECT:  132WCN                               *
     A*                Add field B2FLG1 to indicate printing of CA    *
     A*                fraud statement on checks.                     *
     A*                                                               *
     A* 02/18/05 C:132 PROJECT:  WC1221                               *
     A*                Add Field B2RCVR for Loss Reports Recovery     *
     A*                Indicator.                                     *
     A*                                                               *
     A* 03/19/03 C:062 PROJECT:  129MBH                               *
     A*                UPDATED SOURCE COMMENTS ON FCC FIELD USAGE     *
     A*                OF B2PSIG.                                     *
     A*                                                               *
     A* 11/04/99 C:118 PROJECT:  44WCR                                *
     A*                ADD B2PSIG FIELD                               *
     A*                                                               *
     A* 07/09/97 C:62 PROJECT WC659                                   *
     A*               ADD TEN RESERVE CODE FIELDS                     *
     A*                                                               *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PB201                     TEXT('PAYMENT VALUE 1 TABLE FILE')
     A            B2CO#     R               REFFLD(CO#)
     A            B2KEY     R               REFFLD(KEY)
     A            B2DESC    R               REFFLD(DS30)
     A            B2PLCD    R               REFFLD(FLAG)
     A                                      COLHDG('PLACEMENT' 'CODE')
     A            B2STAT    R               REFFLD(STAT)
     A            B2USER    R               REFFLD(USER)
     A            B2PGM     R               REFFLD(PGM)
     A            B2TIME    R               REFFLD(TIME)
     A            B2DT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            B2PDFL    R               REFFLD(FLAG)
     A                                      COLHDG('PEND' 'FLAG')
     A            B2BNFT    R               REFFLD(CODE)
     A                                      COLHDG('BENEFIT' 'INDICATOR')
     A            B2MINR    R               REFFLD(DS3)
     A                                      COLHDG('MINOR' 'PMT CODE')
     A            B2PYCD    R    3A         REFFLD(CODE)
     A                                      COLHDG('PYMT/ADJ' 'CODE')
     A            B2NDDT    R               REFFLD(DYS)
     A                                      COLHDG('DAYS TILL DUE DATE')
     A            B2RMCD    R               REFFLD(RMCD)
     A                                      COLHDG('REMARK CODE')
     A            B2RC01    R               REFFLD(CODE)
     A                                      COLHDG('RESERVE CODE 01')
     A            B2RC02    R               REFFLD(CODE)
     A                                      COLHDG('RESERVE CODE 02')
     A            B2RC03    R               REFFLD(CODE)
     A                                      COLHDG('RESERVE CODE 03')
     A            B2RC04    R               REFFLD(CODE)
     A                                      COLHDG('RESERVE CODE 04')
     A            B2RC05    R               REFFLD(CODE)
     A                                      COLHDG('RESERVE CODE 05')
     A            B2RC06    R               REFFLD(CODE)
     A                                      COLHDG('RESERVE CODE 06')
     A            B2RC07    R               REFFLD(CODE)
     A                                      COLHDG('RESERVE CODE 07')
     A            B2RC08    R               REFFLD(CODE)
     A                                      COLHDG('RESERVE CODE 08')
     A            B2RC09    R               REFFLD(CODE)
     A                                      COLHDG('RESERVE CODE 09')
     A            B2RC10    R               REFFLD(CODE)
     A                                      COLHDG('RESERVE CODE 10')
     A            B2PSCD    R               REFFLD(CODE)
     A                                      COLHDG('PAYMENT STATUS CODE')
     A***** BEGIN ADD **** 11/04/99 ***********************************
     A            B2PSIG    R               REFFLD(FLAG)
     A                                      COLHDG('PREVENT' 'SIGNATURE' 'FLG:')
     A*
     A*                         CLT129 USAGE: APPORTIONMENT % FLAG
     A*                           VALID VALUES: 'Y' OR BLANK
     A***** END   ADD **** 11/04/99 ***********************************
     A*
     A***** BEG ADD ***** 02/18/05 ***********************************
     A            B2RCVR    R               REFFLD(FLAG)
     A                                      COLHDG('LOSS RPTS' 'RECOVERY')
     A                                      TEXT('LOSS RPRTS RECOVERY INDICATR')
     A***** BEG ADD ***** 04/25/05 ***********************************
     A            B2FLG1    R               REFFLD(FLAG)
     A                                      COLHDG('CA FRAUD' 'STATEMENT')
     A                                      TEXT('PRINT CA FRAUD STMT ON CHECK')
     A***** END ADD ***** 04/25/05 ***********************************
     A***** BEG ADD ***** 08/09/07 ***********************************
     A            B2EFT     R               REFFLD(FLAG)
     A                                      COLHDG('EFT PROCESING' 'FLAG')
     A                                      TEXT('EFT PROCESSING FLAG')
     A***** END ADD ***** 08/09/07 ***********************************
     A*** BEG ADD *** 07/21/09 ***************************************
     A            B2ERCV    R               REFFLD(DS3)
     A                                      COLHDG('EDI Recovery Code')
     A                                      TEXT('EDI Recovery Code')
     A*** END ADD *** 07/21/09 ***************************************
     A***** Beg ADD ***** 03/10/10 ***********************************
     A            B2AWPY    R               REFFLD(FLAG)
     A                                      COLHDG('Waiting' 'Period Diary')
     A                                      TEXT('Waiting Period Diary')
     A            B2ASMY    R               REFFLD(FLAG)
     A                                      COLHDG('Statutory' 'MMI Diary')
     A                                      TEXT('Statutory MMI Diary')
     A            B2ACRY    R               REFFLD(FLAG)
     A                                      COLHDG('Change Comp' 'Rate Diary')
     A                                      TEXT('Change Comp Rate Diary')
     A***** End ADD ***** 03/10/10 ***********************************
     A***** Beg ADD ***** 10/14/10 ***********************************
     A            B2CCW     R               REFFLD(FLAG)
     A                                      COLHDG('Cost Containment')
     A***** End ADD ***** 10/14/10 ***********************************
     A***** Beg ADD ***** 08/04/14 ***********************************
     A            B2EXWDC   R               REFFLD(FLAG)
     A                                      COLHDG('Exclude from' 'We-
     A                                      eks/Days' 'Calculation')
     A***** End ADD ***** 08/04/14 ***********************************
     A***** Beg Add ***** 08/19/19 ***********************************
     A            B2IBTC    R               REFFLD(CODE)
     A                                      COLHDG('IDC Benefit' -
     A                                      'Type Code')
     A***** End Add ***** 08/19/19 ***********************************
     A***** Beg Add ***** 12/06/19 ***********************************
     A            B2VHPC    R               REFFLD(CODE)
     A                                      COLHDG('Voc Rehab' -
     A                                      'Paid Under Comp')
     A***** End Add ***** 12/06/19 ***********************************
     A***** Beg Add ***** 12/10/20 ***********************************
     A            B2EXALAE  R               REFFLD(FLAG)
     A                                      COLHDG('Exclude from' -
     A                                      'ALAE')
     A***** End Add ***** 12/10/20 ***********************************
     A***** Beg Add ***** 02/28/23 *** WC2430 ************************
     A            B2LMPSUM  R               REFFLD(FLAG)
     A                                      COLHDG('Lump Sum' +
     A                                      'Indicator' +
     A                                      'Flag')
     A            B2STSPINEXR               REFFLD(FLAG)
     A                                      COLHDG('State Specific' +
     A                                      'Include Exclude' +
     A                                      'Flag')
     A***** End Add ***** 02/28/23 *** WC2430 ************************
