     A* (c) 2009 StoneRiver, Inc. All rights Reserved.                *
     A* StoneRiver is a trademark of StoneRiver, Inc.                 *
     A*                                                               *
     A*****************************************************************
     A*                                                               *
     A* FILE: HOLIDAY BLACKOUT DATE FILE                              *
     A*                                                               *
     A* CREATED UNDER PROJECT : WC1766                                *
     A*                                                               *
     A* CREATED BY : 220                                              *
     A*                                                               *
     A*****************************************************************
     A
     A          R PCB01                     PFILE(WTCBP)
     A          K CBCO#
     A          K CBDATE                    DESCEND
     A*
