      * (c) 2023 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A**
     A** WORKERS' COMP CHECK CONTROL TABLE FILE
     A                                      REF(WREFP)
     A          R PCC01                     TEXT('CHECK CONTROL TABLE FILE')
     A            CCCO#     R               REFFLD(CO#)
     A            CCKEY     R               REFFLD(KEY)
     A            CCDESC    R               REFFLD(DS30)
     A            CCSTAT    R               REFFLD(STAT)
     A            CCUSER    R               REFFLD(USER)
     A            CCPGM     R               REFFLD(PGM)
     A            CCTIME    R               REFFLD(TIME)
     A            CCDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
