     A                                      REF(*LIBL/WREFP)
     A                                      INDARA
     A          R RCDPANEL
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RASSUME    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdPanel","onload":"           -
     A                                                       ","description":"R-
     A                                      eserve Worksheet  Tab Panel","overl-
     A                                      ay":"true","assume":"true"},"items"-
     A                                      :[{"id":"HdgClmConfig","field type"-
     A                                      :"output field","css class":"headin-
     A                                      g","value":{"fieldName":"scPnlHdg",-
     A                                      "dataLength":"50","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[scPnlHdg]"},"left":"250px","to-
     A                                      p":"10px","description":"Claim Conf-
     A                                      iguration Heading","z index":"11","-
     A                                      width":"190px","heading type":"Page-
     A                                       Title"},{"id":"BtnExitButton","fie-
     A                                      ld type":"button","css class":"butt-
     A                                      on","value":"Exit","left":"490px","-
     A                                      top":"10px","width":"100px","cursor-
     A                                      ":"default","description":"Exit But-
     A                                      ton","response":{"fieldName":"ExitN-
     A                                      ow","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"shortcut key":"F3","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"id":"TabRsvWorksheet","field typ-
     A                                      e":"tab panel","css class":"panel",-
     A                                      "left":"250px","top":"70px","width"-
     A                                      :"970px","height":{"fieldName":"Tab-
     A                                      Height","dataLength":"5","decPos":"-
     A                                      0","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","dataType":"zoned","formatting":-
     A                                      "Number","units":"px","negNum":"-99-
     A                                      9.00","designValue":"3270px"},"tab -
     A                                      names":{"fieldName":"TabNames","dat-
     A                                      aLength":"1000","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"Reserve WorkSheet,General,Import/-
     A                                      Export"},"z index":"9","tab panel s-
     A                                      tyle":"Transform Tab Panel","active-
     A                                       tab":{"fieldName":"TabIndex","data-
     A                                      Length":"5","decPos":"0","numSep":"-
     A                                      false","zeroBalance":"false","numBl-
     A                                      ankFill":"false","zeroFill":"false"-
     A                                      ,"noExtraSpaces":"false","curSym":"-
     A                                      ","dataType":"zoned","formatting":"-
     A                                      Number","negNum":"-999.00","units":-
     A                                      ""},"locked in place":"true","ontab-
     A                                      click":"pui.click(\"BtnTabClick\")"-
     A                                      },{"id":"BtnTabClick","field type":-
     A                                      "button","css class":"button","curs-
     A                                      or":"default","description":"tab cl-
     A                                      ick button","value":"Tab","response-
     A                                      ":{"fieldName":"tabClick","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"shortcut -
     A                                      key":"F3","left":"450px","top":"10p-
     A                                      x","width":"35px","visibility":"hid-
     A                                      den"},{"id":"btnRefresh","field typ-
     A                                      e":"button","css class":"button","v-
     A                                      alue":"Refresh","left":"620px","top-
     A                                      ":"10px","width":"100px","cursor":"-
     A                                      default","response":{"fieldName":"B-
     A                                      tnRefresh","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"visibility')
     A                                  1  2HTML('":"hidden"},{"id":"btnSave","-
     A                                      field type":"button","css class":"b-
     A                                      utton","cursor":"default","value":"-
     A                                      Save","response":{"fieldName":"BtnS-
     A                                      ave","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"left":"750px","top":"15px","wi-
     A                                      dth":"100px","visibility":"hidden",-
     A                                      "description":"Save Button","shortc-
     A                                      ut key":"Enter"},{"id":"BtnUserAcce-
     A                                      ss","field type":"button","css clas-
     A                                      s":"button","value":"User Access","-
     A                                      response":{"fieldName":"btnUsrAcc",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"le-
     A                                      ft":"255px","top":"40px","width":"1-
     A                                      00px","visibility":{"fieldName":"is-
     A                                      UsrAcc","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"disabled":{"fieldN-
     A                                      ame":"dspMode","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"}},{"id":"OutNoAcc-
     A                                      ess","field type":"output field","c-
     A                                      ss class":"output-field","value":"Y-
     A                                      ou do not have access to these conf-
     A                                      iguration options.  Please contact -
     A                                      your system administrator for assis-
     A                                      tance.","left":"475px","top":"335px-
     A                                      ","z index":"10","visibility":{"fie-
     A                                      ldName":"isNoAccess","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"}},{"id"-
     A                                      :"OutDisplayMode","field type":"out-
     A                                      put field","css class":"output-fiel-
     A                                      d","value":{"fieldName":"dspMode","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      ","designValue":"[dspMode]"},"left"-
     A                                      :"390px","top":"45px","visibility":-
     A                                      "hidden"}]}')
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNUSRACC      1A  H
     A            DSPMODE        1A  H
     A            EXITNOW        1A  H
     A            ISNOACCESS     1A  H
     A            ISUSRACC       1A  H
     A            SCPNLHDG      50A  H
     A            TABCLICK       1A  H
     A            TABHEIGHT      5S 0H
     A            TABINDEX       5S 0H
     A            TABNAMES    1000A  H
     A          R SFLSTATEHD                SFL
     A            QPUI000001     1A  O  2  2
     A            DSBEDIT        1A  H
     A            DSPHDGACT      1A  H
     A            DSPHDGEDT      1A  H
     A            SCACTIVAT1    10A  H
     A            SCACTIVATE    10A  H
     A            SCAGNROWSL     1A  H
     A            SCHDGEDT       1A  H
     A            SCHDGSTATE     7A  H
     A            SCRESRRN#      9S 0H
     A            SCSTATUS       1A  H
     A          R QSFLCTL001                SFLCTL(SFLSTATEHD)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLRCDREQRSVW')
     A          R RCDREQRSVW
     A                                  1  2HTML('QPUICTL1    SFLSTATEHD5    RS-
     A                                      FLDSP    0    FDSPHDGSUB RSFLDSPCTL-
     A                                       0    FDSPHDGCTL RSFLCLR    0    FC-
     A                                      LRHDGST  RSFLPAG    1    C1    5 RS-
     A                                      FLSIZ    1    C1    6 0    5    ROV-
     A                                      ERLAY   0     RASSUME    0     RROW-
     A                                      S      2    C1    1C1    1 REMSGID -
     A                                         5    C15   TxbApprovalCodeC7    -
     A                                      WCR0503C6    WMESGGC0    C0    FERA-
     A                                      PPCODE REMSGID    5    C13   TxbRem-
     A                                      arkCodeC7    WCR0503C6    WMESGGC0 -
     A                                         C0    FERRMKCODE ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdReqRsvW","overlay":"true","e-
     A                                      xternal css":"label","onload":"docu-
     A                                      ment.body.style.background = \"#EBF-
     A                                      5FF\"; fillDetailBox(''sflGrdStateH-
     A                                      eading'',1,''OutResRRN#'', ''WTCLMC-
     A                                      FG01'');                           -
     A                                       ","description":"Require Reserve W-
     A                                      orksheet ","assume":"true","overlay-
     A                                       range":"1-1","design overlay forma-
     A                                      ts":"Rcdpanel"},"items":[{"id":"Out-
     A                                      RsvWorksheet","field type":"output -
     A                                      field","css class":"heading","value-
     A                                      ":"Require Reserve Worksheet ","tex-
     A                                      t align":"left","left":"260px","top-
     A                                      ":"105px","width":"200px","z index"-
     A                                      :"50","heading type":"Section Heade-
     A                                      r","locked in place":"true","visibi-
     A                                      lity":{"fieldName":"ShowClmCfg","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"disabled":{"fieldName":"Sho-
     A                                      wClmCfg","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"}},{"id":"sflGrdStateH-
     A                                      eading ","field type":"grid","css c-
     A                                      lass":"subfilegrid","left":"260px",-
     A                                      "top":"330px","number of rows":"6",-
     A                                      "number of columns":"3","column wid-
     A                                      ths":"148,146,181","column headings-
     A                                      ":"State,Status,","header height":"-
     A                                      21","row height":"20","csv export":-
     A                                      "true","export with headings":"true-
     A                                      ","sortable columns":"true","resiza-
     A                                      ble columns":"true","movable column-
     A                                      s":"true","height":"121px","width":-
     A                                      "476px","record format name":"sflSt-
     A                                      ateHd","description":"State Heading-
     A                                       grid ","header text align":"left,l-
     A                                      eft,","row selection":"single","cle-
     A                                      ar subfile":{"fieldName":"clrHdgSt"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"subfile record number":{"fi-
     A                                      eldName":"rrnHdgSt","dataLength":"5-
     A                                      ","decPos":"0","numSep":"false","ze-
     A                                      roBalance":"false","numBlankFill":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","dataType":"zoned","formatting":-
     A                                      "Number","negNum":"-999.00","units"-
     A                                      :""},"locked in place":"false","dis-
     A                                      play subfile":{"fieldName":"dspHdgS-
     A                                      ub","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"display control record":-
     A                                      {"fieldName":"dspHdgCtl","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"onr-
     A                                      owclick":"fillDetailBox(''sflGrdSta-
     A                                      teHeading'',row,''OutResRRN#'', ''W-
     A                                      TCLMCFG01'');","selection field":{"-
     A                                      fieldName":"scAgnRowSl","dataLength-
     A                                      ":"1","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"},"selection value":"A",-
     A                                      "visibility":{"fieldName":"ShowClmC-
     A                                      fg","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"export file name":"S-
     A                                      tate_Satus","filter o')
     A                                  1  2HTML('ption":"true","find option":"-
     A                                      true"},{"id":"OutHeading","field ty-
     A                                      pe":"output field","css class":"hea-
     A                                      ding","value":"State Heading Grid "-
     A                                      ,"text align":"left","left":"260px"-
     A                                      ,"top":"295px","width":"125px","z i-
     A                                      ndex":"50","heading type":"Section -
     A                                      Header","locked in place":"false","-
     A                                      visibility":{"fieldName":"ShowClmCf-
     A                                      g","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"disabled":{"fieldName-
     A                                      ":"ShowClmCfg","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"true / false"}},{"id":"OutDtl-
     A                                      Status","field type":"output field"-
     A                                      ,"css class":"output-field","left":-
     A                                      "645px","top":"505px","width":"65px-
     A                                      ","height":"12px","locked in place"-
     A                                      :"false","visibility":{"fieldName":-
     A                                      "ShowClmCfg","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"}},{"id":"LblD-
     A                                      tlStatus","field type":"output fiel-
     A                                      d","css class":"label","value":"Sta-
     A                                      tus","left":"645px","top":"490px","-
     A                                      width":"40px","locked in place":"fa-
     A                                      lse","visibility":{"fieldName":"Sho-
     A                                      wClmCfg","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"}},{"id":"line1","-
     A                                      field type":"horizontal line","css -
     A                                      class":"line","left":"260px","top":-
     A                                      "285px","line style":"Dotted","heig-
     A                                      ht":"1px","width":"950px","visibili-
     A                                      ty":{"fieldName":"ShowClmCfg","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"}},{"id":"LblDtlState","field ty-
     A                                      pe":"output field","css class":"lab-
     A                                      el","value":"State","left":"265px",-
     A                                      "top":"490px","width":"35px","locke-
     A                                      d in place":"false","visibility":{"-
     A                                      fieldName":"ShowClmCfg","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"}},-
     A                                      {"id":"LblIIndBenHdg","field type":-
     A                                      "output field","css class":"label",-
     A                                      "value":"Indemnity Benefit Headings-
     A                                      ","left":"265px","top":"530px","wid-
     A                                      th":"200px","locked in place":"fals-
     A                                      e","visibility":{"fieldName":"ShowC-
     A                                      lmCfg","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"}},{"id":"OutDtlBHdg-
     A                                      2","field type":"output field","css-
     A                                       class":"output-field","left":"265p-
     A                                      x","top":"560px","height":"12px","w-
     A                                      idth":"300px","locked in place":"fa-
     A                                      lse","visibility":{"fieldName":"Sho-
     A                                      wClmCfg","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"}},{"id":"OutDtlBH-
     A                                      dg3","field type":"output field","c-
     A                                      ss class":"output-field","left":"26-
     A                                      5px","top":"575px","height":"12px",-
     A                                      "width":"300px","locked in place":"-
     A                                      false","visibility":{"fieldName":"S-
     A                                      howClmCfg","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"}},{"id":"OutDtl-
     A                                      BHdg1","field type":"')
     A                                  1  2HTML('output field","css class":"ou-
     A                                      tput-field","left":"265px","top":"5-
     A                                      45px","height":"12px","width":"300p-
     A                                      x","locked in place":"false","visib-
     A                                      ility":{"fieldName":"ShowClmCfg","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"}},{"id":"OutDtlstate","field-
     A                                       type":"output field","css class":"-
     A                                      output-field","left":"265px","top":-
     A                                      "505px","height":"12px","width":"45-
     A                                      px","locked in place":"false","visi-
     A                                      bility":{"fieldName":"ShowClmCfg","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"}},{"id":"cbxMedClaims","fie-
     A                                      ld type":"checkbox","css class":"in-
     A                                      put","value":{"fieldName":"scMedClm-
     A                                      ","refField":"FLAG","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","textTransform":"none","des-
     A                                      ignValue":"[scMedClm]"},"left":"260-
     A                                      px","top":"155px","label":"Medical -
     A                                      Only Claims","css class 2":"checkbo-
     A                                      x","visibility":{"fieldName":"ShowC-
     A                                      lmCfg","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"disabled":{"field-
     A                                      Name":"DsblClmCfg","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"checked v-
     A                                      alue":"Y","unchecked value":" "},{"-
     A                                      id":"TxbMedicalAmt","field type":"t-
     A                                      extbox","css class":"input","value"-
     A                                      :{"fieldName":"scMedAmt","dataLengt-
     A                                      h":"11","decPos":"2","numSep":"true-
     A                                      ","zeroBalance":"false","numBlankFi-
     A                                      ll":"false","zeroFill":"true","curS-
     A                                      ym":"$","dataType":"zoned","formatt-
     A                                      ing":"Number","negNum":"-999.00","u-
     A                                      nits":"","designValue":"[scMedAmt]"-
     A                                      },"left":"855px","top":"155px","css-
     A                                       class 2":"textbox","required":"fal-
     A                                      se","text align":"right","width":"1-
     A                                      10px","visibility":{"fieldName":"Sh-
     A                                      owClmCfg","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"disabled":{"fi-
     A                                      eldName":"DsblClmCfg","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"true / false"}},{"id":-
     A                                      "cbxIndClaims","field type":"checkb-
     A                                      ox","css class":"input","label":"In-
     A                                      demnity Claims","left":"260px","top-
     A                                      ":"175px","css class 2":"checkbox",-
     A                                      "value":{"fieldName":"scIndClm","re-
     A                                      fField":"Flag","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[scIndClm]"},"visibility":{"f-
     A                                      ieldName":"ShowClmCfg","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"d-
     A                                      isabled":{"fieldName":"DsblClmCfg",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"checked value":"Y","unchecke-
     A                                      d value":" "},{"id":"')
     A                                  1  2HTML('TxbIndemnityAmt","field type"-
     A                                      :"textbox","css class":"input","val-
     A                                      ue":{"fieldName":"scIndAmt","dataLe-
     A                                      ngth":"11","decPos":"2","numSep":"t-
     A                                      rue","zeroBalance":"false","numBlan-
     A                                      kFill":"false","zeroFill":"false","-
     A                                      curSym":"$","dataType":"zoned","for-
     A                                      matting":"Number","negNum":"-999.00-
     A                                      ","units":"","designValue":"[scIndA-
     A                                      mt]"},"required":"false","left":"85-
     A                                      5px","top":"175px","css class 2":"t-
     A                                      extbox","text align":"right","width-
     A                                      ":"110px","visibility":{"fieldName"-
     A                                      :"ShowClmCfg","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"disabled":-
     A                                      {"fieldName":"DsblClmCfg","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"}},{"-
     A                                      id":"cbxUserFlag","field type":"che-
     A                                      ckbox","css class":"input","label":-
     A                                      "Disallow User From Approving Own W-
     A                                      orksheet","left":"260px","top":"230-
     A                                      px","css class 2":"checkbox","value-
     A                                      ":{"fieldName":"scUserFlag","refFie-
     A                                      ld":"Flag","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scUserFlag]"},"visibility":{"fie-
     A                                      ldName":"ShowClmCfg","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"dis-
     A                                      abled":{"fieldName":"DsblClmCfg","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"checked value":"Y","unchecked -
     A                                      value":" "},{"id":"TxbApprovalCode"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","value":{"fieldName":"scAp-
     A                                      pCode","dataLength":"5","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none","desi-
     A                                      gnValue":"[scAppCode]"},"required":-
     A                                      "false","left":"855px","top":"225px-
     A                                      ","css class 2":"textbox","width":"-
     A                                      300px","choices database file":"STC-
     A                                      TP","choices selection criteria":"C-
     A                                      TSTAT <>''I''","choice options fiel-
     A                                      d":"TRIM(CTRMCD) || '' - '' || CTDE-
     A                                      SC","choice values field":"CTRMCD",-
     A                                      "contains match":"true","visibility-
     A                                      ":{"fieldName":"ShowClmCfg","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"disabled":{"fieldName":"DsblClm-
     A                                      Cfg","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"error messages":"1 mess-
     A                                      age","error message id":"WCR0503","-
     A                                      error message file":"WMESGG","error-
     A                                       condition":{"fieldName":"erAppCode-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error enhanced mode":"1","max cho-
     A                                      ices":"25"},{"id":"TxbRemarkCode","-
     A                                      field type":"textbox","css class":"-
     A                                      input","value":{"fieldName":"scRmkC-
     A                                      ode","dataLength":"5"')
     A                                  1  2HTML(',"trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[scRmkC-
     A                                      ode]"},"required":"false","left":"8-
     A                                      55px","top":"250px","width":"300px"-
     A                                      ,"css class 2":"textbox","choices d-
     A                                      atabase file":"STCTP","choice optio-
     A                                      ns field":"TRIM(CTRMCD) || '' - '' -
     A                                      || CTDESC","choice values field":"C-
     A                                      TRMCD","choices selection criteria"-
     A                                      :"CTSTAT <>''I''","contains match":-
     A                                      "true","visibility":{"fieldName":"S-
     A                                      howClmCfg","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"disabled":{"f-
     A                                      ieldName":"DsblClmCfg","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"error-
     A                                       messages":"1 message","error messa-
     A                                      ge id":"WCR0503","error message fil-
     A                                      e":"WMESGG","error condition":{"fie-
     A                                      ldName":"erRmkCode","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error enhanced -
     A                                      mode":"1","max choices":"25"},{"id"-
     A                                      :"BtnHdgAdd","field type":"button",-
     A                                      "css class":"button","value":"Add",-
     A                                      "left":"645px","top":"455px","width-
     A                                      ":"85px","cursor":"default","respon-
     A                                      se":{"fieldName":"ScHdgAdd","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"visibil-
     A                                      ity":{"fieldName":"dspHdgAdd","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"disabled":{"fieldName":"dsbadd"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"height":"20px"},{"id":"LblM-
     A                                      edThreshold","field type":"output f-
     A                                      ield","css class":"label","value":"-
     A                                      Threshold Amount","left":"655px","t-
     A                                      op":"155px","width":"115px","locked-
     A                                       in place":"false","visibility":{"f-
     A                                      ieldName":"ShowClmCfg","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"}},{-
     A                                      "id":"LblIndThreshold","field type"-
     A                                      :"output field","css class":"label"-
     A                                      ,"value":"Threshold Amount","left":-
     A                                      "655px","top":"175px","width":"115p-
     A                                      x","locked in place":"false","visib-
     A                                      ility":{"fieldName":"ShowClmCfg","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"}},{"id":"LblApprovalCode","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"label","value":"Worksheet Appro-
     A                                      val Diary Code","left":"655px","top-
     A                                      ":"230px","width":"184px","locked i-
     A                                      n place":"false","visibility":{"fie-
     A                                      ldName":"ShowClmCfg","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"}},{"i-
     A                                      d":"LblRemarkCode","field type":"ou-
     A                                      tput field","css class":"label","va-
     A                                      lue":"Worksheet Remark Code","left"-
     A                                      :"655px","top":"250px","width":"144-
     A                                      px","locked in place"')
     A                                  1  2HTML(':"false","visibility":{"field-
     A                                      Name":"ShowClmCfg","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"}},{"id"-
     A                                      :"OutDtlBHdg6","field type":"output-
     A                                       field","css class":"output-field",-
     A                                      "left":"265px","top":"620px","heigh-
     A                                      t":"12px","width":"300px","locked i-
     A                                      n place":"false","visibility":{"fie-
     A                                      ldName":"ShowClmCfg","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"}},{"i-
     A                                      d":"OutDtlBHdg5","field type":"outp-
     A                                      ut field","css class":"output-field-
     A                                      ","left":"265px","top":"605px","hei-
     A                                      ght":"12px","width":"300px","locked-
     A                                       in place":"false","visibility":{"f-
     A                                      ieldName":"ShowClmCfg","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"}},{-
     A                                      "id":"OutDtlBHdg4","field type":"ou-
     A                                      tput field","css class":"output-fie-
     A                                      ld","left":"265px","top":"590px","h-
     A                                      eight":"12px","width":"300px","lock-
     A                                      ed in place":"false","visibility":{-
     A                                      "fieldName":"ShowClmCfg","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"}}-
     A                                      ,{"id":"LblIndFlexHdg","field type"-
     A                                      :"output field","css class":"label"-
     A                                      ,"value":"Indemnity Flexible Headin-
     A                                      gs","left":"645px","top":"530px","w-
     A                                      idth":"200px","locked in place":"fa-
     A                                      lse","visibility":{"fieldName":"Sho-
     A                                      wClmCfg","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"}},{"id":"OutDtlFH-
     A                                      dg2","field type":"output field","c-
     A                                      ss class":"output-field","left":"64-
     A                                      5px","top":"560px","height":"12px",-
     A                                      "width":"300px","locked in place":"-
     A                                      false","visibility":{"fieldName":"S-
     A                                      howClmCfg","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"}},{"id":"OutDtl-
     A                                      FHdg3","field type":"output field",-
     A                                      "css class":"output-field","left":"-
     A                                      645px","top":"575px","height":"12px-
     A                                      ","width":"300px","locked in place"-
     A                                      :"false","visibility":{"fieldName":-
     A                                      "ShowClmCfg","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"}},{"id":"OutD-
     A                                      tlFHdg1","field type":"output field-
     A                                      ","css class":"output-field","left"-
     A                                      :"645px","top":"545px","height":"12-
     A                                      px","width":"300px","locked in plac-
     A                                      e":"false","visibility":{"fieldName-
     A                                      ":"ShowClmCfg","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"}},{"id":"Ou-
     A                                      tDtlFHdg4","field type":"output fie-
     A                                      ld","css class":"output-field","lef-
     A                                      t":"645px","top":"590px","height":"-
     A                                      12px","width":"300px","locked in pl-
     A                                      ace":"false","visibility":{"fieldNa-
     A                                      me":"ShowClmCfg","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"}},{"id":"-
     A                                      LblMedFlexHdg","field type":"output-
     A                                       field","css class":"label","value"-
     A                                      :"Medical Flexible He')
     A                                  1  2HTML('adings","left":"265px","top":-
     A                                      "650px","width":"200px","locked in -
     A                                      place":"false","visibility":{"field-
     A                                      Name":"ShowClmCfg","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"}},{"id"-
     A                                      :"OutDtlMHdg2","field type":"output-
     A                                       field","css class":"output-field",-
     A                                      "left":"265px","top":"680px","heigh-
     A                                      t":"12px","width":"300px","locked i-
     A                                      n place":"false","visibility":{"fie-
     A                                      ldName":"ShowClmCfg","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"}},{"i-
     A                                      d":"OutDtlMHdg3","field type":"outp-
     A                                      ut field","css class":"output-field-
     A                                      ","left":"265px","top":"695px","hei-
     A                                      ght":"12px","width":"300px","locked-
     A                                       in place":"false","visibility":{"f-
     A                                      ieldName":"ShowClmCfg","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"}},{-
     A                                      "id":"OutDtlMHdg1","field type":"ou-
     A                                      tput field","css class":"output-fie-
     A                                      ld","left":"265px","top":"665px","h-
     A                                      eight":"12px","width":"300px","lock-
     A                                      ed in place":"false","visibility":{-
     A                                      "fieldName":"ShowClmCfg","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"}}-
     A                                      ,{"id":"OutDtlMHdg4","field type":"-
     A                                      output field","css class":"output-f-
     A                                      ield","left":"265px","top":"710px",-
     A                                      "height":"12px","width":"300px","lo-
     A                                      cked in place":"false","visibility"-
     A                                      :{"fieldName":"ShowClmCfg","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      }},{"id":"LblExpFlexHdg","field typ-
     A                                      e":"output field","css class":"labe-
     A                                      l","value":"Expense Flexible Headin-
     A                                      gs","left":"645px","top":"650px","w-
     A                                      idth":"200px","locked in place":"fa-
     A                                      lse","visibility":{"fieldName":"Sho-
     A                                      wClmCfg","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"}},{"id":"OutDtlEH-
     A                                      dg2","field type":"output field","c-
     A                                      ss class":"output-field","left":"64-
     A                                      5px","top":"680px","height":"12px",-
     A                                      "width":"300px","locked in place":"-
     A                                      false","visibility":{"fieldName":"S-
     A                                      howClmCfg","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"}},{"id":"OutDtl-
     A                                      EHdg3","field type":"output field",-
     A                                      "css class":"output-field","left":"-
     A                                      645px","top":"695px","height":"12px-
     A                                      ","width":"300px","locked in place"-
     A                                      :"false","visibility":{"fieldName":-
     A                                      "ShowClmCfg","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"}},{"id":"OutD-
     A                                      tlEHdg1","field type":"output field-
     A                                      ","css class":"output-field","left"-
     A                                      :"645px","top":"665px","height":"12-
     A                                      px","width":"300px","locked in plac-
     A                                      e":"false","visibility":{"fieldName-
     A                                      ":"ShowClmCfg","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"}},{"id":"Ou-
     A                                      tDtlEHdg4","field typ')
     A                                  1  2HTML('e":"output field","css class"-
     A                                      :"output-field","left":"645px","top-
     A                                      ":"710px","height":"12px","width":"-
     A                                      300px","locked in place":"false","v-
     A                                      isibility":{"fieldName":"ShowClmCfg-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"}},{"id":"LblLegFlexHdg",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"label","value":"Legal Flexibl-
     A                                      e Headings","left":"265px","top":"7-
     A                                      40px","width":"200px","locked in pl-
     A                                      ace":"false","visibility":{"fieldNa-
     A                                      me":"ShowClmCfg","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"}},{"id":"-
     A                                      OutDtlLHdg2","field type":"output f-
     A                                      ield","css class":"output-field","l-
     A                                      eft":"265px","top":"770px","height"-
     A                                      :"12px","width":"300px","locked in -
     A                                      place":"false","visibility":{"field-
     A                                      Name":"ShowClmCfg","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"}},{"id"-
     A                                      :"OutDtlLHdg3","field type":"output-
     A                                       field","css class":"output-field",-
     A                                      "left":"265px","top":"785px","heigh-
     A                                      t":"12px","width":"300px","locked i-
     A                                      n place":"false","visibility":{"fie-
     A                                      ldName":"ShowClmCfg","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"}},{"i-
     A                                      d":"OutDtlLHdg1","field type":"outp-
     A                                      ut field","css class":"output-field-
     A                                      ","left":"265px","top":"755px","hei-
     A                                      ght":"12px","width":"300px","locked-
     A                                       in place":"false","visibility":{"f-
     A                                      ieldName":"ShowClmCfg","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"}},{-
     A                                      "id":"OutDtlLHdg4","field type":"ou-
     A                                      tput field","css class":"output-fie-
     A                                      ld","left":"265px","top":"800px","h-
     A                                      eight":"12px","width":"300px","lock-
     A                                      ed in place":"false","visibility":{-
     A                                      "fieldName":"ShowClmCfg","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"}}-
     A                                      ,{"id":"Astappdiarycode","field typ-
     A                                      e":"image","css class":"image","lef-
     A                                      t":"845px","top":"230px","height":"-
     A                                      8px","width":"8px","image source":"-
     A                                      /profoundui/userdata/images/asteris-
     A                                      k_orange_small.png","css class 2":"-
     A                                      required-icon","visibility":{"field-
     A                                      Name":"ShowClmCfg","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"}},{"id"-
     A                                      :"Astremarkcode","field type":"imag-
     A                                      e","css class":"image","image sourc-
     A                                      e":"/profoundui/userdata/images/ast-
     A                                      erisk_orange_small.png","left":"805-
     A                                      px","top":"250px","height":"8px","w-
     A                                      idth":"8px","css class 2":"required-
     A                                      -icon","visibility":{"fieldName":"S-
     A                                      howClmCfg","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"}},{"id":"OutJob-
     A                                      U","field type":"output field","css-
     A                                       class":"output-field","value":{"fi-
     A                                      eldName":"q1cusr","refField":"q1cus-
     A                                      r szq1p","trimLeading')
     A                                  1  2HTML('":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"reference","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[q1cusr]"},"lef-
     A                                      t":"995px","top":"330px","descripti-
     A                                      on":"job user","visibility":"hidden-
     A                                      "},{"id":"OutJobN","field type":"ou-
     A                                      tput field","css class":"output-fie-
     A                                      ld","description":"job Number","val-
     A                                      ue":{"fieldName":"q1jobn","refField-
     A                                      ":"q1jobn szq1p","numSep":"false","-
     A                                      zeroBalance":"false","numBlankFill"-
     A                                      :"false","zeroFill":"true","curSym"-
     A                                      :"","dataType":"reference","formatt-
     A                                      ing":"Number","negNum":"-999.00","u-
     A                                      nits":"","designValue":"[q1jobn]"},-
     A                                      "left":"995px","top":"350px","visib-
     A                                      ility":"hidden"},{"id":"OutJobNm","-
     A                                      field type":"output field","css cla-
     A                                      ss":"output-field","description":"j-
     A                                      ob name","value":{"fieldName":"q1jo-
     A                                      b","refField":"q1job szq1p","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"reference","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[q1job]"},"left"-
     A                                      :"995px","top":"370px","visibility"-
     A                                      :"hidden"},{"id":"OutErrMsg","field-
     A                                       type":"output field","css class":"-
     A                                      output-field","value":"The Reserve -
     A                                      Worksheet Module is not installed f-
     A                                      or your use at this time.  If you w-
     A                                      ould like more information on this -
     A                                      module,","text align":"center","lef-
     A                                      t":"260px","top":"195px","width":"9-
     A                                      40px","visibility":{"fieldName":"Sh-
     A                                      owErrMsg","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"}},{"id":"OutErrM-
     A                                      sg2","field type":"output field","c-
     A                                      ss class":"output-field","value":"p-
     A                                      lease have your representative cont-
     A                                      act StoneRiver.","text align":"cent-
     A                                      er","left":"260px","top":"210px","w-
     A                                      idth":"940px","visibility":{"fieldN-
     A                                      ame":"ShowErrMsg","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"height-
     A                                      ":"15px"},{"id":"OutState","field t-
     A                                      ype":"output field","css class":"ou-
     A                                      tput-field","value":{"fieldName":"s-
     A                                      cHdgState","dataLength":"7","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[scHdgState]"},"left"-
     A                                      :"5px","top":"5px","width":"135px",-
     A                                      "grid":"sflGrdStateHeading ","colum-
     A                                      n":"0"},{"id":"OutResRRN#","field t-
     A                                      ype":"output field","css class":"ou-
     A                                      tput-field","value":{"fieldName":"s-
     A                                      cResRRN#","dataLength":"9","decPos"-
     A                                      :"0","numSep":"false","zeroBalance"-
     A                                      :"false","numBlankFill":"false","ze-
     A                                      roFill":"true","curSym":"","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      egNum":"-999.00","units":"","design-
     A                                      Value":"[scResRRN#]"},"left":"90px"-
     A                                      ,"top":"5px","width":')
     A                                  1  2HTML('"50px","visibility":"hidden",-
     A                                      "grid":"sflGrdStateHeading ","colum-
     A                                      n":"1"},{"id":"LnkHdgStatus","field-
     A                                       type":"hyperlink","css class":"lin-
     A                                      k","value":{"fieldName":"scActivate-
     A                                      ","dataLength":"10","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[scActivate]"},"response":{"f-
     A                                      ieldName":"scStatus","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"left":"70px","-
     A                                      top":"5px","width":"80px","visibili-
     A                                      ty":{"fieldName":"dspHdgAct","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"hidden / visible"-
     A                                      },"grid":"sflGrdStateHeading ","col-
     A                                      umn":"2"},{"id":"LnkHdgEdit","field-
     A                                       type":"hyperlink","css class":"lin-
     A                                      k","value":"Edit","left":"15px","to-
     A                                      p":"5px","response":{"fieldName":"s-
     A                                      cHdgEdt","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"visibility":{"fieldName":"-
     A                                      dspHdgEdt","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"disabled":{"f-
     A                                      ieldName":"dsbedit","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"grid":"s-
     A                                      flGrdStateHeading ","column":"2"},{-
     A                                      "id":"OutHdgStatus","field type":"o-
     A                                      utput field","css class":"Output-fi-
     A                                      eld","value":{"fieldName":"scActiva-
     A                                      t1","dataLength":"10","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[scActivat1]"},"left":"5px"-
     A                                      ,"top":"5px","width":"75px","z inde-
     A                                      x":"9","grid":"sflGrdStateHeading "-
     A                                      ,"column":"1"}]}')
     A            CLRHDGST       1A  H
     A            DSBADD         1A  H
     A            DSBLCLMCFG     1A  H
     A            DSPHDGADD      1A  H
     A            DSPHDGCTL      1A  H
     A            DSPHDGSUB      1A  H
     A            ERAPPCODE      1A  H
     A            ERRMKCODE      1A  H
     A            RRNHDGST       5S 0H
     A            SCAPPCODE      5A  H
     A            SCHDGADD       1A  H
     A            SCINDAMT      11S 2H
     A            SCMEDAMT      11S 2H
     A            SCRMKCODE      5A  H
     A            SHOWCLMCFG     1A  H
     A            SHOWERRMSG     1A  H
     A            Q1CUSR    R        H      REFFLD(Q1CUSR SZQ1P)
     A            Q1JOB     R        H      REFFLD(Q1JOB SZQ1P)
     A            Q1JOBN    R        H      REFFLD(Q1JOBN SZQ1P)
     A            SCINDCLM  R        H      REFFLD(FLAG)
     A            SCMEDCLM  R        H      REFFLD(FLAG)
     A            SCUSERFLAGR        H      REFFLD(FLAG)
     A          R RCDSTATEHD
     A                                  1  2HTML('QPUIREC3    RWINDOW    0     -
     A                                      RASSUME    0     RERRMSGID  5    C8-
     A                                          DrpAddStC7    WC30108C6    WMES-
     A                                      GGC0    C0    FERRSTATE  ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdStateHd","description":"Rese-
     A                                      rve Worksheet Add/Edit","assume":"t-
     A                                      rue","show as window":"true"},"item-
     A                                      s":[{"id":"panelAddEdit","field typ-
     A                                      e":"panel","css class":"dialog","va-
     A                                      lue":"Reserve Worksheet Add/Edit","-
     A                                      left":"195px","top":"85px","width":-
     A                                      "820px","height":"655px","panel sty-
     A                                      le":"Transform Dialog","z index":"8-
     A                                      ","locked in place":"true"},{"id":"-
     A                                      LblAddSt","field type":"output fiel-
     A                                      d","css class":"label","value":"Sta-
     A                                      te","left":"210px","top":"120px","w-
     A                                      idth":"35px"},{"id":"LblAddStatus",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"label","value":"Status ","lef-
     A                                      t":"655px","top":"120px","width":"4-
     A                                      5px","locked in place":"false"},{"i-
     A                                      d":"DrpAddSt","field type":"select -
     A                                      box","css class":"input","value":{"-
     A                                      fieldName":"scAddSt","dataLength":"-
     A                                      2","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none","designValue":"[scAddSt]"}-
     A                                      ,"choices database file":"STSTP","c-
     A                                      hoice options field":"STKEY || '' --
     A                                       '' || TRIM(STNAME)","choice values-
     A                                       field":"STKEY","choices selection -
     A                                      criteria":"ST1A5 <> ''Y''","left":"-
     A                                      210px","top":"135px","width":"43px"-
     A                                      ,"css class 2":"dropdown","disabled-
     A                                      ":{"fieldName":"scDisstate","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      blank option":"true","order by":"ST-
     A                                      KEY","error message id":"WC30108","-
     A                                      error message file":"WMESGG","error-
     A                                       condition":{"fieldName":"errState"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error enhanced mode":"0","error me-
     A                                      ssages":"1 message"},{"id":"OutStat-
     A                                      us","field type":"output field","cs-
     A                                      s class":"output-field","value":{"f-
     A                                      ieldName":"scRsvStat","dataLength":-
     A                                      "8","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[scRsvStat-
     A                                      ]"},"left":"655px","top":"135px","w-
     A                                      idth":"85px","locked in place":"fal-
     A                                      se"},{"id":"LblAddIndBHdg","field t-
     A                                      ype":"output field","css class":"la-
     A                                      bel","value":"Indemnity Benefit Hea-
     A                                      dings","left":"210px","top":"170px"-
     A                                      ,"width":"200px","locked in place":-
     A                                      "false"},{"id":"LblCompRateEditable-
     A                                      ","field type":"output field","css -
     A                                      class":"label","value":"Comp Rate E-
     A                                      ditable","left":"530px","top":"170p-
     A                                      x","width":"120px","locked in place-
     A                                      ":"false"},{"id":"LblNum1_1","field-
     A                                       type":"output field","css class":"-
     A                                      label","value":"1.","left":"210px",-
     A                                      "top":"185px","width":"15px"},{"id"-
     A                                      :"TxbAddIndBHdg1","field type":"tex-
     A                                      tbox","css class":"input","value":{-
     A                                      "fieldName":"scAddIBH')
     A                                  1  2HTML('1","dataLength":"40","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none","d-
     A                                      esignValue":"[scAddIBH1]"},"left":"-
     A                                      225px","top":"185px","css class 2":-
     A                                      "textbox","required":"false","width-
     A                                      ":"325px","locked in place":"false"-
     A                                      },{"id":"CxbAddIndBenefit1","field -
     A                                      type":"checkbox","css class":"check-
     A                                      box","value":{"fieldName":"scIndEdt-
     A                                      1","dataLength":"1","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[scIndEdt1]"},"left":"580px",-
     A                                      "top":"185px","checked value":"Y"},-
     A                                      {"id":"LblNum2_1","field type":"out-
     A                                      put field","css class":"label","val-
     A                                      ue":"2.","left":"210px","top":"205p-
     A                                      x","width":"15px"},{"id":"TxbAddInd-
     A                                      BHdg2","field type":"textbox","css -
     A                                      class":"input","value":{"fieldName"-
     A                                      :"scAddIBH2","dataLength":"40","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[scAddIBH2]"},"req-
     A                                      uired":"false","left":"225px","top"-
     A                                      :"205px","width":"325px","css class-
     A                                       2":"textbox","locked in place":"fa-
     A                                      lse"},{"id":"CxbAddIndBenefit2","fi-
     A                                      eld type":"checkbox","css class":"c-
     A                                      heckbox","left":"580px","top":"205p-
     A                                      x","checked value":"Y","value":{"fi-
     A                                      eldName":"scIndEdt2","dataLength":"-
     A                                      1","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none","designValue":"[scIndEdt2]-
     A                                      "}},{"id":"LblNum3_1","field type":-
     A                                      "output field","css class":"label",-
     A                                      "value":"3.","left":"210px","top":"-
     A                                      225px","width":"15px"},{"id":"TxbAd-
     A                                      dIndBHdg3","field type":"textbox","-
     A                                      css class":"input","value":{"fieldN-
     A                                      ame":"scAddIBH3","dataLength":"40",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[scAddIBH3]"},-
     A                                      "required":"false","left":"225px","-
     A                                      top":"225px","width":"325px","locke-
     A                                      d in place":"false","css class 2":"-
     A                                      textbox"},{"id":"CxbAddIndBenefit3"-
     A                                      ,"field type":"checkbox","css class-
     A                                      ":"checkbox","left":"580px","top":"-
     A                                      225px","checked value":"Y","value":-
     A                                      {"fieldName":"scIndEdt3","dataLengt-
     A                                      h":"1","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[scIndE-
     A                                      dt3]"}},{"id":"LblNum4_1","field ty-
     A                                      pe":"output field","css class":"lab-
     A                                      el","value":"4.","lef')
     A                                  1  2HTML('t":"210px","top":"245px","wid-
     A                                      th":"15px"},{"id":"TxbAddIndBHdg4",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","value":{"fieldName":"scAdd-
     A                                      IBH4","dataLength":"40","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none","desi-
     A                                      gnValue":"[scAddIBH4]"},"required":-
     A                                      "false","left":"225px","top":"245px-
     A                                      ","width":"325px","locked in place"-
     A                                      :"false","css class 2":"textbox"},{-
     A                                      "id":"CxbAddIndBenefit4","field typ-
     A                                      e":"checkbox","css class":"checkbox-
     A                                      ","left":"580px","top":"245px","che-
     A                                      cked value":"Y","value":{"fieldName-
     A                                      ":"scIndEdt4","dataLength":"1","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[scIndEdt4]"}},{"i-
     A                                      d":"LblNum5_1","field type":"output-
     A                                       field","css class":"label","value"-
     A                                      :"5.","left":"210px","top":"265px",-
     A                                      "width":"15px"},{"id":"TxbAddIndBHd-
     A                                      g5","field type":"textbox","css cla-
     A                                      ss":"input","value":{"fieldName":"s-
     A                                      cAddIBH5","dataLength":"40","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[scAddIBH5]"},"requir-
     A                                      ed":"false","left":"225px","top":"2-
     A                                      65px","width":"325px","locked in pl-
     A                                      ace":"false","css class 2":"textbox-
     A                                      "},{"id":"CxbAddIndBenefit5","field-
     A                                       type":"checkbox","css class":"chec-
     A                                      kbox","left":"580px","top":"265px",-
     A                                      "checked value":"Y","value":{"field-
     A                                      Name":"scIndEdt5","dataLength":"1",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[scIndEdt5]"}}-
     A                                      ,{"id":"LblNum6_1","field type":"ou-
     A                                      tput field","css class":"label","va-
     A                                      lue":"6.","left":"210px","top":"285-
     A                                      px","width":"15px"},{"id":"LblPrcnt-
     A                                      ","field type":"output field","css -
     A                                      class":"label","value":"%","left":"-
     A                                      225px","top":"285px","width":"15px"-
     A                                      },{"id":"TxbAddIndBHdg6","field typ-
     A                                      e":"textbox","css class":"input","v-
     A                                      alue":{"fieldName":"scAddIBH6","dat-
     A                                      aLength":"40","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none","designValue":"-
     A                                      [scAddIBH6]"},"required":"false","l-
     A                                      eft":"240px","top":"285px","width":-
     A                                      "325px","locked in place":"false","-
     A                                      css class 2":"textbox"},{"id":"CxbA-
     A                                      ddIndBenefit6","field type":"checkb-
     A                                      ox","css class":"checkbox","left":"-
     A                                      580px","top":"285px","checked value-
     A                                      ":"Y","value":{"fieldName":"scIndEd-
     A                                      t6","dataLength":"1",')
     A                                  1  2HTML('"trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[scIndEd-
     A                                      t6]"}},{"id":"LblAddIndFHdg","field-
     A                                       type":"output field","css class":"-
     A                                      label","value":"Indemnity Flexible -
     A                                      Headings","left":"655px","top":"170-
     A                                      px","width":"200px","locked in plac-
     A                                      e":"false"},{"id":"LblNum1_2","fiel-
     A                                      d type":"output field","css class":-
     A                                      "label","value":"1.","left":"655px"-
     A                                      ,"top":"185px","width":"15px"},{"id-
     A                                      ":"TxbAddIndFHdg1","field type":"te-
     A                                      xtbox","css class":"input","value":-
     A                                      {"fieldName":"scAddIFH1","dataLengt-
     A                                      h":"40","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[scAdd-
     A                                      IFH1]"},"required":"false","left":"-
     A                                      670px","top":"185px","width":"325px-
     A                                      ","locked in place":"false","css cl-
     A                                      ass 2":"textbox"},{"id":"LblNum2_2"-
     A                                      ,"field type":"output field","css c-
     A                                      lass":"label","value":"2.","left":"-
     A                                      655px","top":"205px","width":"15px"-
     A                                      },{"id":"TxbAddIndFHdg2","field typ-
     A                                      e":"textbox","css class":"input","v-
     A                                      alue":{"fieldName":"scAddIFH2","dat-
     A                                      aLength":"40","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none","designValue":"-
     A                                      [scAddIFH2]"},"required":"false","l-
     A                                      eft":"670px","top":"205px","width":-
     A                                      "325px","locked in place":"false","-
     A                                      css class 2":"textbox"},{"id":"LblN-
     A                                      um3_2","field type":"output field",-
     A                                      "css class":"label","value":"3.","l-
     A                                      eft":"655px","top":"225px","width":-
     A                                      "15px"},{"id":"TxbAddIndFHdg3","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","value":{"fieldName":"scAddIFH3-
     A                                      ","dataLength":"40","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[scAddIFH3]"},"required":"fal-
     A                                      se","left":"670px","top":"225px","w-
     A                                      idth":"325px","locked in place":"fa-
     A                                      lse","css class 2":"textbox"},{"id"-
     A                                      :"LblNum4_2","field type":"output f-
     A                                      ield","css class":"label","value":"-
     A                                      4.","left":"655px","top":"245px","w-
     A                                      idth":"15px"},{"id":"TxbAddIndFHdg4-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","value":{"fieldName":"scA-
     A                                      ddIFH4","dataLength":"40","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[scAddIFH4]"},"required-
     A                                      ":"false","left":"670px","top":"245-
     A                                      px","width":"325px","locked in plac-
     A                                      e":"false","css class 2":"textbox"}-
     A                                      ,{"id":"LblAddIndStdH')
     A                                  1  2HTML('dg","field type":"output fiel-
     A                                      d","css class":"label","value":"Ind-
     A                                      emnity Standard Headings","left":"6-
     A                                      55px","top":"265px","width":"200px"-
     A                                      ,"locked in place":"false"},{"id":"-
     A                                      OutAddIndStdHdg1","field type":"out-
     A                                      put field","css class":"output-fiel-
     A                                      d","value":"Death Benefits","left":-
     A                                      "655px","top":"280px","width":"345p-
     A                                      x"},{"id":"OutAddIndStdHdg2","field-
     A                                       type":"output field","css class":"-
     A                                      output-field","value":"Funeral Bene-
     A                                      fit","left":"655px","top":"295px","-
     A                                      width":"345px"},{"id":"OutAddIndStd-
     A                                      Hdg3","field type":"output field","-
     A                                      css class":"output-field","value":"-
     A                                      Disfigurement","left":"655px","top"-
     A                                      :"310px","width":"345px"},{"id":"Ou-
     A                                      tAddIndStdHdg4","field type":"outpu-
     A                                      t field","css class":"output-field"-
     A                                      ,"value":"Settlement","left":"655px-
     A                                      ","top":"325px","width":"345px"},{"-
     A                                      id":"LblAddMedFHdg","field type":"o-
     A                                      utput field","css class":"label","v-
     A                                      alue":"Medical Flexible Headings","-
     A                                      left":"210px","top":"350px","width"-
     A                                      :"200px","locked in place":"false"}-
     A                                      ,{"id":"LblNum1_3","field type":"ou-
     A                                      tput field","css class":"label","va-
     A                                      lue":"1.","left":"210px","top":"365-
     A                                      px","width":"15px"},{"id":"TxbAddMe-
     A                                      dFHdg1","field type":"textbox","css-
     A                                       class":"input","value":{"fieldName-
     A                                      ":"scAddMFH1","dataLength":"40","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[scAddMFH1]"},"re-
     A                                      quired":"false","left":"225px","top-
     A                                      ":"365px","width":"325px","locked i-
     A                                      n place":"false","css class 2":"tex-
     A                                      tbox"},{"id":"LblNum2_3","field typ-
     A                                      e":"output field","css class":"labe-
     A                                      l","value":"2.","left":"210px","top-
     A                                      ":"385px","width":"15px"},{"id":"Tx-
     A                                      bAddMedFHdg2","field type":"textbox-
     A                                      ","css class":"input","value":{"fie-
     A                                      ldName":"scAddMFH2","dataLength":"4-
     A                                      0","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none","designValue":"[scAddMFH2]-
     A                                      "},"required":"false","left":"225px-
     A                                      ","top":"385px","width":"325px","lo-
     A                                      cked in place":"false","css class 2-
     A                                      ":"textbox"},{"id":"LblNum3_3","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"label","value":"3.","left":"210px-
     A                                      ","top":"405px","width":"15px"},{"i-
     A                                      d":"TxbAddMedFHdg3","field type":"t-
     A                                      extbox","css class":"input","value"-
     A                                      :{"fieldName":"scAddMFH3","dataLeng-
     A                                      th":"40","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none","designValue":"[scAd-
     A                                      dMFH3]"},"required":"false","left":-
     A                                      "225px","top":"405px","width":"325p-
     A                                      x","locked in place":')
     A                                  1  2HTML('"false","css class 2":"textbo-
     A                                      x"},{"id":"LblNum4_3","field type":-
     A                                      "output field","css class":"label",-
     A                                      "value":"4.","left":"210px","top":"-
     A                                      425px","width":"15px"},{"id":"TxbAd-
     A                                      dMedFHdg4","field type":"textbox","-
     A                                      css class":"input","value":{"fieldN-
     A                                      ame":"scAddMFH4","dataLength":"40",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[scAddMFH4]"},-
     A                                      "required":"false","left":"225px","-
     A                                      top":"425px","width":"325px","locke-
     A                                      d in place":"false","css class 2":"-
     A                                      textbox"},{"id":"LblAddMedStdHdg","-
     A                                      field type":"output field","css cla-
     A                                      ss":"label","value":"Medical Standa-
     A                                      rd Headings","left":"210px","top":"-
     A                                      445px","width":"200px","locked in p-
     A                                      lace":"false"},{"id":"OutAddMedStdH-
     A                                      dg1","field type":"output field","c-
     A                                      ss class":"output-field","value":"P-
     A                                      hysician","left":"210px","top":"460-
     A                                      px","width":"345px"},{"id":"OutAddM-
     A                                      edStdHdg2","field type":"output fie-
     A                                      ld","css class":"output-field","val-
     A                                      ue":"Hospital","left":"210px","top"-
     A                                      :"475px","width":"345px"},{"id":"Ou-
     A                                      tAddMedStdHdg3","field type":"outpu-
     A                                      t field","css class":"output-field"-
     A                                      ,"value":"Surgery","left":"210px","-
     A                                      top":"490px","width":"345px"},{"id"-
     A                                      :"OutAddMedStdHdg4","field type":"o-
     A                                      utput field","css class":"output-fi-
     A                                      eld","value":"RX/Medical Supplies",-
     A                                      "left":"210px","top":"505px","width-
     A                                      ":"345px"},{"id":"OutAddMedStdHdg5"-
     A                                      ,"field type":"output field","css c-
     A                                      lass":"output-field","value":"Diagn-
     A                                      ostics","left":"210px","top":"520px-
     A                                      ","width":"345px"},{"id":"OutAddMed-
     A                                      StdHdg6","field type":"output field-
     A                                      ","css class":"output-field","value-
     A                                      ":"Physical Therapy","left":"210px"-
     A                                      ,"top":"535px","width":"345px"},{"i-
     A                                      d":"LblAddExpFHdg","field type":"ou-
     A                                      tput field","css class":"label","va-
     A                                      lue":"Expense Flexible Headings","l-
     A                                      eft":"655px","top":"350px","width":-
     A                                      "200px","locked in place":"false"},-
     A                                      {"id":"LblNum1_4","field type":"out-
     A                                      put field","css class":"label","val-
     A                                      ue":"1.","left":"655px","top":"365p-
     A                                      x","width":"15px"},{"id":"TxbAddExp-
     A                                      FHdg1","field type":"textbox","css -
     A                                      class":"input","value":{"fieldName"-
     A                                      :"scAddEFH1","dataLength":"40","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[scAddEFH1]"},"req-
     A                                      uired":"false","left":"670px","top"-
     A                                      :"365px","width":"325px","locked in-
     A                                       place":"false","css class 2":"text-
     A                                      box"},{"id":"LblNum2_4","field type-
     A                                      ":"output field","css class":"label-
     A                                      ","value":"2.","left":"655px","top"-
     A                                      :"385px","width":"15px"},{"id":"Txb-
     A                                      AddExpFHdg2","field t')
     A                                  1  2HTML('ype":"textbox","css class":"i-
     A                                      nput","value":{"fieldName":"scAddEF-
     A                                      H2","dataLength":"40","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[scAddEFH2]"},"required":"f-
     A                                      alse","left":"670px","top":"385px",-
     A                                      "width":"325px","locked in place":"-
     A                                      false","css class 2":"textbox"},{"i-
     A                                      d":"LblNum3_4","field type":"output-
     A                                       field","css class":"label","value"-
     A                                      :"3.","left":"655px","top":"405px",-
     A                                      "width":"15px"},{"id":"TxbAddExpFHd-
     A                                      g3","field type":"textbox","css cla-
     A                                      ss":"input","value":{"fieldName":"s-
     A                                      cAddEFH3","dataLength":"40","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[scAddEFH3]"},"requir-
     A                                      ed":"false","left":"670px","top":"4-
     A                                      05px","width":"325px","locked in pl-
     A                                      ace":"false","css class 2":"textbox-
     A                                      "},{"id":"LblNum4_4","field type":"-
     A                                      output field","css class":"label","-
     A                                      value":"4.","left":"655px","top":"4-
     A                                      25px","width":"15px"},{"id":"TxbAdd-
     A                                      ExpFHdg4","field type":"textbox","c-
     A                                      ss class":"input","value":{"fieldNa-
     A                                      me":"scAddEFH4","dataLength":"40","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[scAddEFH4]"},"-
     A                                      required":"false","left":"670px","t-
     A                                      op":"425px","width":"325px","locked-
     A                                       in place":"false","css class 2":"t-
     A                                      extbox"},{"id":"LblAddExpStdHdg","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"label","value":"Expense Standar-
     A                                      d Headings","left":"655px","top":"4-
     A                                      45px","width":"200px","locked in pl-
     A                                      ace":"false"},{"id":"OutAddExpStdHd-
     A                                      g1","field type":"output field","cs-
     A                                      s class":"output-field","value":"Su-
     A                                      rveillance","left":"655px","top":"4-
     A                                      60px","width":"345px"},{"id":"OutAd-
     A                                      dExpStdHdg2","field type":"output f-
     A                                      ield","css class":"output-field","v-
     A                                      alue":"Medical Records","left":"655-
     A                                      px","top":"475px","width":"345px"},-
     A                                      {"id":"LblAddLegFHdg","field type":-
     A                                      "output field","css class":"label",-
     A                                      "value":"Legal Flexible Headings","-
     A                                      left":"210px","top":"560px","width"-
     A                                      :"200px","locked in place":"false"}-
     A                                      ,{"id":"LblNum1_5","field type":"ou-
     A                                      tput field","css class":"label","va-
     A                                      lue":"1.","left":"210px","top":"575-
     A                                      px","width":"15px"},{"id":"TxbAddLe-
     A                                      gFHdg1","field type":"textbox","css-
     A                                       class":"input","value":{"fieldName-
     A                                      ":"scAddLFH1","dataLength":"40","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[sc')
     A                                  1  2HTML('AddLFH1]"},"required":"false"-
     A                                      ,"left":"225px","top":"575px","widt-
     A                                      h":"325px","locked in place":"false-
     A                                      ","css class 2":"textbox"},{"id":"L-
     A                                      blNum2_5","field type":"output fiel-
     A                                      d","css class":"label","value":"2."-
     A                                      ,"left":"210px","top":"595px","widt-
     A                                      h":"15px"},{"id":"TxbAddLegFHdg2","-
     A                                      field type":"textbox","css class":"-
     A                                      input","value":{"fieldName":"scAddL-
     A                                      FH2","dataLength":"40","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[scAddLFH2]"},"required":"-
     A                                      false","left":"225px","top":"595px"-
     A                                      ,"width":"325px","locked in place":-
     A                                      "false","css class 2":"textbox"},{"-
     A                                      id":"LblNum3_5","field type":"outpu-
     A                                      t field","css class":"label","value-
     A                                      ":"3.","left":"210px","top":"615px"-
     A                                      ,"width":"15px"},{"id":"TxbAddLegFH-
     A                                      dg3","field type":"textbox","css cl-
     A                                      ass":"input","value":{"fieldName":"-
     A                                      scAddLFH3","dataLength":"40","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none",-
     A                                      "designValue":"[scAddLFH3]"},"requi-
     A                                      red":"false","left":"225px","top":"-
     A                                      615px","width":"325px","locked in p-
     A                                      lace":"false","css class 2":"textbo-
     A                                      x"},{"id":"LblNum4_5","field type":-
     A                                      "output field","css class":"label",-
     A                                      "value":"4.","left":"210px","top":"-
     A                                      635px","width":"15px"},{"id":"TxbAd-
     A                                      dLegFHdg4","field type":"textbox","-
     A                                      css class":"input","value":{"fieldN-
     A                                      ame":"scAddLFH4","dataLength":"40",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[scAddLFH4]"},-
     A                                      "required":"false","left":"225px","-
     A                                      top":"635px","width":"325px","locke-
     A                                      d in place":"false","css class 2":"-
     A                                      textbox"},{"id":"LblAddLegStdHdg","-
     A                                      field type":"output field","css cla-
     A                                      ss":"label","value":"Legal Standard-
     A                                       Headings","left":"210px","top":"65-
     A                                      5px","width":"200px","locked in pla-
     A                                      ce":"false"},{"id":"OutAddLegStdHdg-
     A                                      1","field type":"output field","css-
     A                                       class":"output-field","value":"Dep-
     A                                      ositions","left":"210px","top":"670-
     A                                      px","width":"345px"},{"id":"OutAddL-
     A                                      egStdHdg1_copy","field type":"outpu-
     A                                      t field","css class":"output-field"-
     A                                      ,"value":"Defense Attorney","left":-
     A                                      "210px","top":"685px","width":"345p-
     A                                      x"},{"id":"BtnAdd","field type":"bu-
     A                                      tton","css class":"button","value":-
     A                                      "Save","left":"785px","top":"705px"-
     A                                      ,"width":"100px","cursor":"default"-
     A                                      ,"shortcut key":"Enter","response":-
     A                                      {"fieldName":"BtnAddRcd","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"locked in -
     A                                      place":"false"},{"id"')
     A                                  1  2HTML(':"BtnCan","field type":"butto-
     A                                      n","css class":"button","value":"Ca-
     A                                      ncel","left":"900px","top":"705px",-
     A                                      "width":"100px","cursor":"default",-
     A                                      "response":{"fieldName":"BtnCanRcd"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "shortcut key":"Escape","locked in -
     A                                      place":"false"}]}')
     A            BTNADDRCD      1A  H
     A            BTNCANRCD      1A  H
     A            ERRSTATE       1A  H
     A            SCADDEFH1     40A  H
     A            SCADDEFH2     40A  H
     A            SCADDEFH3     40A  H
     A            SCADDEFH4     40A  H
     A            SCADDIBH1     40A  H
     A            SCADDIBH2     40A  H
     A            SCADDIBH3     40A  H
     A            SCADDIBH4     40A  H
     A            SCADDIBH5     40A  H
     A            SCADDIBH6     40A  H
     A            SCADDIFH1     40A  H
     A            SCADDIFH2     40A  H
     A            SCADDIFH3     40A  H
     A            SCADDIFH4     40A  H
     A            SCADDLFH1     40A  H
     A            SCADDLFH2     40A  H
     A            SCADDLFH3     40A  H
     A            SCADDLFH4     40A  H
     A            SCADDMFH1     40A  H
     A            SCADDMFH2     40A  H
     A            SCADDMFH3     40A  H
     A            SCADDMFH4     40A  H
     A            SCADDST        2A  H
     A            SCDISSTATE     1A  H
     A            SCINDEDT1      1A  H
     A            SCINDEDT2      1A  H
     A            SCINDEDT3      1A  H
     A            SCINDEDT4      1A  H
     A            SCINDEDT5      1A  H
     A            SCINDEDT6      1A  H
     A            SCRSVSTAT      8A  H
     A          R RCDGENRL
     A                                  1  2HTML('QPUIREC3    ROVERLAY   0     -
     A                                      RASSUME    0     RROWS      2    C1-
     A                                          1C1    1 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdGenrl","overlay":"true","ext-
     A                                      ernal css":"label","onload":"docume-
     A                                      nt.body.style.background = \"#EBF5F-
     A                                      F\"; fillDetailBox(''sflGrdStateHea-
     A                                      ding'',1,''OutResRRN#'', ''WTCLMCFG-
     A                                      01'');                            "-
     A                                      ,"description":"General","assume":"-
     A                                      true","overlay range":"1-1","design-
     A                                       overlay formats":"RcdPanel"},"item-
     A                                      s":[{"id":"cbxGeneral","field type"-
     A                                      :"checkbox","css class":"input","va-
     A                                      lue":{"fieldName":"scGenClm","refFi-
     A                                      eld":"FLAG","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "textTransform":"none","designValue-
     A                                      ":"[scGenClm]"},"left":"260px","top-
     A                                      ":"120px","label":"Require the CMS -
     A                                      Date of Incident to be on or after -
     A                                      the claims Date of Injury","css cla-
     A                                      ss 2":"checkbox","visibility":{"fie-
     A                                      ldName":"ShowGnlCfg","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"disab-
     A                                      led":{"fieldName":"isDsblGen","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      checked value":"Y","unchecked value-
     A                                      ":" N","onclick":"pui.click(\"BtnSa-
     A                                      veGeneral\")","tool tip":{"fieldNam-
     A                                      e":"strhelp","dataLength":"250","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[strhelp]"}},{"id-
     A                                      ":"cbxInquiryOverride","field type"-
     A                                      :"checkbox","css class":"input","va-
     A                                      lue":{"fieldName":"scInqAutO","refF-
     A                                      ield":"FLAG","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[scInqAutO]"},"checked value":"-
     A                                      Y","unchecked value":" N","label":"-
     A                                      Override Inquiry mode when working -
     A                                      with Additional Payees","left":"260-
     A                                      px","top":"140px","css class 2":"ch-
     A                                      eckbox","visibility":{"fieldName":"-
     A                                      ShowGnlCfg","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"onclick":"pui.-
     A                                      click(\"BtnSaveGeneral\")","disable-
     A                                      d":{"fieldName":"dsbMC","customTrue-
     A                                      ":"","customFalse":"","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"true / false"}},{"id":-
     A                                      "line1","field type":"horizontal li-
     A                                      ne","css class":"line","line style"-
     A                                      :"Dotted","left":"260px","top":"185-
     A                                      px","height":"1px","width":"950px"}-
     A                                      ,{"id":"LblMultiClaim","field type"-
     A                                      :"output field","css class":"headin-
     A                                      g","value":"Multiple Claims","text -
     A                                      align":"left","disabled":{"fieldNam-
     A                                      e":"ShowClmCfg","data')
     A                                  1  2HTML('Type":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"left":"260px","top":"195px"-
     A                                      ,"width":"125px","z index":"50","lo-
     A                                      cked in place":"false","heading typ-
     A                                      e":"Section Header"},{"id":"LblAddE-
     A                                      ditMultiClaim","field type":"output-
     A                                       field","css class":"label","value"-
     A                                      :"Add/Edit a Multi-claim","left":"2-
     A                                      65px","top":"240px","width":"200px"-
     A                                      ,"locked in place":"false"},{"id":"-
     A                                      LblAddEditMultiClaimType","field ty-
     A                                      pe":"output field","css class":"lab-
     A                                      el","value":"Type","left":"290px","-
     A                                      top":"260px","width":"45px"},{"id":-
     A                                      "TxbAddEditMultiClaimType","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "description":"Type","value":{"fiel-
     A                                      dName":"scAEmcTyp1","dataLength":"1-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[scAEmcTyp1]-
     A                                      "},"text align":"right","text trans-
     A                                      form":"uppercase","disabled":{"fiel-
     A                                      dName":"dsbMC","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"left":"350px","-
     A                                      top":"260px","width":"40px","locked-
     A                                       in place":"false","css class 2":"t-
     A                                      extbox","height":"15px"},{"id":"Txb-
     A                                      AddEditMultiClaimLevel","field type-
     A                                      ":"textbox","css class":"input","de-
     A                                      scription":"Type","value":{"fieldNa-
     A                                      me":"scAEmcLvl1","dataLength":"3","-
     A                                      decPos":"0","numSep":"false","zeroB-
     A                                      alance":"false","numBlankFill":"fal-
     A                                      se","zeroFill":"false","noExtraSpac-
     A                                      es":"false","curSym":"","dataType":-
     A                                      "zoned","formatting":"Number","negN-
     A                                      um":"-999.00","units":"","designVal-
     A                                      ue":"[scAEmcLvl1]"},"text align":"r-
     A                                      ight","text transform":"uppercase",-
     A                                      "disabled":{"fieldName":"dsbMC","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"left":"350px","top":"285px","heig-
     A                                      ht":"15px","width":"40px","locked i-
     A                                      n place":"false","css class 2":"tex-
     A                                      tbox"},{"id":"TxbAddEditMultiClaimT-
     A                                      ype2","field type":"textbox","css c-
     A                                      lass":"input","description":"Type",-
     A                                      "value":{"fieldName":"scAEmcTyp2","-
     A                                      dataLength":"1","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scAEmcTyp2]"},"text align":"righ-
     A                                      t","text transform":"uppercase","di-
     A                                      sabled":{"fieldName":"dsbMC","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"l-
     A                                      eft":"410px","top":"260px","height"-
     A                                      :"15px","width":"40px","locked in p-
     A                                      lace":"false","css class 2":"textbo-
     A                                      x"},{"id":"TxbAddEditMultiClaimLeve-
     A                                      l2","field type":"tex')
     A                                  1  2HTML('tbox","css class":"input","de-
     A                                      scription":"Type","value":{"fieldNa-
     A                                      me":"scAEmcLvl2","dataLength":"3","-
     A                                      decPos":"0","numSep":"false","zeroB-
     A                                      alance":"false","numBlankFill":"fal-
     A                                      se","zeroFill":"false","noExtraSpac-
     A                                      es":"false","curSym":"","dataType":-
     A                                      "zoned","formatting":"Number","negN-
     A                                      um":"-999.00","units":"","designVal-
     A                                      ue":"[scAEmcLvl2]"},"text align":"r-
     A                                      ight","text transform":"uppercase",-
     A                                      "disabled":{"fieldName":"dsbMC","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"left":"410px","top":"285px","heig-
     A                                      ht":"15px","width":"40px","locked i-
     A                                      n place":"false","css class 2":"tex-
     A                                      tbox"},{"id":"TxbAddEditMultiClaimT-
     A                                      ype3","field type":"textbox","css c-
     A                                      lass":"input","description":"Type",-
     A                                      "value":{"fieldName":"scAEmcTyp3","-
     A                                      dataLength":"1","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scAEmcTyp3]"},"text align":"righ-
     A                                      t","text transform":"uppercase","di-
     A                                      sabled":{"fieldName":"dsbMC","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"l-
     A                                      eft":"470px","top":"260px","height"-
     A                                      :"15px","width":"40px","locked in p-
     A                                      lace":"false","css class 2":"textbo-
     A                                      x"},{"id":"TxbAddEditMultiClaimLeve-
     A                                      l3","field type":"textbox","css cla-
     A                                      ss":"input","description":"Type","v-
     A                                      alue":{"fieldName":"scAEmcLvl3","da-
     A                                      taLength":"3","decPos":"0","numSep"-
     A                                      :"false","zeroBalance":"false","num-
     A                                      BlankFill":"false","zeroFill":"fals-
     A                                      e","noExtraSpaces":"false","curSym"-
     A                                      :"","dataType":"zoned","formatting"-
     A                                      :"Number","negNum":"-999.00","units-
     A                                      ":"","designValue":"[scAEmcLvl3]"},-
     A                                      "text align":"right","text transfor-
     A                                      m":"uppercase","disabled":{"fieldNa-
     A                                      me":"dsbMC","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"left":"470px","top-
     A                                      ":"285px","height":"15px","width":"-
     A                                      40px","locked in place":"false","cs-
     A                                      s class 2":"textbox"},{"id":"TxbAdd-
     A                                      EditMultiClaimType4","field type":"-
     A                                      textbox","css class":"input","descr-
     A                                      iption":"Type","value":{"fieldName"-
     A                                      :"scAEmcTyp4","dataLength":"1","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[scAEmcTyp4]"},"te-
     A                                      xt align":"right","text transform":-
     A                                      "uppercase","disabled":{"fieldName"-
     A                                      :"dsbMC","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"left":"530px","top":"-
     A                                      260px","height":"15px')
     A                                  1  2HTML('","width":"40px","locked in p-
     A                                      lace":"false","css class 2":"textbo-
     A                                      x"},{"id":"TxbAddEditMultiClaimLeve-
     A                                      l4","field type":"textbox","css cla-
     A                                      ss":"input","description":"Type","v-
     A                                      alue":{"fieldName":"scAEmcLvl4","da-
     A                                      taLength":"3","decPos":"0","numSep"-
     A                                      :"false","zeroBalance":"false","num-
     A                                      BlankFill":"false","zeroFill":"fals-
     A                                      e","noExtraSpaces":"false","curSym"-
     A                                      :"","dataType":"zoned","formatting"-
     A                                      :"Number","negNum":"-999.00","units-
     A                                      ":"","designValue":"[scAEmcLvl4]"},-
     A                                      "text align":"right","text transfor-
     A                                      m":"uppercase","disabled":{"fieldNa-
     A                                      me":"dsbMC","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"left":"530px","top-
     A                                      ":"285px","height":"15px","width":"-
     A                                      40px","locked in place":"false","cs-
     A                                      s class 2":"textbox"},{"id":"TxbAdd-
     A                                      EditMultiClaimType5","field type":"-
     A                                      textbox","css class":"input","descr-
     A                                      iption":"Type","value":{"fieldName"-
     A                                      :"scAEmcTyp5","dataLength":"1","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[scAEmcTyp5]"},"te-
     A                                      xt align":"right","text transform":-
     A                                      "uppercase","disabled":{"fieldName"-
     A                                      :"dsbMC","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"left":"590px","top":"-
     A                                      260px","height":"15px","width":"40p-
     A                                      x","locked in place":"false","css c-
     A                                      lass 2":"textbox"},{"id":"TxbAddEdi-
     A                                      tMultiClaimLevel5","field type":"te-
     A                                      xtbox","css class":"input","descrip-
     A                                      tion":"Type","value":{"fieldName":"-
     A                                      scAEmcLvl5","dataLength":"3","decPo-
     A                                      s":"0","numSep":"false","zeroBalanc-
     A                                      e":"false","numBlankFill":"false","-
     A                                      zeroFill":"false","noExtraSpaces":"-
     A                                      false","curSym":"","dataType":"zone-
     A                                      d","formatting":"Number","negNum":"-
     A                                      -999.00","units":"","designValue":"-
     A                                      [scAEmcLvl5]"},"text align":"right"-
     A                                      ,"text transform":"uppercase","disa-
     A                                      bled":{"fieldName":"dsbMC","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"lef-
     A                                      t":"590px","top":"285px","height":"-
     A                                      15px","width":"40px","locked in pla-
     A                                      ce":"false","css class 2":"textbox"-
     A                                      },{"id":"TxbAddEditMultiClaimType6"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","description":"Type","valu-
     A                                      e":{"fieldName":"scAEmcTyp6","dataL-
     A                                      ength":"1","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none","designValue":"[sc-
     A                                      AEmcTyp6]"},"text align":"right","t-
     A                                      ext transform":"uppercase","disable-
     A                                      d":{"fieldName":"dsbMC","customTrue-
     A                                      ":"","customFalse":""')
     A                                  1  2HTML(',"dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"left":"650px","top":"-
     A                                      260px","height":"15px","width":"40p-
     A                                      x","locked in place":"false","css c-
     A                                      lass 2":"textbox"},{"id":"TxbAddEdi-
     A                                      tMultiClaimLevel6","field type":"te-
     A                                      xtbox","css class":"input","descrip-
     A                                      tion":"Type","value":{"fieldName":"-
     A                                      scAEmcLvl6","dataLength":"3","decPo-
     A                                      s":"0","numSep":"false","zeroBalanc-
     A                                      e":"false","numBlankFill":"false","-
     A                                      zeroFill":"false","noExtraSpaces":"-
     A                                      false","curSym":"","dataType":"zone-
     A                                      d","formatting":"Number","negNum":"-
     A                                      -999.00","units":"","designValue":"-
     A                                      [scAEmcLvl6]"},"text align":"right"-
     A                                      ,"text transform":"uppercase","disa-
     A                                      bled":{"fieldName":"dsbMC","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"lef-
     A                                      t":"650px","top":"285px","height":"-
     A                                      15px","width":"40px","locked in pla-
     A                                      ce":"false","css class 2":"textbox"-
     A                                      },{"id":"TxbAddEditMultiClaimType7"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","description":"Type","valu-
     A                                      e":{"fieldName":"scAEmcTyp7","dataL-
     A                                      ength":"1","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none","designValue":"[sc-
     A                                      AEmcTyp7]"},"text align":"right","t-
     A                                      ext transform":"uppercase","disable-
     A                                      d":{"fieldName":"dsbMC","customTrue-
     A                                      ":"","customFalse":"","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"left":-
     A                                      "710px","top":"260px","height":"15p-
     A                                      x","width":"40px","locked in place"-
     A                                      :"false","css class 2":"textbox"},{-
     A                                      "id":"TxbAddEditMultiClaimLevel7","-
     A                                      field type":"textbox","css class":"-
     A                                      input","description":"Type","value"-
     A                                      :{"fieldName":"scAEmcLvl7","dataLen-
     A                                      gth":"3","decPos":"0","numSep":"fal-
     A                                      se","zeroBalance":"false","numBlank-
     A                                      Fill":"false","zeroFill":"false","n-
     A                                      oExtraSpaces":"false","curSym":"","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","negNum":"-999.00","units":"",-
     A                                      "designValue":"[scAEmcLvl7]"},"text-
     A                                       align":"right","text transform":"u-
     A                                      ppercase","disabled":{"fieldName":"-
     A                                      dsbMC","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"left":"710px","top":"28-
     A                                      5px","height":"15px","width":"40px"-
     A                                      ,"locked in place":"false","css cla-
     A                                      ss 2":"textbox"},{"id":"TxbAddEditM-
     A                                      ultiClaimType8","field type":"textb-
     A                                      ox","css class":"input","descriptio-
     A                                      n":"Type","value":{"fieldName":"scA-
     A                                      EmcTyp8","dataLength":"1","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[scAEmcTy')
     A                                  1  2HTML('p8]"},"text align":"right","t-
     A                                      ext transform":"uppercase","disable-
     A                                      d":{"fieldName":"dsbMC","customTrue-
     A                                      ":"","customFalse":"","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"left":-
     A                                      "770px","top":"260px","height":"15p-
     A                                      x","width":"40px","locked in place"-
     A                                      :"false","css class 2":"textbox"},{-
     A                                      "id":"TxbAddEditMultiClaimLevel8","-
     A                                      field type":"textbox","css class":"-
     A                                      input","description":"Type","value"-
     A                                      :{"fieldName":"scAEmcLvl8","dataLen-
     A                                      gth":"3","decPos":"0","numSep":"fal-
     A                                      se","zeroBalance":"false","numBlank-
     A                                      Fill":"false","zeroFill":"false","n-
     A                                      oExtraSpaces":"false","curSym":"","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","negNum":"-999.00","units":"",-
     A                                      "designValue":"[scAEmcLvl8]"},"text-
     A                                       align":"right","text transform":"u-
     A                                      ppercase","disabled":{"fieldName":"-
     A                                      dsbMC","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"left":"770px","top":"28-
     A                                      5px","height":"15px","width":"40px"-
     A                                      ,"locked in place":"false","css cla-
     A                                      ss 2":"textbox"},{"id":"TxbAddEditM-
     A                                      ultiClaimType9","field type":"textb-
     A                                      ox","css class":"input","descriptio-
     A                                      n":"Type","value":{"fieldName":"scA-
     A                                      EmcTyp9","dataLength":"1","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[scAEmcTyp9]"},"text al-
     A                                      ign":"right","text transform":"uppe-
     A                                      rcase","disabled":{"fieldName":"dsb-
     A                                      MC","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"left":"830px","top":"260px-
     A                                      ","height":"15px","width":"40px","l-
     A                                      ocked in place":"false","css class -
     A                                      2":"textbox"},{"id":"TxbAddEditMult-
     A                                      iClaimLevel9","field type":"textbox-
     A                                      ","css class":"input","description"-
     A                                      :"Type","value":{"fieldName":"scAEm-
     A                                      cLvl9","dataLength":"3","decPos":"0-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","numBlankFill":"false","zeroF-
     A                                      ill":"false","noExtraSpaces":"false-
     A                                      ","curSym":"","dataType":"zoned","f-
     A                                      ormatting":"Number","negNum":"-999.-
     A                                      00","units":"","designValue":"[scAE-
     A                                      mcLvl9]"},"text align":"right","tex-
     A                                      t transform":"uppercase","disabled"-
     A                                      :{"fieldName":"dsbMC","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"left":"8-
     A                                      30px","top":"285px","height":"15px"-
     A                                      ,"width":"40px","locked in place":"-
     A                                      false","css class 2":"textbox"},{"i-
     A                                      d":"TxbAddEditMultiClaimType10","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","description":"Type","value":{-
     A                                      "fieldName":"scAEmcTy10","dataLengt-
     A                                      h":"1","trimLeading":"false","trimT-
     A                                      railing":"true","blan')
     A                                  1  2HTML('kFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none","d-
     A                                      esignValue":"[scAEmcTy10]"},"text a-
     A                                      lign":"right","text transform":"upp-
     A                                      ercase","disabled":{"fieldName":"ds-
     A                                      bMC","customTrue":"","customFalse":-
     A                                      "","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"left":"890px","top":"260p-
     A                                      x","height":"15px","width":"40px","-
     A                                      locked in place":"false","css class-
     A                                       2":"textbox"},{"id":"TxbAddEditMul-
     A                                      tiClaimLevel10","field type":"textb-
     A                                      ox","css class":"input","descriptio-
     A                                      n":"Type","value":{"fieldName":"scA-
     A                                      EmcLv10","dataLength":"3","decPos":-
     A                                      "0","numSep":"false","zeroBalance":-
     A                                      "false","numBlankFill":"false","zer-
     A                                      oFill":"false","noExtraSpaces":"fal-
     A                                      se","curSym":"","dataType":"zoned",-
     A                                      "formatting":"Number","negNum":"-99-
     A                                      9.00","units":"","designValue":"[sc-
     A                                      AEmcLv10]"},"text align":"right","t-
     A                                      ext transform":"uppercase","disable-
     A                                      d":{"fieldName":"dsbMC","customTrue-
     A                                      ":"","customFalse":"","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"left":-
     A                                      "890px","top":"285px","height":"15p-
     A                                      x","width":"40px","locked in place"-
     A                                      :"false","css class 2":"textbox"},{-
     A                                      "id":"LblAddEditMultiClaimLevel","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"label","value":"Level","left":"-
     A                                      290px","top":"285px","width":"45px"-
     A                                      },{"id":"LblAddEditMultiClaim_copy"-
     A                                      ,"field type":"output field","css c-
     A                                      lass":"label","value":"Add Claim to-
     A                                       a Multi-claim Number","left":"265p-
     A                                      x","top":"320px","width":"200px","l-
     A                                      ocked in place":"false","visibility-
     A                                      ":{"fieldName":"ShowClmCfg","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "}},{"id":"OutJobU","field type":"o-
     A                                      utput field","css class":"output-fi-
     A                                      eld","value":{"fieldName":"q1cusr",-
     A                                      "refField":"q1cusr szq1p","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"reference","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[q1cusr]"},"left":-
     A                                      "995px","top":"330px","description"-
     A                                      :"job user","visibility":"hidden"},-
     A                                      {"id":"LblAddEditMultiClaimType_cop-
     A                                      y","field type":"output field","css-
     A                                       class":"label","value":"Type","lef-
     A                                      t":"290px","top":"340px","width":"4-
     A                                      5px"},{"id":"TxbAddMultiClaimType",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","description":"Type","value-
     A                                      ":{"fieldName":"scAddCTyp1","dataLe-
     A                                      ngth":"1","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[scA-
     A                                      ddCTyp1]"},"text align":"right","te-
     A                                      xt transform":"uppercase","disabled-
     A                                      ":{"fieldName":"dsbMC')
     A                                  1  2HTML('","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"left":"350px","top":"3-
     A                                      40px","height":"15px","width":"40px-
     A                                      ","locked in place":"false","css cl-
     A                                      ass 2":"textbox"},{"id":"TxbAddMult-
     A                                      iClaimLevel","field type":"textbox"-
     A                                      ,"css class":"input","description":-
     A                                      "Type","value":{"fieldName":"scAddC-
     A                                      Lvl1","dataLength":"3","decPos":"0"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","numBlankFill":"false","zeroFi-
     A                                      ll":"false","noExtraSpaces":"false"-
     A                                      ,"curSym":"","dataType":"zoned","fo-
     A                                      rmatting":"Number","negNum":"-999.0-
     A                                      0","units":"","designValue":"[scAdd-
     A                                      CLvl1]"},"text align":"right","text-
     A                                       transform":"uppercase","disabled":-
     A                                      {"fieldName":"dsbMC","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"left":"35-
     A                                      0px","top":"365px","height":"15px",-
     A                                      "width":"40px","locked in place":"f-
     A                                      alse","css class 2":"textbox"},{"id-
     A                                      ":"TxbAddMultiClaimType2","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      description":"Type","value":{"field-
     A                                      Name":"scAddCTyp2","dataLength":"1"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[scAddCTyp2]"-
     A                                      },"text align":"right","text transf-
     A                                      orm":"uppercase","disabled":{"field-
     A                                      Name":"dsbMC","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"left":"410px","t-
     A                                      op":"340px","height":"15px","width"-
     A                                      :"40px","locked in place":"false","-
     A                                      css class 2":"textbox"},{"id":"TxbA-
     A                                      ddMultiClaimLevel2","field type":"t-
     A                                      extbox","css class":"input","descri-
     A                                      ption":"Type","value":{"fieldName":-
     A                                      "scAddCLvl2","dataLength":"3","decP-
     A                                      os":"0","numSep":"false","zeroBalan-
     A                                      ce":"false","numBlankFill":"false",-
     A                                      "zeroFill":"false","noExtraSpaces":-
     A                                      "false","curSym":"","dataType":"zon-
     A                                      ed","formatting":"Number","negNum":-
     A                                      "-999.00","units":"","designValue":-
     A                                      "[scAddCLvl2]"},"text align":"right-
     A                                      ","text transform":"uppercase","dis-
     A                                      abled":{"fieldName":"dsbMC","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"le-
     A                                      ft":"410px","top":"365px","height":-
     A                                      "15px","width":"40px","locked in pl-
     A                                      ace":"false","css class 2":"textbox-
     A                                      "},{"id":"TxbAddMultiClaimType3","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","description":"Type","value":-
     A                                      {"fieldName":"scAddCTyp3","dataLeng-
     A                                      th":"1","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none","design')
     A                                  1  2HTML('Value":"[scAddCTyp3]"},"text -
     A                                      align":"right","text transform":"up-
     A                                      percase","disabled":{"fieldName":"d-
     A                                      sbMC","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"left":"470px","top":"340-
     A                                      px","height":"15px","width":"40px",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"textbox"},{"id":"TxbAddMultiC-
     A                                      laimLevel3","field type":"textbox",-
     A                                      "css class":"input","description":"-
     A                                      Type","value":{"fieldName":"scAddCL-
     A                                      vl3","dataLength":"3","decPos":"0",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","numBlankFill":"false","zeroFil-
     A                                      l":"false","noExtraSpaces":"false",-
     A                                      "curSym":"","dataType":"zoned","for-
     A                                      matting":"Number","negNum":"-999.00-
     A                                      ","units":"","designValue":"[scAddC-
     A                                      Lvl3]"},"text align":"right","text -
     A                                      transform":"uppercase","disabled":{-
     A                                      "fieldName":"dsbMC","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"left":"470-
     A                                      px","top":"365px","height":"15px","-
     A                                      width":"40px","locked in place":"fa-
     A                                      lse","css class 2":"textbox"},{"id"-
     A                                      :"TxbAddMultiClaimType4","field typ-
     A                                      e":"textbox","css class":"input","d-
     A                                      escription":"Type","value":{"fieldN-
     A                                      ame":"scAddCTyp4","dataLength":"1",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[scAddCTyp4]"}-
     A                                      ,"text align":"right","text transfo-
     A                                      rm":"uppercase","disabled":{"fieldN-
     A                                      ame":"dsbMC","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"left":"530px","to-
     A                                      p":"340px","height":"15px","width":-
     A                                      "40px","locked in place":"false","c-
     A                                      ss class 2":"textbox"},{"id":"TxbAd-
     A                                      dMultiClaimLevel4","field type":"te-
     A                                      xtbox","css class":"input","descrip-
     A                                      tion":"Type","value":{"fieldName":"-
     A                                      scAddCLvl4","dataLength":"3","decPo-
     A                                      s":"0","numSep":"false","zeroBalanc-
     A                                      e":"false","numBlankFill":"false","-
     A                                      zeroFill":"false","noExtraSpaces":"-
     A                                      false","curSym":"","dataType":"zone-
     A                                      d","formatting":"Number","negNum":"-
     A                                      -999.00","units":"","designValue":"-
     A                                      [scAddCLvl4]"},"text align":"right"-
     A                                      ,"text transform":"uppercase","disa-
     A                                      bled":{"fieldName":"dsbMC","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"lef-
     A                                      t":"530px","top":"365px","height":"-
     A                                      15px","width":"40px","locked in pla-
     A                                      ce":"false","css class 2":"textbox"-
     A                                      },{"id":"TxbAddMultiClaimType5","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","description":"Type","value":{-
     A                                      "fieldName":"scAddCTyp5","dataLengt-
     A                                      h":"1","trimLeading":"false","trimT-
     A                                      railing":"true","blan')
     A                                  1  2HTML('kFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none","d-
     A                                      esignValue":"[scAddCTyp5]"},"text a-
     A                                      lign":"right","text transform":"upp-
     A                                      ercase","disabled":{"fieldName":"ds-
     A                                      bMC","customTrue":"","customFalse":-
     A                                      "","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"left":"590px","top":"340p-
     A                                      x","height":"15px","width":"40px","-
     A                                      locked in place":"false","css class-
     A                                       2":"textbox"},{"id":"TxbAddMultiCl-
     A                                      aimLevel5","field type":"textbox","-
     A                                      css class":"input","description":"T-
     A                                      ype","value":{"fieldName":"scAddCLv-
     A                                      l5","dataLength":"3","decPos":"0","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","numBlankFill":"false","zeroFill-
     A                                      ":"false","noExtraSpaces":"false","-
     A                                      curSym":"","dataType":"zoned","form-
     A                                      atting":"Number","negNum":"-999.00"-
     A                                      ,"units":"","designValue":"[scAddCL-
     A                                      vl5]"},"text align":"right","text t-
     A                                      ransform":"uppercase","disabled":{"-
     A                                      fieldName":"dsbMC","customTrue":"",-
     A                                      "customFalse":"","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"left":"590p-
     A                                      x","top":"365px","height":"15px","w-
     A                                      idth":"40px","locked in place":"fal-
     A                                      se","css class 2":"textbox"},{"id":-
     A                                      "TxbAddMultiClaimType6","field type-
     A                                      ":"textbox","css class":"input","de-
     A                                      scription":"Type","value":{"fieldNa-
     A                                      me":"scAddCTyp6","dataLength":"1","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[scAddCTyp6]"},-
     A                                      "text align":"right","text transfor-
     A                                      m":"uppercase","disabled":{"fieldNa-
     A                                      me":"dsbMC","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"left":"650px","top-
     A                                      ":"340px","height":"15px","width":"-
     A                                      40px","locked in place":"false","cs-
     A                                      s class 2":"textbox"},{"id":"TxbAdd-
     A                                      MultiClaimLevel6","field type":"tex-
     A                                      tbox","css class":"input","descript-
     A                                      ion":"Type","value":{"fieldName":"s-
     A                                      cAddCLvl6","dataLength":"3","decPos-
     A                                      ":"0","numSep":"false","zeroBalance-
     A                                      ":"false","numBlankFill":"false","z-
     A                                      eroFill":"false","noExtraSpaces":"f-
     A                                      alse","curSym":"","dataType":"zoned-
     A                                      ","formatting":"Number","negNum":"--
     A                                      999.00","units":"","designValue":"[-
     A                                      scAddCLvl6]"},"text align":"right",-
     A                                      "text transform":"uppercase","disab-
     A                                      led":{"fieldName":"dsbMC","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"left-
     A                                      ":"650px","top":"365px","height":"1-
     A                                      5px","width":"40px","locked in plac-
     A                                      e":"false","css class 2":"textbox"}-
     A                                      ,{"id":"TxbAddMultiClaimType7","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","description":"Ty')
     A                                  1  2HTML('pe","value":{"fieldName":"scA-
     A                                      ddCTyp7","dataLength":"1","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[scAddCTyp7]"},"text al-
     A                                      ign":"right","text transform":"uppe-
     A                                      rcase","disabled":{"fieldName":"dsb-
     A                                      MC","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"left":"710px","top":"340px-
     A                                      ","height":"15px","width":"40px","l-
     A                                      ocked in place":"false","css class -
     A                                      2":"textbox"},{"id":"TxbAddMultiCla-
     A                                      imLevel7","field type":"textbox","c-
     A                                      ss class":"input","description":"Ty-
     A                                      pe","value":{"fieldName":"scAddCLvl-
     A                                      7","dataLength":"3","decPos":"0","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","numBlankFill":"false","zeroFill"-
     A                                      :"false","noExtraSpaces":"false","c-
     A                                      urSym":"","dataType":"zoned","forma-
     A                                      tting":"Number","negNum":"-999.00",-
     A                                      "units":"","designValue":"[scAddCLv-
     A                                      l7]"},"text align":"right","text tr-
     A                                      ansform":"uppercase","disabled":{"f-
     A                                      ieldName":"dsbMC","customTrue":"","-
     A                                      customFalse":"","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"left":"710px-
     A                                      ","top":"365px","height":"15px","wi-
     A                                      dth":"40px","locked in place":"fals-
     A                                      e","css class 2":"textbox"},{"id":"-
     A                                      TxbAddMultiClaimType8","field type"-
     A                                      :"textbox","css class":"input","des-
     A                                      cription":"Type","value":{"fieldNam-
     A                                      e":"scAddCTyp8","dataLength":"1","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[scAddCTyp8]"},"-
     A                                      text align":"right","text transform-
     A                                      ":"uppercase","disabled":{"fieldNam-
     A                                      e":"dsbMC","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"left":"770px","top"-
     A                                      :"340px","height":"15px","width":"4-
     A                                      0px","locked in place":"false","css-
     A                                       class 2":"textbox"},{"id":"TxbAddM-
     A                                      ultiClaimLevel8","field type":"text-
     A                                      box","css class":"input","descripti-
     A                                      on":"Type","value":{"fieldName":"sc-
     A                                      AddCLvl8","dataLength":"3","decPos"-
     A                                      :"0","numSep":"false","zeroBalance"-
     A                                      :"false","numBlankFill":"false","ze-
     A                                      roFill":"false","noExtraSpaces":"fa-
     A                                      lse","curSym":"","dataType":"zoned"-
     A                                      ,"formatting":"Number","negNum":"-9-
     A                                      99.00","units":"","designValue":"[s-
     A                                      cAddCLvl8]"},"text align":"right","-
     A                                      text transform":"uppercase","disabl-
     A                                      ed":{"fieldName":"dsbMC","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"left"-
     A                                      :"770px","top":"365px","height":"15-
     A                                      px","width":"40px","locked in place-
     A                                      ":"false","css class')
     A                                  1  2HTML(' 2":"textbox"},{"id":"TxbAddM-
     A                                      ultiClaimType9","field type":"textb-
     A                                      ox","css class":"input","descriptio-
     A                                      n":"Type","value":{"fieldName":"scA-
     A                                      ddCTyp9","dataLength":"1","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[scAddCTyp9]"},"text al-
     A                                      ign":"right","text transform":"uppe-
     A                                      rcase","disabled":{"fieldName":"dsb-
     A                                      MC","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"left":"830px","top":"340px-
     A                                      ","height":"15px","width":"40px","l-
     A                                      ocked in place":"false","css class -
     A                                      2":"textbox"},{"id":"TxbAddMultiCla-
     A                                      imLevel9","field type":"textbox","c-
     A                                      ss class":"input","description":"Ty-
     A                                      pe","value":{"fieldName":"scAddCLvl-
     A                                      9","dataLength":"3","decPos":"0","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","numBlankFill":"false","zeroFill"-
     A                                      :"false","noExtraSpaces":"false","c-
     A                                      urSym":"","dataType":"zoned","forma-
     A                                      tting":"Number","negNum":"-999.00",-
     A                                      "units":"","designValue":"[scAddCLv-
     A                                      l9]"},"text align":"right","text tr-
     A                                      ansform":"uppercase","disabled":{"f-
     A                                      ieldName":"dsbMC","customTrue":"","-
     A                                      customFalse":"","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"left":"830px-
     A                                      ","top":"365px","height":"15px","wi-
     A                                      dth":"40px","locked in place":"fals-
     A                                      e","css class 2":"textbox"},{"id":"-
     A                                      TxbAddMultiClaimType10","field type-
     A                                      ":"textbox","css class":"input","de-
     A                                      scription":"Type","value":{"fieldNa-
     A                                      me":"scAddCTy10","dataLength":"1","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[scAddCTy10]"},-
     A                                      "text align":"right","text transfor-
     A                                      m":"uppercase","disabled":{"fieldNa-
     A                                      me":"dsbMC","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"left":"890px","top-
     A                                      ":"340px","height":"15px","width":"-
     A                                      40px","locked in place":"false","cs-
     A                                      s class 2":"textbox"},{"id":"TxbAdd-
     A                                      MultiClaimLevel10","field type":"te-
     A                                      xtbox","css class":"input","descrip-
     A                                      tion":"Type","value":{"fieldName":"-
     A                                      scAddCLv10","dataLength":"3","decPo-
     A                                      s":"0","numSep":"false","zeroBalanc-
     A                                      e":"false","numBlankFill":"false","-
     A                                      zeroFill":"false","noExtraSpaces":"-
     A                                      false","curSym":"","dataType":"zone-
     A                                      d","formatting":"Number","negNum":"-
     A                                      -999.00","units":"","designValue":"-
     A                                      [scAddCLv10]"},"text align":"right"-
     A                                      ,"text transform":"uppercase","disa-
     A                                      bled":{"fieldName":"dsbMC","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true')
     A                                  1  2HTML(' / false"},"left":"890px","to-
     A                                      p":"365px","height":"15px","width":-
     A                                      "40px","locked in place":"false","c-
     A                                      ss class 2":"textbox"},{"id":"OutJo-
     A                                      bN","field type":"output field","cs-
     A                                      s class":"output-field","descriptio-
     A                                      n":"job Number","value":{"fieldName-
     A                                      ":"q1jobn","refField":"q1jobn szq1p-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","numBlankFill":"false","zeroF-
     A                                      ill":"true","curSym":"","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      negNum":"-999.00","units":"","desig-
     A                                      nValue":"[q1jobn]"},"left":"995px",-
     A                                      "top":"350px","visibility":"hidden"-
     A                                      },{"id":"LblAddEditMultiClaimLevel_-
     A                                      copy","field type":"output field","-
     A                                      css class":"label","value":"Level",-
     A                                      "left":"290px","top":"365px","width-
     A                                      ":"45px"},{"id":"OutJobNm","field t-
     A                                      ype":"output field","css class":"ou-
     A                                      tput-field","description":"job name-
     A                                      ","value":{"fieldName":"q1job","ref-
     A                                      Field":"q1job szq1p","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[q1job]"},"left":"995px-
     A                                      ","top":"370px","visibility":"hidde-
     A                                      n"},{"id":"LblAddEditMultiClaim_cop-
     A                                      y2","field type":"output field","cs-
     A                                      s class":"label","value":"Delete a -
     A                                      Claim from a Multi-claim Number","l-
     A                                      eft":"265px","top":"400px","width":-
     A                                      "255px","locked in place":"false","-
     A                                      visibility":{"fieldName":"ShowClmCf-
     A                                      g","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"}},{"id":"LblAddEditMult-
     A                                      iClaimType_copy2","field type":"out-
     A                                      put field","css class":"label","val-
     A                                      ue":"Type","left":"290px","top":"42-
     A                                      0px","width":"45px"},{"id":"TxbDelM-
     A                                      ultiClaimType","field type":"textbo-
     A                                      x","css class":"input","description-
     A                                      ":"Type","value":{"fieldName":"scDe-
     A                                      lCtyp1","dataLength":"1","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none","des-
     A                                      ignValue":"[scDelCtyp1]"},"text ali-
     A                                      gn":"right","text transform":"upper-
     A                                      case","disabled":{"fieldName":"dsbM-
     A                                      C","customTrue":"","customFalse":""-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"left":"350px","top":"420px"-
     A                                      ,"height":"15px","width":"40px","lo-
     A                                      cked in place":"false","css class 2-
     A                                      ":"textbox"},{"id":"TxbDelMultiClai-
     A                                      mLevel","field type":"textbox","css-
     A                                       class":"input","description":"Type-
     A                                      ","value":{"fieldName":"scDelCLvl1"-
     A                                      ,"dataLength":"3","decPos":"0","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "numBlankFill":"false","zeroFill":"-
     A                                      false","noExtraSpaces":"false","cur-
     A                                      Sym":"","dataType":"zoned","formatt-
     A                                      ing":"Number","negNum":"-999.00","u-
     A                                      nits":"","designValue')
     A                                  1  2HTML('":"[scDelCLvl1]"},"text align-
     A                                      ":"right","text transform":"upperca-
     A                                      se","disabled":{"fieldName":"dsbMC"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"left":"350px","top":"445px","-
     A                                      height":"15px","width":"40px","lock-
     A                                      ed in place":"false","css class 2":-
     A                                      "textbox"},{"id":"TxbDelMultiClaimT-
     A                                      ype2","field type":"textbox","css c-
     A                                      lass":"input","description":"Type",-
     A                                      "value":{"fieldName":"scDelCtyp2","-
     A                                      dataLength":"1","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scDelCtyp2]"},"text align":"righ-
     A                                      t","text transform":"uppercase","di-
     A                                      sabled":{"fieldName":"dsbMC","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"l-
     A                                      eft":"410px","top":"420px","height"-
     A                                      :"15px","width":"40px","locked in p-
     A                                      lace":"false","css class 2":"textbo-
     A                                      x"},{"id":"TxbDelMultiClaimLevel2",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","description":"Type","value-
     A                                      ":{"fieldName":"scDelCLvl2","dataLe-
     A                                      ngth":"3","decPos":"0","numSep":"fa-
     A                                      lse","zeroBalance":"false","numBlan-
     A                                      kFill":"false","zeroFill":"false","-
     A                                      noExtraSpaces":"false","curSym":"",-
     A                                      "dataType":"zoned","formatting":"Nu-
     A                                      mber","negNum":"-999.00","units":""-
     A                                      ,"designValue":"[scDelCLvl2]"},"tex-
     A                                      t align":"right","text transform":"-
     A                                      uppercase","disabled":{"fieldName":-
     A                                      "dsbMC","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"left":"410px","top":"4-
     A                                      45px","height":"15px","width":"40px-
     A                                      ","locked in place":"false","css cl-
     A                                      ass 2":"textbox"},{"id":"TxbDelMult-
     A                                      iClaimType3","field type":"textbox"-
     A                                      ,"css class":"input","description":-
     A                                      "Type","value":{"fieldName":"scDelC-
     A                                      typ3","dataLength":"1","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[scDelCtyp3]"},"text align-
     A                                      ":"right","text transform":"upperca-
     A                                      se","disabled":{"fieldName":"dsbMC"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"left":"470px","top":"420px","-
     A                                      height":"15px","width":"40px","lock-
     A                                      ed in place":"false","css class 2":-
     A                                      "textbox"},{"id":"TxbDelMultiClaimL-
     A                                      evel3","field type":"textbox","css -
     A                                      class":"input","description":"Type"-
     A                                      ,"value":{"fieldName":"scDelCLvl3",-
     A                                      "dataLength":"3","decPos":"0","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      numBlankFill":"false","zeroFill":"f-
     A                                      alse","noExtraSpaces"')
     A                                  1  2HTML(':"false","curSym":"","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      egNum":"-999.00","units":"","design-
     A                                      Value":"[scDelCLvl3]"},"text align"-
     A                                      :"right","text transform":"uppercas-
     A                                      e","disabled":{"fieldName":"dsbMC",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"left":"470px","top":"445px","h-
     A                                      eight":"15px","width":"40px","locke-
     A                                      d in place":"false","css class 2":"-
     A                                      textbox"},{"id":"TxbDelMultiClaimTy-
     A                                      pe4","field type":"textbox","css cl-
     A                                      ass":"input","description":"Type","-
     A                                      value":{"fieldName":"scDelCtyp4","d-
     A                                      ataLength":"1","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none","designValue":-
     A                                      "[scDelCtyp4]"},"text align":"right-
     A                                      ","text transform":"uppercase","dis-
     A                                      abled":{"fieldName":"dsbMC","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"le-
     A                                      ft":"530px","top":"420px","height":-
     A                                      "15px","width":"40px","locked in pl-
     A                                      ace":"false","css class 2":"textbox-
     A                                      "},{"id":"TxbDelMultiClaimLevel4","-
     A                                      field type":"textbox","css class":"-
     A                                      input","description":"Type","value"-
     A                                      :{"fieldName":"scDelCLvl4","dataLen-
     A                                      gth":"3","decPos":"0","numSep":"fal-
     A                                      se","zeroBalance":"false","numBlank-
     A                                      Fill":"false","zeroFill":"false","n-
     A                                      oExtraSpaces":"false","curSym":"","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","negNum":"-999.00","units":"",-
     A                                      "designValue":"[scDelCLvl4]"},"text-
     A                                       align":"right","text transform":"u-
     A                                      ppercase","disabled":{"fieldName":"-
     A                                      dsbMC","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"left":"530px","top":"44-
     A                                      5px","height":"15px","width":"40px"-
     A                                      ,"locked in place":"false","css cla-
     A                                      ss 2":"textbox"},{"id":"TxbDelMulti-
     A                                      ClaimType5","field type":"textbox",-
     A                                      "css class":"input","description":"-
     A                                      Type","value":{"fieldName":"scDelCt-
     A                                      yp5","dataLength":"1","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[scDelCtyp5]"},"text align"-
     A                                      :"right","text transform":"uppercas-
     A                                      e","disabled":{"fieldName":"dsbMC",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"left":"590px","top":"420px","h-
     A                                      eight":"15px","width":"40px","locke-
     A                                      d in place":"false","css class 2":"-
     A                                      textbox"},{"id":"TxbDelMultiClaimLe-
     A                                      vel5","field type":"textbox","css c-
     A                                      lass":"input","description":"Type",-
     A                                      "value":{"fieldName":"scDelCLvl5","-
     A                                      dataLength":"3","decP')
     A                                  1  2HTML('os":"0","numSep":"false","zer-
     A                                      oBalance":"false","numBlankFill":"f-
     A                                      alse","zeroFill":"false","noExtraSp-
     A                                      aces":"false","curSym":"","dataType-
     A                                      ":"zoned","formatting":"Number","ne-
     A                                      gNum":"-999.00","units":"","designV-
     A                                      alue":"[scDelCLvl5]"},"text align":-
     A                                      "right","text transform":"uppercase-
     A                                      ","disabled":{"fieldName":"dsbMC","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"left":"590px","top":"445px","he-
     A                                      ight":"15px","width":"40px","locked-
     A                                       in place":"false","css class 2":"t-
     A                                      extbox"},{"id":"TxbDelMultiClaimTyp-
     A                                      e6","field type":"textbox","css cla-
     A                                      ss":"input","description":"Type","v-
     A                                      alue":{"fieldName":"scDelCtyp6","da-
     A                                      taLength":"1","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none","designValue":"-
     A                                      [scDelCtyp6]"},"text align":"right"-
     A                                      ,"text transform":"uppercase","disa-
     A                                      bled":{"fieldName":"dsbMC","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"lef-
     A                                      t":"650px","top":"420px","height":"-
     A                                      15px","width":"40px","locked in pla-
     A                                      ce":"false","css class 2":"textbox"-
     A                                      },{"id":"TxbDelMultiClaimLevel6","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","description":"Type","value":-
     A                                      {"fieldName":"scDelCLvl6","dataLeng-
     A                                      th":"3","decPos":"0","numSep":"fals-
     A                                      e","zeroBalance":"false","numBlankF-
     A                                      ill":"false","zeroFill":"false","no-
     A                                      ExtraSpaces":"false","curSym":"","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","negNum":"-999.00","units":"","-
     A                                      designValue":"[scDelCLvl6]"},"text -
     A                                      align":"right","text transform":"up-
     A                                      percase","disabled":{"fieldName":"d-
     A                                      sbMC","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"left":"650px","top":"445-
     A                                      px","height":"15px","width":"40px",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"textbox"},{"id":"TxbDelMultiC-
     A                                      laimType7","field type":"textbox","-
     A                                      css class":"input","description":"T-
     A                                      ype","value":{"fieldName":"scDelCty-
     A                                      p7","dataLength":"1","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[scDelCtyp7]"},"text align":-
     A                                      "right","text transform":"uppercase-
     A                                      ","disabled":{"fieldName":"dsbMC","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"left":"710px","top":"420px","he-
     A                                      ight":"15px","width":"40px","locked-
     A                                       in place":"false","css class 2":"t-
     A                                      extbox"},{"id":"TxbDelMultiClaimLev-
     A                                      el7","field type":"te')
     A                                  1  2HTML('xtbox","css class":"input","d-
     A                                      escription":"Type","value":{"fieldN-
     A                                      ame":"scDelCLvl7","dataLength":"3",-
     A                                      "decPos":"0","numSep":"false","zero-
     A                                      Balance":"false","numBlankFill":"fa-
     A                                      lse","zeroFill":"false","noExtraSpa-
     A                                      ces":"false","curSym":"","dataType"-
     A                                      :"zoned","formatting":"Number","neg-
     A                                      Num":"-999.00","units":"","designVa-
     A                                      lue":"[scDelCLvl7]"},"text align":"-
     A                                      right","text transform":"uppercase"-
     A                                      ,"disabled":{"fieldName":"dsbMC","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"left":"710px","top":"445px","hei-
     A                                      ght":"15px","width":"40px","locked -
     A                                      in place":"false","css class 2":"te-
     A                                      xtbox"},{"id":"TxbDelMultiClaimType-
     A                                      8","field type":"textbox","css clas-
     A                                      s":"input","description":"Type","va-
     A                                      lue":{"fieldName":"scDelCtyp8","dat-
     A                                      aLength":"1","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      scDelCtyp8]"},"text align":"right",-
     A                                      "text transform":"uppercase","disab-
     A                                      led":{"fieldName":"dsbMC","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"left-
     A                                      ":"770px","top":"420px","height":"1-
     A                                      5px","width":"40px","locked in plac-
     A                                      e":"false","css class 2":"textbox"}-
     A                                      ,{"id":"TxbDelMultiClaimLevel8","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","description":"Type","value":{-
     A                                      "fieldName":"scDelCLvl8","dataLengt-
     A                                      h":"3","decPos":"0","numSep":"false-
     A                                      ","zeroBalance":"false","numBlankFi-
     A                                      ll":"false","zeroFill":"false","noE-
     A                                      xtraSpaces":"false","curSym":"","da-
     A                                      taType":"zoned","formatting":"Numbe-
     A                                      r","negNum":"-999.00","units":"","d-
     A                                      esignValue":"[scDelCLvl8]"},"text a-
     A                                      lign":"right","text transform":"upp-
     A                                      ercase","disabled":{"fieldName":"ds-
     A                                      bMC","customTrue":"","customFalse":-
     A                                      "","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"left":"770px","top":"445p-
     A                                      x","height":"15px","width":"40px","-
     A                                      locked in place":"false","css class-
     A                                       2":"textbox"},{"id":"TxbDelMultiCl-
     A                                      aimType9","field type":"textbox","c-
     A                                      ss class":"input","description":"Ty-
     A                                      pe","value":{"fieldName":"scDelCtyp-
     A                                      9","dataLength":"1","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[scDelCtyp9]"},"text align":"-
     A                                      right","text transform":"uppercase"-
     A                                      ,"disabled":{"fieldName":"dsbMC","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"left":"830px","top":"420px","hei-
     A                                      ght":"15px","width":"')
     A                                  1  2HTML('40px","locked in place":"fals-
     A                                      e","css class 2":"textbox"},{"id":"-
     A                                      TxbDelMultiClaimLevel9","field type-
     A                                      ":"textbox","css class":"input","de-
     A                                      scription":"Type","value":{"fieldNa-
     A                                      me":"scDelCLvl9","dataLength":"3","-
     A                                      decPos":"0","numSep":"false","zeroB-
     A                                      alance":"false","numBlankFill":"fal-
     A                                      se","zeroFill":"false","noExtraSpac-
     A                                      es":"false","curSym":"","dataType":-
     A                                      "zoned","formatting":"Number","negN-
     A                                      um":"-999.00","units":"","designVal-
     A                                      ue":"[scDelCLvl9]"},"text align":"r-
     A                                      ight","text transform":"uppercase",-
     A                                      "disabled":{"fieldName":"dsbMC","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"left":"830px","top":"445px","heig-
     A                                      ht":"15px","width":"40px","locked i-
     A                                      n place":"false","css class 2":"tex-
     A                                      tbox"},{"id":"TxbDelMultiClaimType1-
     A                                      0","field type":"textbox","css clas-
     A                                      s":"input","description":"Type","va-
     A                                      lue":{"fieldName":"scDelCty10","dat-
     A                                      aLength":"1","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      scDelCty10]"},"text align":"right",-
     A                                      "text transform":"uppercase","disab-
     A                                      led":{"fieldName":"dsbMC","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"left-
     A                                      ":"890px","top":"420px","height":"1-
     A                                      5px","width":"40px","locked in plac-
     A                                      e":"false","css class 2":"textbox"}-
     A                                      ,{"id":"TxbDelMultiClaimLevel10","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","description":"Type","value":-
     A                                      {"fieldName":"scDelCLv10","dataLeng-
     A                                      th":"3","decPos":"0","numSep":"fals-
     A                                      e","zeroBalance":"false","numBlankF-
     A                                      ill":"false","zeroFill":"false","no-
     A                                      ExtraSpaces":"false","curSym":"","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","negNum":"-999.00","units":"","-
     A                                      designValue":"[scDelCLv10]"},"text -
     A                                      align":"right","text transform":"up-
     A                                      percase","disabled":{"fieldName":"d-
     A                                      sbMC","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"left":"890px","top":"445-
     A                                      px","height":"15px","width":"40px",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"textbox"},{"id":"LblAddEditMu-
     A                                      ltiClaimLevel_copy2","field type":"-
     A                                      output field","css class":"label","-
     A                                      value":"Level","left":"290px","top"-
     A                                      :"445px","width":"45px"},{"id":"Btn-
     A                                      SaveGeneral","field type":"button",-
     A                                      "css class":"button","value":"Save -
     A                                      ","left":"1075px","top":"995px","wi-
     A                                      dth":"100px","response":{"fieldName-
     A                                      ":"btnGenSav","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"visibility":{"fieldName-
     A                                      ":"dsbMC","customTrue')
     A                                  1  2HTML('":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"hidden / visible-
     A                                      "}},{"id":"LblAddEditMultiClaim_cop-
     A                                      y3","field type":"output field","cs-
     A                                      s class":"label","value":"Payment R-
     A                                      equest ","left":"265px","top":"525p-
     A                                      x","width":"200px","locked in place-
     A                                      ":"false"},{"id":"LblAddEditMultiCl-
     A                                      aimType_copy3","field type":"output-
     A                                       field","css class":"label","value"-
     A                                      :"Type","left":"290px","top":"545px-
     A                                      ","width":"45px"},{"id":"TxbPayment-
     A                                      ReqTyp1","field type":"textbox","cs-
     A                                      s class":"input","description":"Typ-
     A                                      e","value":{"fieldName":"scPayRTyp1-
     A                                      ","dataLength":"1","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none","designVal-
     A                                      ue":"[scPayRTyp1]"},"text align":"r-
     A                                      ight","text transform":"uppercase",-
     A                                      "disabled":{"fieldName":"dsbMC","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"left":"350px","top":"545px","heig-
     A                                      ht":"15px","width":"40px","locked i-
     A                                      n place":"false","css class 2":"tex-
     A                                      tbox"},{"id":"TxbPaymentReqLvl1","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","description":"Type","value":-
     A                                      {"fieldName":"scPayRLvl1","dataLeng-
     A                                      th":"3","decPos":"0","numSep":"fals-
     A                                      e","zeroBalance":"false","numBlankF-
     A                                      ill":"false","zeroFill":"false","no-
     A                                      ExtraSpaces":"false","curSym":"","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","negNum":"-999.00","units":"","-
     A                                      designValue":"[scPayRLvl1]"},"text -
     A                                      align":"right","text transform":"up-
     A                                      percase","disabled":{"fieldName":"d-
     A                                      sbMC","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"left":"350px","top":"570-
     A                                      px","height":"15px","width":"40px",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"textbox"},{"id":"TxbPaymentRe-
     A                                      qTyp2","field type":"textbox","css -
     A                                      class":"input","description":"Type"-
     A                                      ,"value":{"fieldName":"scPayRTyp2",-
     A                                      "dataLength":"1","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none","designValue-
     A                                      ":"[scPayRTyp2]"},"text align":"rig-
     A                                      ht","text transform":"uppercase","d-
     A                                      isabled":{"fieldName":"dsbMC","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      left":"410px","top":"545px","height-
     A                                      ":"15px","width":"40px","locked in -
     A                                      place":"false","css class 2":"textb-
     A                                      ox"},{"id":"TxbPaymentReqLvl2","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","description":"Type","value":{"-
     A                                      fieldName":"scPayRLvl2","dataLength-
     A                                      ":"3","decPos":"0","n')
     A                                  1  2HTML('umSep":"false","zeroBalance":-
     A                                      "false","numBlankFill":"false","zer-
     A                                      oFill":"false","noExtraSpaces":"fal-
     A                                      se","curSym":"","dataType":"zoned",-
     A                                      "formatting":"Number","negNum":"-99-
     A                                      9.00","units":"","designValue":"[sc-
     A                                      PayRLvl2]"},"text align":"right","t-
     A                                      ext transform":"uppercase","disable-
     A                                      d":{"fieldName":"dsbMC","customTrue-
     A                                      ":"","customFalse":"","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"left":-
     A                                      "410px","top":"570px","height":"15p-
     A                                      x","width":"40px","locked in place"-
     A                                      :"false","css class 2":"textbox"},{-
     A                                      "id":"TxbPaymentReqTyp3","field typ-
     A                                      e":"textbox","css class":"input","d-
     A                                      escription":"Type","value":{"fieldN-
     A                                      ame":"scPayRTyp3","dataLength":"1",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[scPayRTyp3]"}-
     A                                      ,"text align":"right","text transfo-
     A                                      rm":"uppercase","disabled":{"fieldN-
     A                                      ame":"dsbMC","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"left":"470px","to-
     A                                      p":"545px","height":"15px","width":-
     A                                      "40px","locked in place":"false","c-
     A                                      ss class 2":"textbox"},{"id":"TxbPa-
     A                                      ymentReqLvl3","field type":"textbox-
     A                                      ","css class":"input","description"-
     A                                      :"Type","value":{"fieldName":"scPay-
     A                                      RLvl3","dataLength":"3","decPos":"0-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","numBlankFill":"false","zeroF-
     A                                      ill":"false","noExtraSpaces":"false-
     A                                      ","curSym":"","dataType":"zoned","f-
     A                                      ormatting":"Number","negNum":"-999.-
     A                                      00","units":"","designValue":"[scPa-
     A                                      yRLvl3]"},"text align":"right","tex-
     A                                      t transform":"uppercase","disabled"-
     A                                      :{"fieldName":"dsbMC","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"left":"4-
     A                                      70px","top":"570px","height":"15px"-
     A                                      ,"width":"40px","locked in place":"-
     A                                      false","css class 2":"textbox"},{"i-
     A                                      d":"TxbPaymentReqTyp4","field type"-
     A                                      :"textbox","css class":"input","des-
     A                                      cription":"Type","value":{"fieldNam-
     A                                      e":"scPayRTyp4","dataLength":"1","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[scPayRTyp4]"},"-
     A                                      text align":"right","text transform-
     A                                      ":"uppercase","disabled":{"fieldNam-
     A                                      e":"dsbMC","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"left":"530px","top"-
     A                                      :"545px","height":"15px","width":"4-
     A                                      0px","locked in place":"false","css-
     A                                       class 2":"textbox"},{"id":"TxbPaym-
     A                                      entReqLvl4","field type":"textbox",-
     A                                      "css class":"input","')
     A                                  1  2HTML('description":"Type","value":{-
     A                                      "fieldName":"scPayRLvl4","dataLengt-
     A                                      h":"3","decPos":"0","numSep":"false-
     A                                      ","zeroBalance":"false","numBlankFi-
     A                                      ll":"false","zeroFill":"false","noE-
     A                                      xtraSpaces":"false","curSym":"","da-
     A                                      taType":"zoned","formatting":"Numbe-
     A                                      r","negNum":"-999.00","units":"","d-
     A                                      esignValue":"[scPayRLvl4]"},"text a-
     A                                      lign":"right","text transform":"upp-
     A                                      ercase","disabled":{"fieldName":"ds-
     A                                      bMC","customTrue":"","customFalse":-
     A                                      "","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"left":"530px","top":"570p-
     A                                      x","height":"15px","width":"40px","-
     A                                      locked in place":"false","css class-
     A                                       2":"textbox"},{"id":"TxbPaymentReq-
     A                                      Typ5","field type":"textbox","css c-
     A                                      lass":"input","description":"Type",-
     A                                      "value":{"fieldName":"scPayRTyp5","-
     A                                      dataLength":"1","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scPayRTyp5]"},"text align":"righ-
     A                                      t","text transform":"uppercase","di-
     A                                      sabled":{"fieldName":"dsbMC","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"l-
     A                                      eft":"590px","top":"545px","height"-
     A                                      :"15px","width":"40px","locked in p-
     A                                      lace":"false","css class 2":"textbo-
     A                                      x"},{"id":"TxbPaymentReqLvl5","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","description":"Type","value":{"f-
     A                                      ieldName":"scPayRLvl5","dataLength"-
     A                                      :"3","decPos":"0","numSep":"false",-
     A                                      "zeroBalance":"false","numBlankFill-
     A                                      ":"false","zeroFill":"false","noExt-
     A                                      raSpaces":"false","curSym":"","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"negNum":"-999.00","units":"","des-
     A                                      ignValue":"[scPayRLvl5]"},"text ali-
     A                                      gn":"right","text transform":"upper-
     A                                      case","disabled":{"fieldName":"dsbM-
     A                                      C","customTrue":"","customFalse":""-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"left":"590px","top":"570px"-
     A                                      ,"height":"15px","width":"40px","lo-
     A                                      cked in place":"false","css class 2-
     A                                      ":"textbox"},{"id":"TxbPaymentReqTy-
     A                                      p6","field type":"textbox","css cla-
     A                                      ss":"input","description":"Type","v-
     A                                      alue":{"fieldName":"scPayRTyp6","da-
     A                                      taLength":"1","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none","designValue":"-
     A                                      [scPayRTyp6]"},"text align":"right"-
     A                                      ,"text transform":"uppercase","disa-
     A                                      bled":{"fieldName":"dsbMC","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"lef-
     A                                      t":"650px","top":"545px","height":"-
     A                                      15px","width":"40px","locked in pla-
     A                                      ce":"false","css clas')
     A                                  1  2HTML('s 2":"textbox"},{"id":"TxbPay-
     A                                      mentReqLvl6","field type":"textbox"-
     A                                      ,"css class":"input","description":-
     A                                      "Type","value":{"fieldName":"scPayR-
     A                                      Lvl6","dataLength":"3","decPos":"0"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","numBlankFill":"false","zeroFi-
     A                                      ll":"false","noExtraSpaces":"false"-
     A                                      ,"curSym":"","dataType":"zoned","fo-
     A                                      rmatting":"Number","negNum":"-999.0-
     A                                      0","units":"","designValue":"[scPay-
     A                                      RLvl6]"},"text align":"right","text-
     A                                       transform":"uppercase","disabled":-
     A                                      {"fieldName":"dsbMC","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"left":"65-
     A                                      0px","top":"570px","height":"15px",-
     A                                      "width":"40px","locked in place":"f-
     A                                      alse","css class 2":"textbox"},{"id-
     A                                      ":"TxbPaymentReqTyp7","field type":-
     A                                      "textbox","css class":"input","desc-
     A                                      ription":"Type","value":{"fieldName-
     A                                      ":"scPayRTyp7","dataLength":"1","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[scPayRTyp7]"},"t-
     A                                      ext align":"right","text transform"-
     A                                      :"uppercase","disabled":{"fieldName-
     A                                      ":"dsbMC","customTrue":"","customFa-
     A                                      lse":"","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"left":"710px","top":-
     A                                      "545px","height":"15px","width":"40-
     A                                      px","locked in place":"false","css -
     A                                      class 2":"textbox"},{"id":"TxbPayme-
     A                                      ntReqLvl7","field type":"textbox","-
     A                                      css class":"input","description":"T-
     A                                      ype","value":{"fieldName":"scPayRLv-
     A                                      l7","dataLength":"3","decPos":"0","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","numBlankFill":"false","zeroFill-
     A                                      ":"false","noExtraSpaces":"false","-
     A                                      curSym":"","dataType":"zoned","form-
     A                                      atting":"Number","negNum":"-999.00"-
     A                                      ,"units":"","designValue":"[scPayRL-
     A                                      vl7]"},"text align":"right","text t-
     A                                      ransform":"uppercase","disabled":{"-
     A                                      fieldName":"dsbMC","customTrue":"",-
     A                                      "customFalse":"","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"left":"710p-
     A                                      x","top":"570px","height":"15px","w-
     A                                      idth":"40px","locked in place":"fal-
     A                                      se","css class 2":"textbox"},{"id":-
     A                                      "TxbPaymentReqTyp8","field type":"t-
     A                                      extbox","css class":"input","descri-
     A                                      ption":"Type","value":{"fieldName":-
     A                                      "scPayRTyp8","dataLength":"1","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[scPayRTyp8]"},"tex-
     A                                      t align":"right","text transform":"-
     A                                      uppercase","disabled":{"fieldName":-
     A                                      "dsbMC","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"left":"7')
     A                                  1  2HTML('70px","top":"545px","height":-
     A                                      "15px","width":"40px","locked in pl-
     A                                      ace":"false","css class 2":"textbox-
     A                                      "},{"id":"TxbPaymentReqLvl8","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","description":"Type","value":{"fi-
     A                                      eldName":"scPayRLvl8","dataLength":-
     A                                      "3","decPos":"0","numSep":"false","-
     A                                      zeroBalance":"false","numBlankFill"-
     A                                      :"false","zeroFill":"false","noExtr-
     A                                      aSpaces":"false","curSym":"","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "negNum":"-999.00","units":"","desi-
     A                                      gnValue":"[scPayRLvl8]"},"text alig-
     A                                      n":"right","text transform":"upperc-
     A                                      ase","disabled":{"fieldName":"dsbMC-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"left":"770px","top":"570px",-
     A                                      "height":"15px","width":"40px","loc-
     A                                      ked in place":"false","css class 2"-
     A                                      :"textbox"},{"id":"TxbPaymentReqTyp-
     A                                      9","field type":"textbox","css clas-
     A                                      s":"input","description":"Type","va-
     A                                      lue":{"fieldName":"scPayRTyp9","dat-
     A                                      aLength":"1","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      scPayRTyp9]"},"text align":"right",-
     A                                      "text transform":"uppercase","disab-
     A                                      led":{"fieldName":"dsbMC","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"left-
     A                                      ":"830px","top":"545px","height":"1-
     A                                      5px","width":"40px","locked in plac-
     A                                      e":"false","css class 2":"textbox"}-
     A                                      ,{"id":"TxbPaymentReqLvl9","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "description":"Type","value":{"fiel-
     A                                      dName":"scPayRLvl9","dataLength":"3-
     A                                      ","decPos":"0","numSep":"false","ze-
     A                                      roBalance":"false","numBlankFill":"-
     A                                      false","zeroFill":"false","noExtraS-
     A                                      paces":"false","curSym":"","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      egNum":"-999.00","units":"","design-
     A                                      Value":"[scPayRLvl9]"},"text align"-
     A                                      :"right","text transform":"uppercas-
     A                                      e","disabled":{"fieldName":"dsbMC",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"left":"830px","top":"570px","h-
     A                                      eight":"15px","width":"40px","locke-
     A                                      d in place":"false","css class 2":"-
     A                                      textbox"},{"id":"TxbPaymentReqTyp10-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","description":"Type","val-
     A                                      ue":{"fieldName":"scPayRTy10","data-
     A                                      Length":"1","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none","designValue":"[s-
     A                                      cPayRTy10]"},"text align":"right","-
     A                                      text transform":"uppercase","disabl-
     A                                      ed":{"fieldName":"dsbMC","customTru-
     A                                      e":"","customFalse":"')
     A                                  1  2HTML('","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"left":"890px","top":-
     A                                      "545px","height":"15px","width":"40-
     A                                      px","locked in place":"false","css -
     A                                      class 2":"textbox"},{"id":"TxbPayme-
     A                                      ntReqLvl10","field type":"textbox",-
     A                                      "css class":"input","description":"-
     A                                      Type","value":{"fieldName":"scPayRL-
     A                                      v10","dataLength":"3","decPos":"0",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","numBlankFill":"false","zeroFil-
     A                                      l":"false","noExtraSpaces":"false",-
     A                                      "curSym":"","dataType":"zoned","for-
     A                                      matting":"Number","negNum":"-999.00-
     A                                      ","units":"","designValue":"[scPayR-
     A                                      Lv10]"},"text align":"right","text -
     A                                      transform":"uppercase","disabled":{-
     A                                      "fieldName":"dsbMC","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"left":"890-
     A                                      px","top":"570px","height":"15px","-
     A                                      width":"40px","locked in place":"fa-
     A                                      lse","css class 2":"textbox"},{"id"-
     A                                      :"LblAddEditMultiClaimLevel_copy3",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"label","value":"Level","left"-
     A                                      :"290px","top":"570px","width":"45p-
     A                                      x"},{"id":"LblAddEditMultiClaim_cop-
     A                                      y4","field type":"output field","cs-
     A                                      s class":"label","value":"Manual Pa-
     A                                      yment","left":"265px","top":"605px"-
     A                                      ,"width":"200px","locked in place":-
     A                                      "false","visibility":{"fieldName":"-
     A                                      ShowClmCfg","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"}},{"id":"LblAd-
     A                                      dEditMultiClaimType_copy4","field t-
     A                                      ype":"output field","css class":"la-
     A                                      bel","value":"Type","left":"290px",-
     A                                      "top":"625px","width":"45px"},{"id"-
     A                                      :"TxbManualPayType1","field type":"-
     A                                      textbox","css class":"input","descr-
     A                                      iption":"Type","value":{"fieldName"-
     A                                      :"scManPTyp1","dataLength":"1","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[scManPTyp1]"},"te-
     A                                      xt align":"right","text transform":-
     A                                      "uppercase","disabled":{"fieldName"-
     A                                      :"dsbMC","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"left":"350px","top":"-
     A                                      625px","height":"15px","width":"40p-
     A                                      x","locked in place":"false","css c-
     A                                      lass 2":"textbox"},{"id":"Txbmanual-
     A                                      PayLevel1","field type":"textbox","-
     A                                      css class":"input","description":"T-
     A                                      ype","value":{"fieldName":"scManPLv-
     A                                      l1","dataLength":"3","decPos":"0","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","numBlankFill":"false","zeroFill-
     A                                      ":"false","noExtraSpaces":"false","-
     A                                      curSym":"","dataType":"zoned","form-
     A                                      atting":"Number","negNum":"-999.00"-
     A                                      ,"units":"","designValue":"[scManPL-
     A                                      vl1]"},"text align":"right","text t-
     A                                      ransform":"uppercase"')
     A                                  1  2HTML(',"disabled":{"fieldName":"dsb-
     A                                      MC","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"left":"350px","top":"650px-
     A                                      ","height":"15px","width":"40px","l-
     A                                      ocked in place":"false","css class -
     A                                      2":"textbox"},{"id":"TxbManualPayTy-
     A                                      pe2","field type":"textbox","css cl-
     A                                      ass":"input","description":"Type","-
     A                                      value":{"fieldName":"scManPTyp2","d-
     A                                      ataLength":"1","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none","designValue":-
     A                                      "[scManPTyp2]"},"text align":"right-
     A                                      ","text transform":"uppercase","dis-
     A                                      abled":{"fieldName":"dsbMC","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"le-
     A                                      ft":"410px","top":"625px","height":-
     A                                      "15px","width":"40px","locked in pl-
     A                                      ace":"false","css class 2":"textbox-
     A                                      "},{"id":"TxbmanualPayLevel2","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","description":"Type","value":{"f-
     A                                      ieldName":"scManPLvl2","dataLength"-
     A                                      :"3","decPos":"0","numSep":"false",-
     A                                      "zeroBalance":"false","numBlankFill-
     A                                      ":"false","zeroFill":"false","noExt-
     A                                      raSpaces":"false","curSym":"","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"negNum":"-999.00","units":"","des-
     A                                      ignValue":"[scManPLvl2]"},"text ali-
     A                                      gn":"right","text transform":"upper-
     A                                      case","disabled":{"fieldName":"dsbM-
     A                                      C","customTrue":"","customFalse":""-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"left":"410px","top":"650px"-
     A                                      ,"height":"15px","width":"40px","lo-
     A                                      cked in place":"false","css class 2-
     A                                      ":"textbox"},{"id":"TxbManualPayTyp-
     A                                      e3","field type":"textbox","css cla-
     A                                      ss":"input","description":"Type","v-
     A                                      alue":{"fieldName":"scManPTyp3","da-
     A                                      taLength":"1","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none","designValue":"-
     A                                      [scManPTyp3]"},"text align":"right"-
     A                                      ,"text transform":"uppercase","disa-
     A                                      bled":{"fieldName":"dsbMC","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"lef-
     A                                      t":"470px","top":"625px","height":"-
     A                                      15px","width":"40px","locked in pla-
     A                                      ce":"false","css class 2":"textbox"-
     A                                      },{"id":"TxbmanualPayLevel3","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","description":"Type","value":{"fi-
     A                                      eldName":"scManPLvl3","dataLength":-
     A                                      "3","decPos":"0","numSep":"false","-
     A                                      zeroBalance":"false","numBlankFill"-
     A                                      :"false","zeroFill":"false","noExtr-
     A                                      aSpaces":"false","curSym":"","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "negNum":"-999.00","u')
     A                                  1  2HTML('nits":"","designValue":"[scMa-
     A                                      nPLvl3]"},"text align":"right","tex-
     A                                      t transform":"uppercase","disabled"-
     A                                      :{"fieldName":"dsbMC","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"left":"4-
     A                                      70px","top":"650px","height":"15px"-
     A                                      ,"width":"40px","locked in place":"-
     A                                      false","css class 2":"textbox"},{"i-
     A                                      d":"TxbManualPayType4","field type"-
     A                                      :"textbox","css class":"input","des-
     A                                      cription":"Type","value":{"fieldNam-
     A                                      e":"scManPTyp4","dataLength":"1","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[scManPTyp4]"},"-
     A                                      text align":"right","text transform-
     A                                      ":"uppercase","disabled":{"fieldNam-
     A                                      e":"dsbMC","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"left":"530px","top"-
     A                                      :"625px","height":"15px","width":"4-
     A                                      0px","locked in place":"false","css-
     A                                       class 2":"textbox"},{"id":"Txbmanu-
     A                                      alPayLevel4","field type":"textbox"-
     A                                      ,"css class":"input","description":-
     A                                      "Type","value":{"fieldName":"scManP-
     A                                      Lvl4","dataLength":"3","decPos":"0"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","numBlankFill":"false","zeroFi-
     A                                      ll":"false","noExtraSpaces":"false"-
     A                                      ,"curSym":"","dataType":"zoned","fo-
     A                                      rmatting":"Number","negNum":"-999.0-
     A                                      0","units":"","designValue":"[scMan-
     A                                      PLvl4]"},"text align":"right","text-
     A                                       transform":"uppercase","disabled":-
     A                                      {"fieldName":"dsbMC","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"left":"53-
     A                                      0px","top":"650px","height":"15px",-
     A                                      "width":"40px","locked in place":"f-
     A                                      alse","css class 2":"textbox"},{"id-
     A                                      ":"TxbManualPayType5","field type":-
     A                                      "textbox","css class":"input","desc-
     A                                      ription":"Type","value":{"fieldName-
     A                                      ":"scManPTyp5","dataLength":"1","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[scManPTyp5]"},"t-
     A                                      ext align":"right","text transform"-
     A                                      :"uppercase","disabled":{"fieldName-
     A                                      ":"dsbMC","customTrue":"","customFa-
     A                                      lse":"","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"left":"590px","top":-
     A                                      "625px","height":"15px","width":"40-
     A                                      px","locked in place":"false","css -
     A                                      class 2":"textbox"},{"id":"Txbmanua-
     A                                      lPayLevel5","field type":"textbox",-
     A                                      "css class":"input","description":"-
     A                                      Type","value":{"fieldName":"scManPL-
     A                                      vl5","dataLength":"3","decPos":"0",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","numBlankFill":"false","zeroFil-
     A                                      l":"false","noExtraSp')
     A                                  1  2HTML('aces":"false","curSym":"","da-
     A                                      taType":"zoned","formatting":"Numbe-
     A                                      r","negNum":"-999.00","units":"","d-
     A                                      esignValue":"[scManPLvl5]"},"text a-
     A                                      lign":"right","text transform":"upp-
     A                                      ercase","disabled":{"fieldName":"ds-
     A                                      bMC","customTrue":"","customFalse":-
     A                                      "","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"left":"590px","top":"650p-
     A                                      x","height":"15px","width":"40px","-
     A                                      locked in place":"false","css class-
     A                                       2":"textbox"},{"id":"TxbManualPayT-
     A                                      ype6","field type":"textbox","css c-
     A                                      lass":"input","description":"Type",-
     A                                      "value":{"fieldName":"scManPTyp6","-
     A                                      dataLength":"1","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scManPTyp6]"},"text align":"righ-
     A                                      t","text transform":"uppercase","di-
     A                                      sabled":{"fieldName":"dsbMC","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"l-
     A                                      eft":"650px","top":"625px","height"-
     A                                      :"15px","width":"40px","locked in p-
     A                                      lace":"false","css class 2":"textbo-
     A                                      x"},{"id":"TxbmanualPayLevel6","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","description":"Type","value":{"-
     A                                      fieldName":"scManPLvl6","dataLength-
     A                                      ":"3","decPos":"0","numSep":"false"-
     A                                      ,"zeroBalance":"false","numBlankFil-
     A                                      l":"false","zeroFill":"false","noEx-
     A                                      traSpaces":"false","curSym":"","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","negNum":"-999.00","units":"","de-
     A                                      signValue":"[scManPLvl6]"},"text al-
     A                                      ign":"right","text transform":"uppe-
     A                                      rcase","disabled":{"fieldName":"dsb-
     A                                      MC","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"left":"650px","top":"650px-
     A                                      ","height":"15px","width":"40px","l-
     A                                      ocked in place":"false","css class -
     A                                      2":"textbox"},{"id":"TxbManualPayTy-
     A                                      pe7","field type":"textbox","css cl-
     A                                      ass":"input","description":"Type","-
     A                                      value":{"fieldName":"scManPTyp7","d-
     A                                      ataLength":"1","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none","designValue":-
     A                                      "[scManPTyp7]"},"text align":"right-
     A                                      ","text transform":"uppercase","dis-
     A                                      abled":{"fieldName":"dsbMC","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"le-
     A                                      ft":"710px","top":"625px","height":-
     A                                      "15px","width":"40px","locked in pl-
     A                                      ace":"false","css class 2":"textbox-
     A                                      "},{"id":"TxbmanualPayLevel7","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","description":"Type","value":{"f-
     A                                      ieldName":"scManPLvl7","dataLength"-
     A                                      :"3","decPos":"0","nu')
     A                                  1  2HTML('mSep":"false","zeroBalance":"-
     A                                      false","numBlankFill":"false","zero-
     A                                      Fill":"false","noExtraSpaces":"fals-
     A                                      e","curSym":"","dataType":"zoned","-
     A                                      formatting":"Number","negNum":"-999-
     A                                      .00","units":"","designValue":"[scM-
     A                                      anPLvl7]"},"text align":"right","te-
     A                                      xt transform":"uppercase","disabled-
     A                                      ":{"fieldName":"dsbMC","customTrue"-
     A                                      :"","customFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"left":"-
     A                                      710px","top":"650px","height":"15px-
     A                                      ","width":"40px","locked in place":-
     A                                      "false","css class 2":"textbox"},{"-
     A                                      id":"TxbManualPayType8","field type-
     A                                      ":"textbox","css class":"input","de-
     A                                      scription":"Type","value":{"fieldNa-
     A                                      me":"scManPTyp8","dataLength":"1","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[scManPTyp8]"},-
     A                                      "text align":"right","text transfor-
     A                                      m":"uppercase","disabled":{"fieldNa-
     A                                      me":"dsbMC","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"left":"770px","top-
     A                                      ":"625px","height":"15px","width":"-
     A                                      40px","locked in place":"false","cs-
     A                                      s class 2":"textbox"},{"id":"Txbman-
     A                                      ualPayLevel8","field type":"textbox-
     A                                      ","css class":"input","description"-
     A                                      :"Type","value":{"fieldName":"scMan-
     A                                      PLvl8","dataLength":"3","decPos":"0-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","numBlankFill":"false","zeroF-
     A                                      ill":"false","noExtraSpaces":"false-
     A                                      ","curSym":"","dataType":"zoned","f-
     A                                      ormatting":"Number","negNum":"-999.-
     A                                      00","units":"","designValue":"[scMa-
     A                                      nPLvl8]"},"text align":"right","tex-
     A                                      t transform":"uppercase","disabled"-
     A                                      :{"fieldName":"dsbMC","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"left":"7-
     A                                      70px","top":"650px","height":"15px"-
     A                                      ,"width":"40px","locked in place":"-
     A                                      false","css class 2":"textbox"},{"i-
     A                                      d":"TxbManualPayType9","field type"-
     A                                      :"textbox","css class":"input","des-
     A                                      cription":"Type","value":{"fieldNam-
     A                                      e":"scManPTyp9","dataLength":"1","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[scManPTyp9]"},"-
     A                                      text align":"right","text transform-
     A                                      ":"uppercase","disabled":{"fieldNam-
     A                                      e":"dsbMC","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"left":"830px","top"-
     A                                      :"625px","height":"15px","width":"4-
     A                                      0px","locked in place":"false","css-
     A                                       class 2":"textbox"},{"id":"Txbmanu-
     A                                      alPayLevel9","field type":"textbox"-
     A                                      ,"css class":"input",')
     A                                  1  2HTML('"description":"Type","value":-
     A                                      {"fieldName":"scManPLvl9","dataLeng-
     A                                      th":"3","decPos":"0","numSep":"fals-
     A                                      e","zeroBalance":"false","numBlankF-
     A                                      ill":"false","zeroFill":"false","no-
     A                                      ExtraSpaces":"false","curSym":"","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","negNum":"-999.00","units":"","-
     A                                      designValue":"[scManPLvl9]"},"text -
     A                                      align":"right","text transform":"up-
     A                                      percase","disabled":{"fieldName":"d-
     A                                      sbMC","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"left":"830px","top":"650-
     A                                      px","height":"15px","width":"40px",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"textbox"},{"id":"TxbManualPay-
     A                                      Type10","field type":"textbox","css-
     A                                       class":"input","description":"Type-
     A                                      ","value":{"fieldName":"scManPTy10"-
     A                                      ,"dataLength":"1","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[scManPTy10]"},"text align":"ri-
     A                                      ght","text transform":"uppercase","-
     A                                      disabled":{"fieldName":"dsbMC","cus-
     A                                      tomTrue":"","customFalse":"","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "left":"890px","top":"625px","heigh-
     A                                      t":"15px","width":"40px","locked in-
     A                                       place":"false","css class 2":"text-
     A                                      box"},{"id":"TxbmanualPayLevel10","-
     A                                      field type":"textbox","css class":"-
     A                                      input","description":"Type","value"-
     A                                      :{"fieldName":"scManPLv10","dataLen-
     A                                      gth":"3","decPos":"0","numSep":"fal-
     A                                      se","zeroBalance":"false","numBlank-
     A                                      Fill":"false","zeroFill":"false","n-
     A                                      oExtraSpaces":"false","curSym":"","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","negNum":"-999.00","units":"",-
     A                                      "designValue":"[scManPLv10]"},"text-
     A                                       align":"right","text transform":"u-
     A                                      ppercase","disabled":{"fieldName":"-
     A                                      dsbMC","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"left":"890px","top":"65-
     A                                      0px","height":"15px","width":"40px"-
     A                                      ,"locked in place":"false","css cla-
     A                                      ss 2":"textbox"},{"id":"LblAddEditM-
     A                                      ultiClaimLevel_copy4","field type":-
     A                                      "output field","css class":"label",-
     A                                      "value":"Level","left":"290px","top-
     A                                      ":"650px","width":"45px"},{"id":"Lb-
     A                                      lAddEditMultiClaim_copy5","field ty-
     A                                      pe":"output field","css class":"lab-
     A                                      el","value":"Adjustment","left":"26-
     A                                      5px","top":"685px","width":"255px",-
     A                                      "locked in place":"false","visibili-
     A                                      ty":{"fieldName":"ShowClmCfg","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"}},{"id":"LblAddEditMultiClaimTy-
     A                                      pe_copy5","field type":"output fiel-
     A                                      d","css class":"label","value":"Typ-
     A                                      e","left":"290px","top":"705px","wi-
     A                                      dth":"45px"},{"id":"T')
     A                                  1  2HTML('xbAdjustType1","field type":"-
     A                                      textbox","css class":"input","descr-
     A                                      iption":"Type","value":{"fieldName"-
     A                                      :"scAdstTyp1","dataLength":"1","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[scAdstTyp1]"},"te-
     A                                      xt align":"right","text transform":-
     A                                      "uppercase","disabled":{"fieldName"-
     A                                      :"dsbMC","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"left":"350px","top":"-
     A                                      705px","height":"15px","width":"40p-
     A                                      x","locked in place":"false","css c-
     A                                      lass 2":"textbox"},{"id":"TxbAdjust-
     A                                      Level1","field type":"textbox","css-
     A                                       class":"input","description":"Type-
     A                                      ","value":{"fieldName":"scAdstLvl1"-
     A                                      ,"dataLength":"3","decPos":"0","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "numBlankFill":"false","zeroFill":"-
     A                                      false","noExtraSpaces":"false","cur-
     A                                      Sym":"","dataType":"zoned","formatt-
     A                                      ing":"Number","negNum":"-999.00","u-
     A                                      nits":"","designValue":"[scAdstLvl1-
     A                                      ]"},"text align":"right","text tran-
     A                                      sform":"uppercase","disabled":{"fie-
     A                                      ldName":"dsbMC","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"left":"350px",-
     A                                      "top":"730px","height":"15px","widt-
     A                                      h":"40px","locked in place":"false"-
     A                                      ,"css class 2":"textbox"},{"id":"Tx-
     A                                      bAdjustType2","field type":"textbox-
     A                                      ","css class":"input","description"-
     A                                      :"Type","value":{"fieldName":"scAds-
     A                                      tTyp2","dataLength":"1","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none","desi-
     A                                      gnValue":"[scAdstTyp2]"},"text alig-
     A                                      n":"right","text transform":"upperc-
     A                                      ase","disabled":{"fieldName":"dsbMC-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"left":"410px","top":"705px",-
     A                                      "height":"15px","width":"40px","loc-
     A                                      ked in place":"false","css class 2"-
     A                                      :"textbox"},{"id":"TxbAdjustLevel2"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","description":"Type","valu-
     A                                      e":{"fieldName":"scAdstLvl2","dataL-
     A                                      ength":"3","decPos":"0","numSep":"f-
     A                                      alse","zeroBalance":"false","numBla-
     A                                      nkFill":"false","zeroFill":"false",-
     A                                      "noExtraSpaces":"false","curSym":""-
     A                                      ,"dataType":"zoned","formatting":"N-
     A                                      umber","negNum":"-999.00","units":"-
     A                                      ","designValue":"[scAdstLvl2]"},"te-
     A                                      xt align":"right","text transform":-
     A                                      "uppercase","disabled":{"fieldName"-
     A                                      :"dsbMC","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"left":"410px","top":"-
     A                                      730px","height":"15px')
     A                                  1  2HTML('","width":"40px","locked in p-
     A                                      lace":"false","css class 2":"textbo-
     A                                      x"},{"id":"TxbAdjustType3","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "description":"Type","value":{"fiel-
     A                                      dName":"scAdstTyp3","dataLength":"1-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[scAdstTyp3]-
     A                                      "},"text align":"right","text trans-
     A                                      form":"uppercase","disabled":{"fiel-
     A                                      dName":"dsbMC","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"left":"470px","-
     A                                      top":"705px","height":"15px","width-
     A                                      ":"40px","locked in place":"false",-
     A                                      "css class 2":"textbox"},{"id":"Txb-
     A                                      AdjustLevel3","field type":"textbox-
     A                                      ","css class":"input","description"-
     A                                      :"Type","value":{"fieldName":"scAds-
     A                                      tLvl3","dataLength":"3","decPos":"0-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","numBlankFill":"false","zeroF-
     A                                      ill":"false","noExtraSpaces":"false-
     A                                      ","curSym":"","dataType":"zoned","f-
     A                                      ormatting":"Number","negNum":"-999.-
     A                                      00","units":"","designValue":"[scAd-
     A                                      stLvl3]"},"text align":"right","tex-
     A                                      t transform":"uppercase","disabled"-
     A                                      :{"fieldName":"dsbMC","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"left":"4-
     A                                      70px","top":"730px","height":"15px"-
     A                                      ,"width":"40px","locked in place":"-
     A                                      false","css class 2":"textbox"},{"i-
     A                                      d":"TxbAdjustType4","field type":"t-
     A                                      extbox","css class":"input","descri-
     A                                      ption":"Type","value":{"fieldName":-
     A                                      "scAdstTyp4","dataLength":"1","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[scAdstTyp4]"},"tex-
     A                                      t align":"right","text transform":"-
     A                                      uppercase","disabled":{"fieldName":-
     A                                      "dsbMC","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"left":"530px","top":"7-
     A                                      05px","height":"15px","width":"40px-
     A                                      ","locked in place":"false","css cl-
     A                                      ass 2":"textbox"},{"id":"TxbAdjustL-
     A                                      evel4","field type":"textbox","css -
     A                                      class":"input","description":"Type"-
     A                                      ,"value":{"fieldName":"scAdstLvl4",-
     A                                      "dataLength":"3","decPos":"0","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      numBlankFill":"false","zeroFill":"f-
     A                                      alse","noExtraSpaces":"false","curS-
     A                                      ym":"","dataType":"zoned","formatti-
     A                                      ng":"Number","negNum":"-999.00","un-
     A                                      its":"","designValue":"[scAdstLvl4]-
     A                                      "},"text align":"right","text trans-
     A                                      form":"uppercase","disabled":{"fiel-
     A                                      dName":"dsbMC","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indica')
     A                                  1  2HTML('tor","indFormat":"true / fals-
     A                                      e"},"left":"530px","top":"730px","h-
     A                                      eight":"15px","width":"40px","locke-
     A                                      d in place":"false","css class 2":"-
     A                                      textbox"},{"id":"TxbAdjustType5","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","description":"Type","value":-
     A                                      {"fieldName":"scAdstTyp5","dataLeng-
     A                                      th":"1","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[scAds-
     A                                      tTyp5]"},"text align":"right","text-
     A                                       transform":"uppercase","disabled":-
     A                                      {"fieldName":"dsbMC","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"left":"59-
     A                                      0px","top":"705px","height":"15px",-
     A                                      "width":"40px","locked in place":"f-
     A                                      alse","css class 2":"textbox"},{"id-
     A                                      ":"TxbAdjustLevel5","field type":"t-
     A                                      extbox","css class":"input","descri-
     A                                      ption":"Type","value":{"fieldName":-
     A                                      "scAdstLvl5","dataLength":"3","decP-
     A                                      os":"0","numSep":"false","zeroBalan-
     A                                      ce":"false","numBlankFill":"false",-
     A                                      "zeroFill":"false","noExtraSpaces":-
     A                                      "false","curSym":"","dataType":"zon-
     A                                      ed","formatting":"Number","negNum":-
     A                                      "-999.00","units":"","designValue":-
     A                                      "[scAdstLvl5]"},"text align":"right-
     A                                      ","text transform":"uppercase","dis-
     A                                      abled":{"fieldName":"dsbMC","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"le-
     A                                      ft":"590px","top":"730px","height":-
     A                                      "15px","width":"40px","locked in pl-
     A                                      ace":"false","css class 2":"textbox-
     A                                      "},{"id":"TxbAdjustType6","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      description":"Type","value":{"field-
     A                                      Name":"scAdstTyp6","dataLength":"1"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[scAdstTyp6]"-
     A                                      },"text align":"right","text transf-
     A                                      orm":"uppercase","disabled":{"field-
     A                                      Name":"dsbMC","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"left":"650px","t-
     A                                      op":"705px","height":"15px","width"-
     A                                      :"40px","locked in place":"false","-
     A                                      css class 2":"textbox"},{"id":"TxbA-
     A                                      djustLevel6","field type":"textbox"-
     A                                      ,"css class":"input","description":-
     A                                      "Type","value":{"fieldName":"scAdst-
     A                                      Lvl6","dataLength":"3","decPos":"0"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","numBlankFill":"false","zeroFi-
     A                                      ll":"false","noExtraSpaces":"false"-
     A                                      ,"curSym":"","dataType":"zoned","fo-
     A                                      rmatting":"Number","negNum":"-999.0-
     A                                      0","units":"","designValue":"[scAds-
     A                                      tLvl6]"},"text align":"right","text-
     A                                       transform":"uppercase","disabled":-
     A                                      {"fieldName":"dsbMC",')
     A                                  1  2HTML('"customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"left":"650px","top":"730-
     A                                      px","height":"15px","width":"40px",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"textbox"},{"id":"TxbAdjustTyp-
     A                                      e7","field type":"textbox","css cla-
     A                                      ss":"input","description":"Type","v-
     A                                      alue":{"fieldName":"scAdstTyp7","da-
     A                                      taLength":"1","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none","designValue":"-
     A                                      [scAdstTyp7]"},"text align":"right"-
     A                                      ,"text transform":"uppercase","disa-
     A                                      bled":{"fieldName":"dsbMC","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"lef-
     A                                      t":"710px","top":"705px","height":"-
     A                                      15px","width":"40px","locked in pla-
     A                                      ce":"false","css class 2":"textbox"-
     A                                      },{"id":"TxbAdjustLevel7","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      description":"Type","value":{"field-
     A                                      Name":"scAdstLvl7","dataLength":"3"-
     A                                      ,"decPos":"0","numSep":"false","zer-
     A                                      oBalance":"false","numBlankFill":"f-
     A                                      alse","zeroFill":"false","noExtraSp-
     A                                      aces":"false","curSym":"","dataType-
     A                                      ":"zoned","formatting":"Number","ne-
     A                                      gNum":"-999.00","units":"","designV-
     A                                      alue":"[scAdstLvl7]"},"text align":-
     A                                      "right","text transform":"uppercase-
     A                                      ","disabled":{"fieldName":"dsbMC","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"left":"710px","top":"730px","he-
     A                                      ight":"15px","width":"40px","locked-
     A                                       in place":"false","css class 2":"t-
     A                                      extbox"},{"id":"TxbAdjustType8","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","description":"Type","value":{-
     A                                      "fieldName":"scAdstTyp8","dataLengt-
     A                                      h":"1","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[scAdst-
     A                                      Typ8]"},"text align":"right","text -
     A                                      transform":"uppercase","disabled":{-
     A                                      "fieldName":"dsbMC","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"left":"770-
     A                                      px","top":"705px","height":"15px","-
     A                                      width":"40px","locked in place":"fa-
     A                                      lse","css class 2":"textbox"},{"id"-
     A                                      :"TxbAdjustLevel8","field type":"te-
     A                                      xtbox","css class":"input","descrip-
     A                                      tion":"Type","value":{"fieldName":"-
     A                                      scAdstLvl8","dataLength":"3","decPo-
     A                                      s":"0","numSep":"false","zeroBalanc-
     A                                      e":"false","numBlankFill":"false","-
     A                                      zeroFill":"false","noExtraSpaces":"-
     A                                      false","curSym":"","dataType":"zone-
     A                                      d","formatting":"Number","negNum":"-
     A                                      -999.00","units":"","designValue":"-
     A                                      [scAdstLvl8]"},"text')
     A                                  1  2HTML(' align":"right","text transfo-
     A                                      rm":"uppercase","disabled":{"fieldN-
     A                                      ame":"dsbMC","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"left":"770px","to-
     A                                      p":"730px","height":"15px","width":-
     A                                      "40px","locked in place":"false","c-
     A                                      ss class 2":"textbox"},{"id":"TxbAd-
     A                                      justType9","field type":"textbox","-
     A                                      css class":"input","description":"T-
     A                                      ype","value":{"fieldName":"scAdstTy-
     A                                      p9","dataLength":"1","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[scAdstTyp9]"},"text align":-
     A                                      "right","text transform":"uppercase-
     A                                      ","disabled":{"fieldName":"dsbMC","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"left":"830px","top":"705px","he-
     A                                      ight":"15px","width":"40px","locked-
     A                                       in place":"false","css class 2":"t-
     A                                      extbox"},{"id":"TxbAdjustLevel9","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","description":"Type","value":-
     A                                      {"fieldName":"scAdstLvl9","dataLeng-
     A                                      th":"3","decPos":"0","numSep":"fals-
     A                                      e","zeroBalance":"false","numBlankF-
     A                                      ill":"false","zeroFill":"false","no-
     A                                      ExtraSpaces":"false","curSym":"","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","negNum":"-999.00","units":"","-
     A                                      designValue":"[scAdstLvl9]"},"text -
     A                                      align":"right","text transform":"up-
     A                                      percase","disabled":{"fieldName":"d-
     A                                      sbMC","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"left":"830px","top":"730-
     A                                      px","height":"15px","width":"40px",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"textbox"},{"id":"TxbAdjustTyp-
     A                                      e10","field type":"textbox","css cl-
     A                                      ass":"input","description":"Type","-
     A                                      value":{"fieldName":"scAdstTy10","d-
     A                                      ataLength":"1","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none","designValue":-
     A                                      "[scAdstTy10]"},"text align":"right-
     A                                      ","text transform":"uppercase","dis-
     A                                      abled":{"fieldName":"dsbMC","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"le-
     A                                      ft":"890px","top":"705px","height":-
     A                                      "15px","width":"40px","locked in pl-
     A                                      ace":"false","css class 2":"textbox-
     A                                      "},{"id":"TxbAdjustLevel10","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"description":"Type","value":{"fie-
     A                                      ldName":"scAdstLv10","dataLength":"-
     A                                      3","decPos":"0","numSep":"false","z-
     A                                      eroBalance":"false","numBlankFill":-
     A                                      "false","zeroFill":"false","noExtra-
     A                                      Spaces":"false","curSym":"","dataTy-
     A                                      pe":"zoned","formatti')
     A                                  1  2HTML('ng":"Number","negNum":"-999.0-
     A                                      0","units":"","designValue":"[scAds-
     A                                      tLv10]"},"text align":"right","text-
     A                                       transform":"uppercase","disabled":-
     A                                      {"fieldName":"dsbMC","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"left":"89-
     A                                      0px","top":"730px","height":"15px",-
     A                                      "width":"40px","locked in place":"f-
     A                                      alse","css class 2":"textbox"},{"id-
     A                                      ":"LblAddEditMultiClaimLevel_copy5"-
     A                                      ,"field type":"output field","css c-
     A                                      lass":"label","value":"Level","left-
     A                                      ":"290px","top":"730px","width":"45-
     A                                      px"},{"id":"LblMultiClaim_copy","fi-
     A                                      eld type":"output field","css class-
     A                                      ":"heading","value":"Payments","tex-
     A                                      t align":"left","disabled":{"fieldN-
     A                                      ame":"ShowClmCfg","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"left":"270-
     A                                      px","top":"490px","width":"125px","-
     A                                      z index":"50","locked in place":"fa-
     A                                      lse","heading type":"Section Header-
     A                                      "},{"id":"LblAddEditMultiClaim_copy-
     A                                      6","field type":"output field","css-
     A                                       class":"label","value":"Recovery T-
     A                                      racking ","left":"265px","top":"760-
     A                                      px","width":"200px","locked in plac-
     A                                      e":"false"},{"id":"LblAddEditMultiC-
     A                                      laimType_copy6","field type":"outpu-
     A                                      t field","css class":"label","value-
     A                                      ":"Type","left":"290px","top":"780p-
     A                                      x","width":"45px"},{"id":"TxbRecove-
     A                                      ryTrackType1","field type":"textbox-
     A                                      ","css class":"input","description"-
     A                                      :"Type","value":{"fieldName":"scRec-
     A                                      TTyp1","dataLength":"1","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none","desi-
     A                                      gnValue":"[scRecTTyp1]"},"text alig-
     A                                      n":"right","text transform":"upperc-
     A                                      ase","disabled":{"fieldName":"dsbMC-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"left":"350px","top":"780px",-
     A                                      "height":"15px","width":"40px","loc-
     A                                      ked in place":"false","css class 2"-
     A                                      :"textbox"},{"id":"TxbRecoveryTrack-
     A                                      Level1","field type":"textbox","css-
     A                                       class":"input","description":"Type-
     A                                      ","value":{"fieldName":"scRecTLvl1"-
     A                                      ,"dataLength":"3","decPos":"0","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "numBlankFill":"false","zeroFill":"-
     A                                      false","noExtraSpaces":"false","cur-
     A                                      Sym":"","dataType":"zoned","formatt-
     A                                      ing":"Number","negNum":"-999.00","u-
     A                                      nits":"","designValue":"[scRecTLvl1-
     A                                      ]"},"text align":"right","text tran-
     A                                      sform":"uppercase","disabled":{"fie-
     A                                      ldName":"dsbMC","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"left":"350px",-
     A                                      "top":"805px","height":"15px","widt-
     A                                      h":"40px","locked in place":"false"-
     A                                      ,"css class 2":"textb')
     A                                  1  2HTML('ox"},{"id":"TxbRecoveryTrackT-
     A                                      ype2","field type":"textbox","css c-
     A                                      lass":"input","description":"Type",-
     A                                      "value":{"fieldName":"scRecTTyp2","-
     A                                      dataLength":"1","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scRecTTyp2]"},"text align":"righ-
     A                                      t","text transform":"uppercase","di-
     A                                      sabled":{"fieldName":"dsbMC","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"l-
     A                                      eft":"410px","top":"780px","height"-
     A                                      :"15px","width":"40px","locked in p-
     A                                      lace":"false","css class 2":"textbo-
     A                                      x"},{"id":"TxbRecoveryTrackLevel2",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","description":"Type","value-
     A                                      ":{"fieldName":"scRecTLvl2","dataLe-
     A                                      ngth":"3","decPos":"0","numSep":"fa-
     A                                      lse","zeroBalance":"false","numBlan-
     A                                      kFill":"false","zeroFill":"false","-
     A                                      noExtraSpaces":"false","curSym":"",-
     A                                      "dataType":"zoned","formatting":"Nu-
     A                                      mber","negNum":"-999.00","units":""-
     A                                      ,"designValue":"[scRecTLvl2]"},"tex-
     A                                      t align":"right","text transform":"-
     A                                      uppercase","disabled":{"fieldName":-
     A                                      "dsbMC","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"left":"410px","top":"8-
     A                                      05px","height":"15px","width":"40px-
     A                                      ","locked in place":"false","css cl-
     A                                      ass 2":"textbox"},{"id":"TxbRecover-
     A                                      yTrackType3","field type":"textbox"-
     A                                      ,"css class":"input","description":-
     A                                      "Type","value":{"fieldName":"scRecT-
     A                                      Typ3","dataLength":"1","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[scRecTTyp3]"},"text align-
     A                                      ":"right","text transform":"upperca-
     A                                      se","disabled":{"fieldName":"dsbMC"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"left":"470px","top":"780px","-
     A                                      height":"15px","width":"40px","lock-
     A                                      ed in place":"false","css class 2":-
     A                                      "textbox"},{"id":"TxbRecoveryTrackL-
     A                                      evel3","field type":"textbox","css -
     A                                      class":"input","description":"Type"-
     A                                      ,"value":{"fieldName":"scRecTLvl3",-
     A                                      "dataLength":"3","decPos":"0","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      numBlankFill":"false","zeroFill":"f-
     A                                      alse","noExtraSpaces":"false","curS-
     A                                      ym":"","dataType":"zoned","formatti-
     A                                      ng":"Number","negNum":"-999.00","un-
     A                                      its":"","designValue":"[scRecTLvl3]-
     A                                      "},"text align":"right","text trans-
     A                                      form":"uppercase","disabled":{"fiel-
     A                                      dName":"dsbMC","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"l')
     A                                  1  2HTML('eft":"470px","top":"805px","h-
     A                                      eight":"15px","width":"40px","locke-
     A                                      d in place":"false","css class 2":"-
     A                                      textbox"},{"id":"TxbRecoveryTrackTy-
     A                                      pe4","field type":"textbox","css cl-
     A                                      ass":"input","description":"Type","-
     A                                      value":{"fieldName":"scRecTTyp4","d-
     A                                      ataLength":"1","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none","designValue":-
     A                                      "[scRecTTyp4]"},"text align":"right-
     A                                      ","text transform":"uppercase","dis-
     A                                      abled":{"fieldName":"dsbMC","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"le-
     A                                      ft":"530px","top":"780px","height":-
     A                                      "15px","width":"40px","locked in pl-
     A                                      ace":"false","css class 2":"textbox-
     A                                      "},{"id":"TxbRecoveryTrackLevel4","-
     A                                      field type":"textbox","css class":"-
     A                                      input","description":"Type","value"-
     A                                      :{"fieldName":"scRecTLvl4","dataLen-
     A                                      gth":"3","decPos":"0","numSep":"fal-
     A                                      se","zeroBalance":"false","numBlank-
     A                                      Fill":"false","zeroFill":"false","n-
     A                                      oExtraSpaces":"false","curSym":"","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","negNum":"-999.00","units":"",-
     A                                      "designValue":"[scRecTLvl4]"},"text-
     A                                       align":"right","text transform":"u-
     A                                      ppercase","disabled":{"fieldName":"-
     A                                      dsbMC","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"left":"530px","top":"80-
     A                                      5px","height":"15px","width":"40px"-
     A                                      ,"locked in place":"false","css cla-
     A                                      ss 2":"textbox"},{"id":"TxbRecovery-
     A                                      TrackType5","field type":"textbox",-
     A                                      "css class":"input","description":"-
     A                                      Type","value":{"fieldName":"scRecTT-
     A                                      yp5","dataLength":"1","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[scRecTTyp5]"},"text align"-
     A                                      :"right","text transform":"uppercas-
     A                                      e","disabled":{"fieldName":"dsbMC",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"left":"590px","top":"780px","h-
     A                                      eight":"15px","width":"40px","locke-
     A                                      d in place":"false","css class 2":"-
     A                                      textbox"},{"id":"TxbRecoveryTrackLe-
     A                                      vel5","field type":"textbox","css c-
     A                                      lass":"input","description":"Type",-
     A                                      "value":{"fieldName":"scRecTLvl5","-
     A                                      dataLength":"3","decPos":"0","numSe-
     A                                      p":"false","zeroBalance":"false","n-
     A                                      umBlankFill":"false","zeroFill":"fa-
     A                                      lse","noExtraSpaces":"false","curSy-
     A                                      m":"","dataType":"zoned","formattin-
     A                                      g":"Number","negNum":"-999.00","uni-
     A                                      ts":"","designValue":"[scRecTLvl5]"-
     A                                      },"text align":"right","text transf-
     A                                      orm":"uppercase","disabled":{"field-
     A                                      Name":"dsbMC","custom')
     A                                  1  2HTML('True":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"left":"590px","top":"805px","he-
     A                                      ight":"15px","width":"40px","locked-
     A                                       in place":"false","css class 2":"t-
     A                                      extbox"},{"id":"TxbRecoveryTrackTyp-
     A                                      e6","field type":"textbox","css cla-
     A                                      ss":"input","description":"Type","v-
     A                                      alue":{"fieldName":"scRecTTyp6","da-
     A                                      taLength":"1","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none","designValue":"-
     A                                      [scRecTTyp6]"},"text align":"right"-
     A                                      ,"text transform":"uppercase","disa-
     A                                      bled":{"fieldName":"dsbMC","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"lef-
     A                                      t":"650px","top":"780px","height":"-
     A                                      15px","width":"40px","locked in pla-
     A                                      ce":"false","css class 2":"textbox"-
     A                                      },{"id":"TxbRecoveryTrackLevel6","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","description":"Type","value":-
     A                                      {"fieldName":"scRecTLvl6","dataLeng-
     A                                      th":"3","decPos":"0","numSep":"fals-
     A                                      e","zeroBalance":"false","numBlankF-
     A                                      ill":"false","zeroFill":"false","no-
     A                                      ExtraSpaces":"false","curSym":"","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","negNum":"-999.00","units":"","-
     A                                      designValue":"[scRecTLvl6]"},"text -
     A                                      align":"right","text transform":"up-
     A                                      percase","disabled":{"fieldName":"d-
     A                                      sbMC","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"left":"650px","top":"805-
     A                                      px","height":"15px","width":"40px",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"textbox"},{"id":"TxbRecoveryT-
     A                                      rackType7","field type":"textbox","-
     A                                      css class":"input","description":"T-
     A                                      ype","value":{"fieldName":"scRecTTy-
     A                                      p7","dataLength":"1","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[scRecTTyp7]"},"text align":-
     A                                      "right","text transform":"uppercase-
     A                                      ","disabled":{"fieldName":"dsbMC","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"left":"710px","top":"780px","he-
     A                                      ight":"15px","width":"40px","locked-
     A                                       in place":"false","css class 2":"t-
     A                                      extbox"},{"id":"TxbRecoveryTrackLev-
     A                                      el7","field type":"textbox","css cl-
     A                                      ass":"input","description":"Type","-
     A                                      value":{"fieldName":"scRecTLvl7","d-
     A                                      ataLength":"3","decPos":"0","numSep-
     A                                      ":"false","zeroBalance":"false","nu-
     A                                      mBlankFill":"false","zeroFill":"fal-
     A                                      se","noExtraSpaces":"false","curSym-
     A                                      ":"","dataType":"zoned","formatting-
     A                                      ":"Number","negNum":"-999.00","unit-
     A                                      s":"","designValue":"')
     A                                  1  2HTML('[scRecTLvl7]"},"text align":"-
     A                                      right","text transform":"uppercase"-
     A                                      ,"disabled":{"fieldName":"dsbMC","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"left":"710px","top":"805px","hei-
     A                                      ght":"15px","width":"40px","locked -
     A                                      in place":"false","css class 2":"te-
     A                                      xtbox"},{"id":"TxbRecoveryTrackType-
     A                                      8","field type":"textbox","css clas-
     A                                      s":"input","description":"Type","va-
     A                                      lue":{"fieldName":"scRecTTyp8","dat-
     A                                      aLength":"1","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      scRecTTyp8]"},"text align":"right",-
     A                                      "text transform":"uppercase","disab-
     A                                      led":{"fieldName":"dsbMC","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"left-
     A                                      ":"770px","top":"780px","height":"1-
     A                                      5px","width":"40px","locked in plac-
     A                                      e":"false","css class 2":"textbox"}-
     A                                      ,{"id":"TxbRecoveryTrackLevel8","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","description":"Type","value":{-
     A                                      "fieldName":"scRecTLvl8","dataLengt-
     A                                      h":"3","decPos":"0","numSep":"false-
     A                                      ","zeroBalance":"false","numBlankFi-
     A                                      ll":"false","zeroFill":"false","noE-
     A                                      xtraSpaces":"false","curSym":"","da-
     A                                      taType":"zoned","formatting":"Numbe-
     A                                      r","negNum":"-999.00","units":"","d-
     A                                      esignValue":"[scRecTLvl8]"},"text a-
     A                                      lign":"right","text transform":"upp-
     A                                      ercase","disabled":{"fieldName":"ds-
     A                                      bMC","customTrue":"","customFalse":-
     A                                      "","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"left":"770px","top":"805p-
     A                                      x","height":"15px","width":"40px","-
     A                                      locked in place":"false","css class-
     A                                       2":"textbox"},{"id":"TxbRecoveryTr-
     A                                      ackType9","field type":"textbox","c-
     A                                      ss class":"input","description":"Ty-
     A                                      pe","value":{"fieldName":"scRecTTyp-
     A                                      9","dataLength":"1","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[scRecTTyp9]"},"text align":"-
     A                                      right","text transform":"uppercase"-
     A                                      ,"disabled":{"fieldName":"dsbMC","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"left":"830px","top":"780px","hei-
     A                                      ght":"15px","width":"40px","locked -
     A                                      in place":"false","css class 2":"te-
     A                                      xtbox"},{"id":"TxbRecoveryTrackLeve-
     A                                      l9","field type":"textbox","css cla-
     A                                      ss":"input","description":"Type","v-
     A                                      alue":{"fieldName":"scRecTLvl9","da-
     A                                      taLength":"3","decPos":"0","numSep"-
     A                                      :"false","zeroBalance":"false","num-
     A                                      BlankFill":"false","zeroFill":"fals-
     A                                      e","noExtraSpaces":"f')
     A                                  1  2HTML('alse","curSym":"","dataType":-
     A                                      "zoned","formatting":"Number","negN-
     A                                      um":"-999.00","units":"","designVal-
     A                                      ue":"[scRecTLvl9]"},"text align":"r-
     A                                      ight","text transform":"uppercase",-
     A                                      "disabled":{"fieldName":"dsbMC","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"left":"830px","top":"805px","heig-
     A                                      ht":"15px","width":"40px","locked i-
     A                                      n place":"false","css class 2":"tex-
     A                                      tbox"},{"id":"TxbRecoveryTrackType1-
     A                                      0","field type":"textbox","css clas-
     A                                      s":"input","description":"Type","va-
     A                                      lue":{"fieldName":"scRecTTy10","dat-
     A                                      aLength":"1","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      scRecTTy10]"},"text align":"right",-
     A                                      "text transform":"uppercase","disab-
     A                                      led":{"fieldName":"dsbMC","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"left-
     A                                      ":"890px","top":"780px","height":"1-
     A                                      5px","width":"40px","locked in plac-
     A                                      e":"false","css class 2":"textbox"}-
     A                                      ,{"id":"TxbRecoveryTrackLevel10","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","description":"Type","value":-
     A                                      {"fieldName":"scRecTLv10","dataLeng-
     A                                      th":"3","decPos":"0","numSep":"fals-
     A                                      e","zeroBalance":"false","numBlankF-
     A                                      ill":"false","zeroFill":"false","no-
     A                                      ExtraSpaces":"false","curSym":"","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","negNum":"-999.00","units":"","-
     A                                      designValue":"[scRecTLv10]"},"text -
     A                                      align":"right","text transform":"up-
     A                                      percase","disabled":{"fieldName":"d-
     A                                      sbMC","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"left":"890px","top":"805-
     A                                      px","height":"15px","width":"40px",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"textbox"},{"id":"LblAddEditMu-
     A                                      ltiClaimLevel_copy6","field type":"-
     A                                      output field","css class":"label","-
     A                                      value":"Level","left":"290px","top"-
     A                                      :"805px","width":"45px"},{"id":"Lbl-
     A                                      AddEditMultiClaim_copy7","field typ-
     A                                      e":"output field","css class":"labe-
     A                                      l","value":"Post Recovery","left":"-
     A                                      265px","top":"840px","width":"200px-
     A                                      ","locked in place":"false","visibi-
     A                                      lity":{"fieldName":"ShowClmCfg","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"}},{"id":"LblAddEditMultiClaim-
     A                                      Type_copy7","field type":"output fi-
     A                                      eld","css class":"label","value":"T-
     A                                      ype","left":"290px","top":"860px","-
     A                                      width":"45px"},{"id":"TxbPostRecove-
     A                                      ryType1","field type":"textbox","cs-
     A                                      s class":"input","description":"Typ-
     A                                      e","value":{"fieldName":"scPstRTyp1-
     A                                      ","dataLength":"1","trimLeading":"f-
     A                                      alse","trimTrailing":')
     A                                  1  2HTML('"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[scPstRTyp-
     A                                      1]"},"text align":"right","text tra-
     A                                      nsform":"uppercase","disabled":{"fi-
     A                                      eldName":"dsbMC","customTrue":"","c-
     A                                      ustomFalse":"","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"left":"350px"-
     A                                      ,"top":"860px","height":"15px","wid-
     A                                      th":"40px","locked in place":"false-
     A                                      ","css class 2":"textbox"},{"id":"T-
     A                                      xbPostRecoveryLevel1","field type":-
     A                                      "textbox","css class":"input","desc-
     A                                      ription":"Type","value":{"fieldName-
     A                                      ":"scPstRLvl1","dataLength":"3","de-
     A                                      cPos":"0","numSep":"false","zeroBal-
     A                                      ance":"false","numBlankFill":"false-
     A                                      ","zeroFill":"false","noExtraSpaces-
     A                                      ":"false","curSym":"","dataType":"z-
     A                                      oned","formatting":"Number","negNum-
     A                                      ":"-999.00","units":"","designValue-
     A                                      ":"[scPstRLvl1]"},"text align":"rig-
     A                                      ht","text transform":"uppercase","d-
     A                                      isabled":{"fieldName":"dsbMC","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      left":"350px","top":"885px","height-
     A                                      ":"15px","width":"40px","locked in -
     A                                      place":"false","css class 2":"textb-
     A                                      ox"},{"id":"TxbPostRecoveryType2","-
     A                                      field type":"textbox","css class":"-
     A                                      input","description":"Type","value"-
     A                                      :{"fieldName":"scPstRTyp2","dataLen-
     A                                      gth":"1","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none","designValue":"[scPs-
     A                                      tRTyp2]"},"text align":"right","tex-
     A                                      t transform":"uppercase","disabled"-
     A                                      :{"fieldName":"dsbMC","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"left":"4-
     A                                      10px","top":"860px","height":"15px"-
     A                                      ,"width":"40px","locked in place":"-
     A                                      false","css class 2":"textbox"},{"i-
     A                                      d":"TxbPostRecoveryLevel2","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "description":"Type","value":{"fiel-
     A                                      dName":"scPstRLvl2","dataLength":"3-
     A                                      ","decPos":"0","numSep":"false","ze-
     A                                      roBalance":"false","numBlankFill":"-
     A                                      false","zeroFill":"false","noExtraS-
     A                                      paces":"false","curSym":"","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      egNum":"-999.00","units":"","design-
     A                                      Value":"[scPstRLvl2]"},"text align"-
     A                                      :"right","text transform":"uppercas-
     A                                      e","disabled":{"fieldName":"dsbMC",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"left":"410px","top":"885px","h-
     A                                      eight":"15px","width":"40px","locke-
     A                                      d in place":"false","css class 2":"-
     A                                      textbox"},{"id":"TxbPostRecoveryTyp-
     A                                      e3","field type":"textbox","css cla-
     A                                      ss":"input","descript')
     A                                  1  2HTML('ion":"Type","value":{"fieldNa-
     A                                      me":"scPstRTyp3","dataLength":"1","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[scPstRTyp3]"},-
     A                                      "text align":"right","text transfor-
     A                                      m":"uppercase","disabled":{"fieldNa-
     A                                      me":"dsbMC","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"left":"470px","top-
     A                                      ":"860px","height":"15px","width":"-
     A                                      40px","locked in place":"false","cs-
     A                                      s class 2":"textbox"},{"id":"TxbPos-
     A                                      tRecoveryLevel3","field type":"text-
     A                                      box","css class":"input","descripti-
     A                                      on":"Type","value":{"fieldName":"sc-
     A                                      PstRLvl3","dataLength":"3","decPos"-
     A                                      :"0","numSep":"false","zeroBalance"-
     A                                      :"false","numBlankFill":"false","ze-
     A                                      roFill":"false","noExtraSpaces":"fa-
     A                                      lse","curSym":"","dataType":"zoned"-
     A                                      ,"formatting":"Number","negNum":"-9-
     A                                      99.00","units":"","designValue":"[s-
     A                                      cPstRLvl3]"},"text align":"right","-
     A                                      text transform":"uppercase","disabl-
     A                                      ed":{"fieldName":"dsbMC","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"left"-
     A                                      :"470px","top":"885px","height":"15-
     A                                      px","width":"40px","locked in place-
     A                                      ":"false","css class 2":"textbox"},-
     A                                      {"id":"TxbPostRecoveryType4","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","description":"Type","value":{"fi-
     A                                      eldName":"scPstRTyp4","dataLength":-
     A                                      "1","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[scPstRTyp-
     A                                      4]"},"text align":"right","text tra-
     A                                      nsform":"uppercase","disabled":{"fi-
     A                                      eldName":"dsbMC","customTrue":"","c-
     A                                      ustomFalse":"","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"left":"530px"-
     A                                      ,"top":"860px","height":"15px","wid-
     A                                      th":"40px","locked in place":"false-
     A                                      ","css class 2":"textbox"},{"id":"T-
     A                                      xbPostRecoveryLevel4","field type":-
     A                                      "textbox","css class":"input","desc-
     A                                      ription":"Type","value":{"fieldName-
     A                                      ":"scPstRLvl4","dataLength":"3","de-
     A                                      cPos":"0","numSep":"false","zeroBal-
     A                                      ance":"false","numBlankFill":"false-
     A                                      ","zeroFill":"false","noExtraSpaces-
     A                                      ":"false","curSym":"","dataType":"z-
     A                                      oned","formatting":"Number","negNum-
     A                                      ":"-999.00","units":"","designValue-
     A                                      ":"[scPstRLvl4]"},"text align":"rig-
     A                                      ht","text transform":"uppercase","d-
     A                                      isabled":{"fieldName":"dsbMC","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      left":"530px","top":"885px","height-
     A                                      ":"15px","width":"40px","locked in -
     A                                      place":"false","css c')
     A                                  1  2HTML('lass 2":"textbox"},{"id":"Txb-
     A                                      PostRecoveryType5","field type":"te-
     A                                      xtbox","css class":"input","descrip-
     A                                      tion":"Type","value":{"fieldName":"-
     A                                      scPstRTyp5","dataLength":"1","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none",-
     A                                      "designValue":"[scPstRTyp5]"},"text-
     A                                       align":"right","text transform":"u-
     A                                      ppercase","disabled":{"fieldName":"-
     A                                      dsbMC","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"left":"590px","top":"86-
     A                                      0px","height":"15px","width":"40px"-
     A                                      ,"locked in place":"false","css cla-
     A                                      ss 2":"textbox"},{"id":"TxbPostReco-
     A                                      veryLevel5","field type":"textbox",-
     A                                      "css class":"input","description":"-
     A                                      Type","value":{"fieldName":"scPstRL-
     A                                      vl5","dataLength":"3","decPos":"0",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","numBlankFill":"false","zeroFil-
     A                                      l":"false","noExtraSpaces":"false",-
     A                                      "curSym":"","dataType":"zoned","for-
     A                                      matting":"Number","negNum":"-999.00-
     A                                      ","units":"","designValue":"[scPstR-
     A                                      Lvl5]"},"text align":"right","text -
     A                                      transform":"uppercase","disabled":{-
     A                                      "fieldName":"dsbMC","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"left":"590-
     A                                      px","top":"885px","height":"15px","-
     A                                      width":"40px","locked in place":"fa-
     A                                      lse","css class 2":"textbox"},{"id"-
     A                                      :"TxbPostRecoveryType6","field type-
     A                                      ":"textbox","css class":"input","de-
     A                                      scription":"Type","value":{"fieldNa-
     A                                      me":"scPstRTyp6","dataLength":"1","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[scPstRTyp6]"},-
     A                                      "text align":"right","text transfor-
     A                                      m":"uppercase","disabled":{"fieldNa-
     A                                      me":"dsbMC","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"left":"650px","top-
     A                                      ":"860px","height":"15px","width":"-
     A                                      40px","locked in place":"false","cs-
     A                                      s class 2":"textbox"},{"id":"TxbPos-
     A                                      tRecoveryLevel6","field type":"text-
     A                                      box","css class":"input","descripti-
     A                                      on":"Type","value":{"fieldName":"sc-
     A                                      PstRLvl6","dataLength":"3","decPos"-
     A                                      :"0","numSep":"false","zeroBalance"-
     A                                      :"false","numBlankFill":"false","ze-
     A                                      roFill":"false","noExtraSpaces":"fa-
     A                                      lse","curSym":"","dataType":"zoned"-
     A                                      ,"formatting":"Number","negNum":"-9-
     A                                      99.00","units":"","designValue":"[s-
     A                                      cPstRLvl6]"},"text align":"right","-
     A                                      text transform":"uppercase","disabl-
     A                                      ed":{"fieldName":"dsbMC","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"true /')
     A                                  1  2HTML(' false"},"left":"650px","top"-
     A                                      :"885px","height":"15px","width":"4-
     A                                      0px","locked in place":"false","css-
     A                                       class 2":"textbox"},{"id":"TxbPost-
     A                                      RecoveryType7","field type":"textbo-
     A                                      x","css class":"input","description-
     A                                      ":"Type","value":{"fieldName":"scPs-
     A                                      tRTyp7","dataLength":"1","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none","des-
     A                                      ignValue":"[scPstRTyp7]"},"text ali-
     A                                      gn":"right","text transform":"upper-
     A                                      case","disabled":{"fieldName":"dsbM-
     A                                      C","customTrue":"","customFalse":""-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"left":"710px","top":"860px"-
     A                                      ,"height":"15px","width":"40px","lo-
     A                                      cked in place":"false","css class 2-
     A                                      ":"textbox"},{"id":"TxbPostRecovery-
     A                                      Level7","field type":"textbox","css-
     A                                       class":"input","description":"Type-
     A                                      ","value":{"fieldName":"scPstRLvl7"-
     A                                      ,"dataLength":"3","decPos":"0","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "numBlankFill":"false","zeroFill":"-
     A                                      false","noExtraSpaces":"false","cur-
     A                                      Sym":"","dataType":"zoned","formatt-
     A                                      ing":"Number","negNum":"-999.00","u-
     A                                      nits":"","designValue":"[scPstRLvl7-
     A                                      ]"},"text align":"right","text tran-
     A                                      sform":"uppercase","disabled":{"fie-
     A                                      ldName":"dsbMC","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"left":"710px",-
     A                                      "top":"885px","height":"15px","widt-
     A                                      h":"40px","locked in place":"false"-
     A                                      ,"css class 2":"textbox"},{"id":"Tx-
     A                                      bPostRecoveryType8","field type":"t-
     A                                      extbox","css class":"input","descri-
     A                                      ption":"Type","value":{"fieldName":-
     A                                      "scPstRTyp8","dataLength":"1","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[scPstRTyp8]"},"tex-
     A                                      t align":"right","text transform":"-
     A                                      uppercase","disabled":{"fieldName":-
     A                                      "dsbMC","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"left":"770px","top":"8-
     A                                      60px","height":"15px","width":"40px-
     A                                      ","locked in place":"false","css cl-
     A                                      ass 2":"textbox"},{"id":"TxbPostRec-
     A                                      overyLevel8","field type":"textbox"-
     A                                      ,"css class":"input","description":-
     A                                      "Type","value":{"fieldName":"scPstR-
     A                                      Lvl8","dataLength":"3","decPos":"0"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","numBlankFill":"false","zeroFi-
     A                                      ll":"false","noExtraSpaces":"false"-
     A                                      ,"curSym":"","dataType":"zoned","fo-
     A                                      rmatting":"Number","negNum":"-999.0-
     A                                      0","units":"","designValue":"[scPst-
     A                                      RLvl8]"},"text align":"right","text-
     A                                       transform":"uppercase","disabled":-
     A                                      {"fieldName":"dsbMC",')
     A                                  1  2HTML('"customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"left":"770px","top":"885-
     A                                      px","height":"15px","width":"40px",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"textbox"},{"id":"TxbPostRecov-
     A                                      eryType9","field type":"textbox","c-
     A                                      ss class":"input","description":"Ty-
     A                                      pe","value":{"fieldName":"scPstRTyp-
     A                                      9","dataLength":"1","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[scPstRTyp9]"},"text align":"-
     A                                      right","text transform":"uppercase"-
     A                                      ,"disabled":{"fieldName":"dsbMC","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"left":"830px","top":"860px","hei-
     A                                      ght":"15px","width":"40px","locked -
     A                                      in place":"false","css class 2":"te-
     A                                      xtbox"},{"id":"TxbPostRecoveryLevel-
     A                                      9","field type":"textbox","css clas-
     A                                      s":"input","description":"Type","va-
     A                                      lue":{"fieldName":"scPstRLvl9","dat-
     A                                      aLength":"3","decPos":"0","numSep":-
     A                                      "false","zeroBalance":"false","numB-
     A                                      lankFill":"false","zeroFill":"false-
     A                                      ","noExtraSpaces":"false","curSym":-
     A                                      "","dataType":"zoned","formatting":-
     A                                      "Number","negNum":"-999.00","units"-
     A                                      :"","designValue":"[scPstRLvl9]"},"-
     A                                      text align":"right","text transform-
     A                                      ":"uppercase","disabled":{"fieldNam-
     A                                      e":"dsbMC","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"left":"830px","top"-
     A                                      :"885px","height":"15px","width":"4-
     A                                      0px","locked in place":"false","css-
     A                                       class 2":"textbox"},{"id":"TxbPost-
     A                                      RecoveryType10","field type":"textb-
     A                                      ox","css class":"input","descriptio-
     A                                      n":"Type","value":{"fieldName":"scP-
     A                                      stRTy10","dataLength":"1","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[scPstRTy10]"},"text al-
     A                                      ign":"right","text transform":"uppe-
     A                                      rcase","disabled":{"fieldName":"dsb-
     A                                      MC","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"left":"890px","top":"860px-
     A                                      ","height":"15px","width":"40px","l-
     A                                      ocked in place":"false","css class -
     A                                      2":"textbox"},{"id":"TxbPostRecover-
     A                                      yLevel10","field type":"textbox","c-
     A                                      ss class":"input","description":"Ty-
     A                                      pe","value":{"fieldName":"scPstRLv1-
     A                                      0","dataLength":"3","decPos":"0","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","numBlankFill":"false","zeroFill"-
     A                                      :"false","noExtraSpaces":"false","c-
     A                                      urSym":"","dataType":"zoned","forma-
     A                                      tting":"Number","negNum":"-999.00",-
     A                                      "units":"","designVal')
     A                                  1  2HTML('ue":"[scPstRLv10]"},"text ali-
     A                                      gn":"right","text transform":"upper-
     A                                      case","disabled":{"fieldName":"dsbM-
     A                                      C","customTrue":"","customFalse":""-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"left":"890px","top":"885px"-
     A                                      ,"height":"15px","width":"40px","lo-
     A                                      cked in place":"false","css class 2-
     A                                      ":"textbox"},{"id":"LblAddEditMulti-
     A                                      ClaimLevel_copy7","field type":"out-
     A                                      put field","css class":"label","val-
     A                                      ue":"Level","left":"290px","top":"8-
     A                                      85px","width":"45px"},{"id":"LblAdd-
     A                                      EditMultiClaim_copy8","field type":-
     A                                      "output field","css class":"label",-
     A                                      "value":"Override Duplicate Payment-
     A                                      ","left":"265px","top":"920px","wid-
     A                                      th":"200px","locked in place":"fals-
     A                                      e","visibility":{"fieldName":"ShowC-
     A                                      lmCfg","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"}},{"id":"LblAddEdit-
     A                                      MultiClaimType_copy8","field type":-
     A                                      "output field","css class":"label",-
     A                                      "value":"Type","left":"290px","top"-
     A                                      :"940px","width":"45px"},{"id":"Txb-
     A                                      OvrDupPayType1","field type":"textb-
     A                                      ox","css class":"input","descriptio-
     A                                      n":"Type","value":{"fieldName":"scO-
     A                                      DPtTyp1","dataLength":"1","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[scODPtTyp1]"},"text al-
     A                                      ign":"right","text transform":"uppe-
     A                                      rcase","disabled":{"fieldName":"dsb-
     A                                      MC","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"left":"350px","top":"940px-
     A                                      ","height":"15px","width":"40px","l-
     A                                      ocked in place":"false","css class -
     A                                      2":"textbox"},{"id":"TxbOvrDupPayLe-
     A                                      vel1","field type":"textbox","css c-
     A                                      lass":"input","description":"Type",-
     A                                      "value":{"fieldName":"scODPtLvl1","-
     A                                      dataLength":"3","decPos":"0","numSe-
     A                                      p":"false","zeroBalance":"false","n-
     A                                      umBlankFill":"false","zeroFill":"fa-
     A                                      lse","noExtraSpaces":"false","curSy-
     A                                      m":"","dataType":"zoned","formattin-
     A                                      g":"Number","negNum":"-999.00","uni-
     A                                      ts":"","designValue":"[scODPtLvl1]"-
     A                                      },"text align":"right","text transf-
     A                                      orm":"uppercase","disabled":{"field-
     A                                      Name":"dsbMC","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"left":"350px","t-
     A                                      op":"965px","height":"15px","width"-
     A                                      :"40px","locked in place":"false","-
     A                                      css class 2":"textbox"},{"id":"TxbO-
     A                                      vrDupPayType2","field type":"textbo-
     A                                      x","css class":"input","description-
     A                                      ":"Type","value":{"fieldName":"scOD-
     A                                      PtTyp2","dataLength":"1","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransfor')
     A                                  1  2HTML('m":"none","designValue":"[scO-
     A                                      DPtTyp2]"},"text align":"right","te-
     A                                      xt transform":"uppercase","disabled-
     A                                      ":{"fieldName":"dsbMC","customTrue"-
     A                                      :"","customFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"left":"-
     A                                      410px","top":"940px","height":"15px-
     A                                      ","width":"40px","locked in place":-
     A                                      "false","css class 2":"textbox"},{"-
     A                                      id":"TxbOvrDupPayLevel2","field typ-
     A                                      e":"textbox","css class":"input","d-
     A                                      escription":"Type","value":{"fieldN-
     A                                      ame":"scODPtLvl2","dataLength":"3",-
     A                                      "decPos":"0","numSep":"false","zero-
     A                                      Balance":"false","numBlankFill":"fa-
     A                                      lse","zeroFill":"false","noExtraSpa-
     A                                      ces":"false","curSym":"","dataType"-
     A                                      :"zoned","formatting":"Number","neg-
     A                                      Num":"-999.00","units":"","designVa-
     A                                      lue":"[scODPtLvl2]"},"text align":"-
     A                                      right","text transform":"uppercase"-
     A                                      ,"disabled":{"fieldName":"dsbMC","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"left":"410px","top":"965px","hei-
     A                                      ght":"15px","width":"40px","locked -
     A                                      in place":"false","css class 2":"te-
     A                                      xtbox"},{"id":"TxbOvrDupPayType3","-
     A                                      field type":"textbox","css class":"-
     A                                      input","description":"Type","value"-
     A                                      :{"fieldName":"scODPtTyp3","dataLen-
     A                                      gth":"1","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none","designValue":"[scOD-
     A                                      PtTyp3]"},"text align":"right","tex-
     A                                      t transform":"uppercase","disabled"-
     A                                      :{"fieldName":"dsbMC","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"left":"4-
     A                                      70px","top":"940px","height":"15px"-
     A                                      ,"width":"40px","locked in place":"-
     A                                      false","css class 2":"textbox"},{"i-
     A                                      d":"TxbOvrDupPayLevel3","field type-
     A                                      ":"textbox","css class":"input","de-
     A                                      scription":"Type","value":{"fieldNa-
     A                                      me":"scODPtLvl3","dataLength":"3","-
     A                                      decPos":"0","numSep":"false","zeroB-
     A                                      alance":"false","numBlankFill":"fal-
     A                                      se","zeroFill":"false","noExtraSpac-
     A                                      es":"false","curSym":"","dataType":-
     A                                      "zoned","formatting":"Number","negN-
     A                                      um":"-999.00","units":"","designVal-
     A                                      ue":"[scODPtLvl3]"},"text align":"r-
     A                                      ight","text transform":"uppercase",-
     A                                      "disabled":{"fieldName":"dsbMC","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"left":"470px","top":"965px","heig-
     A                                      ht":"15px","width":"40px","locked i-
     A                                      n place":"false","css class 2":"tex-
     A                                      tbox"},{"id":"TxbOvrDupPayType4","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","description":"Type","value":-
     A                                      {"fieldName":"scODPtTyp4","dataLeng-
     A                                      th":"1","trimLeading":"false","trim-
     A                                      Trailing":"true","bla')
     A                                  1  2HTML('nkFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[scODPtTyp4]"},"text -
     A                                      align":"right","text transform":"up-
     A                                      percase","disabled":{"fieldName":"d-
     A                                      sbMC","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"left":"530px","top":"940-
     A                                      px","height":"15px","width":"40px",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"textbox"},{"id":"TxbOvrDupPay-
     A                                      Level4","field type":"textbox","css-
     A                                       class":"input","description":"Type-
     A                                      ","value":{"fieldName":"scODPtLvl4"-
     A                                      ,"dataLength":"3","decPos":"0","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "numBlankFill":"false","zeroFill":"-
     A                                      false","noExtraSpaces":"false","cur-
     A                                      Sym":"","dataType":"zoned","formatt-
     A                                      ing":"Number","negNum":"-999.00","u-
     A                                      nits":"","designValue":"[scODPtLvl4-
     A                                      ]"},"text align":"right","text tran-
     A                                      sform":"uppercase","disabled":{"fie-
     A                                      ldName":"dsbMC","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"left":"530px",-
     A                                      "top":"965px","height":"15px","widt-
     A                                      h":"40px","locked in place":"false"-
     A                                      ,"css class 2":"textbox"},{"id":"Tx-
     A                                      bOvrDupPayType5","field type":"text-
     A                                      box","css class":"input","descripti-
     A                                      on":"Type","value":{"fieldName":"sc-
     A                                      ODPtTyp5","dataLength":"1","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none","d-
     A                                      esignValue":"[scODPtTyp5]"},"text a-
     A                                      lign":"right","text transform":"upp-
     A                                      ercase","disabled":{"fieldName":"ds-
     A                                      bMC","customTrue":"","customFalse":-
     A                                      "","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"left":"590px","top":"940p-
     A                                      x","height":"15px","width":"40px","-
     A                                      locked in place":"false","css class-
     A                                       2":"textbox"},{"id":"TxbOvrDupPayL-
     A                                      evel5","field type":"textbox","css -
     A                                      class":"input","description":"Type"-
     A                                      ,"value":{"fieldName":"scODPtLvl5",-
     A                                      "dataLength":"3","decPos":"0","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      numBlankFill":"false","zeroFill":"f-
     A                                      alse","noExtraSpaces":"false","curS-
     A                                      ym":"","dataType":"zoned","formatti-
     A                                      ng":"Number","negNum":"-999.00","un-
     A                                      its":"","designValue":"[scODPtLvl5]-
     A                                      "},"text align":"right","text trans-
     A                                      form":"uppercase","disabled":{"fiel-
     A                                      dName":"dsbMC","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"left":"590px","-
     A                                      top":"965px","height":"15px","width-
     A                                      ":"40px","locked in place":"false",-
     A                                      "css class 2":"textbox"},{"id":"Txb-
     A                                      OvrDupPayType6","field type":"textb-
     A                                      ox","css class":"input","descriptio-
     A                                      n":"Type","value":{"f')
     A                                  1  2HTML('ieldName":"scODPtTyp6","dataL-
     A                                      ength":"1","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none","designValue":"[sc-
     A                                      ODPtTyp6]"},"text align":"right","t-
     A                                      ext transform":"uppercase","disable-
     A                                      d":{"fieldName":"dsbMC","customTrue-
     A                                      ":"","customFalse":"","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"left":-
     A                                      "650px","top":"940px","height":"15p-
     A                                      x","width":"40px","locked in place"-
     A                                      :"false","css class 2":"textbox"},{-
     A                                      "id":"TxbOvrDupPayLevel6","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      description":"Type","value":{"field-
     A                                      Name":"scODPtLvl6","dataLength":"3"-
     A                                      ,"decPos":"0","numSep":"false","zer-
     A                                      oBalance":"false","numBlankFill":"f-
     A                                      alse","zeroFill":"false","noExtraSp-
     A                                      aces":"false","curSym":"","dataType-
     A                                      ":"zoned","formatting":"Number","ne-
     A                                      gNum":"-999.00","units":"","designV-
     A                                      alue":"[scODPtLvl6]"},"text align":-
     A                                      "right","text transform":"uppercase-
     A                                      ","disabled":{"fieldName":"dsbMC","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"left":"650px","top":"965px","he-
     A                                      ight":"15px","width":"40px","locked-
     A                                       in place":"false","css class 2":"t-
     A                                      extbox"},{"id":"TxbOvrDupPayType7",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","description":"Type","value-
     A                                      ":{"fieldName":"scODPtTyp7","dataLe-
     A                                      ngth":"1","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[scO-
     A                                      DPtTyp7]"},"text align":"right","te-
     A                                      xt transform":"uppercase","disabled-
     A                                      ":{"fieldName":"dsbMC","customTrue"-
     A                                      :"","customFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"left":"-
     A                                      710px","top":"940px","height":"15px-
     A                                      ","width":"40px","locked in place":-
     A                                      "false","css class 2":"textbox"},{"-
     A                                      id":"TxbOvrDupPayLevel7","field typ-
     A                                      e":"textbox","css class":"input","d-
     A                                      escription":"Type","value":{"fieldN-
     A                                      ame":"scODPtLvl7","dataLength":"3",-
     A                                      "decPos":"0","numSep":"false","zero-
     A                                      Balance":"false","numBlankFill":"fa-
     A                                      lse","zeroFill":"false","noExtraSpa-
     A                                      ces":"false","curSym":"","dataType"-
     A                                      :"zoned","formatting":"Number","neg-
     A                                      Num":"-999.00","units":"","designVa-
     A                                      lue":"[scODPtLvl7]"},"text align":"-
     A                                      right","text transform":"uppercase"-
     A                                      ,"disabled":{"fieldName":"dsbMC","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"left":"710px","top":"965px","hei-
     A                                      ght":"15px","width":"40px","locked -
     A                                      in place":"false","css class 2":"te-
     A                                      xtbox"},{"id":"TxbOvr')
     A                                  1  2HTML('DupPayType8","field type":"te-
     A                                      xtbox","css class":"input","descrip-
     A                                      tion":"Type","value":{"fieldName":"-
     A                                      scODPtTyp8","dataLength":"1","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none",-
     A                                      "designValue":"[scODPtTyp8]"},"text-
     A                                       align":"right","text transform":"u-
     A                                      ppercase","disabled":{"fieldName":"-
     A                                      dsbMC","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"left":"770px","top":"94-
     A                                      0px","height":"15px","width":"40px"-
     A                                      ,"locked in place":"false","css cla-
     A                                      ss 2":"textbox"},{"id":"TxbOvrDupPa-
     A                                      yLevel8","field type":"textbox","cs-
     A                                      s class":"input","description":"Typ-
     A                                      e","value":{"fieldName":"scODPtLvl8-
     A                                      ","dataLength":"3","decPos":"0","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"numBlankFill":"false","zeroFill":-
     A                                      "false","noExtraSpaces":"false","cu-
     A                                      rSym":"","dataType":"zoned","format-
     A                                      ting":"Number","negNum":"-999.00","-
     A                                      units":"","designValue":"[scODPtLvl-
     A                                      8]"},"text align":"right","text tra-
     A                                      nsform":"uppercase","disabled":{"fi-
     A                                      eldName":"dsbMC","customTrue":"","c-
     A                                      ustomFalse":"","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"left":"770px"-
     A                                      ,"top":"965px","height":"15px","wid-
     A                                      th":"40px","locked in place":"false-
     A                                      ","css class 2":"textbox"},{"id":"T-
     A                                      xbOvrDupPayType9","field type":"tex-
     A                                      tbox","css class":"input","descript-
     A                                      ion":"Type","value":{"fieldName":"s-
     A                                      cODPtTyp9","dataLength":"1","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[scODPtTyp9]"},"text -
     A                                      align":"right","text transform":"up-
     A                                      percase","disabled":{"fieldName":"d-
     A                                      sbMC","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"left":"830px","top":"940-
     A                                      px","height":"15px","width":"40px",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"textbox"},{"id":"TxbOvrDupPay-
     A                                      Level9","field type":"textbox","css-
     A                                       class":"input","description":"Type-
     A                                      ","value":{"fieldName":"scODPtLvl9"-
     A                                      ,"dataLength":"3","decPos":"0","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "numBlankFill":"false","zeroFill":"-
     A                                      false","noExtraSpaces":"false","cur-
     A                                      Sym":"","dataType":"zoned","formatt-
     A                                      ing":"Number","negNum":"-999.00","u-
     A                                      nits":"","designValue":"[scODPtLvl9-
     A                                      ]"},"text align":"right","text tran-
     A                                      sform":"uppercase","disabled":{"fie-
     A                                      ldName":"dsbMC","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"left":"830px",-
     A                                      "top":"965px","height')
     A                                  1  2HTML('":"15px","width":"40px","lock-
     A                                      ed in place":"false","css class 2":-
     A                                      "textbox"},{"id":"TxbOvrDupPayType1-
     A                                      0","field type":"textbox","css clas-
     A                                      s":"input","description":"Type","va-
     A                                      lue":{"fieldName":"scODPtTy10","dat-
     A                                      aLength":"1","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      scODPtTy10]"},"text align":"right",-
     A                                      "text transform":"uppercase","disab-
     A                                      led":{"fieldName":"dsbMC","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"left-
     A                                      ":"890px","top":"940px","height":"1-
     A                                      5px","width":"40px","locked in plac-
     A                                      e":"false","css class 2":"textbox"}-
     A                                      ,{"id":"TxbOvrDupPayLevel10","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","description":"Type","value":{"fi-
     A                                      eldName":"scODPtLv10","dataLength":-
     A                                      "3","decPos":"0","numSep":"false","-
     A                                      zeroBalance":"false","numBlankFill"-
     A                                      :"false","zeroFill":"false","noExtr-
     A                                      aSpaces":"false","curSym":"","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "negNum":"-999.00","units":"","desi-
     A                                      gnValue":"[scODPtLv10]"},"text alig-
     A                                      n":"right","text transform":"upperc-
     A                                      ase","disabled":{"fieldName":"dsbMC-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"left":"890px","top":"965px",-
     A                                      "height":"15px","width":"40px","loc-
     A                                      ked in place":"false","css class 2"-
     A                                      :"textbox"},{"id":"LblAddEditMultiC-
     A                                      laimLevel_copy8","field type":"outp-
     A                                      ut field","css class":"label","valu-
     A                                      e":"Level","left":"290px","top":"96-
     A                                      5px","width":"45px"},{"id":"line1_c-
     A                                      opy","field type":"horizontal line"-
     A                                      ,"css class":"line","line style":"D-
     A                                      otted","left":"265px","top":"475px"-
     A                                      ,"height":"1px","width":"950px"},{"-
     A                                      id":"cbxDefaultPV2","field type":"c-
     A                                      heckbox","css class":"input","value-
     A                                      ":{"fieldName":"scDfltPV2","refFiel-
     A                                      d":"FLAG","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      extTransform":"none","designValue":-
     A                                      "[scDfltPV2]"},"checked value":"Y",-
     A                                      "unchecked value":" N","disabled":{-
     A                                      "fieldName":"dsbMC","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"label":"De-
     A                                      fault the PV2 code for Payment Entr-
     A                                      y","left":"260px","top":"160px","cs-
     A                                      s class 2":"checkbox","tool tip":"T-
     A                                      his will attempt to default the PV2-
     A                                       code from claim information when e-
     A                                      ntering payment transactions.","vis-
     A                                      ibility":{"fieldName":"ShowGnlCfg",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat')
     A                                  1  2HTML('":"visible / hidden"},"onclic-
     A                                      k":"pui.click(\"BtnSaveGeneral\")"}-
     A                                      ]}')
     A            BTNGENSAV      1A  H
     A            DSBMC          1A  H
     A            ISDSBLGEN      1A  H
     A            SCADDCLV10     3S 0H
     A            SCADDCLVL1     3S 0H
     A            SCADDCLVL2     3S 0H
     A            SCADDCLVL3     3S 0H
     A            SCADDCLVL4     3S 0H
     A            SCADDCLVL5     3S 0H
     A            SCADDCLVL6     3S 0H
     A            SCADDCLVL7     3S 0H
     A            SCADDCLVL8     3S 0H
     A            SCADDCLVL9     3S 0H
     A            SCADDCTY10     1A  H
     A            SCADDCTYP1     1A  H
     A            SCADDCTYP2     1A  H
     A            SCADDCTYP3     1A  H
     A            SCADDCTYP4     1A  H
     A            SCADDCTYP5     1A  H
     A            SCADDCTYP6     1A  H
     A            SCADDCTYP7     1A  H
     A            SCADDCTYP8     1A  H
     A            SCADDCTYP9     1A  H
     A            SCADSTLV10     3S 0H
     A            SCADSTLVL1     3S 0H
     A            SCADSTLVL2     3S 0H
     A            SCADSTLVL3     3S 0H
     A            SCADSTLVL4     3S 0H
     A            SCADSTLVL5     3S 0H
     A            SCADSTLVL6     3S 0H
     A            SCADSTLVL7     3S 0H
     A            SCADSTLVL8     3S 0H
     A            SCADSTLVL9     3S 0H
     A            SCADSTTY10     1A  H
     A            SCADSTTYP1     1A  H
     A            SCADSTTYP2     1A  H
     A            SCADSTTYP3     1A  H
     A            SCADSTTYP4     1A  H
     A            SCADSTTYP5     1A  H
     A            SCADSTTYP6     1A  H
     A            SCADSTTYP7     1A  H
     A            SCADSTTYP8     1A  H
     A            SCADSTTYP9     1A  H
     A            SCAEMCLV10     3S 0H
     A            SCAEMCLVL1     3S 0H
     A            SCAEMCLVL2     3S 0H
     A            SCAEMCLVL3     3S 0H
     A            SCAEMCLVL4     3S 0H
     A            SCAEMCLVL5     3S 0H
     A            SCAEMCLVL6     3S 0H
     A            SCAEMCLVL7     3S 0H
     A            SCAEMCLVL8     3S 0H
     A            SCAEMCLVL9     3S 0H
     A            SCAEMCTY10     1A  H
     A            SCAEMCTYP1     1A  H
     A            SCAEMCTYP2     1A  H
     A            SCAEMCTYP3     1A  H
     A            SCAEMCTYP4     1A  H
     A            SCAEMCTYP5     1A  H
     A            SCAEMCTYP6     1A  H
     A            SCAEMCTYP7     1A  H
     A            SCAEMCTYP8     1A  H
     A            SCAEMCTYP9     1A  H
     A            SCDELCLV10     3S 0H
     A            SCDELCLVL1     3S 0H
     A            SCDELCLVL2     3S 0H
     A            SCDELCLVL3     3S 0H
     A            SCDELCLVL4     3S 0H
     A            SCDELCLVL5     3S 0H
     A            SCDELCLVL6     3S 0H
     A            SCDELCLVL7     3S 0H
     A            SCDELCLVL8     3S 0H
     A            SCDELCLVL9     3S 0H
     A            SCDELCTY10     1A  H
     A            SCDELCTYP1     1A  H
     A            SCDELCTYP2     1A  H
     A            SCDELCTYP3     1A  H
     A            SCDELCTYP4     1A  H
     A            SCDELCTYP5     1A  H
     A            SCDELCTYP6     1A  H
     A            SCDELCTYP7     1A  H
     A            SCDELCTYP8     1A  H
     A            SCDELCTYP9     1A  H
     A            SCMANPLV10     3S 0H
     A            SCMANPLVL1     3S 0H
     A            SCMANPLVL2     3S 0H
     A            SCMANPLVL3     3S 0H
     A            SCMANPLVL4     3S 0H
     A            SCMANPLVL5     3S 0H
     A            SCMANPLVL6     3S 0H
     A            SCMANPLVL7     3S 0H
     A            SCMANPLVL8     3S 0H
     A            SCMANPLVL9     3S 0H
     A            SCMANPTY10     1A  H
     A            SCMANPTYP1     1A  H
     A            SCMANPTYP2     1A  H
     A            SCMANPTYP3     1A  H
     A            SCMANPTYP4     1A  H
     A            SCMANPTYP5     1A  H
     A            SCMANPTYP6     1A  H
     A            SCMANPTYP7     1A  H
     A            SCMANPTYP8     1A  H
     A            SCMANPTYP9     1A  H
     A            SCODPTLV10     3S 0H
     A            SCODPTLVL1     3S 0H
     A            SCODPTLVL2     3S 0H
     A            SCODPTLVL3     3S 0H
     A            SCODPTLVL4     3S 0H
     A            SCODPTLVL5     3S 0H
     A            SCODPTLVL6     3S 0H
     A            SCODPTLVL7     3S 0H
     A            SCODPTLVL8     3S 0H
     A            SCODPTLVL9     3S 0H
     A            SCODPTTY10     1A  H
     A            SCODPTTYP1     1A  H
     A            SCODPTTYP2     1A  H
     A            SCODPTTYP3     1A  H
     A            SCODPTTYP4     1A  H
     A            SCODPTTYP5     1A  H
     A            SCODPTTYP6     1A  H
     A            SCODPTTYP7     1A  H
     A            SCODPTTYP8     1A  H
     A            SCODPTTYP9     1A  H
     A            SCPAYRLV10     3S 0H
     A            SCPAYRLVL1     3S 0H
     A            SCPAYRLVL2     3S 0H
     A            SCPAYRLVL3     3S 0H
     A            SCPAYRLVL4     3S 0H
     A            SCPAYRLVL5     3S 0H
     A            SCPAYRLVL6     3S 0H
     A            SCPAYRLVL7     3S 0H
     A            SCPAYRLVL8     3S 0H
     A            SCPAYRLVL9     3S 0H
     A            SCPAYRTY10     1A  H
     A            SCPAYRTYP1     1A  H
     A            SCPAYRTYP2     1A  H
     A            SCPAYRTYP3     1A  H
     A            SCPAYRTYP4     1A  H
     A            SCPAYRTYP5     1A  H
     A            SCPAYRTYP6     1A  H
     A            SCPAYRTYP7     1A  H
     A            SCPAYRTYP8     1A  H
     A            SCPAYRTYP9     1A  H
     A            SCPSTRLV10     3S 0H
     A            SCPSTRLVL1     3S 0H
     A            SCPSTRLVL2     3S 0H
     A            SCPSTRLVL3     3S 0H
     A            SCPSTRLVL4     3S 0H
     A            SCPSTRLVL5     3S 0H
     A            SCPSTRLVL6     3S 0H
     A            SCPSTRLVL7     3S 0H
     A            SCPSTRLVL8     3S 0H
     A            SCPSTRLVL9     3S 0H
     A            SCPSTRTY10     1A  H
     A            SCPSTRTYP1     1A  H
     A            SCPSTRTYP2     1A  H
     A            SCPSTRTYP3     1A  H
     A            SCPSTRTYP4     1A  H
     A            SCPSTRTYP5     1A  H
     A            SCPSTRTYP6     1A  H
     A            SCPSTRTYP7     1A  H
     A            SCPSTRTYP8     1A  H
     A            SCPSTRTYP9     1A  H
     A            SCRECTLV10     3S 0H
     A            SCRECTLVL1     3S 0H
     A            SCRECTLVL2     3S 0H
     A            SCRECTLVL3     3S 0H
     A            SCRECTLVL4     3S 0H
     A            SCRECTLVL5     3S 0H
     A            SCRECTLVL6     3S 0H
     A            SCRECTLVL7     3S 0H
     A            SCRECTLVL8     3S 0H
     A            SCRECTLVL9     3S 0H
     A            SCRECTTY10     1A  H
     A            SCRECTTYP1     1A  H
     A            SCRECTTYP2     1A  H
     A            SCRECTTYP3     1A  H
     A            SCRECTTYP4     1A  H
     A            SCRECTTYP5     1A  H
     A            SCRECTTYP6     1A  H
     A            SCRECTTYP7     1A  H
     A            SCRECTTYP8     1A  H
     A            SCRECTTYP9     1A  H
     A            SHOWCLMCFG     1A  H
     A            SHOWGNLCFG     1A  H
     A            STRHELP      250A  H
     A            Q1CUSR    R        H      REFFLD(Q1CUSR SZQ1P)
     A            Q1JOB     R        H      REFFLD(Q1JOB SZQ1P)
     A            Q1JOBN    R        H      REFFLD(Q1JOBN SZQ1P)
     A            SCDFLTPV2 R        H      REFFLD(FLAG)
     A            SCGENCLM  R        H      REFFLD(FLAG)
     A            SCINQAUTO R        H      REFFLD(FLAG)
     A          R RCDIMPEXP
     A                                  1  2HTML('QPUIREC9    ROVERLAY   0     -
     A                                      RASSUME    0     RROWS      2    C1-
     A                                          1C1    1 REMSG      2    C19   -
     A                                      TxbFromEmailAddressFMGMUTINCL FERFI-
     A                                      MEMAD REMSG      2    C19   TxbFrom-
     A                                      EmailAddressFMGFIMEMAD FERFIMEMAD2R-
     A                                      EMSG      2    C17   TxbToEmailAddr-
     A                                      essFMGMUTINCL FERTIMEMAD REMSG     -
     A                                       2    C17   TxbToEmailAddressFMGTIM-
     A                                      EMAD FERTIMEMAD2REMSG      2    C15-
     A                                         TxbEmailSubjectFMGMUTINCL FERIMS-
     A                                      UB   REMSG      2    C12   TxaEmail-
     A                                      BodyFMGMUTINCL FERIMBODY  ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdImpExp","description":"Impor-
     A                                      t/Export Settings","external css":"-
     A                                      label","overlay":"true","overlay ra-
     A                                      nge":"1-1","design overlay formats"-
     A                                      :"RcdPanel","assume":"true"},"items-
     A                                      ":[{"id":"LblReport","field type":"-
     A                                      output field","css class":"label","-
     A                                      value":"Report","left":"270px","top-
     A                                      ":"145px","width":"150px"},{"id":"O-
     A                                      utClaimImport","field type":"output-
     A                                       field","css class":"heading","valu-
     A                                      e":"Claim Import","text align":"lef-
     A                                      t","left":"265px","top":"110px","wi-
     A                                      dth":"200px","z index":"51","headin-
     A                                      g type":"Section Header"},{"id":"Lb-
     A                                      lFromEmailAddress","field type":"ou-
     A                                      tput field","css class":"label","va-
     A                                      lue":"From Email Address","left":"3-
     A                                      00px","top":"175px","width":"150px"-
     A                                      },{"id":"LblToEmailAddress","field -
     A                                      type":"output field","css class":"l-
     A                                      abel","value":"To Email Address","l-
     A                                      eft":"300px","top":"225px","width":-
     A                                      "150px"},{"id":"LblEmailSubject","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"label","value":"Email Subject",-
     A                                      "left":"300px","top":"275px","width-
     A                                      ":"150px"},{"id":"LblEmailSubject_c-
     A                                      opy","field type":"output field","c-
     A                                      ss class":"label","value":"Email Bo-
     A                                      dy","left":"300px","top":"325px","w-
     A                                      idth":"150px"},{"id":"TxbFromEmailA-
     A                                      ddress","field type":"textbox","css-
     A                                       class":"textbox","value":{"fieldNa-
     A                                      me":"scFIMEMAD","dataLength":"60","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[scFIMEMAD]"},"-
     A                                      left":"300px","top":"190px","requir-
     A                                      ed":"false","width":"370px","error -
     A                                      messages":"2 messages","error messa-
     A                                      ge":{"fieldName":"mgMutIncl","dataL-
     A                                      ength":"70","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none"},"error condition-
     A                                      ":{"fieldName":"erFimEmAd","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error enha-
     A                                      nced mode":"1","error message 2":{"-
     A                                      fieldName":"mgFimEmAd","dataLength"-
     A                                      :"200","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"},"error condition 2":{-
     A                                      "fieldName":"erFimEmad2","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error enhanc-
     A                                      ed mode 2":"1"},{"id":"TxbToEmailAd-
     A                                      dress","field type":"textbox","css -
     A                                      class":"textbox","value":{"fieldNam-
     A                                      e":"scTIMEMAD","dataLength":"60","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataTyp')
     A                                  1  2HTML('e":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[scTIMEMAD]"},"required":"false-
     A                                      ","left":"300px","top":"240px","wid-
     A                                      th":"370px","error messages":"2 mes-
     A                                      sages","error message":{"fieldName"-
     A                                      :"mgMutIncl","dataLength":"70","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "},"error condition":{"fieldName":"-
     A                                      erTimEmAd","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error enhanced mode":"1","-
     A                                      error message 2":{"fieldName":"mgTi-
     A                                      mEmAd","dataLength":"200","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none"},"e-
     A                                      rror condition 2":{"fieldName":"erT-
     A                                      imEmad2","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error enhanced mode 2":"1"},-
     A                                      {"id":"TxbEmailSubject","field type-
     A                                      ":"textbox","css class":"textbox","-
     A                                      value":{"fieldName":"scIMSUB","data-
     A                                      Length":"100","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none","designValue":"-
     A                                      [scIMSUB]"},"required":"false","lef-
     A                                      t":"300px","top":"290px","width":"3-
     A                                      70px","error messages":"1 message",-
     A                                      "error message":{"fieldName":"mgMut-
     A                                      Incl","dataLength":"70","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"},"err-
     A                                      or condition":{"fieldName":"erImSub-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error enhanced mode":"1"},{"id":"Tx-
     A                                      aEmailBody","field type":"text area-
     A                                      ","css class":"textarea","value":{"-
     A                                      fieldName":"scIMBody","dataLength":-
     A                                      "250","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[scIMBod-
     A                                      y]"},"left":"300px","top":"340px","-
     A                                      width":"370px","height":"55px","err-
     A                                      or messages":"1 message","error mes-
     A                                      sage":{"fieldName":"mgMutIncl","dat-
     A                                      aLength":"70","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"},"error conditi-
     A                                      on":{"fieldName":"erImBody","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error enh-
     A                                      anced mode":"1"}]}')
     A            ERFIMEMAD      1A  H
     A            ERFIMEMAD2     1A  H
     A            ERIMBODY       1A  H
     A            ERIMSUB        1A  H
     A            ERTIMEMAD      1A  H
     A            ERTIMEMAD2     1A  H
     A            MGFIMEMAD    200A  H
     A            MGMUTINCL     70A  H
     A            MGTIMEMAD    200A  H
     A            SCFIMEMAD     60A  H
     A            SCIMBODY     250A  H
     A            SCIMSUB      100A  H
     A            SCTIMEMAD     60A  H
     A          R RCDSAVE
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RWINDOW    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"rcdSave","description":"Data Sa-
     A                                      ved Popup","overlay":"true","show a-
     A                                      s window":"true"},"items":[{"id":"P-
     A                                      nlDataSaved","field type":"panel","-
     A                                      css class":"dialog","description":"-
     A                                      Data Saved popup panel","panel styl-
     A                                      e":"Transform Dialog","value":"Data-
     A                                       Saved","left":"475px","top":"285px-
     A                                      ","height":"125px","width":"325px",-
     A                                      "z index":"8","locked in place":"fa-
     A                                      lse"},{"id":"OutDataSavedText","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"output-field","description":"Data-
     A                                       Saved popup text","value":"Data su-
     A                                      ccessfully saved","text align":"cen-
     A                                      ter","left":"485px","top":"330px","-
     A                                      width":"300px"},{"id":"BtnDataSaved-
     A                                      Ok","field type":"button","css clas-
     A                                      s":"button","description":"Data Sav-
     A                                      ed popup Ok button","value":"OK","r-
     A                                      esponse":{"fieldName":"saveOK","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"left-
     A                                      ":"585px","top":"370px","width":"10-
     A                                      0px","cursor":"default"}]}')
     A            SAVEOK         1A  H
