     A                                      REF(*LIBL/WREFP)
     A                                      INDARA
     A          R RCDTABDEL
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RASSUME    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdTabDel","description":"Deduc-
     A                                      tible Billing Deletion","overlay":"-
     A                                      true","assume":"true","onload":"//p-
     A                                      ui.buildFKeyMenu({skipHelp: true, a-
     A                                      vailableKeys: file + \"_\" + format-
     A                                       + \"_\" + \"avKeys\", fkeyMenuId:f-
     A                                      ile + \"_\" + format + \"_\" + \"fk-
     A                                      eyMenu\" })"},"items":[{"id":"TabDe-
     A                                      dBillingDeletion","field type":"tab-
     A                                       panel","css class":"tab-panel","va-
     A                                      lue":"value text","left":"250px","t-
     A                                      op":"70px","width":"1000px","height-
     A                                      ":{"fieldName":"TabHeight","dataLen-
     A                                      gth":"5","decPos":"0","numSep":"fal-
     A                                      se","zeroBalance":"false","numBlank-
     A                                      Fill":"false","zeroFill":"false","c-
     A                                      urSym":"","dataType":"zoned","forma-
     A                                      tting":"Number","negNum":"-999.00",-
     A                                      "units":"px","designValue":"690px"}-
     A                                      ,"tab names":"Selection Criteria","-
     A                                      z index":"0","tab panel style":"Com-
     A                                      pSuite Tab Panel","active tab":{"fi-
     A                                      eldName":"TabIndex","dataLength":"5-
     A                                      ","decPos":"0","numSep":"false","ze-
     A                                      roBalance":"false","numBlankFill":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","dataType":"zoned","formatting":-
     A                                      "Number","negNum":"-999.00","units"-
     A                                      :""}},{"id":"BtnTabClick_copy","fie-
     A                                      ld type":"button","css class":"butt-
     A                                      on","description":"tab click button-
     A                                      ","value":"Tab","response":{"fieldN-
     A                                      ame":"tabClick","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"shortcut key":"F3","l-
     A                                      eft":"655px","top":"10px","width":"-
     A                                      35px","cursor":"default","visibilit-
     A                                      y":"hidden"},{"id":"BtnExitButton_c-
     A                                      opy","field type":"button","css cla-
     A                                      ss":"button","description":"Exit Bu-
     A                                      tton","value":"Exit","response":{"f-
     A                                      ieldName":"ExitNow","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"shortcut key":"F3-
     A                                      ","left":"700px","top":"10px","widt-
     A                                      h":"100px","cursor":"default","visi-
     A                                      bility":"hidden"},{"id":"btnRefresh-
     A                                      ","field type":"button","css class"-
     A                                      :"button","value":"Refresh","respon-
     A                                      se":{"fieldName":"BtnRefresh","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"left":"-
     A                                      810px","top":"10px","width":"100px"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","shortcut key":"F5"},{"id":"-
     A                                      HdrDedDel","field type":"output fie-
     A                                      ld","css class":"heading","value":"-
     A                                      Deductible Billing Deletion","left"-
     A                                      :"255px","top":"25px","description"-
     A                                      :"Deductible Billing Deletion","wid-
     A                                      th":"395px","heading type":"Page Ti-
     A                                      tle"}]}')
     A            BTNREFRESH     1A  H
     A            EXITNOW        1A  H
     A            TABCLICK       1A  H
     A            TABHEIGHT      5S 0H
     A            TABINDEX       5S 0H
     A          R RCDDEDDEL
     A                                  1  2HTML('QPUIREC7    ROVERLAY   0     -
     A                                      RASSUME    0     RROWS      2    C1-
     A                                          1C1    1 REMSGID    5    C8    -
     A                                      TxbGroupFMSFND     C6    WMESGGC5  -
     A                                        *LIBLC0    FERFND     REMSGID    -
     A                                      5    C11   TxbEmployerFMSEMP#    C6-
     A                                          WMESGGC5    *LIBLC0    FEREMP# -
     A                                         REMSGID    5    C15   CbxAllDivi-
     A                                      sionsFMSALLDIV  C6    WMESGGC5    *-
     A                                      LIBLC0    FERALLDIV  REMSGID    5  -
     A                                        C16   TxbARPostingDateFMSPOSDT   -
     A                                      C6    WMESGGC5    *LIBLC0    FERPOS-
     A                                      DT   ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdDedDel","overlay":"true","ex-
     A                                      ternal css":"label","description":"-
     A                                      Ded Billing Del Rec Format","assume-
     A                                      ":"true","overlay range":"1-1","des-
     A                                      ign overlay formats":"RcdTabDel","h-
     A                                      eader text align":"Left,Right","csv-
     A                                       file name":"Payment Value 1 Codes"-
     A                                      ,"selection value":"A"},"items":[{"-
     A                                      id":"BtnExitBtnAll","field type":"b-
     A                                      utton","css class":"button","descri-
     A                                      ption":"Exit button","value":"Exit"-
     A                                      ,"response":{"fieldName":"ExitNow",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"sh-
     A                                      ortcut key":"F3","left":"750px","to-
     A                                      p":"10px","height":"25px","width":"-
     A                                      100px","cursor":"default","visibili-
     A                                      ty":"hidden"},{"id":"SCUSER","field-
     A                                       type":"output field","css class":"-
     A                                      output-field","value":{"fieldName":-
     A                                      "SCUSER","refField":"USER","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"reference","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[SCUSER]"},"curs-
     A                                      or row":"1","cursor column":"2","le-
     A                                      ft":"285px","top":"50px","css class-
     A                                       2":"top-line","css class 3":"profo-
     A                                      und-converted"},{"id":"SCPRDS","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"output-field","description":"PROG-
     A                                      RAM NAME","value":{"fieldName":"SCP-
     A                                      RDS","designValue":"[SCPRDS]","refF-
     A                                      ield":"NAME","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"cursor row":"2-
     A                                      ","cursor column":"21","left":"370p-
     A                                      x","top":"50px","css class 2":"HI",-
     A                                      "css class 3":"profound-converted",-
     A                                      "visibility":"hidden"},{"id":"SCCON-
     A                                      M","field type":"output field","css-
     A                                       class":"output-field","description-
     A                                      ":"COMPANY NAME","value":{"fieldNam-
     A                                      e":"SCCOMPNAME","dataLength":"60","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[SCCOMPNAME]"}-
     A                                      ,"cursor row":"1","cursor column":"-
     A                                      21","left":"410px","top":"50px","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","css class 4":"profound-conve-
     A                                      rted","visibility":"hidden"},{"id":-
     A                                      "TxbCo#","field type":"textbox","cs-
     A                                      s class":"outputField","value":{"fi-
     A                                      eldName":"scCo#","refField":"ELCO# -
     A                                      WDELP","numSep":"false","zeroBalanc-
     A                                      e":"false","numBlankFill":"false","-
     A                                      zeroFill":"false","noExtraSpaces":"-
     A                                      false","curSym":"","dataType":"refe-
     A                                      rence","formatting":"Number","negNu-
     A                                      m":"-999.00","units":"","designValu-
     A                                      e":"[scCo#]"},"required":"false","a-
     A                                      llow blanks":"true","contains match-
     A                                      ":"true","left":"555px","top":"50px-
     A                                      ","width":"80px","css class 2":"tex-
     A                                      tbox","tab index":"4"')
     A                                  1  2HTML(',"visibility":"hidden"},{"id"-
     A                                      :"LbGroup","field type":"output fie-
     A                                      ld","css class":"label","value":"Gr-
     A                                      oup","left":"280px","top":"115px","-
     A                                      width":"40px"},{"id":"Image1","fiel-
     A                                      d type":"image","css class":"image"-
     A                                      ,"image source":"/profoundui/userda-
     A                                      ta/images/asterisk_orange_small.png-
     A                                      ","left":"320px","top":"115px","hei-
     A                                      ght":"8px","width":"8px"},{"id":"Hd-
     A                                      gSingleEmpl","field type":"output f-
     A                                      ield","css class":"heading","value"-
     A                                      :"To Run for a Single Employer","te-
     A                                      xt align":"left","left":"640px","to-
     A                                      p":"115px","heading type":"Subsecti-
     A                                      on Header"},{"id":"TxbGroup","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","description":"Group Selection Dr-
     A                                      op Down box","value":{"fieldName":"-
     A                                      scFnd","refField":"emfnd wmemp","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"numBlankFill":"false","zeroFill":-
     A                                      "false","noExtraSpaces":"false","cu-
     A                                      rSym":"","dataType":"reference","fo-
     A                                      rmatting":"Number","negNum":"999.00-
     A                                      ","units":"","designValue":"[scFnd]-
     A                                      "},"error messages":"1 message","ch-
     A                                      oices database file":"WMFNP","choic-
     A                                      e options field":"FNFND|| ''-'' ||T-
     A                                      RIM(FNNAME)","choice values field":-
     A                                      "FNFND","choices selection criteria-
     A                                      ":"FNSTAT <> ''I''","contains match-
     A                                      ":"true","left":"280px","top":"130p-
     A                                      x","width":"345px","css class 2":"t-
     A                                      extbox","onchange":"debugger;\n// C-
     A                                      ode for group and Year\nvar group =-
     A                                       get(\"TxbGroup\");\nvar n1 = group-
     A                                      .search(\"-\");\nvar groupid = grou-
     A                                      p.substr(0,n1);\n\nchangeElementVal-
     A                                      ue(''TxbEmployer'','''');\nchangeEl-
     A                                      ementValue(''TxbDivision'','''');\n-
     A                                      changeElementValue(''CbxAllDivision-
     A                                      s'','''');\nchangeElementValue(''Ou-
     A                                      tEmpName'','''');","height":"12px",-
     A                                      "set focus":"true","tab index":"1",-
     A                                      "error message id":{"fieldName":"ms-
     A                                      Fnd","dataLength":"10","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"},"erro-
     A                                      r message file":"WMESGG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"erFnd","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error enhan-
     A                                      ced mode":"1"},{"id":"LblEmployer",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"label","value":"Employer/ Div-
     A                                      ision","left":"640px","top":"130px"-
     A                                      ,"width":"125px"},{"id":"TxbEmploye-
     A                                      r","field type":"textbox","css clas-
     A                                      s":"input","value":{"fieldName":"sc-
     A                                      Emp#","refField":"ememp# wmemp","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"numBlankFill":"false","zeroFill":-
     A                                      "false","noExtraSpaces":"false","cu-
     A                                      rSym":"","dataType":"reference","fo-
     A                                      rmatting":"Number","negNum":"999.00-
     A                                      ","units":"","designValue":"[scEmp#-
     A                                      ]"},"text align":"rig')
     A                                  1  2HTML('ht","error messages":"1 messa-
     A                                      ge","left":"640px","top":"145px","w-
     A                                      idth":"65px","onchange":"// Clear D-
     A                                      ivsion related fields and Employer -
     A                                      Name\n// 06/05/2025 *** Do not pass-
     A                                       Blank in Division  \n// changeElem-
     A                                      entValue(''TxbDivision'','' '');\n -
     A                                        changeElementValue(''TxbDivision'-
     A                                      ','''');\n// 06/05/2025 *** Do not -
     A                                      clear All Divisions Checkbox \n// c-
     A                                      hangeElementValue(''CbxAllDivisions-
     A                                      '','' ''); \nchangeElementValue(''O-
     A                                      utEmpName'','' '');\napplyProperty(-
     A                                      \"TxbDivision\", \"field type\", \"-
     A                                      textbox\");\napplyProperty(\"CbxAll-
     A                                      Divisions\", \"field type\", \"chec-
     A                                      kbox\");\napplyProperty(\"OutEmpNam-
     A                                      e\", \"field type\", \"output field-
     A                                      \");","height":"12px","tab index":"-
     A                                      2","error message id":{"fieldName":-
     A                                      "msEMP#","dataLength":"10","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"},"-
     A                                      error message file":"WMESGG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"erEmp#","cus-
     A                                      tomTrue":"","customFalse":"","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      enhanced mode":"1"},{"id":"LblHypen-
     A                                      1","field type":"output field","css-
     A                                       class":"label","description":"Hyph-
     A                                      en Lable","value":"-","left":"715px-
     A                                      ","top":"145px","width":"10px"},{"i-
     A                                      d":"TxbDivision","field type":"text-
     A                                      box","css class":"input","value":{"-
     A                                      fieldName":"scDiv","refField":"emdi-
     A                                      v wmemp","numSep":"false","zeroBala-
     A                                      nce":"false","numBlankFill":"false"-
     A                                      ,"zeroFill":"false","noExtraSpaces"-
     A                                      :"false","curSym":"","dataType":"re-
     A                                      ference","formatting":"Number","neg-
     A                                      Num":"999.00","units":"","designVal-
     A                                      ue":"[scDiv]"},"left":"725px","top"-
     A                                      :"145px","width":"40px","onchange":-
     A                                      "// Clear All Divsions and Employer-
     A                                       Name\nchangeElementValue(''CbxAllD-
     A                                      ivisions'','' ''); \n// 06/05/2025 -
     A                                      *** Do not clear Employer Name\n// -
     A                                      changeElementValue(''OutEmpName'','-
     A                                      ' '');\napplyProperty(\"CbxAllDivis-
     A                                      ions\", \"field type\", \"checkbox\-
     A                                      ");\napplyProperty(\"OutEmpName\", -
     A                                      \"field type\", \"output field\");\-
     A                                      n","height":"12px","tab index":"3",-
     A                                      "text align":"right"},{"id":"CbxAll-
     A                                      Divisions","field type":"checkbox",-
     A                                      "css class":"checkbox","value":{"fi-
     A                                      eldName":"scAllDiv","dataLength":"1-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[scAllDiv]"}-
     A                                      ,"checked value":"Y","label":"All D-
     A                                      ivisions","left":"800px","top":"145-
     A                                      px","tab index":"5","onclick":"// C-
     A                                      lear Divsion related fields and Emp-
     A                                      loyer Name\nif (getElementValue(Cbx-
     A                                      AllDivisions) == ''Y''')
     A                                  1  2HTML(') {\n// 06/05/2025 *** Do not-
     A                                       pass Blank in Division      \n// c-
     A                                      hangeElementValue(''TxbDivision'','-
     A                                      ' '');\n   changeElementValue(''Txb-
     A                                      Division'','''');\n// 06/05/2025 **-
     A                                      * Do not clear Employer Name\n//   -
     A                                      changeElementValue(''OutEmpName'','-
     A                                      ' '');\n   applyProperty(\"TxbDivis-
     A                                      ion\", \"field type\", \"textbox\")-
     A                                      ;\n   applyProperty(\"OutEmpName\",-
     A                                       \"field type\", \"output field\");-
     A                                      \n}\n","height":"12px","error messa-
     A                                      ges":"1 message","error message id"-
     A                                      :{"fieldName":"MSALLDIV","dataLengt-
     A                                      h":"10","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"},"error message file"-
     A                                      :"WMESGG","error message library":"-
     A                                      *LIBL","error condition":{"fieldNam-
     A                                      e":"erAllDiv","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error enhanced mode":"1-
     A                                      "},{"id":"OutEmpName","field type":-
     A                                      "output field","css class":"output--
     A                                      field","value":{"fieldName":"scEmpN-
     A                                      ame","refField":"emname wmemp","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"reference","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[scEmpName]"}-
     A                                      ,"left":"900px","top":"145px","widt-
     A                                      h":"365px","description":"Employer -
     A                                      Name","height":"12px"},{"id":"LblAR-
     A                                      PostingDate","field type":"output f-
     A                                      ield","css class":"label","value":"-
     A                                      A/R Posting Date","left":"280px","t-
     A                                      op":"165px","width":"110px"},{"id":-
     A                                      "Image3","field type":"image","css -
     A                                      class":"image","image source":"/pro-
     A                                      foundui/userdata/images/asterisk_or-
     A                                      ange_small.png","left":"380px","top-
     A                                      ":"165px","height":"8px","width":"8-
     A                                      px"},{"id":"TxbARPostingDate","fiel-
     A                                      d type":"date field","css class":"i-
     A                                      nput","description":"A/R Posting Da-
     A                                      te","value":{"fieldName":"scPosDt",-
     A                                      "refField":"DT8 WREFP","numSep":"fa-
     A                                      lse","zeroBalance":"false","numBlan-
     A                                      kFill":"false","zeroFill":"true","n-
     A                                      oExtraSpaces":"false","edtWrd":"'' -
     A                                       /  /    ''","curSym":"","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "negNum":"-999.00","units":"","desi-
     A                                      gnValue":"[scPosDt]"},"text align":-
     A                                      "right","error messages":"1 message-
     A                                      ","left":"280px","top":"180px","hei-
     A                                      ght":"12px","width":"71px","css cla-
     A                                      ss 2":"date-field","tab index":"6",-
     A                                      "error message id":{"fieldName":"ms-
     A                                      PosDt","dataLength":"10","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"},"er-
     A                                      ror message file":"WMESGG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"erPosDt","cust-
     A                                      omTrue":"","customFa')
     A                                  1  2HTML('lse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error enhanced mode":-
     A                                      "1"},{"id":"ButtonCancel","field ty-
     A                                      pe":"button","css class":"button","-
     A                                      value":"Cancel","left":"640px","top-
     A                                      ":"215px","width":"100px","response-
     A                                      ":{"fieldName":"ExitNow","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"shortcut key-
     A                                      ":"F3","tab index":"7"},{"id":"Butt-
     A                                      onSubmit","field type":"button","cs-
     A                                      s class":"button","value":"Submit",-
     A                                      "left":"750px","top":"215px","width-
     A                                      ":"100px","response":{"fieldName":"-
     A                                      BtnSubmit","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"shortcut key":"Enter","tab-
     A                                       index":"8"},{"id":"BtnEmpSearch","-
     A                                      field type":"button","css class":"b-
     A                                      utton","description":"Empployer Div-
     A                                      sion Button","response":{"fieldName-
     A                                      ":"selEmpSrch","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"background image":"url-
     A                                      (/profoundui/userdata/images/systoo-
     A                                      l/search.png)","left":"770px","top"-
     A                                      :"145px","height":"25px","width":"2-
     A                                      5px","cursor":"default"}]}')
     A            BTNSUBMIT      1A  H
     A            ERALLDIV       1A  H
     A            EREMP#         1A  H
     A            ERFND          1A  H
     A            ERPOSDT        1A  H
     A            EXITNOW        1A  H
     A            MSALLDIV      10A  H
     A            MSEMP#        10A  H
     A            MSFND         10A  H
     A            MSPOSDT       10A  H
     A            SCALLDIV       1A  H
     A            SCCOMPNAME    60A  H
     A            SELEMPSRCH     1A  H
     A            SCCO#     R        H      REFFLD(ELCO# WDELP)
     A            SCDIV     R        H      REFFLD(EMDIV WMEMP)
     A            SCEMP#    R        H      REFFLD(EMEMP# WMEMP)
     A            SCEMPNAME R        H      REFFLD(EMNAME WMEMP)
     A            SCFND     R        H      REFFLD(EMFND WMEMP)
     A            SCPOSDT   R        H      REFFLD(DT8 WREFP)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
