     A                                      REF(*LIBL/WREFP)
     A                                      INDARA
     A          R RCDTABDED
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RASSUME    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdTabDed","description":"Deduc-
     A                                      tible Invoice Tab","overlay":"true"-
     A                                      ,"assume":"true","onload":"//pui.bu-
     A                                      ildFKeyMenu({skipHelp: true, availa-
     A                                      bleKeys: file + \"_\" + format + \"-
     A                                      _\" + \"avKeys\", fkeyMenuId:file +-
     A                                       \"_\" + format + \"_\" + \"fkeyMen-
     A                                      u\" })"},"items":[{"id":"TabPmtHstR-
     A                                      ","field type":"tab panel","css cla-
     A                                      ss":"tab-panel","value":"value text-
     A                                      ","left":"250px","top":"70px","widt-
     A                                      h":"970px","height":{"fieldName":"T-
     A                                      abHeight","dataLength":"5","decPos"-
     A                                      :"0","numSep":"false","zeroBalance"-
     A                                      :"false","numBlankFill":"false","ze-
     A                                      roFill":"false","curSym":"","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      negNum":"-999.00","units":"px","des-
     A                                      ignValue":"690px"},"tab names":"Sel-
     A                                      ection Criteria","z index":"0","tab-
     A                                       panel style":"CompSuite Tab Panel"-
     A                                      ,"active tab":{"fieldName":"TabInde-
     A                                      x","dataLength":"5","decPos":"0","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","numBlankFill":"false","zeroFill"-
     A                                      :"false","curSym":"","dataType":"zo-
     A                                      ned","formatting":"Number","negNum"-
     A                                      :"-999.00","units":""}},{"id":"BtnT-
     A                                      abClick_copy","field type":"button"-
     A                                      ,"css class":"button","description"-
     A                                      :"tab click button","value":"Tab","-
     A                                      response":{"fieldName":"tabClick","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"sho-
     A                                      rtcut key":"F3","left":"485px","top-
     A                                      ":"10px","width":"35px","cursor":"d-
     A                                      efault","visibility":"hidden"},{"id-
     A                                      ":"BtnExitButton_copy","field type"-
     A                                      :"button","css class":"button","des-
     A                                      cription":"Exit Button","value":"Ex-
     A                                      it","response":{"fieldName":"ExitNo-
     A                                      w","customTrue":"","customFalse":""-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "shortcut key":"F3","left":"525px",-
     A                                      "top":"10px","width":"100px","curso-
     A                                      r":"default","visibility":"hidden"}-
     A                                      ,{"id":"btnRefresh","field type":"b-
     A                                      utton","css class":"button","value"-
     A                                      :"Refresh","response":{"fieldName":-
     A                                      "BtnRefresh","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"left":"640px","top":"10p-
     A                                      x","width":"100px","cursor":"defaul-
     A                                      t","visibility":"hidden","shortcut -
     A                                      key":"F5"},{"id":"HdrDeductibleInvo-
     A                                      ice","field type":"output field","c-
     A                                      ss class":"heading","value":"Deduct-
     A                                      ible Invoice","left":"255px","top":-
     A                                      "25px","description":"Deductible In-
     A                                      voice","heading type":"Page Title"}-
     A                                      ]}')
     A            BTNREFRESH     1A  H
     A            EXITNOW        1A  H
     A            TABCLICK       1A  H
     A            TABHEIGHT      5S 0H
     A            TABINDEX       5S 0H
     A          R RCDDEDINV
     A                                  1  2HTML('QPUIREC13   ROVERLAY   0     -
     A                                      RASSUME    0     RROWS      2    C1-
     A                                          1C1    1 REMSGID    5    C11   -
     A                                      TxbEmployerFMSEMP#    C6    WMESGGC-
     A                                      5    *LIBLC0    FEREMP#    REMSGID -
     A                                         5    C15   CbxAllDivisionsFMSALL-
     A                                      DIV  C6    WMESGGC5    *LIBLC0    F-
     A                                      ERALLDIV  REMSGID    5    C17   Txb-
     A                                      LossesAsOfDateFMSLOSDT   C6    WMES-
     A                                      GGC5    *LIBLC0    FERLOSDT   REMSG-
     A                                      ID    5    C16   TxbARPostingDateFM-
     A                                      SPOSDT   C6    WMESGGC5    *LIBLC0 -
     A                                         FERPOSDT   REMSGID    5    C12  -
     A                                       TxbPrintDateFMSPRTDT   C6    WMESG-
     A                                      GC5    *LIBLC0    FERPRTDT   REMSGI-
     A                                      D    5    C24   DrpDeductibleBillin-
     A                                      gTypeFMSDEDBIL  C6    WMESGGC0    C-
     A                                      0    FERDEDBIL  REMSGID    5    C13-
     A                                         SbxInvRemarksFMSINVRMK  C6    WM-
     A                                      ESGGC0    C0    FERINVRMK  REMSGID -
     A                                         5    C11   DrpPrintSSNFMSPRTSSN -
     A                                       C6    WMESGGC0    C0    FERPRTSSN -
     A                                       REMSGID    5    C22   CbxResolveBi-
     A                                      llstoDartsFMSDFLG    C6    WMESGGC5-
     A                                          *LIBLC0    FERDFLG    REMSGID  -
     A                                        5    C18   TxbDartsRemarkCodeFMSD-
     A                                      RTRMK  C6    WMESGGC0    C0    FERD-
     A                                      RTRMK  ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdDedInv","overlay":"true","ex-
     A                                      ternal css":"label","description":"-
     A                                      Deductible Invoice Record Format","-
     A                                      assume":"true","overlay range":"1-1-
     A                                      ","design overlay formats":"RcdTabD-
     A                                      ed","header text align":"Left,Right-
     A                                      ","csv file name":"Payment Value 1 -
     A                                      Codes","selection value":"A"},"item-
     A                                      s":[{"id":"BtnExitBtnAll","field ty-
     A                                      pe":"button","css class":"button","-
     A                                      description":"Exit button","value":-
     A                                      "Exit","response":{"fieldName":"Exi-
     A                                      tNow","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"shortcut key":"F3","left":"750p-
     A                                      x","top":"10px","height":"25px","wi-
     A                                      dth":"100px","cursor":"default","vi-
     A                                      sibility":"hidden"},{"id":"SCUSER",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"output-field","value":{"field-
     A                                      Name":"SCUSER","refField":"USER","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"reference-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[SCUSER]"}-
     A                                      ,"cursor row":"1","cursor column":"-
     A                                      2","left":"285px","top":"50px","css-
     A                                       class 2":"top-line","css class 3":-
     A                                      "profound-converted"},{"id":"SCPRDS-
     A                                      ","field type":"output field","css -
     A                                      class":"output-field","description"-
     A                                      :"PROGRAM NAME","value":{"fieldName-
     A                                      ":"SCPRDS","designValue":"[SCPRDS]"-
     A                                      ,"refField":"NAME","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"cursor r-
     A                                      ow":"2","cursor column":"21","left"-
     A                                      :"345px","top":"50px","css class 2"-
     A                                      :"HI","css class 3":"profound-conve-
     A                                      rted","visibility":"hidden"},{"id":-
     A                                      "SCCONM","field type":"output field-
     A                                      ","css class":"output-field","descr-
     A                                      iption":"COMPANY NAME","value":{"fi-
     A                                      eldName":"SCCOMPNAME","dataLength":-
     A                                      "60","trimLeading":"false","trimTra-
     A                                      iling":"false","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[SCCOMPN-
     A                                      AME]"},"cursor row":"1","cursor col-
     A                                      umn":"21","left":"415px","top":"50p-
     A                                      x","css class 2":"top-line","css cl-
     A                                      ass 3":"HI","css class 4":"profound-
     A                                      -converted","visibility":"hidden"},-
     A                                      {"id":"TxbCo#","field type":"textbo-
     A                                      x","css class":"outputField","value-
     A                                      ":{"fieldName":"scCo#","refField":"-
     A                                      ELCO# WDELP","numSep":"false","zero-
     A                                      Balance":"false","numBlankFill":"fa-
     A                                      lse","zeroFill":"false","noExtraSpa-
     A                                      ces":"false","curSym":"","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "negNum":"-999.00","units":"","desi-
     A                                      gnValue":"[scCo#]"},"required":"fal-
     A                                      se","allow blanks":"true","contains-
     A                                       match":"true","left":"555px","top"-
     A                                      :"50px","width":"75px","css class 2-
     A                                      ":"textbox","visibili')
     A                                  1  2HTML('ty":"hidden","height":"12px"}-
     A                                      ,{"id":"TxbEmployerDiv","field type-
     A                                      ":"textbox","css class":"input","va-
     A                                      lue":{"fieldName":"scEmpDiv","dataL-
     A                                      ength":"5","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none","designValue":"[sc-
     A                                      EmpDiv]","decPos":"undefined","refF-
     A                                      ield":"undefined","keywords":[]},"r-
     A                                      equired":"false","allow blanks":"tr-
     A                                      ue","contains match":"true","left":-
     A                                      "650px","top":"50px","width":"160px-
     A                                      ","css class 2":"textbox","tab inde-
     A                                      x":"4","visibility":"hidden"},{"id"-
     A                                      :"LbGroup","field type":"output fie-
     A                                      ld","css class":"label","value":"Gr-
     A                                      oup","left":"280px","top":"115px","-
     A                                      width":"65px","visibility":{"fieldN-
     A                                      ame":"isSglMod","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"}},{"id":"Hdg-
     A                                      SingleEmpl","field type":"output fi-
     A                                      eld","css class":"heading","value":-
     A                                      "To Run for a Single Employer","tex-
     A                                      t align":"left","left":"630px","top-
     A                                      ":"115px","heading type":"Subsectio-
     A                                      n Header","visibility":{"fieldName"-
     A                                      :"isSglMod","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"}},{"id":"OutGrou-
     A                                      p","field type":"output field","css-
     A                                       class":"output-field","description-
     A                                      ":"Group","value":{"fieldName":"scF-
     A                                      nd","refField":"EMFND WMEMP","numSe-
     A                                      p":"false","zeroBalance":"false","n-
     A                                      umBlankFill":"false","zeroFill":"tr-
     A                                      ue","noExtraSpaces":"false","curSym-
     A                                      ":"","dataType":"reference","format-
     A                                      ting":"Number","negNum":"-999.00","-
     A                                      units":"","designValue":"[scFnd]"},-
     A                                      "left":"280px","top":"130px","heigh-
     A                                      t":"15px","width":"55px","visibilit-
     A                                      y":{"fieldName":"isSglMod","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"}}-
     A                                      ,{"id":"OutGroupName","field type":-
     A                                      "output field","css class":"output--
     A                                      field","description":"Group Name","-
     A                                      value":{"fieldName":"scFndNm","refF-
     A                                      ield":"FNNAME WMFNP","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[scFndNm]"},"left":"340-
     A                                      px","top":"130px","height":"12px","-
     A                                      width":"280px","visibility":{"field-
     A                                      Name":"isSglMod","customTrue":"","c-
     A                                      ustomFalse":"","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"}},{"id":"Lb-
     A                                      lEmployer","field type":"output fie-
     A                                      ld","css class":"label","value":"Em-
     A                                      ployer/ Division","left":"630px","t-
     A                                      op":"130px","width":"125px","visibi-
     A                                      lity":{"fieldName":"isSglMod","cust-
     A                                      omTrue":"","customFal')
     A                                  1  2HTML('se":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"}},{"id":"TxbE-
     A                                      mployer","field type":"textbox","cs-
     A                                      s class":"input","value":{"fieldNam-
     A                                      e":"scEmp#","refField":"ememp# wmem-
     A                                      p","numSep":"false","zeroBalance":"-
     A                                      false","numBlankFill":"false","zero-
     A                                      Fill":"false","noExtraSpaces":"fals-
     A                                      e","curSym":"","dataType":"referenc-
     A                                      e","formatting":"Number","negNum":"-
     A                                      999.00","units":"","designValue":"[-
     A                                      scEmp#]"},"text align":"right","err-
     A                                      or messages":"1 message","left":"63-
     A                                      0px","top":"145px","height":"12px",-
     A                                      "width":"65px","onchange":"// Clear-
     A                                       Divsion related fields and Employe-
     A                                      r Name\n// 06/05/2025 *** Do not pa-
     A                                      ss Blank in Division      \n//   ch-
     A                                      angeElementValue(''TxbDivision'',''-
     A                                       '');\n   changeElementValue(''TxbD-
     A                                      ivision'','''');\n// 06/05/2025 ***-
     A                                       Do not clear All Divisions Checkbo-
     A                                      x \n// changeElementValue(''CbxAllD-
     A                                      ivisions'','' ''); \nchangeElementV-
     A                                      alue(''OutEmpName'','' '');\napplyP-
     A                                      roperty(\"TxbDivision\", \"field ty-
     A                                      pe\", \"textbox\");\napplyProperty(-
     A                                      \"CbxAllDivisions\", \"field type\"-
     A                                      , \"checkbox\");\napplyProperty(\"O-
     A                                      utEmpName\", \"field type\", \"outp-
     A                                      ut field\");","visibility":{"fieldN-
     A                                      ame":"isSglMod","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"tab index"-
     A                                      :"1","error message id":{"fieldName-
     A                                      ":"msEMP#","dataLength":"10","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      ,"error message file":"WMESGG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"erEmp#","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r enhanced mode":"1","css class 2":-
     A                                      "textbox"},{"id":"LblHypen1","field-
     A                                       type":"output field","css class":"-
     A                                      label","description":"Hyphen Lable"-
     A                                      ,"value":"-","left":"705px","top":"-
     A                                      145px","width":"10px","visibility":-
     A                                      {"fieldName":"isSglMod","customTrue-
     A                                      ":"","customFalse":"","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"}},{"-
     A                                      id":"TxbDivision","field type":"tex-
     A                                      tbox","css class":"input","value":{-
     A                                      "fieldName":"scDiv","refField":"emd-
     A                                      iv wmemp","numSep":"false","zeroBal-
     A                                      ance":"false","numBlankFill":"false-
     A                                      ","zeroFill":"false","noExtraSpaces-
     A                                      ":"false","curSym":"","dataType":"r-
     A                                      eference","formatting":"Number","ne-
     A                                      gNum":"999.00","units":"","designVa-
     A                                      lue":"[scDiv]"},"left":"715px","top-
     A                                      ":"145px","height":"12px","width":"-
     A                                      40px","onchange":"// Clear All Divs-
     A                                      ions and Employer Name\nchangeEleme-
     A                                      ntValue(''CbxAllDivis')
     A                                  1  2HTML('ions'','' ''); \n// 06/05/202-
     A                                      5 *** Do not clear Employer Name\n/-
     A                                      / changeElementValue(''OutEmpName''-
     A                                      ,'' '');\napplyProperty(\"CbxAllDiv-
     A                                      isions\", \"field type\", \"checkbo-
     A                                      x\");\napplyProperty(\"OutEmpName\"-
     A                                      , \"field type\", \"output field\")-
     A                                      ;\n","visibility":{"fieldName":"isS-
     A                                      glMod","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"tab index":"2","tex-
     A                                      t align":"right","css class 2":"tex-
     A                                      tbox"},{"id":"CbxAllDivisions","fie-
     A                                      ld type":"checkbox","css class":"ch-
     A                                      eckbox","value":{"fieldName":"scAll-
     A                                      Div","dataLength":"1","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[scAllDiv]"},"checked value-
     A                                      ":"Y","label":"All Divisions","left-
     A                                      ":"785px","top":"145px","height":"1-
     A                                      2px","tab index":"4","onclick":"// -
     A                                      Clear Divsion related fields and Em-
     A                                      ployer Name\nif (getElementValue(Cb-
     A                                      xAllDivisions) == ''Y'') {\n// 06/0-
     A                                      5/2025 *** Do not pass Blank in Div-
     A                                      ision      \n//   changeElementValu-
     A                                      e(''TxbDivision'','' '');\n   chang-
     A                                      eElementValue(''TxbDivision'','''')-
     A                                      ;\n// 06/05/2025 *** Do not clear E-
     A                                      mployer Name\n//   changeElementVal-
     A                                      ue(''OutEmpName'','' '');\n   apply-
     A                                      Property(\"TxbDivision\", \"field t-
     A                                      ype\", \"textbox\");\n   applyPrope-
     A                                      rty(\"OutEmpName\", \"field type\",-
     A                                       \"output field\");\n}\n\n","visibi-
     A                                      lity":{"fieldName":"isSglMod","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"error messages":"1 message","er-
     A                                      ror message id":{"fieldName":"MSALL-
     A                                      DIV","dataLength":"10","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"},"erro-
     A                                      r message file":"WMESGG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"erAllDiv","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error en-
     A                                      hanced mode":"1"},{"id":"OutEmpName-
     A                                      ","field type":"output field","css -
     A                                      class":"output-field","description"-
     A                                      :"Employer Name","value":{"fieldNam-
     A                                      e":"scEmpName","refField":"emname w-
     A                                      memp","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"re-
     A                                      ference","formatting":"Text","textT-
     A                                      ransform":"none","designValue":"[sc-
     A                                      EmpName]"},"left":"890px","top":"14-
     A                                      5px","width":"310px","visibility":{-
     A                                      "fieldName":"isSglMod","customTrue"-
     A                                      :"","customFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"visible /')
     A                                  1  2HTML(' hidden"}},{"id":"LblLossesAs-
     A                                      OfDate\\_copy","field type":"output-
     A                                       field","css class":"label","value"-
     A                                      :"Losses as of Date","left":"280px"-
     A                                      ,"top":"175px","width":"110px"},{"i-
     A                                      d":"Image2","field type":"image","c-
     A                                      ss class":"image","image source":"/-
     A                                      profoundui/userdata/images/asterisk-
     A                                      _orange_small.png","left":"380px","-
     A                                      top":"175px","height":"8px","width"-
     A                                      :"8px"},{"id":"LblARPostingDate","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"label","value":"A/R Posting Dat-
     A                                      e","left":"410px","top":"175px","wi-
     A                                      dth":"110px"},{"id":"Image3","field-
     A                                       type":"image","css class":"image",-
     A                                      "image source":"/profoundui/userdat-
     A                                      a/images/asterisk_orange_small.png"-
     A                                      ,"left":"510px","top":"175px","heig-
     A                                      ht":"8px","width":"8px"},{"id":"Lbl-
     A                                      PrintDate","field type":"output fie-
     A                                      ld","css class":"label","value":"Pr-
     A                                      int Date","left":"540px","top":"175-
     A                                      px","width":"65px"},{"id":"Image4",-
     A                                      "field type":"image","css class":"i-
     A                                      mage","image source":"/profoundui/u-
     A                                      serdata/images/asterisk_orange_smal-
     A                                      l.png","left":"600px","top":"175px"-
     A                                      ,"height":"8px","width":"8px"},{"id-
     A                                      ":"TxbLossesAsOfDate","field type":-
     A                                      "date field","css class":"input","d-
     A                                      escription":"Losses As Of Date","va-
     A                                      lue":{"fieldName":"scLosDt","dataLe-
     A                                      ngth":"8","decPos":"0","numSep":"fa-
     A                                      lse","zeroBalance":"false","numBlan-
     A                                      kFill":"false","zeroFill":"true","n-
     A                                      oExtraSpaces":"false","edtWrd":"'' -
     A                                       /  /    ''","curSym":"","dataType"-
     A                                      :"zoned","formatting":"Number","neg-
     A                                      Num":"-999.00","units":"","designVa-
     A                                      lue":"[scLosDt]"},"text align":"rig-
     A                                      ht","error messages":"1 message","l-
     A                                      eft":"280px","top":"190px","width":-
     A                                      "71px","css class 2":"date-field","-
     A                                      height":"12px","tab index":"5","err-
     A                                      or message id":{"fieldName":"msLosD-
     A                                      t","dataLength":"10","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"},"error -
     A                                      message file":"WMESGG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"erLosDt","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error enhan-
     A                                      ced mode":"1"},{"id":"TxbARPostingD-
     A                                      ate","field type":"date field","css-
     A                                       class":"input","value":{"fieldName-
     A                                      ":"scPosDt","dataLength":"8","decPo-
     A                                      s":"0","numSep":"false","zeroBalanc-
     A                                      e":"false","numBlankFill":"false","-
     A                                      zeroFill":"true","noExtraSpaces":"f-
     A                                      alse","edtWrd":"''  /  /    ''","cu-
     A                                      rSym":"","dataType":"zoned","format-
     A                                      ting":"Number","negNum":"-999.00","-
     A                                      units":"","designValue":"[scPosDt]"-
     A                                      },"text align":"right","error messa-
     A                                      ges":"1 message","left":"410px","to-
     A                                      p":"190px","width":"71px","css clas-
     A                                      s 2":"date-field","de')
     A                                  1  2HTML('scription":"A/R Posting Date"-
     A                                      ,"height":"12px","tab index":"6","e-
     A                                      rror message id":{"fieldName":"msPo-
     A                                      sDt","dataLength":"10","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"},"erro-
     A                                      r message file":"WMESGG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"erPosDt","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error enh-
     A                                      anced mode":"1"},{"id":"TxbPrintDat-
     A                                      e","field type":"date field","css c-
     A                                      lass":"input","description":"Print -
     A                                      Date","value":{"fieldName":"scPrtDt-
     A                                      ","dataLength":"8","decPos":"0","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"numBlankFill":"false","zeroFill":-
     A                                      "true","noExtraSpaces":"false","edt-
     A                                      Wrd":"''  /  /    ''","curSym":"","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","negNum":"-999.00","units":"",-
     A                                      "designValue":"[scPrtDt]"},"text al-
     A                                      ign":"right","error messages":"1 me-
     A                                      ssage","left":"540px","top":"190px"-
     A                                      ,"width":"71px","css class 2":"date-
     A                                      -field","height":"12px","tab index"-
     A                                      :"7","error message id":{"fieldName-
     A                                      ":"msPrtDt","dataLength":"10","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      },"error message file":"WMESGG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"erPrtDt",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror enhanced mode":"1"},{"id":"LblD-
     A                                      eductibleBillingType","field type":-
     A                                      "output field","css class":"label",-
     A                                      "value":"Deductible Billing Type","-
     A                                      left":"280px","top":"215px","width"-
     A                                      :"150px"},{"id":"Image5","field typ-
     A                                      e":"image","css class":"image","ima-
     A                                      ge source":"/profoundui/userdata/im-
     A                                      ages/asterisk_orange_small.png","le-
     A                                      ft":"410px","top":"215px","height":-
     A                                      "8px","width":"8px"},{"id":"LblRema-
     A                                      rksforInvoices","field type":"outpu-
     A                                      t field","css class":"label","value-
     A                                      ":"Remarks for Invoices (Max  of 4 -
     A                                      Choices)","left":"630px","top":"215-
     A                                      px","width":"240px"},{"id":"DrpDedu-
     A                                      ctibleBillingType","field type":"se-
     A                                      lect box","css class":"input","valu-
     A                                      e":{"fieldName":"scDedBil","refFiel-
     A                                      d":"FLAG","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      extTransform":"uppercase","designVa-
     A                                      lue":"[scDedBil]"},"error messages"-
     A                                      :"1 message","choices":"Small,Large-
     A                                      ,Both","choice values":"S,L,B","lef-
     A                                      t":"280px","top":"230px","width":"7-
     A                                      0px","css class 2":"dropdown","visi-
     A                                      bility":{"fieldName":')
     A                                  1  2HTML('"isLrgDed","customTrue":"","c-
     A                                      ustomFalse":"","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"error mes-
     A                                      sage id":{"fieldName":"msDedBil","d-
     A                                      ataLength":"10","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"},"error messa-
     A                                      ge file":"WMESGG","error condition"-
     A                                      :{"fieldName":"erDedBil","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error enhanc-
     A                                      ed mode":"1","description":"Deducti-
     A                                      ble Billing Type","height":"12px","-
     A                                      tab index":"8"},{"id":"SbxInvRemark-
     A                                      s","field type":"select box","css c-
     A                                      lass":"dropdown","description":"Inv-
     A                                      oice Remarks","value":{"fieldName":-
     A                                      "scInvRmk","dataLength":"500","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[scInvRmk]"},"choic-
     A                                      es database file":"WTBCP","choice o-
     A                                      ptions field":"BCKEY || ''-'' || BC-
     A                                      DESC","choice values field":"BCKEY"-
     A                                      ,"left":"630px","top":"230px","heig-
     A                                      ht":"135px","width":"235px","blank -
     A                                      option":"false","multiple":"true","-
     A                                      choices selection criteria":{"field-
     A                                      Name":"scRmksSel","dataLength":"500-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"},"order by":"BCKEY","error -
     A                                      messages":"1 message","error messag-
     A                                      e id":{"fieldName":"msInvRmk","data-
     A                                      Length":"10","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"},"error message -
     A                                      file":"WMESGG","error condition":{"-
     A                                      fieldName":"erInvRmk","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error enhanced -
     A                                      mode":"1","required":"false","tab i-
     A                                      ndex":"14"},{"id":"LblPrintSSN","fi-
     A                                      eld type":"output field","css class-
     A                                      ":"label","value":"Print SSN?","lef-
     A                                      t":"280px","top":"255px","width":"6-
     A                                      5px"},{"id":"Image6","field type":"-
     A                                      image","css class":"image","image s-
     A                                      ource":"/profoundui/userdata/images-
     A                                      /asterisk_orange_small.png","left":-
     A                                      "345px","top":"255px","height":"8px-
     A                                      ","width":"8px"},{"id":"DrpPrintSSN-
     A                                      ","field type":"select box","css cl-
     A                                      ass":"input","value":{"fieldName":"-
     A                                      scPrtSsn","refField":"FLAG","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"reference","for-
     A                                      matting":"Text","textTransform":"up-
     A                                      percase","designValue":"[scPrtSsn]"-
     A                                      },"choices":"Print fu')
     A                                  1  2HTML('ll SSN,Print last 4 digits,Su-
     A                                      ppress SSN","choice values":"Y,4,N"-
     A                                      ,"left":"280px","top":"270px","widt-
     A                                      h":"120px","error messages":"1 mess-
     A                                      age","description":"Print SSN?","di-
     A                                      sabled":{"fieldName":"isSsnLock","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"height":"12px","tab index":"10",-
     A                                      "error message id":{"fieldName":"ms-
     A                                      PrtSsn","dataLength":"10","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none"},"e-
     A                                      rror message file":"WMESGG","error -
     A                                      condition":{"fieldName":"erPrtSsn",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror enhanced mode":"1","css class 2-
     A                                      ":"dropdown"},{"id":"CbxExcludePoli-
     A                                      cies","field type":"checkbox","css -
     A                                      class":"checkbox","value":{"fieldNa-
     A                                      me":"scExCL","dataLength":"1","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[scExCL]"},"text tr-
     A                                      ansform":"uppercase","checked value-
     A                                      ":"Y","label":"Exclude policies wit-
     A                                      h no activity","left":"280px","top"-
     A                                      :"295px","locked in place":"false",-
     A                                      "description":"Exclude Policies wit-
     A                                      h No Activity","tab index":"11"},{"-
     A                                      id":"CbxResolveBillstoDarts","field-
     A                                       type":"checkbox","css class":"chec-
     A                                      kbox","value":{"fieldName":"scDfLg"-
     A                                      ,"dataLength":"10","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none","designVal-
     A                                      ue":"[scDfLg]"},"text transform":"u-
     A                                      ppercase","checked value":"Y","labe-
     A                                      l":"Resolve bills to DARTS?","error-
     A                                       messages":"1 message","left":"280p-
     A                                      x","top":"315px","description":"Res-
     A                                      olve Bills to Darts","error message-
     A                                       id":{"fieldName":"MSDFLG","dataLen-
     A                                      gth":"10","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none"},"error message fil-
     A                                      e":"WMESGG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"erDFLG","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error enhanced mode":"1-
     A                                      ","visibility":{"fieldName":"isRsvD-
     A                                      arts","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"tab index":"12"},{"i-
     A                                      d":"LblDartsRemarkCode","field type-
     A                                      ":"output field","css class":"label-
     A                                      ","value":"DARTS Remark Code","left-
     A                                      ":"280px","top":"340p')
     A                                  1  2HTML('x","width":"145px","visibilit-
     A                                      y":{"fieldName":"isRsvDarts","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      }},{"id":"TxbDartsRemarkCode","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","value":{"fieldName":"scDrtRmk",-
     A                                      "dataLength":"5","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"uppercase","design-
     A                                      Value":"[scDrtRmk]"},"text align":"-
     A                                      left","error messages":"1 message",-
     A                                      "left":"280px","top":"355px","width-
     A                                      ":"340px","description":"DARTS Rema-
     A                                      rk Code","contains match":"true","c-
     A                                      hoices database file":"STCTP","choi-
     A                                      ce options field":"CTRMCD || ''-'' -
     A                                      || CTDESC","choice values field":"C-
     A                                      TRMCD","choices selection criteria"-
     A                                      :"CTSTAT <> ''I'' and CTRMCD <> '' -
     A                                      ''","max choices":"200","height":"1-
     A                                      2px","tab index":"13","error messag-
     A                                      e id":{"fieldName":"msDrtRmk","data-
     A                                      Length":"10","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"},"error message -
     A                                      file":"WMESGG","error condition":{"-
     A                                      fieldName":"erDrtRmk","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error enhanced -
     A                                      mode":"1","css class 2":"Textbox","-
     A                                      visibility":{"fieldName":"isRsvDart-
     A                                      s","customTrue":"","customFalse":""-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"}},{"id":"OutOutputFile","-
     A                                      field type":"output field","css cla-
     A                                      ss":"output-field","value":{"fieldN-
     A                                      ame":"scOutFile","dataLength":"100"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[scOutFile]"}-
     A                                      ,"left":"280px","top":"395px","heig-
     A                                      ht":"15px","width":"635px","font we-
     A                                      ight":"bold"},{"id":"ButtonCancel",-
     A                                      "field type":"button","css class":"-
     A                                      button","value":"Cancel","left":"64-
     A                                      0px","top":"435px","width":"100px",-
     A                                      "response":{"fieldName":"ExitNow","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"sho-
     A                                      rtcut key":"F3","tab index":"15"},{-
     A                                      "id":"ButtonSubmit","field type":"b-
     A                                      utton","css class":"button","value"-
     A                                      :"Submit","left":"750px","top":"435-
     A                                      px","width":"100px","response":{"fi-
     A                                      eldName":"BtnSubmit","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"shortcut key":"E-
     A                                      nter","tab index":"16"},{"id":"BtnE-
     A                                      mpSearch","field type":"button","cs-
     A                                      s class":"button","de')
     A                                  1  2HTML('scription":"Empployer Divsion-
     A                                       Button","response":{"fieldName":"s-
     A                                      elEmpSrch","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"background image":"url(/pr-
     A                                      ofoundui/userdata/images/systool/se-
     A                                      arch.png)","left":"760px","top":"14-
     A                                      5px","height":"25px","width":"25px"-
     A                                      ,"cursor":"default","visibility":{"-
     A                                      fieldName":"isSglMod","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"}}]}')
     A            BTNSUBMIT      1A  H
     A            ERALLDIV       1A  H
     A            ERDEDBIL       1A  H
     A            ERDFLG         1A  H
     A            ERDRTRMK       1A  H
     A            EREMP#         1A  H
     A            ERINVRMK       1A  H
     A            ERLOSDT        1A  H
     A            ERPOSDT        1A  H
     A            ERPRTDT        1A  H
     A            ERPRTSSN       1A  H
     A            EXITNOW        1A  H
     A            ISLRGDED       1A  H
     A            ISRSVDARTS     1A  H
     A            ISSGLMOD       1A  H
     A            ISSSNLOCK      1A  H
     A            MSALLDIV      10A  H
     A            MSDEDBIL      10A  H
     A            MSDFLG        10A  H
     A            MSDRTRMK      10A  H
     A            MSEMP#        10A  H
     A            MSINVRMK      10A  H
     A            MSLOSDT       10A  H
     A            MSPOSDT       10A  H
     A            MSPRTDT       10A  H
     A            MSPRTSSN      10A  H
     A            SCALLDIV       1A  H
     A            SCCOMPNAME    60A  H
     A            SCDFLG        10A  H
     A            SCDRTRMK       5A  H
     A            SCEMPDIV       5A  H
     A            SCEXCL         1A  H
     A            SCINVRMK     500A  H
     A            SCLOSDT        8S 0H
     A            SCOUTFILE    100A  H
     A            SCPOSDT        8S 0H
     A            SCPRTDT        8S 0H
     A            SCRMKSSEL    500A  H
     A            SELEMPSRCH     1A  H
     A            SCCO#     R        H      REFFLD(ELCO# WDELP)
     A            SCDEDBIL  R        H      REFFLD(FLAG)
     A            SCDIV     R        H      REFFLD(EMDIV WMEMP)
     A            SCEMP#    R        H      REFFLD(EMEMP# WMEMP)
     A            SCEMPNAME R        H      REFFLD(EMNAME WMEMP)
     A            SCFND     R        H      REFFLD(EMFND WMEMP)
     A            SCFNDNM   R        H      REFFLD(FNNAME WMFNP)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPRTSSN  R        H      REFFLD(FLAG)
     A            SCUSER    R        H      REFFLD(USER)
