     A* ** ======================================================= **
      * (c) 2009 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*                                                              *
     A*     MEDICARE 2ND PAY DATA COMPLIANCE COEE TABLE FILE         *
     A*                                                              *
     A*    06/12/09  C:33   PROJECT: WC1819                          *
     A*                                                              *
     A*                                                              *
     A** ========================================================= **
     A* REVISIONS:                                                   *
     A*                                                              *
     A*                                                              *
     A** ========================================================= **
     A          R PDM01                     PFILE(WTDMP)
     A          K DMCO#
     A          K DMCODE
