     A* ** ======================================================= **
     A* (c) 2010 StoneRiver, Inc. All rights Reserved.               *
     A* StoneRiver is a trademark of StoneRiver, Inc.                *
     A*                                                              *
     A*    DISPOSITION CODE FILE                                     *
     A*                                                              *
     A*    01/28/10  C:198  PROJECT: WC1819 PHASE 2                  *
     A*                                                              *
     A*                                                              *
     A** ========================================================= **
     A* REVISIONS:                                                   *
     A*                                                              *
     A*                                                              *
     A** ========================================================= **
     A          R PDS01                     PFILE(WTDSP)
     A          K DSCO#
     A          K DSCODE
