      * (c) 2022 Sapiens. All Rights Reserved.
      ****************************************************************
      * Extraordinary Loss Event Category Criteria
      ****************************************************************
      *  Created: 04/18/22   C:291    Project: WC2852
      ****************************************************************
      * REVISIONS:                                                   *
      *                                                              *
      *                                                              *
      ****************************************************************

     A          R PELECAT                   TEXT('Extraordinary Loss +
     A                                      Event Category Criteria')
     A            CACODE         5S 0       COLHDG('Cat Code Number')
     A            CADESC        40A         COLHDG('Description')
     A            CAST           2A         COLHDG('State')
     A            CASTDT         7S 0       COLHDG('Start Date')
     A            CAENDT         7S 0       COLHDG('End Date')
