      * Copyright('(c) 2021 Sapiens. All Rights Reserved.')
      *
      *  WORKERS' COMP ENDORSEMENT FORM TABLE FILE
     A          R PEN01                     PFILE(WTENP)
     A          K ENCO#
     A          K ENFORM
     A          K ENFND
