     A*  (C) Copyright Progressive Data Systems, Inc., 1996
     A*
     A** EDI 149/A49 ERROR DESCRIPTION TABLE FILE
     A*
     A          R PER01                     PFILE(WTERP)
     A          K ERCO#
     A          K ERMSG#
