      * (c) 2019 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*****************************************************************
     A*  ENDORSEMENT STATES - APPROVED
     A*
     A*  FILE:       WTESP
     A*  DATE:       10/01/07
     A*  PROJECT:    WC1530
     A*  PROGRAMMER: C:184
     A*
     A*****************************************************************
     A* REVISIONS:
     A*
     A* 12/12/19 C:291 Project: WC2693
     A*                Expiration date
     A*
     A* 01/08/18 C:62  PROJECT: 133WQH
     A*                ADD ADOPTION DATE
     A*
     A*****************************************************************
     A          R PES01                     TEXT('ENDORSEMENT STATES-APPROVED')
     A            ESCO#          3S 0       COLHDG('COMPANY')
     A            ESFORM        15A         COLHDG('FORM')
     A            ESST           2A         COLHDG('COVERAGE STATE')
     A            ESAPEX         1A         COLHDG('APPROVED/EXCLUDED ' +
     A                                      '(A/E)')
     A*
     A            ESPGM         10A         COLHDG('PROGRAM')
     A            ESUSR         10A         COLHDG('USER')
     A            ESDT           7S 0       COLHDG('DATE')
     A            ESTIM          6S 0       COLHDG('TIME')
     A*
     A            ESIPGM        10A         COLHDG('INITIAL' 'PROGRAM')
     A            ESIUSR        10A         COLHDG('INITIAL' 'USER')
     A            ESIDT          7S 0       COLHDG('INITIAL' 'DATE')
     A            ESITIM         6S 0       COLHDG('INITIAL' 'TIME')
     A*** BEGIN ADD *** 01/08/18 ***********************************************
     A            ESADTE         7S 0       COLHDG('ADDOPTION DATE')
     A*** END ADD ***** 01/08/18 ***********************************************
     A*** Begin Add *** 12/12/19 ***********************************************
     A            ESEXDT         7S 0       COLHDG('EXPIRATION' 'DATE')
     A*** End   Add *** 12/12/19 ***********************************************
