     A                                      REF(*LIBL/SREFP)
     A*PUI                                  SFLDEFINE(01)
     A*PUI                                  SFLDEFINE(02)
     A          R SFLDIMGINF                SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI000001     1A  O  2  2
     A            BTNSELECT      1A  H
     A            SCDBIMGRRN     9S 0H
     A            SCQDESC       40A  H
     A            SCQUEUE       10A  H
     A          R QSFLCTL001                SFLCTL(SFLDIMGINF)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLRCDDIMGMST')
     A          R RCDDIMGMST
     A                                  1  2HTML('QPUICTL1    SFLDIMGINF5    RS-
     A                                      FLDSP    0    FDSPDIMG   RSFLDSPCTL-
     A                                       0    FDSPDIMG   RSFLCLR    0    FC-
     A                                      LRDIMGSFLRSFLPAG    1    C2    14 R-
     A                                      SFLSIZ    1    C2    15 0    4    R-
     A                                      OVERLAY   0     RASSUME    0     RR-
     A                                      OWS      2    C1    1C2    24 REMSG-
     A                                            2    C10   txtImageIDFMSDCID -
     A                                         FERDCID    ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdDimgMst","overlay":"true","o-
     A                                      verlay range":"1-24","assume":"true-
     A                                      "},"items":[{"field type":"panel","-
     A                                      panel style":"TransformButtonBar","-
     A                                      id":"IS215F_SCR01_ButtonBar","top":-
     A                                      "35px","left":"1036px","width":"187-
     A                                      px","height":"28px","css class":"st-
     A                                      ationary","visibility":"hidden","lo-
     A                                      cked in place":"true"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1118px","id":"IS215F_SCR0-
     A                                      1_BtnDiaryItems","tool tip":"Diary/-
     A                                      Work Items - IDARTS","onclick":"Sys-
     A                                      temToolbarDiary","background image"-
     A                                      :{"fieldName":"DryIcnURL","dataLeng-
     A                                      th":"128","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none"}},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1144px","id":"IS215F_SCR01_Btn-
     A                                      SystemMessages","tool tip":"System -
     A                                      Messages","onclick":"SystemToolbarM-
     A                                      essages","background image":{"field-
     A                                      Name":"MsgIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"id":"IS215F_SCR01_ImgSy-
     A                                      sToolBottom","field type":"image","-
     A                                      image source":"/profoundui/userdata-
     A                                      /images/systool/butbarbot.png","lef-
     A                                      t":"1036px","top":"64px","width":"1-
     A                                      87px","locked in place":"true","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden"},{"id":"IS215F_SCR01_MainTa-
     A                                      bPanel","field type":"tab panel","t-
     A                                      ab panel style":"Transform","tab na-
     A                                      mes":"Undelete Images","active tab"-
     A                                      :"0","left":"250px","top":"70px","w-
     A                                      idth":"970px","height":"657px","z i-
     A                                      ndex":"8","locked in place":"true",-
     A                                      "css class":"tab-panel","css class -
     A                                      2":"stationary"},{"id":"lblImage","-
     A                                      field type":"output field","css cla-
     A                                      ss":"label","value":"Image ID","lef-
     A                                      t":"265px","top":"105px","width":"1-
     A                                      50px"},{"id":"txtImageID","field ty-
     A                                      pe":"textbox","css class":"textbox"-
     A                                      ,"value":{"fieldName":"scDCid","dat-
     A                                      aLength":"12","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":')
     A                                  1  2HTML('"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[scDCid]"},"req-
     A                                      uired":"false","error messages":"1 -
     A                                      message","error message":{"fieldNam-
     A                                      e":"msDCid","dataLength":"150","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "},"error condition":{"fieldName":"-
     A                                      erDCid","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error enhanced mode":"1","lef-
     A                                      t":"265px","top":"125px"},{"id":"Hd-
     A                                      gCompInfo","field type":"output fie-
     A                                      ld","css class":"heading","value":"-
     A                                      Image Queues","text align":"left","-
     A                                      left":"265px","top":"150px","width"-
     A                                      :"155px","z index":"50","heading ty-
     A                                      pe":"Section Header"},{"id":"sflDIm-
     A                                      gInf","field type":"grid","css clas-
     A                                      s":"subfilegrid","left":"265px","to-
     A                                      p":"185px","number of rows":"15","n-
     A                                      umber of columns":"3","column width-
     A                                      s":"107,775,59","column headings":"-
     A                                      Queue,Description,","header height"-
     A                                      :"21","row height":"20","csv export-
     A                                      ":"true","export with headings":"tr-
     A                                      ue","sortable columns":"true","find-
     A                                       option":"true","filter option":"tr-
     A                                      ue","persist state":"true","resizab-
     A                                      le columns":"true","movable columns-
     A                                      ":"true","height":"301px","width":"-
     A                                      942px","parent tab panel":"IS215F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"record format name":"sflDImgInf",-
     A                                      "display subfile":{"fieldName":"dsp-
     A                                      DImg","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"display control record":-
     A                                      {"fieldName":"dspDImg","customTrue"-
     A                                      :"","customFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"clear s-
     A                                      ubfile":{"fieldName":"clrDImgSfl","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"subfile record number":{"fieldN-
     A                                      ame":"rrnDImgInf","dataLength":"9",-
     A                                      "decPos":"0","numSep":"false","zero-
     A                                      Balance":"false","numBlankFill":"fa-
     A                                      lse","zeroFill":"false","noExtraSpa-
     A                                      ces":"false","curSym":"","dataType"-
     A                                      :"zoned","formatting":"Number","neg-
     A                                      Num":"-999.00","units":""},"positio-
     A                                      n at top":"true","scrollbar":"slidi-
     A                                      ng","header image":"Queue,Descripti-
     A                                      on,","description":"Deleted Images"-
     A                                      ,"export file name":"data"},{"id":"-
     A                                      BtnImgNew","field type":"button","c-
     A                                      ss class":"button","value":"Refresh-
     A                                      ","response":{"fieldName":"btnimgNe-
     A                                      w","customTrue":"","customFalse":""-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "shortcut key":"F5","left":"1035px"-
     A                                      ,"top":"525px","height":"20px","wid-
     A                                      th":"75px","cursor":"')
     A                                  1  2HTML('default","parent tab panel":"-
     A                                      IS215F_SCR01_MainTabPanel","parent -
     A                                      tab":"0"},{"id":"BtnImgCls","field -
     A                                      type":"button","css class":"button"-
     A                                      ,"value":"Close","response":{"field-
     A                                      Name":"btnimgCls","customTrue":"","-
     A                                      customFalse":"","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"shortcut key":"F3",-
     A                                      "left":"1120px","top":"525px","heig-
     A                                      ht":"20px","width":"75px","cursor":-
     A                                      "default","parent tab panel":"IS215-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0"},{"id":"OutQueue","field type":-
     A                                      "output field","css class":"output--
     A                                      field","value":{"fieldName":"scQueu-
     A                                      e","dataLength":"10","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[scQueue]"},"text align":"le-
     A                                      ft","left":"5px","top":"0px","width-
     A                                      ":"70px","grid":"sflDImgInf","colum-
     A                                      n":"0"},{"id":"OutDesc","field type-
     A                                      ":"output field","css class":"outpu-
     A                                      t-field","value":{"fieldName":"scQD-
     A                                      esc","dataLength":"40","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[scQDesc]"},"text align":"-
     A                                      left","left":"5px","top":"5px","wid-
     A                                      th":"760px","grid":"sflDImgInf","co-
     A                                      lumn":"1"},{"id":"OutCmpNum_copy","-
     A                                      field type":"output field","css cla-
     A                                      ss":"output-field","value":{"fieldN-
     A                                      ame":"scDbImgRrn","dataLength":"9",-
     A                                      "decPos":"0","numSep":"false","zero-
     A                                      Balance":"false","numBlankFill":"fa-
     A                                      lse","zeroFill":"false","noExtraSpa-
     A                                      ces":"false","curSym":"","dataType"-
     A                                      :"zoned","formatting":"Number","neg-
     A                                      Num":"999.00","units":"","designVal-
     A                                      ue":"[scDbImgRrn]"},"text align":"l-
     A                                      eft","left":"35px","top":"5px","wid-
     A                                      th":"70px","visibility":"hidden","g-
     A                                      rid":"sflDImgInf","column":"2"},{"i-
     A                                      d":"imgSelect_copy","field type":"i-
     A                                      mage","css class":"transform-image"-
     A                                      ,"response":{"fieldName":"btnSelect-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"image source":"/profoundui/userda-
     A                                      ta/images/Select_Icon.png","left":"-
     A                                      5px","top":"0px","height":"20px","w-
     A                                      idth":"25px","tool tip":"Click to s-
     A                                      elect record.","grid":"sflDImgInf",-
     A                                      "column":"2"}]}')
     A            BTNIMGCLS      1A  H
     A            BTNIMGNEW      1A  H
     A            CLRDIMGSFL     1A  H
     A            DRYICNURL    128A  H
     A            DSPDIMG        1A  H
     A            ERDCID         1A  H
     A            MSDCID       150A  H
     A            MSGICNURL    128A  H
     A            RRNDIMGINF     9S 0H
     A            SCDCID        12A  H
