     A*  (C) Copyright Progressive Data Systems, Inc., 1988, 1995
     A** (C) COPYRIGHT INSURANCE ADMINISTRATIVE SYSTEMS, INC. 1987
     A*
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*  03/15/95 C:24 PROJECT WC405                                  *
     A*                ADDED FUND TO KEY.                             *
     A*****************************************************************
     A*
     A          R PLM01                     PFILE(WTLMP)
     A          K LMCO#
     A*** BEGIN ADD *** 03/15/95 ****************************************
     A          K LMFND
     A*** END ADD ***** 03/15/95 ****************************************
     A          K LMKEY
     A          K LMEFDT
