      * (c) 2011 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *

     A**
     A** WORKERS' COMP LIMITS TABLE FILE
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*
     A* 08/16/11 C:061 PROJECT 114WZW
     A*                Add Expanded Minimum Premium 7.2
     A*                                                               *
     A* 08/15/01  C:90   PROJECT: WC1041                              *
     A*                  Expand incr. limit percent from 3.2 to 5.3   *
     A*                                                               *
     A* 09/16/99  C:35   PROJECT: WC949                               *
     A*                  ADD FIELD FOR INCR LIMITS RENEWAL.           *
     A*                                                               *
     A*  03/15/95 C:24 PROJECT WC405                                  *
     A*                ADDED FIELD FOR FUND.                          *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PLM01                     TEXT('LIMIT CODE TABLE FILE')
     A            LMCO#     R               REFFLD(CO#)
     A            LMKEY     R               REFFLD(KEY)
     A            LMDESC    R               REFFLD(DS30)
                  LMACC     R               REFFLD(SEQ#)
     A                                      COLHDG('BODILY INQUIY BY ACC')
                  LMDIS     R               REFFLD(SEQ#)
     A                                      COLHDG('BODILY INQUIY BY DIS')
                  LMAGG     R               REFFLD(SEQ#)
     A                                      COLHDG('BODILY INQUIY BY AGG')
                  LMMIN     R               REFFLD(PC52)
     A                                      COLHDG('MINIMUM PREMIUM')
      **** BEGIN CHG **** 08/15/01 ************************************
      *********** LMPCT     R               REFFLD(PC32)
                  LMPCT     R               REFFLD(A53)
      **** END   CHG **** 08/15/01 ************************************
     A                                      COLHDG('PERCENTAGE')
     A            LMSTAT    R               REFFLD(STAT)
     A            LMUSER    R               REFFLD(USER)
     A            LMPGM     R               REFFLD(PGM)
     A            LMTIME    R               REFFLD(TIME)
     A            LMDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A*****  RELEASE 2 MODS  *****
     A            LMEFDT    R               REFFLD(DT)
     A                                      COLHDG('EFFECTIVE DATE')
     A            LMCLAS    R               REFFLD(CLAS)
     A                                      COLHDG('LIMITS CLASS CD')
     A*** BEGIN ADD *** 03/15/95 ****************************************
     A            LMFND     R               REFFLD(FND)
     A*** END ADD ***** 03/15/95 ****************************************
     A            LMST      R               REFFLD(ST)
     A            LMIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL USER')
     A            LMIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL PGM')
     A            LMITIM    R               REFFLD(TIME)
     A                                      COLHDG('INITIAL TIME')
     A            LMIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL DATE')
      **** BEGIN ADD **** 09/16/99 *********************************************
     A            LMRNW     R               REFFLD(FLAG)
     A                                      COLHDG('INCREASED' 'LIMIT RENEW')
      **** END   ADD **** 09/16/99 *********************************************
      **** BEG ADD ****** 08/16/11 *********************************************
     A            LMMINE    R     S         REFFLD(A72)
     A                                      COLHDG('MINIMUM PREM' +
     A                                      'EXPANDED')
      **** END ADD ****** 08/16/11 *********************************************
