     A*  (C) Copyright Progressive Data Solutions, Inc., 1997
     A** WORKERS' COMP - OCCUPATION CODE TABLE FILE
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R POC01                     TEXT('OCC CODE TABLE FILE')
     A            OCCO#     R               REFFLD(CO#)
     A            OCKEY     R               REFFLD(KEY)
     A            OCDESC    R               REFFLD(DS30)
     A            OCSTAT    R               REFFLD(STAT)
     A            OCUSER    R               REFFLD(USER)
     A            OCPGM     R               REFFLD(PGM)
     A            OCTIME    R               REFFLD(TIME)
     A            OCDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
