      * (c) 2023 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A**
     A** WORKERS' COMP BODY PART TABLE FILE
     A**********************************************************************
     A*  Revisions:
     A*
     A*  05/01/18 C:053 Project: WC1917
     A*                 Changed size of EDI field
     A*
     A**********************************************************************
     A                                      REF(WREFP)
     A          R PPA01                     TEXT('PART CODE TABLE FILE')
     A            PACO#     R               REFFLD(CO#)
     A            PAKEY     R               REFFLD(KEY)
     A            PADESC    R               REFFLD(DS30)
     A            PASTAT    R               REFFLD(STAT)
     A            PAUSER    R               REFFLD(USER)
     A            PAPGM     R               REFFLD(PGM)
     A            PATIME    R               REFFLD(TIME)
     A            PADT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            PAMBR     R               REFFLD(CODE)
     A                                      COLHDG('BODY' 'MEMBER')
     A*** Beg Chg *** 05/01/18 **********************************
     A*********** PAEDIP    R               REFFLD(CODE)
     A            PAEDIP    R               REFFLD(KEY)
     A*** End Chg *** 05/01/18 **********************************
     A                                      COLHDG('PART' 'CODE')
