     A          R RCDPANEL
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RASSUME    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"rcdPanel","description":"Base P-
     A                                      anel for Return Funds Check Request-
     A                                       Report","overlay":"true","assume":-
     A                                      "true"},"items":[{"id":"HeadingRFCh-
     A                                      eck","field type":"output field","c-
     A                                      ss class":"heading","description":"-
     A                                      Return Funds Check Request Report",-
     A                                      "value":"Return Fund Checks to be W-
     A                                      ritten Report","left":"250px","top"-
     A                                      :"10px","width":"360px","heading ty-
     A                                      pe":"Page Title"},{"id":"btnRefresh-
     A                                      ","field type":"button","css class"-
     A                                      :"button","value":"Refresh","respon-
     A                                      se":{"fieldName":"BtnRefresh","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"left":"-
     A                                      1085px","top":"35px","width":"100px-
     A                                      ","visibility":"hidden"},{"id":"Tab-
     A                                      RFChkReqRpt","field type":"tab pane-
     A                                      l","css class":"tab-panel","left":"-
     A                                      250px","top":"70px","width":"970px"-
     A                                      ,"height":{"fieldName":"pnlHeight",-
     A                                      "dataLength":"5","decPos":"0","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      numBlankFill":"false","zeroFill":"f-
     A                                      alse","noExtraSpaces":"false","curS-
     A                                      ym":"","dataType":"zoned","formatti-
     A                                      ng":"Number","negNum":"-999.00","un-
     A                                      its":"px","designValue":""},"tab na-
     A                                      mes":"Selection Criteria","z index"-
     A                                      :"8","tab panel style":"CompSuite T-
     A                                      ab Panel","active tab":{"fieldName"-
     A                                      :"tabIndex","dataLength":"5","decPo-
     A                                      s":"0","numSep":"false","zeroBalanc-
     A                                      e":"false","numBlankFill":"false","-
     A                                      zeroFill":"false","curSym":"","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"negNum":"-999.00","units":""},"on-
     A                                      tabclick":"pui.click(\"BtnTabClick\-
     A                                      ");"}]}')
     A            BTNREFRESH     1A  H
     A            PNLHEIGHT      5S 0H
     A            TABINDEX       5S 0H
     A          R RCDRFCRPT
     A                                  1  2HTML('QPUIREC5    ROVERLAY   0     -
     A                                      RASSUME    0     RROWS      2    C1-
     A                                          1C1    1 REMSGID    5    C12   -
     A                                      DrpBatchTypeFMSBTYPPRTRC6    WMESGG-
     A                                      C5    *LIBLC0    FERBTYPPRTRREMSGID-
     A                                          5    C12   DrpPrtChkRptFMSPRTRP-
     A                                      T  C6    WMESGGC5    *LIBLC0    FER-
     A                                      PRTRPT  ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"rcdRFCRpt","description":"Retur-
     A                                      n Fund Check Report  ","overlay":"t-
     A                                      rue","assume":"true","overlay range-
     A                                      ":"1-1","design overlay formats":"r-
     A                                      cdPanel"},"items":[{"id":"TxbSCCO#"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","description":"SCCO# box",-
     A                                      "value":{"fieldName":"scCo#","refFi-
     A                                      eld":"elco# wdelp","numSep":"false"-
     A                                      ,"zeroBalance":"false","numBlankFil-
     A                                      l":"false","zeroFill":"false","noEx-
     A                                      traSpaces":"false","curSym":"","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","negNum":"-999.00","units":""-
     A                                      ,"designValue":"[scCo#]"},"left":"5-
     A                                      65px","top":"50px","width":"70px","-
     A                                      css class 2":"textbox","visibility"-
     A                                      :"hidden"},{"id":"Img1","field type-
     A                                      ":"image","css class":"image","imag-
     A                                      e source":"/profoundui/userdata/ima-
     A                                      ges/asterisk_orange_small.png","lef-
     A                                      t":"595px","top":"115px","height":"-
     A                                      8px","width":"8px","css class 2":"r-
     A                                      equired-icon"},{"id":"LblBatchType"-
     A                                      ,"field type":"output field","css c-
     A                                      lass":"label","value":"Batch Type",-
     A                                      "left":"260px","top":"115px","width-
     A                                      ":"85px","locked in place":"false"}-
     A                                      ,{"id":"LblPrtChkRpt","field type":-
     A                                      "output field","css class":"label",-
     A                                      "description":"Print Checks","value-
     A                                      ":"Print Checks","left":"520px","to-
     A                                      p":"115px","width":"80px"},{"id":"D-
     A                                      rpBatchType","field type":"select b-
     A                                      ox","css class":"input","value":{"f-
     A                                      ieldName":"scBtypPrtR","dataLength"-
     A                                      :"1","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[scBtypPr-
     A                                      tR]"},"choices":{"fieldName":"SelCh-
     A                                      oices","dataLength":"200","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none"},"c-
     A                                      hoice values":{"fieldName":"SelValu-
     A                                      es","dataLength":"10","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"},"left"-
     A                                      :"260px","top":"130px","width":"200-
     A                                      px","css class 2":"dropdown","error-
     A                                       messages":"1 message","error messa-
     A                                      ge id":{"fieldName":"msBtypPrtR","d-
     A                                      ataLength":"10","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"},"error messa-
     A                                      ge file":"WMESGG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"erBtypPrtR","customTrue-
     A                                      ":"","customFalse":"","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error enhance-
     A                                      d mode":"1"},{"id":"DrpPrtChkRpt","-
     A                                      field type":"select box","css class-
     A                                      ":"input","descriptio')
     A                                  1  2HTML('n":"Primary sort Dropdown","v-
     A                                      alue":{"fieldName":"scPrtRpt","data-
     A                                      Length":"1","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none","designValue":"[s-
     A                                      cPrtRpt]"},"error messages":"1 mess-
     A                                      age","choices":"Held Checks,Release-
     A                                      d Checks,Both","choice values":"H,R-
     A                                      ,B","left":"520px","top":"130px","w-
     A                                      idth":"145px","css class 2":"dropdo-
     A                                      wn","error message id":{"fieldName"-
     A                                      :"msPrtRpt","dataLength":"10","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      },"error message file":"WMESGG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"erPrtRpt"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror enhanced mode":"1"},{"id":"Sub-
     A                                      LblBlankAll1","field type":"output -
     A                                      field","css class":"sublabel","desc-
     A                                      ription":"Blank For All","value":"(-
     A                                      blank for all)","left":"260px","top-
     A                                      ":"150px","width":"70px"},{"id":"Bt-
     A                                      nCancelPrtChk","field type":"button-
     A                                      ","css class":"button","value":"Can-
     A                                      cel","response":{"fieldName":"BtnPR-
     A                                      Can","customTrue":"","customFalse":-
     A                                      "","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"shortcut key":"Escape","left":"4-
     A                                      55px","top":"175px","width":"100px"-
     A                                      ,"cursor":"default"},{"id":"BtnSubm-
     A                                      it","field type":"button","css clas-
     A                                      s":"button","value":"Submit","respo-
     A                                      nse":{"fieldName":"BtnPRSub","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"shortcut-
     A                                       key":"Enter","left":"565px","top":-
     A                                      "175px","width":"100px","cursor":"d-
     A                                      efault"}]}')
     A            BTNPRCAN       1A  H
     A            BTNPRSUB       1A  H
     A            ERBTYPPRTR     1A  H
     A            ERPRTRPT       1A  H
     A            MSBTYPPRTR    10A  H
     A            MSPRTRPT      10A  H
     A            SCBTYPPRTR     1A  H
     A            SCPRTRPT       1A  H
     A            SELCHOICES   200A  H
     A            SELVALUES     10A  H
     A            SCCO#     R        H      REFFLD(ELCO# WDELP)
