     A* (C) Copyright FISERV Insurance Solutions, Inc., 2005
     A**
     A** WORKERS' COMP BUSINESS CATEGORY TABLE FILE
     A*****************************************************************
     A*  CREATED:    C:53 03/23/05  WC1196
     A*****************************************************************
     A*
     A                                      ALTSEQ(QSYSTRNTBL)
     A          R PTG01                     PFILE(WTTGP)
     A*
     A          K TGCO#
     A          K TGBCTG
