     A* (c) 2023 Sapiens. All Rights Reserved.                             *
     A*
     A* WORKERS' COMP A/R TRANSACTION TYPE CODE TABLE FILE
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A* 03/11/21 C:62  Project: WC2663                                *
     A*                Add Exclude from Invoice Cloud                 *
     A*                                                               *
     A* 05/29/03  C:35   PROJECT: 129WAK                              *
     A*                  CHANGED FIELD TO PACKED.                     *
     A*                                                               *
     A* 03/19/03 C:61  PROJECT 129WAK                                 *
     A*                Add security level / type fields.              *
     A*                                                               *
     A*  04/21/98  C:33  PROJECT: WC577                               *
     A*                  ADD TT1@TY (G/L RECORD TYPE)                 *
     A*                      TT1DCT (G/L DOCUMENT TYPE)               *
     A*                      TT1OBJ (G/L OBJECT ACCOUNT)              *
     A*                      TT1GLC (G/L OFFSET)                      *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PTT01                     TEXT('TRANSACTION TYPE CODE FILE')
     A            TTCO#     R               REFFLD(CO#)
     A            TTKEY     R               REFFLD(KEY)
     A            TTDESC    R               REFFLD(DS30)
     A            TTTYPE    R               REFFLD(FLAG)
     A            TTSTAT    R               REFFLD(STAT)
     A            TTUSER    R               REFFLD(USER)
     A            TTPGM     R               REFFLD(PGM)
     A            TTTIME    R               REFFLD(TIME)
     A            TTDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            TTDCO     R               REFFLD(CO#)
     A                                      COLHDG('GL COMPANY')
     A            TTDFAC    R               REFFLD(FAC)
     A            TTDDPT    R               REFFLD(DPT)
     A            TTDACC    R               REFFLD(ACC)
     A            TTDSUB    R               REFFLD(SUB)
     A            TTCCO     R               REFFLD(CO#)
     A                                      COLHDG('GL COMPANY')
     A            TTCFAC    R               REFFLD(FAC)
     A            TTCDPT    R               REFFLD(DPT)
     A            TTCACC    R               REFFLD(ACC)
     A            TTCSUB    R               REFFLD(SUB)
     A            TTCTYP    R               REFFLD(FLAG)
     A                                      COLHDG('A/R CATEGORY TYPE')
     A            TTEXDS    R               REFFLD(FLAG)
     A                                      COLHDG('EXCLUDE DEPOSIT SLIP')
     A            TTECFL    R               REFFLD(FLAG)
     A                                      COLHDG('EXCL AGNT COMMISSION')
     A***  BEGIN ADD  ***  04/21/98  *********************************
     A            TT1@TY         2A         COLHDG('G/L' 'RECORD' 'TYPE')
     A            TT1DCT         2A         COLHDG('G/L' 'DOCUMENT' 'TYPE')
     A            TT1OBJ         4A         COLHDG('G/L' 'OBJECT' 'ACCOUNT')
     A            TT1GLC         4A         COLHDG('G/L' 'OFFSET')
     A***  END   ADD  ***  04/21/98  *********************************
      ****** beg add ****** 03/19/03 **********************************
      *
      **** BEGIN CHG **** 05/29/03 *********************************************
     A*********** TTMINS         3S 0
     A            TTMINS    R               REFFLD(LVL)
      **** BEGIN CHG **** 05/29/03 *********************************************
     A                                      COLHDG('Security Level' +
     A                                      'Required')
      *
     A            TTTY01         1A
     A                                      COLHDG('Security Type 1')
      *
     A            TTTY02         1A
     A                                      COLHDG('Security Type 2')
      *
     A            TTTY03         1A
     A                                      COLHDG('Security Type 3')
      *
     A            TTTY04         1A
     A                                      COLHDG('Security Type 4')
      *
     A            TTTY05         1A
     A                                      COLHDG('Security Type 5')
      *
     A            TTTY06         1A
     A                                      COLHDG('Security Type 6')
      *
      ****** end add ****** 03/19/03 **********************************
      *** Begin Add *** 03/11/21 **************************************
     A            TTEXIC         1A         COLHDG('Exclude from' +
     A                                      'Invoice Cloud')
      *** End   Add *** 03/11/21 **************************************
