     A*  (C) Copyright Progressive Data Solutions, Inc., 1990,93,95
     A*
     A** EDI/NOI Transmission Data
     A*
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A* 08/23/96 C:15 PROJECT: 25WDE                                  *
     A*               REMOVED THE TRANS SET ID FROM THE KEY LIST      *
     A*               SINCE IT IS NOT NECESSARY.                      *
     A*****************************************************************
     A*  ACKNOWLEDGEMENT HEADER
     A          R PHA01                     PFILE(WXHAP)
     A          K HACO#
     A          K HAJST
     A*** BEGIN DLT *** 08/23/96 **************************************
     A********* K HATSET
     A*** END DLT ***** 08/23/96 **************************************
     A          K HAOTDT
     A          K HAOTTM
     A*  ACKNOWLEDGEMENT DETAIL
     A          R PA101                     PFILE(WXA1P)
     A          K A1CO#
     A          K A1JST
     A*** BEGIN DLT *** 08/23/96 **************************************
     A********* K A1TAK1
     A*** END DLT ***** 08/23/96 **************************************
     A          K A1OTDT
     A          K A1OTTM
