     A*****************************************************************
     A*  (C) COPYRIGHT STONERIVER INC., 2018
     A*****************************************************************
     A*    EDI A49 - R22 Flat File
     A*******************************************************************
     A* REVISIONS:
     A*
     A* 00/00/00 C:000 PROJECT: XX
     A*
     A*****************************************************************
     A          R PX901                     TEXT('EDI A49 - R22 Format')
     A*
     A            X9DATA     19830A         COLHDG('DATA')
