     ** ======================================================= **
      *  (C) COPYRIGHT FISERV INSURANCE SOLUTIONS, 2008           *
      *                                                           *
      ** WORKERS' COMPENSATION POLICY PAGE ADDRESS REPORTING FILE *
      *                                                           *
      * 10/01/08  C:197  PROJECT: WC1701                          *
     ** ======================================================= **
     A****+======================================================= **
     A* REVISIONS:                                                   *
     A*                                                              *
     A****************************************************************
     A** WORKERS' COMP POLICY PAGE NAME REPORTING FILE
     A*
     A          R PA501                     PFILE(WXA5P)
     A          K A5CO#
     A          K A5FND
     A          K A5EMP#
     A          K A5FYR
     A          K A5SST
     A          K A5SCTY
