     A* (c) 2016 StoneRiver, Inc. All rights Reserved.                *
     A* StoneRiver is a trademark of StoneRiver, Inc.                 *
     A*                                                               *
     A*****************************************************************
     A* WCPOLS REPORTED ADDRESS WORK FILE LOGICAL                     *
     A*****************************************************************
     A*                                                               *
     A*  PROJECT:  WC2446       PROGRAMMER:  C:65                     *
     A*  CREATED:  08/15/16                                           *
     A*                                                               *
     A*****************************************************************
     A*
     A          R PA601                     PFILE(WXA6P)
     A          K A6CO#
     A          K A6FND
     A          K A6FYR
     A          K A6EMP#
     A          K A6UNID
     A          K A6TYPE
