      * (c) 2025 Sapiens. All Rights Reserved.
     A*****************************************************************
     A*  WORKERS' COMPENSATION AUDIT PAYROLL UPLOAD FILE
     A*****************************************************************
     A*  Project:  150WBV       Programmer:  C:291                    *
     A*  Created:  10/27/22                                           *
     A*****************************************************************
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A          R PAD01                     PFILE(WXADP)
     A          K ADEMP#
     A          K ADFYR
     A          K ADDIV
