     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1997
     A*
     A** WORKERS' COMPENSATION AGT QUOTE SYSTEM
     A*
     A          R PAR01                     PFILE(WXARP)
     A          K ARCO#
     A          K ARFND
     A          K ARCNTY
     A          K ARAGNM
     A          K ARAGT#
     A          K ARTYPE
     A          K AREFDT
