      * (c) 2024 Sapiens. All Rights Reserved.                             *
     A**
     A** WORKERS' COMP EMPLOYER PAYROLL WORK FILE
     A**
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*  06/17/24 C:344 PROJECT: WC2952                               *
     A*                 Expand rate field from 7.2 to 8.3 zoned.      *
     A*                                                               *
     H*  08/30/01 C:90 PROJECT: WC1052                                *
     H*                Expand premium fields from 9.2 to 11.2         *
     H*                                                               *
     H*  08/15/01 C:90 PROJECT: WC1035                                *
     H*                Expand rate field from 5.2 to 7.2              *
     H*                                                               *
     H*  08/29/91 JJJ  PROJECT AIZ                                    *
     H*                ADDED 3 DATES IN ORDER TO SPLIT PAYROLLS       *
     H*                FOR ALL RATING CHANGES                         *
     A*                                                               *
     A*  11/16/95 C:30 Project:  WC385                                *
     A*                Added 2 fields to handle the NCCI Data         *
     A*                Reporting changes:  B5EXDT (Effective Date of  *
     A*                Modification) & B5EXMD (Experience Modification*
     A*                                                               *
     A*  06/06/96 C:35 PROJECT:  WC513                                *
     A*                ADDED AUDITED MANUAL PREM FOR EXTENDED BSI.    *
     A*                                                               *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PB501                     TEXT('EMPLOYER PAYROLL WORK FILE')
     A            B5CO#     R               REFFLD(CO#)
     A            B5FND     R               REFFLD(FND)
     A            B5FYR     R               REFFLD(FYR)
     A            B5EMP#    R               REFFLD(EMP#)
     A            B5CLAS    R               REFFLD(CLAS)
     A            B5AAPR    R               REFFLD(A112)
     A                                      COLHDG('AUDITED' 'PAYROLL')
     A            B5SPEC    R               REFFLD(FLAG)
     A                                      COLHDG('SPECIAL DES')
      **** BEGIN CHG **** 06/17/24 ************************************
      **** BEGIN CHG **** 08/15/01 ************************************
     A*********** B5ARAT    R               REFFLD(PC52)
     A*********** B5ARAT    R               REFFLD(A72)
      **** END   CHG **** 08/15/01 ************************************
     A            B5ARAT         8S 3
      **** END   CHG **** 06/17/24 ************************************
     A                                      COLHDG('ADJUSTED RATE')
     A*** BEGIN ADD ***** 08/29/91 *** JJJ ********************************
     A            B5EFDT    R               REFFLD(DT)
     A                                      COLHDG('PAYROLL EFF DATE')
     A            B5RDAT    R               REFFLD(DT)
     A                                      COLHDG('RATING DATE')
     A            B5TODT    R               REFFLD(DT)
     A                                      COLHDG('PAYROLL END DATE')
     A*** BEGIN ADD *** 11/16/95 ***
     A            B5EXMD         4S 3       COLHDG('Experience' 'Modification')
     A            B5EXDT    R               REFFLD(DT)
     A                                      COLHDG('Effective' 'Date' 'Modifica-
     A                                      tion')
     A*** END   ADD *** 11/16/95 ***
      **** BEGIN ADD **** 06/06/96 ************************************
      **** BEGIN CHG **** 08/30/01 ************************************
     A*********** B5AMPR    R               REFFLD(A92)
     A            B5AMPR    R               REFFLD(A112)
      **** END   CHG **** 08/30/01 ************************************
     A                                      COLHDG('AUD MAN PREM')
      **** BEGIN ADD **** 06/06/96 ************************************
     A          K B5CO#
     A          K B5FND
     A          K B5FYR
     A          K B5EMP#
     A          K B5EFDT
     A          K B5CLAS
     A          K B5SPEC
