     A* (c) 2014 StoneRiver, Inc. All rights Reserved.               **
     A* StoneRiver is a trademark of StoneRiver, Inc.                **
     A** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **
     A** WORK FILE FOR BANK CLAIMS CHECK DOWNLOAD FILE
     A**                                                             **
     A**   NOTE: DATE REQUESTED AS 6 POSTIONS MMDDYY-NOT 8 MMDDCCYY  **
     A**                                                             **
     A**  10/28/03  C: 132  PROJECT: 121WAR                          **
     A** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **
     A** MODIFICATIONS:                                              **
     A**                                                             **
     A*   06/04/14  C:  53  REDMINE: 4200
     A*                     RENAMING THE FILE SO THAT CAN BE BROUGHT
     A**                    IN BASE                                  **
     A**                                                             **
     A*   08/31/04  C:  53  PROJECT: 121WBB
     A*                     CREATE IN CLT129
     A**                                                             **
     A** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **
     A*
     A          R PBR01
     A            BRTYPE         1A         COLHDG('RECORD TYPE')
     A            BRACCT        13A         COLHDG('ACCOUNT NBR')
     A            BRCHK#        10A         COLHDG('CHECK NBR')
     A            BRCHKD         6A         COLHDG('CHECK DATE')
     A            BRAMT         11A         COLHDG('CHECK AMOUNT')
     A            BRFILL        30A         COLHDG('ADDITIONAL DATA')
