      * (c) 2016 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A* ============================================================= *
     A*  CLAIM'S BENEFIT SUMMARY WORK FILE
     A* ============================================================= *
     A*  Created on 2/22/2016 by c:300 for Support PHW29764
     A* ============================================================= *
     A* REVISIONS:                                                    *
     A*                                                               *
     A*                                                               *
     A* ============================================================= *
     A                                      REF(WREFP)
     A          R PCB02                     TEXT('BENEFIT DETAIL FILE')
     A            CBCOD2    R               REFFLD(CODE)
     A                                      COLHDG('BENEFIT' 'CODE')
     A            CBAMT2    R               REFFLD(A92)
     A                                      COLHDG('TOTAL BENEFIT' 'AMOUNT')
