      * (c) 2019 Sapiens, Inc. All rights Reserved.                        *
     A*
     A* EDI Claim Import File - Claim#/Sts/JrSt/MTC/EventDt
     A*
     A**********************************************************************
     A* Created on 09/07/19 by c:62 for Project 152WAU
     A**********************************************************************
     A* Revisions:                                                         *
     A*                                                                    *
     A**********************************************************************
     A          R WXCLP                     PFILE(WXCLP)
     A          K CLCLM#
     A          K CLSTS
     A          K CLJRST
     A          K CLMTC
     A          K CLEVENTDT
