     A*  (C) Copyright Progressive Data Systems, Inc., 1988
     A** (C) COPYRIGHT INSURANCE ADMINISTRATIVE SYSTEMS, INC. 1987
     A**
     A** WORKERS' COMPENSATION CANCELATION NOTICE WORK FILE
     A*
     A          R PCN01                     PFILE(WXCNP)
     A          K CNCO#
     A          K CNFND
     A          K CNEMP#
     A          K CNDIV
     A          K CNDATE
     A          S CNSELC                    COMP(EQ 'Y')
     A            CNSTAT                    COMP(EQ ' ')
