      * (c) 2025 Sapiens. All Rights Reserved.                       *
      * Ded Dtl Rpt Hdr XML Work File
      * Created:  02/17/16  C:136  Project: SY371
      *==============================================================*
      *                                                              *
      * 01/20/25 C:300 Project: WC2494                               *
      *                Add new fields for Deductible Invoice Scriptura
      *                output.                                       *
      * REVISIONS:
      *==============================================================*
     A                                      REF(WREFP)
     A          R PDD001                    TEXT('Ded Dtl Rpt Hdr')
     A            D0XMLKEY  R               REFFLD(DS60)
     A                                      COLHDG('XML Key')
     A            D0CO#     R     S         REFFLD(CO#)
     A            D0CNAM    R               REFFLD(NM60)
     A                                      COLHDG('COMPANY NAME')
     A            D0RNAM    R               REFFLD(DS60)
     A                                      COLHDG('REPORT TITLE')
     A            D0PNAM    R               REFFLD(DS10)
     A                                      COLHDG('PROGRAM' 'NAME')
     A            D0RNDT    R               REFFLD(DS10)
     A                                      COLHDG('RUN DATE')
     A            D0RNTM         8          COLHDG('RUN TIME')
     A            D0ASOF    R               REFFLD(DS10)
     A                                      COLHDG('LOSS' 'AS OF' 'DATE')
     A            D0PODT    R               REFFLD(DS10)
     A                                      COLHDG('A/R POST' 'DATE')
     A            D0BTYP    R               REFFLD(DS10)
     A                                      COLHDG('DED' 'BILL' 'TYPE')
     A            D0EXFL    R               REFFLD(FLAG)
     A                                      COLHDG('EXC' 'ACTV' 'FLAG')
     A            D0MSFL    R               REFFLD(FLAG)
     A                                      COLHDG('MASS/SINGLE' 'FLAG')
      *** Beg Add ***** 01/20/25 ************************************
     A            D0PEDT        10          COLHDG('Period End' 'Date')
     A            D0PSSN         1          COLHDG('Print SSN')
      *** End Add ***** 01/20/25 ************************************
