     A*  (C) Copyright Progressive Data Solutions Inc., 1995          *
     A*
     A*  WORKERS' COMP DUPLICATE PAYMENT WORK FILE LOGICAL
     A*
     A*****************************************************************
     A*  PROGRAMMER: 30                                               *
     A*  CREATED:    12/26/95                                         *
     A*  PROJECT#:   WC457                                            *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*****************************************************************
     A          R PDU02                     PFILE(WXDU2P)
     A          K DUKEY
