     A* COPYRIGHT (C) 2020 SAPIENS INTERNATIONAL. ALL RIGHTS RESERVED.
     A*
     A*  EMPLOYER REPORT SELECTION WORKFILE
     A*
     A*****************************************************************
     A*  PROGRAMMER: 180                                              *
     A*  CREATED:    01/08/19                                         *
     A*  PROJECT#:   102WIC                                           *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*****************************************************************
     A          R PEB01                     PFILE(WXEBP)
     A          K EBCO#
     A          K EBFND
     A          K EBFYR
     A          K EBEMP#
     A          K EBJRST
