     A*  (C) Copyright Progressive Data Solutions, Inc., 1999
     A*
     A*  EMPLOYER REPORT SELECTION WORKFILE
     A*
     A*****************************************************************
     A*  PROGRAMMER: 35                                               *
     A*  CREATED:    06/24/96                                         *
     A*  PROJECT#:   CM019                                            *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A* 05/06/10  C:235 PROJECT: 133WIP                               *
     A*                 Agent Employee List Report-Add Agent Status   *
     A*                 date                                          *
     A*                                                               *
     A* 04/03/99  C:33 PROJECT: 96WAD                                 *
     A*                ADDED EBACUR - ACCOUNT CURRENT POLICY          *
     A*                                                               *
     A* 08/20/98  C87  PROJECT  WC577                                 *
     A*                ADDED EBCFDT - CONFIRMED PROCESSED DT
     A*                                                               *
     A* 09/16/96  C57  PROJECT  CM015                                 *
     A*                ADDED EBINDT - EMPLR ORIG INCEPT DATE          *
     A*                ADDED EBPFDT - POLICY EFFECTIVE DATE           *
     A*                ADDED EBCNDT - POLICY CANCELLATION DATE        *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PEB01                     TEXT('EMP RPT SELECTION WORKFILE')
     A            EBCO#     R               REFFLD(CO#)
     A            EBFND     R               REFFLD(FND)
     A            EBFYR     R               REFFLD(FYR)
     A            EBEMP#    R               REFFLD(EMP#)
     A            EBDIV     R               REFFLD(DIV)
     A            EBSRT1        40A
     A                                      COLHDG('PRIMARY' 'SORT')
     A            EBSRT2        40A
     A                                      COLHDG('SECONDARY' 'SORT')
     A            EBENAM    R               REFFLD(NAME)
     A                                      COLHDG('EMPLOYER' 'NAME')
     A            EBAGT#    R               REFFLD(AGT#)
     A            EBANAM    R               REFFLD(NAME)
     A                                      COLHDG('AGENT' 'NAME')
     A            EBRGN#    R               REFFLD(RGN#)
     A            EBCHAP    R               REFFLD(RGN#)
     A            EBCNTY    R               REFFLD(CODE)
     A                                      COLHDG('COUNTY' 'CODE')
     A            EBEZIP    R               REFFLD(ZIP1)
     A                                      COLHDG('EMPLOYER' 'ZIP')
     A            EBAZIP    R               REFFLD(ZIP1)
     A                                      COLHDG('AGENT' 'ZIP')
     A            EBSEFL    R               REFFLD(FLAG)
     A                                      COLHDG('SELF-REPT/' 'ESTIMATE FLAG')
     A            EBUSER    R               REFFLD(USER)
     A            EBPGM     R               REFFLD(PGM)
     A            EBTIME    R               REFFLD(TIME)
     A            EBDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            EBINDT    R               REFFLD(DT)
     A                                      COLHDG('EMPLR' 'ORIG INCEPT' 'DATE')
     A            EBPFDT    R               REFFLD(DT)
     A                                      COLHDG('POLICY' 'EFFECT' 'DATE')
     A            EBCNDT    R               REFFLD(DT)
     A                                      COLHDG('POLICY' 'CANCEL' 'DATE')
     A            EBJRST    R               REFFLD(ST)
     A                                      COLHDG('PREMIUM RATING STATE')
      *** BEGIN ADD *** 12/01/97 ******************************************
     A            EBPTDT    R               REFFLD(DT)
     A                                      COLHDG('POLICY' 'TO' 'DATE')
      *** END   ADD *** 12/01/97 ******************************************
     A*** BEGIN ADD *** 08/20/98 ******************************************
     A            EBCFDT    R               REFFLD(DT)
     A                                      COLHDG('CONFIRMED' 'PROCESSED DT')
     A*** END   ADD *** 08/20/98 ******************************************
     A***  BEGIN ADD  ***  04/02/99  *********************************
     A            EBACUR    R               REFFLD(FLAG)
     A                                      COLHDG('ACCOUNT' 'CURRENT' 'POLICY')
     A***  END   ADD  ***  04/02/99  *********************************
     A***  BEG   ADD  ***  05/06/10  *********************************
     A            EBAGTL         5S 0       COLHDG('LAST ACTIVE AGENT')
     A***  END   ADD  ***  05/06/10  *********************************
