     A*  (C) Copyright Progressive Data Solutions Inc., 1996          *
     A*
     A*  EMPLOYER REPORT SELECTION WORKFILE
     A*
     A*****************************************************************
     A*  PROGRAMMER: 35                                               *
     A*  CREATED:    06/25/96                                         *
     A*  PROJECT#:   CM019                                            *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*****************************************************************
     A          R PEB01                     PFILE(WXEBP)
     A          K EBCO#
     A          K EBFND
     A          K EBSRT1
     A          K EBSRT2
