      * Copyright('(c) 2024 Sapiens. All Rights Reserved.')           *
     A*****************************************************************
     A** WORKERS' COMP FUND WORK FILE
     A*****************************************************************
     A* Created: 340 :  PROJECT: WC2972    07/16/24
     A*                                                               *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PGS01                     TEXT('Fund Work File')
     A
     A            GSCO#     R               REFFLD(CO#)
     A            GSFND     R               REFFLD(FND)
     A            GSNAME    R               REFFLD(NM60)
     A            GSIEFL    R               REFFLD(FLAG)
     A                                      TEXT('Include/Exclude')
     A            GSRRE#    R     S         REFFLD(FEIN)
     A                                      COLHDG('Responsibility' -
     A                                      'Reporting' 'Entity')
     A            GSNCCI         5A         COLHDG('NCCI' 'Carrier#')
     A            GSTCC          5A         COLHDG('Transmitter' -
     A                                      'Control Code' )
     A                                      TEXT('Transmitter Control Code')
     A            GSNCARGPCD     5A         COLHDG('NCCI Carrier' 'Group Code')
     A          K GSCO#
     A          K GSFND
