     A*  (C) COPYRIGHT FISERV, INC., 2008
     A*****************************************************************
     A**
     A** EDI AUTO TRIGGER HEADER HISTORY FILE
     A**
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PHT01
     A            HFXML     R               REFFLD(DS20)
     A                                      COLHDG('XML VERSION')
     A            HFACK        250          COLHDG('TRGFUNCTIONALACK')
     A            HTTYPE    R               REFFLD(DS5)
     A                                      COLHDG('TYPE')
     A            HTDATP    R               REFFLD(DS10)
     A                                      COLHDG('DATE PROCESSED')
     A            HTTIMP    R               REFFLD(DS15)
     A                                      COLHDG('TIME PROCESSED')
     A            HTSNDF    R               REFFLD(DS9)
     A                                      COLHDG('SENDER FEIN')
     A            HTSNDZ    R               REFFLD(DS9)
     A                                      COLHDG('SENDER ZIP')
     A            HTIVID         3          COLHDG('INTERCHANGE VERSION' +
     A                                      'ID')
     A            HTDATS    R               REFFLD(DS10)
     A                                      COLHDG('DATE SENT')
     A            HTTIMS    R               REFFLD(DS15)
     A                                      COLHDG('TIME SENT')
     A            HTCNTP         6          COLHDG('COUNT PROCESSED')
     A            HTCNTE         6          COLHDG('COUNT PASSED EDITS')
