     A* (c) 2017 StoneRiver, Inc. All rights Reserved.                *
     A* StoneRiver is a trademark of StoneRiver, Inc.                 *
     A*                                                               *
     A*****************************************************************
     A* SCRIPTURA DATA WORK FILE FOR ESTIMATED LATE NOTICES           *
     A*****************************************************************
     A*                                                               *
     A*  PROJECT:  SY371        PROGRAMMER:  C:65                     *
     A*  CREATED:  01/09/17                                           *
     A*  DESCRIPTION:  THIS IS THE WORK FILE TO HOLD THE DATA FOR     *
     A*                ESTIMATED LATE NOTICES AND REPORT.             *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A* 05/26/21  C:65  PROJECT: WC2760                               *
     A*                 ADD AGENT FIELDS TO WORK FILE.                *
     A*                                                               *
     A* 03/05/21  C:180 SUPPORT: 94891 (LUBA)                         *
     A*                 INCREASE EMP# FROM 5 TO 9                     *
     A*                                                               *
     A* 01/03/20  C:300 SUPPORT: 86217 (CAREWEST)                     *
     A*                 ADD CONTACT PERSON FIELD.                     *
     A*                                                               *
     A* 04/04/16  C:65  PROJECT: SY371                                *
     A*                 ADD # OF EMPLOYERS TOTAL FIELD.               *
     A*                                                               *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PL801                     TEXT('EST LATE NOTICE WORKFILE')
     A*
     A* KEY FIELDS
     A*
     A            L8XML         60A         COLHDG('XML FILE NAME')
     A*
     A* CRITERIA FIELDS
     A*
     A            L8CO#          3S 0       COLHDG('REPORT COMPANY #')
     A            L8CONAME      60A         COLHDG('REPORT COMPANY NAME')
     A            L8USRNAME     60A         COLHDG('REPORT USER NAME')
     A            L8DIS1        40A         COLHDG('RPT DISTRIBUTION 1')
     A            L8DIS2        40A         COLHDG('RPT DISTRIBUTION 2')
     A            L8DIS3        40A         COLHDG('RPT DISTRIBUTION 3')
     A            L8DIS4        40A         COLHDG('RPT DISTRIBUTION 4')
     A            L8TITL        60A         COLHDG('REPORT TITLE')
     A            L8FRDT         8S 0       COLHDG('REPORT FROM DATE')
     A            L8TODT         8S 0       COLHDG('REPORT TO DATE')
     A            L8MINAMT       8S 0       COLHDG('REPORT MIN AMOUNT')
     A            L8EXCAUD       1A         COLHDG('RPT EXCL' 'CONTESTED AUDIT')
     A            L8RPTONLY      1A         COLHDG('REPORT ONLY MODE')
     A            L8SORT1       20A         COLHDG('REPORT SORT #1')
     A            L8SORT2       20A         COLHDG('REPORT SORT #2')
     A            L8RPTEMP       9S 0       COLHDG('REPORT EMPLOYER #')
     A            L8RPTDIV       5A         COLHDG('REPORT DIVISION')
     A            L8AGT#FRM      5S 0       COLHDG('RPT AGENT #' 'FROM RANGE')
     A            L8AGT#TO       5S 0       COLHDG('RPT AGENT #' 'TO RANGE')
     A            L8AGTNFRM     20A         COLHDG('RPT AGT NAME' 'FROM RANGE')
     A            L8AGTNTO      20A         COLHDG('RPT AGT NAME' 'TO RANGE')
      *** BEGIN CHANGE *** 03/05/21 *******************************
     A**          L8EMP#FRM      5S 0       COLHDG('RPT EMPLR #' 'FROM RANGE')
     A**          L8EMP#TO       5S 0       COLHDG('RPT EMPLR #' 'TO RANGE')
     A            L8EMP#FRM      9S 0       COLHDG('RPT EMPLR #' 'FROM RANGE')
     A            L8EMP#TO       9S 0       COLHDG('RPT EMPLR #' 'TO RANGE')
      *** END   CHANGE *** 03/05/21 *******************************
     A            L8EMPNFRM     20A         COLHDG('RPT EMP NAME' 'FROM RANGE')
     A            L8EMPNTO      20A         COLHDG('RPT EMP NAME' 'TO RANGE')
     A            L8POLFRDT      8S 0       COLHDG('REPORT POLICY' 'FROM DATE')
     A            L8POLTODT      8S 0       COLHDG('REPORT POLICY' 'TO DATE')
     A            L8RPTSTATE     2A         COLHDG('REPORT RATING STATE')
     A            L8INT1STIN     3S 0       COLHDG('INTERIM DAYS' '1ST INST')
     A            L8INTESTBL     3S 0       COLHDG('INTERIM DAYS' 'EST BILL')
     A            L8INTAUDBL     3S 0       COLHDG('INTERIM DAYS' 'AUD BILL')
     A            L8INTRVAUD     3S 0       COLHDG('INTERIM DAYS' 'REV AUDIT')
     A            L8RPTACTST    40A         COLHDG('REPORT' 'ACCOUNT STATUS')
     A            L8RPTAUDST    40A         COLHDG('REPORT' 'AUDIT STATUS')
     A            L8RPTACTTY    40A         COLHDG('REPORT' 'ACCOUNT TYPE')
     A            L8INCDEP       1A         COLHDG('REPORT' 'INCLUDE DEPOSIT')
     A            L8ADDDAYS      3S 0       COLHDG('ADDITIONAL DAYS' 'INST DT')
     A            L8ARFLAG       1A         COLHDG('REPORT' 'A/R INC/EXC FLG')
     A            L8ARCD01       2A         COLHDG('REPORT' 'A/R CODE 01')
     A            L8ARCD02       2A         COLHDG('REPORT' 'A/R CODE 02')
     A            L8ARCD03       2A         COLHDG('REPORT' 'A/R CODE 03')
     A            L8ARCD04       2A         COLHDG('REPORT' 'A/R CODE 04')
     A            L8ARCD05       2A         COLHDG('REPORT' 'A/R CODE 05')
     A            L8ARCD06       2A         COLHDG('REPORT' 'A/R CODE 06')
     A            L8ARCD07       2A         COLHDG('REPORT' 'A/R CODE 07')
     A            L8ARCD08       2A         COLHDG('REPORT' 'A/R CODE 08')
     A            L8ARCD09       2A         COLHDG('REPORT' 'A/R CODE 09')
     A            L8ARCD10       2A         COLHDG('REPORT' 'A/R CODE 10')
     A            L8ARCD11       2A         COLHDG('REPORT' 'A/R CODE 11')
     A            L8ARCD12       2A         COLHDG('REPORT' 'A/R CODE 12')
     A            L8ARCD13       2A         COLHDG('REPORT' 'A/R CODE 13')
     A            L8ARCD14       2A         COLHDG('REPORT' 'A/R CODE 14')
     A            L8ARCD15       2A         COLHDG('REPORT' 'A/R CODE 15')
     A            L8ARCD16       2A         COLHDG('REPORT' 'A/R CODE 16')
     A            L8ARCD17       2A         COLHDG('REPORT' 'A/R CODE 17')
     A            L8ARCD18       2A         COLHDG('REPORT' 'A/R CODE 18')
     A            L8ARCD19       2A         COLHDG('REPORT' 'A/R CODE 19')
     A            L8ARCD20       2A         COLHDG('REPORT' 'A/R CODE 20')
     A            L8ARCD21       2A         COLHDG('REPORT' 'A/R CODE 21')
     A            L8ARCD22       2A         COLHDG('REPORT' 'A/R CODE 22')
     A            L8ARCD23       2A         COLHDG('REPORT' 'A/R CODE 23')
     A            L8ARCD24       2A         COLHDG('REPORT' 'A/R CODE 24')
     A            L8ARCD25       2A         COLHDG('REPORT' 'A/R CODE 25')
     A            L8ARCD26       2A         COLHDG('REPORT' 'A/R CODE 26')
     A            L8ARCD27       2A         COLHDG('REPORT' 'A/R CODE 27')
     A            L8ARCD28       2A         COLHDG('REPORT' 'A/R CODE 28')
     A            L8ARCD29       2A         COLHDG('REPORT' 'A/R CODE 29')
     A            L8ARCD30       2A         COLHDG('REPORT' 'A/R CODE 30')
     A            L8ARDS01      30A         COLHDG('REPORT' 'A/R CODE DESC 01')
     A            L8ARDS02      30A         COLHDG('REPORT' 'A/R CODE DESC 02')
     A            L8ARDS03      30A         COLHDG('REPORT' 'A/R CODE DESC 03')
     A            L8ARDS04      30A         COLHDG('REPORT' 'A/R CODE DESC 04')
     A            L8ARDS05      30A         COLHDG('REPORT' 'A/R CODE DESC 05')
     A            L8ARDS06      30A         COLHDG('REPORT' 'A/R CODE DESC 06')
     A            L8ARDS07      30A         COLHDG('REPORT' 'A/R CODE DESC 07')
     A            L8ARDS08      30A         COLHDG('REPORT' 'A/R CODE DESC 08')
     A            L8ARDS09      30A         COLHDG('REPORT' 'A/R CODE DESC 09')
     A            L8ARDS10      30A         COLHDG('REPORT' 'A/R CODE DESC 10')
     A            L8ARDS11      30A         COLHDG('REPORT' 'A/R CODE DESC 11')
     A            L8ARDS12      30A         COLHDG('REPORT' 'A/R CODE DESC 12')
     A            L8ARDS13      30A         COLHDG('REPORT' 'A/R CODE DESC 13')
     A            L8ARDS14      30A         COLHDG('REPORT' 'A/R CODE DESC 14')
     A            L8ARDS15      30A         COLHDG('REPORT' 'A/R CODE DESC 15')
     A            L8ARDS16      30A         COLHDG('REPORT' 'A/R CODE DESC 16')
     A            L8ARDS17      30A         COLHDG('REPORT' 'A/R CODE DESC 17')
     A            L8ARDS18      30A         COLHDG('REPORT' 'A/R CODE DESC 18')
     A            L8ARDS19      30A         COLHDG('REPORT' 'A/R CODE DESC 19')
     A            L8ARDS20      30A         COLHDG('REPORT' 'A/R CODE DESC 20')
     A            L8ARDS21      30A         COLHDG('REPORT' 'A/R CODE DESC 21')
     A            L8ARDS22      30A         COLHDG('REPORT' 'A/R CODE DESC 22')
     A            L8ARDS23      30A         COLHDG('REPORT' 'A/R CODE DESC 23')
     A            L8ARDS24      30A         COLHDG('REPORT' 'A/R CODE DESC 24')
     A            L8ARDS25      30A         COLHDG('REPORT' 'A/R CODE DESC 25')
     A            L8ARDS26      30A         COLHDG('REPORT' 'A/R CODE DESC 26')
     A            L8ARDS27      30A         COLHDG('REPORT' 'A/R CODE DESC 27')
     A            L8ARDS28      30A         COLHDG('REPORT' 'A/R CODE DESC 28')
     A            L8ARDS29      30A         COLHDG('REPORT' 'A/R CODE DESC 29')
     A            L8ARDS30      30A         COLHDG('REPORT' 'A/R CODE DESC 30')
     A            L8ASFLAG       1A         COLHDG('REPORT' 'ACTV INC/EXC FLG')
     A            L8ASCD01       2A         COLHDG('REPORT' 'ACTV STS CODE 01')
     A            L8ASCD02       2A         COLHDG('REPORT' 'ACTV STS CODE 02')
     A            L8ASCD03       2A         COLHDG('REPORT' 'ACTV STS CODE 03')
     A            L8ASCD04       2A         COLHDG('REPORT' 'ACTV STS CODE 04')
     A            L8ASCD05       2A         COLHDG('REPORT' 'ACTV STS CODE 05')
     A            L8ASDS01      30A         COLHDG('REPORT' 'ACTV STS DESC 01')
     A            L8ASDS02      30A         COLHDG('REPORT' 'ACTV STS DESC 02')
     A            L8ASDS03      30A         COLHDG('REPORT' 'ACTV STS DESC 03')
     A            L8ASDS04      30A         COLHDG('REPORT' 'ACTV STS DESC 04')
     A            L8ASDS05      30A         COLHDG('REPORT' 'ACTV STS DESC 05')
     A            L8COMC01       2A         COLHDG('REPORT' 'COMMENT CODE 01')
     A            L8COMC02       2A         COLHDG('REPORT' 'COMMENT CODE 02')
     A            L8COMC03       2A         COLHDG('REPORT' 'COMMENT CODE 03')
     A            L8COMC04       2A         COLHDG('REPORT' 'COMMENT CODE 04')
     A            L8COMC05       2A         COLHDG('REPORT' 'COMMENT CODE 05')
     A            L8COMD01      40A         COLHDG('REPORT' 'COMMENT DESC 01')
     A            L8COMD02      40A         COLHDG('REPORT' 'COMMENT DESC 02')
     A            L8COMD03      40A         COLHDG('REPORT' 'COMMENT DESC 03')
     A            L8COMD04      40A         COLHDG('REPORT' 'COMMENT DESC 04')
     A            L8COMD05      40A         COLHDG('REPORT' 'COMMENT DESC 05')
     A*
     A* DATA FIELDS
     A*
     A            L8FND     R     S         REFFLD(FND)
     A            L8EMP#    R     S         REFFLD(EMP#)
     A            L8DIV     R     S         REFFLD(DIV)
     A            L8FYR     R     S         REFFLD(FYR)
     A*
     A            L8GRPNAME     60A
     A                                      COLHDG('GROUP NAME')
     A            L8SRVNAME    100A
     A                                      COLHDG('SERV OFFICE NAME')
     A            L8POLFDNM    120A
     A                                      COLHDG('POLICY FEDERAL NAME')
     A            L8POLNAME    120A
     A                                      COLHDG('POLICY NAME')
     A            L8POLADR1 R               REFFLD(ADR1)
     A                                      COLHDG('POLICY' 'ADDRESS 1')
     A            L8POLADR2 R               REFFLD(ADR2)
     A                                      COLHDG('POLICY' 'ADDRESS 2')
     A            L8POLCITY R               REFFLD(CTY)
     A                                      COLHDG('POLICY' 'CITY')
     A            L8POLST   R               REFFLD(ST)
     A                                      COLHDG('POLICY' 'STATE')
     A            L8POLZIP  R     S         REFFLD(ZIP)
     A                                      COLHDG('POLICY' 'ZIP CODE')
     A            L8AGTHDG      20A
     A                                      COLHDG('AGENT HEADING')
     A            L8AGT#    R     S         REFFLD(A50)
     A                                      COLHDG('AGENT' 'NUMBER')
     A            L8AGTNAME R               REFFLD(DS40)
     A                                      COLHDG('AGENT' 'NAME')
     A            L8PRD#    R     S         REFFLD(A50)
     A                                      COLHDG('AGENT' 'PRODUCER #')
     A            L8PRDLSN  R               REFFLD(LSN)
     A                                      COLHDG('AGENT' 'PROD LAST NAME')
     A            L8PRDFSN  R               REFFLD(FSN)
     A                                      COLHDG('AGENT' 'PROD FIRST NAME')
     A*
     A            L8DUEDATE      8S 0
     A                                      COLHDG('DUE DATE')
     A            L8PASTDUED     8S 0
     A                                      COLHDG('PAST DUE DATE')
     A            L8AUDIT   R               REFFLD(FLAG)
     A                                      COLHDG('AUDIT STATUS')
     A            L8TOTALD  R     S         REFFLD(A112)
     A                                      COLHDG('TOTAL DUE')
     A*
     A            L8HDG01   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 01')
     A            L8HDG02   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 02')
     A            L8HDG03   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 03')
     A            L8HDG04   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 04')
     A            L8HDG05   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 05')
     A            L8HDG06   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 06')
     A            L8HDG07   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 07')
     A            L8HDG08   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 08')
     A            L8HDG09   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 09')
     A            L8HDG10   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 10')
     A            L8HDG11   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 11')
     A            L8HDG12   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 12')
     A            L8HDG13   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 13')
     A            L8HDG14   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 14')
     A            L8HDG15   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 15')
     A            L8HDG16   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 16')
     A            L8HDG17   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 17')
     A            L8HDG18   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 18')
     A            L8HDG19   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 19')
     A            L8HDG20   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 20')
     A            L8HDG21   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 21')
     A            L8HDG22   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 22')
     A            L8HDG23   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 23')
     A            L8HDG24   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 24')
     A            L8HDG25   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 25')
     A            L8HDG26   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 26')
     A            L8HDG27   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 27')
     A            L8HDG28   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 28')
     A            L8HDG29   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 29')
     A            L8HDG30   R               REFFLD(DS40)
     A                                      COLHDG('LINE ITEM HDG 30')
     A*
     A            L8AMT01   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 01')
     A            L8AMT02   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 02')
     A            L8AMT03   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 03')
     A            L8AMT04   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 04')
     A            L8AMT05   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 05')
     A            L8AMT06   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 06')
     A            L8AMT07   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 07')
     A            L8AMT08   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 08')
     A            L8AMT09   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 09')
     A            L8AMT10   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 10')
     A            L8AMT11   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 11')
     A            L8AMT12   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 12')
     A            L8AMT13   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 13')
     A            L8AMT14   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 14')
     A            L8AMT15   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 15')
     A            L8AMT16   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 16')
     A            L8AMT17   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 17')
     A            L8AMT18   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 18')
     A            L8AMT19   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 19')
     A            L8AMT20   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 20')
     A            L8AMT21   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 21')
     A            L8AMT22   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 22')
     A            L8AMT23   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 23')
     A            L8AMT24   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 24')
     A            L8AMT25   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 25')
     A            L8AMT26   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 26')
     A            L8AMT27   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 27')
     A            L8AMT28   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 28')
     A            L8AMT29   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 29')
     A            L8AMT30   R     S         REFFLD(A112)
     A                                      COLHDG('LINE ITEM AMT 30')
     A*
     A* MAINTENANCE FIELDS
     A*
     A            L8USER    R               REFFLD(USER)
     A                                      COLHDG('USER')
     A            L8PGM     R               REFFLD(PGM)
     A                                      COLHDG('PROGRAM')
     A            L8TIME    R     S         REFFLD(TIME)
     A                                      COLHDG('TIME')
     A            L8DT      R     S         REFFLD(DT)
     A                                      COLHDG('DATE')
     A*
     A            L8GROUPS    3000A
     A                                      COLHDG('LIST OF ' 'SELECTED GROUPS')
     A*** BEGIN ADD ***  04/04/17  *********************************************
     A            L8EMCNT   R     S         REFFLD(A110)
     A                                      COLHDG('# OF EMPLOYERS')
     A*** END ADD *****  04/04/17  *********************************************
     A*** BEGIN ADD ***  01/03/20  *********************************************
     A            L8CONT    R               REFFLD(NAME)
     A                                      COLHDG('CONTACT PERSON')
     A*** END ADD *****  01/03/20  *********************************************
     A*** BEGIN ADD ***  05/26/21  *********************************************
     A            L8AGTFEIN      9S 0       COLHDG('Agent Fein')
     A            L8AGTMOD       3S 0       COLHDG('Agent Mod')
     A            L8AGTADR1     40A         COLHDG('Agent Address 1')
     A            L8AGTADR2     40A         COLHDG('Agent Address 2')
     A            L8AGTCITY     25A         COLHDG('Agent City')
     A            L8AGTST        2A         COLHDG('Agent State')
     A            L8AGTZIP       9S 0       COLHDG('Agent Zip')
     A*** END ADD *****  05/26/21  *********************************************
