      * (c) 2020 Sapiens. All Rights Reserved.                             *
     A* S/R Late Notice - Report Information                               *
     A**********************************************************************
     A* Created on 11/10/2020 by c:62 for Project WC2760                   *
     A**********************************************************************
     A* Revisions:                                                         *
     A*                                                                    *
     A**********************************************************************
     A                                      REF(SREFP)
     A          R PL801                     TEXT('S/R Late Notice -
     A                                      - Report Information')
     A*
     A            L8XML         60A         COLHDG('Unique XML File' +
     A                                      'Name Key')
     A            L8CO#          3S 0       COLHDG('Company #')
     A            L8FND          3S 0       COLHDG('Group')
     A            L8EMP#         9S 0       COLHDG('Employer #')
     A            L8DIV          5S 0       COLHDG('Division')
     A            L8YEAR         3S 0       COLHDG('Policy Year')
     A            L8DUEDT        8S 0       COLHDG('Due Date')
     A            L8DUEAMT      15S 2       COLHDG('Due Amount')
     A            L8PAYABLE    100A         COLHDG('Checks Payable To')
     A            L8INQNAME    100A         COLHDG('Direct Inquiries To' +
     A                                      '(Name)')
     A            L8INQAREA      3A         COLHDG('Direct Inquiries To' +
     A                                      '(Area Code)')
     A            L8INQPHN#     10A         COLHDG('Direct Inquiries To' +
     A                                      '(Phone)')
     A* Scriptura Initial Date
     A            L8IDT          7S 0       COLHDG('Init Date')
