     A*  (C) Copyright Progressive Data Systems, Inc., 1988
     A** (C) COPYRIGHT INSURANCE ADMINISTRATIVE SYSTEMS, INC. 1987
     A**
     A** WORKERS' COMP LOSS RATIO BY JOB CLASS WORK FILE
     A*
     A          R PLJ01                     PFILE(WXLJP)
     A          K LJCO#
     A          K LJCLAS
