     A* (c) 2018 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A*
     A*  NCCI REPORTING - POLICY PAGE HEADER TRANSACTION
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A* 12/26/17 C:267 Project: C150WCI                               *
     A*                Adding new field for Business Segment Id       *
     A*                                                               *
     A* 04/27/16 C:306 Project: WC2424                                *
     A*                Adding new fields for Experience Modifiers -   *
     A*                Not Final status                               *
     A*                                                               *
     A* 02/26/15  C:180  SUPPORT: 31837                               *
     A*                  ADD DCO RISK ID NUMBER                       *
     A*                                                               *
     A*                                                               *
     A* 08/12/13  C:190  PROJECT: WC2130                              *
     A*                  ADD/DELETE STATE FLAG.                       *
     A*                                                               *
     A* 05/12/05  C:65   PROJECT: 132WAY                              *
     A*                  ADD FIELD FOR 3RD EXPERIENCE MODIFIER AND    *
     A*                  THREE FIELDS FOR EXP MODIFIER EFF DATES.     *
     A*                                                               *
     A* 06/16/04  C:65   PROJECT: 114WGH                              *
     A*                  ADD FIELD FOR 2ND EXPERIENCE MODIFIER FOR    *
     A*                  ANNIVERSARY RATED REPORTING.                 *
     A*                                                               *
     A* 07/09/03  C:35   PROJECT: SUPPORT WA081 #37326                *
     A*                  ADDED NEW FIELD FOR MINIMUM PREMIUM TO       *
     A*                  ACCOMODATE LARGER SIZE.                      *
     A*                                                               *
     A* 01/30/01  C:61   PROJECT: 114WAK                              *
     A*                  Add field for Policy Deposit Premium.        *
     A*                                                               *
     A* 12/07/00  C:35   PROJECT: SUPPORT                             *
     A*                  ADD NEW ALPHA FIELD FOR PRIOR POLICY NUMBER. *
     A*                                                               *
     A* 11/20/98  C:35   PROJECT: SUPPORT                             *
     A*                  EXPANDED EXPERIENCE MOD FACTOR FIELD TO      *
     A*                  MATCH EMPLOYER DETAIL.                       *
     A*                                                               *
     A* 06/15/94 C:24 PROJECT 03AZK                                   *
     A*               NEW TRANSACTION FILE FOR NCCI REPORTING.        *
     A*                                                               *
     A* 11/29/95 C:24 PROJECT CM006                                   *
     A*                FIELDS WERE ADDED FOR SELF-INSURED POLICY      *
     A*                INDICATOR, POLICY TYPE ID CODE, EMPLOYEE       *
     A*                LEASING POLICY IDENTIFIER, AND EXPIRATION DATE *
     A*                OF POLICY CHANGES.                             *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PNH01                     TEXT('POLICY PAGE HEADER TRAN')
     A            NHCO#     R               REFFLD(CO#)
     A            NHFND     R               REFFLD(FND)
     A            NHEMP#    R               REFFLD(EMP#)
     A            NHFYR     R               REFFLD(FYR)
     A            NHUNID    R               REFFLD(A120)
     A                                      COLHDG('UNIQUE' 'IDENTIFIER')
     A            NHRSK#    R               REFFLD(A90)
     A                                      COLHDG('NCCI' 'RISK ID#')
     A            NHCAR#    R               REFFLD(CLAS)
     A                                      COLHDG('NCCI' 'CARRIER#')
     A            NHPTDT    R               REFFLD(DT)
     A                                      COLHDG('POLICY' 'EXP DATE')
      **** NOTE: FOLLOWING FIELD NO LONGER USED 12/07/00
     A            NHPPOL    R               REFFLD(A110)
     A                                      COLHDG('NOT USED')
     A            NHTPOB    R               REFFLD(FLAG)
     A                                      COLHDG('TYPE OF' 'BUSINESS')
     A            NHMIN     R               REFFLD(PC52)
     A                                      COLHDG('MINIMUM PREMIUM')
     A            NHMPST    R               REFFLD(ST)
     A                                      COLHDG('MIN PRM' 'STATE')
     A            NHANPR    R               REFFLD(A112)
     A                                      COLHDG('EST ANNUAL' 'PREMIUM')
     A            NHDPPR    R               REFFLD(A112)
     A                                      COLHDG('DEPOSIT' 'PREMIUM')
     A            NHACC     R               REFFLD(A90)
     A                                      COLHDG('BODILY INJURY BY ACC')
     A            NHAGG     R               REFFLD(A90)
     A                                      COLHDG('BODILY INJURY BY AGG')
     A            NHDIS     R               REFFLD(A90)
     A                                      COLHDG('BODILY INJURY BY DIS')
     A            NHPLSN    R               REFFLD(LSN)
     A                                      COLHDG('PRODUCER' 'NAME')
     A            NHPFSN    R               REFFLD(FSN)
     A                                      COLHDG('PRODUCER' 'FIRST NAME')
     A            NHPFDT    R               REFFLD(DT)
     A                                      COLHDG('POLICY' 'FROM DATE')
     A            NHPCDT    R               REFFLD(DT)
     A                                      COLHDG('POLICY' 'CHANGE DATE')
     A            NHREIS    R               REFFLD(FLAG)
     A                                      COLHDG('REISSUE' 'FLAG')
     A            NHST      R               REFFLD(ST)
     A                                      COLHDG('STATE')
      **** BEGIN CHG **** 11/20/98 *********************************************
     A*********** NHEXM1    R               REFFLD(PC32)
     A            NHEXM1    R               REFFLD(PC54)
      **** END   CHG **** 11/20/98 *********************************************
     A                                      COLHDG('EXPERIENCE' 'MODIFIER'  )
     A            NHEXT1    R               REFFLD(FLAG)
     A                                      COLHDG('EXPERIENCE' 'MOD STATUS')
     A            NHOIRR    R               REFFLD(A40)
     A                                      COLHDG('OTHER' 'INDIVIDUAL' +
     A                                      'RISK')
     A            NHCPRD    R               REFFLD(A40)
     A                                      COLHDG('CARRIER' 'PREMIUM' +
     A                                      'DEVIATION')
     A            NHCPTD    R               REFFLD(FLAG)
     A                                      COLHDG('TYPE OF' 'PREMIUM' +
     A                                      'DEVIATION')
     A            NHPRTD    R               REFFLD(A112)
     A                                      COLHDG('EXPENSE' 'CONSTANT')
     A            NHLOSS    R               REFFLD(A112)
     A                                      COLHDG('LOSS' 'CONSTANT')
     A            NHPRMD    R               REFFLD(A112)
     A                                      COLHDG('PREMIUM' 'DISCOUNT')
     A            NHANDT    R               REFFLD(DT)
     A                                      COLHDG('ANNIVERSARY' 'RATING DATE')
     A            NHSTAT    R               REFFLD(STAT)
     A            NHUSER    R               REFFLD(USER)
     A            NHPGM     R               REFFLD(PGM)
     A            NHTIME    R               REFFLD(TIME)
     A            NHDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            NHIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            NHIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'ENTRY' 'DATE')
     A*** BEGIN ADD *** 11/29/95 *******************************************
     A            NHSIP          1S         COLHDG('SELF-INSURED' 'POLICY IND')
     A            NHPTI          2S         COLHDG('POLICY TYPE' 'ID CODE')
     A            NHLPI          1S         COLHDG('EMPLOYEE LEASING' 'POL ID')
     A            NHXPC     R               REFFLD(DT)
     A                                      COLHDG('EXP DATE' 'OF POL CHGS')
     A*** END ADD ***** 11/29/95 *******************************************
     A            NHEXRT    R               REFFLD(FLAG)
     A                                      COLHDG('EXP RATING FLAG')
      **** BEGIN ADD **** 12/07/00 *********************************************
     A            NHPP#         18A
     A                                      COLHDG('PRIOR' 'POLICY #')
      **** END   ADD **** 12/07/00 *********************************************
     A****** BEG ADD ***** 01/30/01 ***********************************
      *
     A            NHPDPR        11S 2
     A                                      COLHDG('Policy' +
     A                                      'Deposit' 'Premium')
      *
     A****** END ADD ***** 01/30/01 ***********************************
      **** BEGIN ADD **** 07/09/03 *********************************************
     A            NHMNPR         7S 2
     A                                      COLHDG('MINIMUM PREMIUM')
      **** END   ADD **** 07/09/03 *********************************************
      **** BEGIN ADD **** 07/09/03 *********************************************
     A            NHEXM2         5S 4
     A                                      COLHDG('EXPERIENCE MOD #2')
      **** END   ADD **** 07/09/03 *********************************************
      **** BEGIN ADD **** 07/09/03 *********************************************
     A            NHEXM3         5S 4
     A                                      COLHDG('EXPERIENCE MOD #3')
     A            NHEMD1         7S 0
     A                                      COLHDG('EXP MOD #1 EFF DT')
     A            NHEMD2         7S 0
     A                                      COLHDG('EXP MOD #2 EFF DT')
     A            NHEMD3         7S 0
     A                                      COLHDG('EXP MOD #3 EFF DT')
      **** END   ADD **** 07/09/03 *********************************************
      **** BEGIN ADD **** 08/12/13 *********************************************
     A            NHSADD         1A
     A                                      COLHDG('ADD/DELETE STATE FLG')
      **** END   ADD **** 08/12/13 *********************************************
      **** BEGIN ADD **** 02/26/15 *********************************************
     A            NHDRSK        15A
     A                                      COLHDG('DCO RISK ID NUMBER')
      **** END   ADD **** 02/26/15 *********************************************
     A*** Beg Add ***** 04/27/16 ******************************************
     A            NHEXMD1NF      1A         COLHDG('EXP MOD ' +
     A                                      '1 NOT FINAL FLAG')
     A            NHEXMD2NF      1A         COLHDG('EXP MOD ' +
     A                                      '2 NOT FINAL FLAG')
     A            NHEXMD3NF      1A         COLHDG('EXP MOD ' +
     A                                      '3 NOT FINAL FLAG')
     A*** End Add ***** 04/27/16 ******************************************
      *** Beg Add ***** 12/26/17 ******************************************
     A            NHBSI#         7S 0
     A                                      COLHDG('Bus Seg ID#')
      *** End Add ***** 12/26/17 ******************************************
