     A*  (C) Copyright Progressive Data Systems, Inc., 1998
     A**
     A** WORKERS' COMP NOI (DWC-1) WORK FILE
     A**
     A                                      REF(WREFP)
     A          R PNI01                     TEXT('NOI (DWC-1) WORK FILE')
     A            NICO#     R               REFFLD(CO#)
     A            NIFND     R               REFFLD(FND)
     A            NIFYR     R               REFFLD(FYR)
     A            NICASE    R               REFFLD(CASE)
     A            NIEMP#    R               REFFLD(EMP#)
     A            NIDIV     R               REFFLD(DIV)
     A            NIENAM    R               REFFLD(NAME)
     A                                      COLHDG('EMPLOYER NAME')
     A            NICNAM    R               REFFLD(DS60)
     A                                      COLHDG('CLAIMANT NAME')
     A            NIEUSR    R               REFFLD(USER)
     A                                      COLHDG('USER WHO CHANGED' -
     A                                       'LOST TIME FLAG')
     A            NIIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL ENTRY DATE')
     A            NIENTD    R               REFFLD(DT)
     A                                      COLHDG('LOST TIME FLAG' -
     A                                       'CHANGE DATE')
     A            NIUSER    R               REFFLD(USER)
     A            NIPGM     R               REFFLD(PGM)
     A            NITIME    R               REFFLD(TIME)
     A            NIDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
