      * (c) 2017 StoneRiver, Inc. All rights Reserved.
      * StoneRiver is a trademark of StoneRiver, Inc.
      *===============================================================
      * Policy Page Scriptura Work File - Schedule of Installments
      *===============================================================
      *
      *  Project: 148WAN
      *  Created: 11/09/17 by C:136
      *  Description: AmWins Schedule of Installments for
      *               WC900600, WC900601, WC900602
      *===============================================================
      * REVISIONS:
      *
      *===============================================================
     A                                      REF(WREFP)
     A          R PP701                     TEXT('SCHEDULE OF INSTALLMENTS')
     A            P7XML         60A         COLHDG('XML FILE NAME')
     A            P7#OFINST      2S 0       COLHDG('# OF INSTALLMENTS')
     A            P7TTANNPRM    13S 2       COLHDG('TOTAL EST ANN PREM')
     A            P7DOWNPCT      5S 2       COLHDG('DOWN PAYMENT %')
     A            P7DOWNPAY     13S 2       COLHDG('DOWN PAYMENT')
     A            P7PYRLFREQ    40A         COLHDG('PAYROLL TYPE DESC')
     A            P7USER    R               REFFLD(USER)
     A                                      COLHDG('USER')
     A            P7PGM     R               REFFLD(PGM)
     A                                      COLHDG('PROGRAM')
     A            P7TIME    R     S         REFFLD(TIME)
     A                                      COLHDG('TIME')
     A            P7DT      R     S         REFFLD(DT)
     A                                      COLHDG('DATE')
