     A* (c) 2018 StoneRiver, Inc. All rights Reserved.                *
     A* StoneRiver is a trademark of StoneRiver, Inc.                 *
     A**                                                              *
     A** EDI - Benefit ACR                                            *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A* 05/30/18 C:274 PROJECT: WC2515                                *
     A*                Re-compile after adding new fields to WXRDP    *
     A*                                                               *
     A*****************************************************************
     A*
     A          R PRD01                     PFILE(WXRDP)
     A          K RDCO#
     A          K RDJRST
     A          K RDEXDT
     A          K RDTSET
     A          K RDACLC
     A          K RDMTC
