     A**
     A** SCHEDULED RATING DATA FILE
     A                                      REF(WREFP)
     A          R RFP01                     TEXT('SCHEDULED RATING')
     A            RFCO#     R               REFFLD(CO#)
     A                                      COLHDG('CO#')
     A            RFFND     R               REFFLD(FND)
     A                                      COLHDG('FUND')
     A            RFEMP#    R               REFFLD(EMP#)
     A                                      COLHDG('EMP#')
     A            RFDIV     R               REFFLD(DIV)
     A                                      COLHDG('DIVISION')
     A            RFFYR     R               REFFLD(FYR)
     A                                      COLHDG('FUND' 'YEAR')
     A            RFENAM        40A         TEXT('Employer Name')
     A                                      COLHDG('Emp Name')
     A            RFEADR        60A         TEXT('Employer Address')
     A                                      COLHDG('Emp Address')
     A            RFPOL#        25A         TEXT('Policy #')
     A                                      COLHDG('Policy #')
     A            RFEFDT    R               REFFLD(DT7)
     A                                      TEXT('Policy Effective Date')
     A            RFSREF    R               REFFLD(DT7)
     A                                      COLHDG('RATING' 'EFF')
     A                                      TEXT('Rating Effective Date')
     A            RFSREX    R               REFFLD(DT7)
     A                                      TEXT('Rating Expiration Date')
     A                                      COLHDG('RATING' 'EXP')
     A            RFCOFL         1A         COLHDG('Company ID')
     A            RFLSCF         1A         TEXT('Loss Survey Compl Flag')
     A                                      COLHDG('Loss Survey' 'Compl Flag')
     A            RFLSDT         7  0       TEXT('Loss Survey Compl Date')
     A                                      COLHDG('Loss Survey' 'Compl Date')
     A            RFPEFL         1A         TEXT('Prem >= Curr Exp Rat Laws')
     A                                      COLHDG('Prem >= Curr' 'Exp Laws')
     A            RFPEEM         5  4       TEXT('Experience Modifier')
     A                                      COLHDG('Experience' 'Modified')
     A            RFPRCA         5  2       TEXT('Premises - Cr applied')
     A                                      COLHDG('Premises' 'Cr applied')
     A            RFPRDA         5  2       TEXT('Premises - DR applied')
     A                                      COLHDG('Premises' 'Dr applied')
     A            RFPRRS        50A         TEXT('Premises - Reason')
     A                                      COLHDG('Premises' 'Reason')
     A            RFCPCA         5  2       TEXT('Peculiar - CR Applied')
     A                                      COLHDG('Peculier' 'Cr applied')
     A            RFCPDA         5  2       TEXT('Peculiar - DR Applied')
     A                                      COLHDG('Peculiar' 'Dr Applied')
     A            RFCPRS        50A         TEXT('Peculiar - Reason')
     A                                      COLHDG('Peculiar' 'Reason')
     A            RFMFCA         5  2       TEXT('Med Facilities - CR')
     A                                      COLHDG('Med Facility Cr')
     A            RFMFDA         5  2       TEXT('Med Facilities - DR')
     A                                      COLHDG('Med Facility Dr')
     A            RFMFRS        50A         TEXT('Med Facilities - Reason')
     A                                      COLHDG('Med Facility' 'Reason')
     A            RFSDCA         5  2       TEXT('Safety Devices - CR')
     A                                      COLHDG('Safety Device Cr')
     A            RFSDDA         5  2       TEXT('Safety Devices - DR')
     A                                      COLHDG('Safety Device Dr')
     A            RFSDRS        50A         TEXT('Safety Devices - Reason')
     A                                      COLHDG('Safety Device' 'Reason')
     A            RFEMCA         5  2       TEXT('Empl-Sel,Train,Super - CR')
     A                                      COLHDG('Emp-Sel,Train' 'Super Cr')
     A            RFEMDA         5  2       TEXT('Empl-Sel,Train,Super - DR')
     A                                      COLHDG('Emp-Sel,Train' 'Super Dr')
     A            RFEMRS        50A         TEXT('Empl-Sel,Train,Super-Reason')
     A                                      COLHDG('Emp-Sel,Train' 'Super Reas-
     A                                      son')
     A            RFMCCA         5  2       TEXT('Mgmt-Coop w/Ins Carrier - CR')
     A                                      COLHDG('Mgmt Coop' 'w/ins Cr')
     A            RFMCDA         5  2       TEXT('Mgmt-Coop w/Ins Carrier - DR')
     A                                      COLHDG('Mgmt Coop' 'w/ins Dr')
     A            RFMCRS        50A         TEXT('Mgmt-Coop w/Ins Carrier-Reas')
     A                                      COLHDG('Mgmt Coop' 'w/ins Reason')
     A            RFMSCA         5  2       TEXT('Mgmt - Safety Org - CR')
     A                                      COLHDG('Mgmt-Safety' 'Org Cr')
     A            RFMSDA         5  2       TEXT('Mgmt - Safety Org - DR')
     A                                      COLHDG('Mgmt-Safety' 'Org Dr')
     A            RFMSRS        50A         TEXT('Mgmt - Safety Org - Reason')
     A                                      COLHDG('Mgmt-Safety' 'Org Reason')
     A            RFCOM1        60A         TEXT('Comments Line 1')
     A                                      COLHDG('Comment' 'Line 1')
     A            RFCOM2        60A         TEXT('Comments Line 2')
     A                                      COLHDG('Comment' 'Line 2')
     A            RFCOM3        60A         TEXT('Comments Line 3')
     A                                      COLHDG('Comment' 'Line 3')
     A            RFPGM         10A         TEXT('Program')
     A                                      COLHDG('Program')
     A            RFUSER        10A         TEXT('User')
     A                                      COLHDG('User')
     A            RFDT      R               REFFLD(DT7)
     A                                      COLHDG('Date')
     A                                      TEXT('Date')
     A            RFTIME         6  0       TEXT('Time')
     A                                      COLHDG('Time')
     A            RFIPGM        10A         TEXT('Initial Program')
     A                                      COLHDG('Initial' 'Program')
     A            RFIUSR        10A         TEXT('Initial User')
     A                                      COLHDG('Initial' 'User')
     A            RFIDT     R               REFFLD(DT7)
     A                                      TEXT('Initial Date')
     A                                      COLHDG('Initial' 'Date')
