     A*  (C) Copyright Progressive Data Systems, Inc., 1995
     A**
     A** WORKERS' COMP  SUPERVISORS EOMB PEND REPORT  WORKFILE
     A*
     A          R PRL01                     PFILE(WXRLP)
     A          K RLCO#
     A          K RLSORT
     A          K RLFND
     A          K RLFYR
     A          K RLCASE
     A          K RLSEQ#
