     A*  (C) Copyright FISERV Insurance Solutions, Inc., 2003 - 2008
      *===============================================================
      * REVISIONS:
      *
      * 12/26/07 C:183 PROJECT: 81WZB
      *                ADDED SURPLUS DIVIDEND FLAG.
      *
      * 07/18/07 C:136 PROJECT: WC1491
      *                ADD BATCH METHOD AND PAYEE TYPE FLAGS
      *
      * 07/15/05 C:136 PROJECT: WC1337 (RETURN DEPOSIT)
      *                ADD BATCH TYPE FLAG
      *===============================================================
     A**
     A** Mass Return Premium Batch Control File
     A                                      REF(WREFP)
     A          R PRN01                     TEXT('MASS RTN PRM BCH CNTRL')
     A            RNCO#     R               REFFLD(CO#)
     A            RNBAT#         9P 0       TEXT('BATCH NUMBER')
     A            RNFGRP    R               REFFLD(FND)
     A                                      COLHDG('FROM GROUP')
     A            RNTGRP    R               REFFLD(FND)
     A                                      COLHDG('TO GROUP')
     A            RNCOM1        60A         TEXT('COMMENT LINE 1')
     A            RNCOM2        60A         TEXT('COMMENT LINE 2')
     A            RNCOM3        60A         TEXT('COMMENT LINE 3')
     A            RNFAUD    R               REFFLD(DT)
     A                                      COLHDG('FROM AUDIT' 'TR DATE')
     A            RNTAUD    R               REFFLD(DT)
     A                                      COLHDG('TO AUDIT' 'TR DATE')
     A            RNMIN     R               REFFLD(A112)
     A                                      COLHDG('MIN RTN PRM AMT')
     A            RNBPF     R               REFFLD(FLAG)
     A                                      COLHDG('BATCH PROC FLAG')
     A            RNCAFL    R               REFFLD(FLAG)
     A                                      COLHDG('CNTST AUDT FLAG')
     A            RNIUSR    R               REFFLD(USER)
     A                                      COLHDG('INT ENTRY USERD')
     A            RNIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INT ENTRY PGM')
     A            RNIDT     R               REFFLD(DT)
     A                                      COLHDG('INT ENTRY DATE')
     A            RNITIM    R               REFFLD(TIME)
     A                                      COLHDG('INT ENTRY TIME')
     A            RNUSER    R               REFFLD(USER)
     A                                      COLHDG('LAST UPD BY USER')
     A            RNPGM     R               REFFLD(PGM)
     A                                      COLHDG('LAST UPD BY PGMR')
     A            RNDATE    R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            RNTIME    R               REFFLD(TIME)
     A                                      COLHDG('TIME' 'MAINTAINED')
     A***  BEG ADD ***** 07/15/05 *****************************************
     A            RNBTYP    R               REFFLD(FLAG)
     A                                      COLHDG('BATCH' 'TYPE' 'FLAG')
     A***  END ADD ***** 07/15/05 *****************************************
     A***  BEG ADD ***** 07/18/07 *****************************************
     A            RNMTYP    R               REFFLD(FLAG)
     A                                      COLHDG('MTHD' 'TYPE' 'FLAG')
     A            RNPTYP    R               REFFLD(FLAG)
     A                                      COLHDG('PAYEE' 'TYPE' 'FLAG')
     A***  END ADD ***** 07/18/07 *****************************************
     A***  BEG ADD ***** 12/26/07 *****************************************
     A            RNSDFL    R               REFFLD(FLAG)
     A                                      COLHDG('SURPLUS' 'DIST FLAG')
     A***  END ADD ***** 12/26/07 *****************************************
