     A*****************************************************************
     A* (C) 2014 STONERIVER, INC. ALL RIGHTS RESERVED.                *
     A* STONERIVER IS A TRADEMARK OF STONERIVER, INC.                 *
     A*****************************************************************
     A** STATE WORK FILE
     A*****************************************************************
     A* CREATED:                                                      *
     A*       C:296    DATE: 12/01/14      PROJECT: 114MQA            *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PSS01                     TEXT('STATE WORK FILE')
     A
     A            SSCO#     R               REFFLD(CO#)
     A            SSST      R               REFFLD(ST)
     A            SSNAME    R               REFFLD(NM60)
     A            SSIEFL    R               REFFLD(FLAG)
     A                                      TEXT('INCLUDE/EXCLUDE')
     A            SSRRE#    R     S         REFFLD(FEIN)
     A                                      COLHDG('RESPONSIBILITY' -
     A                                      'REPORTING' 'ENTITY')
