      * (c) 2010 StoneRiver, Inc. All rights Reserved.                *
      * StoneRiver is a trademark of StoneRiver, Inc.                 *
     H*****************************************************************
     A* FEE INFORMATION TABLE                                         *
     A*                                                               *
     A*  PROJECT:  WC1851            PROGRAMMER:  C:189               *
     A*  CREATED:  01/25/10                                           *
     H*****************************************************************
     A*
     A*  WORKERS' COMP I/M/R STATUS WORKFILE
     A*
     A
     A          R PST01                     PFILE(WXSTP)
     A          K STCO#
     A          K STFND
     A          K STEMP#
     A          K STDIV
     A          K STFYR
     A          K STCASE
