     A*COPYRIGHT('(C) COPYRIGHT FISERV, INC., 2006')
     A*
     A*****************************************************************
     A* Created on 04/19/2007 by C:183 for Project 135WIB
     A*****************************************************************
     A* Purpose: Transpac Darts Recorf File# 1
     A*****************************************************************
     A* Revisions:
     A*
     A*****************************************************************
     A          R PT501
     A            T5CLM#        13          COLHDG('Claim ID')
     A            T5SS#          9          COLHDG('Claimant ID')
     A            T5ACDT         8S 0       COLHDG('Date of Injury')
     A            T5SEQ#         5S 0       COLHDG('WC Remark' 'sequence#')
     A            T5RMCD         5          COLHDG('WC Remark' 'Code')
     A            T5IDT          8S 0       COLHDG('WC Inital date')
     A            T5COMM       275          COLHDG('WC Remark')
     A            T5IUSR        10          COLHDG('WC record' 'created by')
     A            T5RCVD         8S 0       COLHDG('FROI received date')
     A*
