     A*COPYRIGHT('(C) COPYRIGHT FISERV, INC., 2006')
     A*
     A*****************************************************************
     A* Created on 04/19/2007 by C:183 for Project 135WIB
     A*****************************************************************
     A* Purpose: Transpac Waiver Record File
     A*****************************************************************
     A* Revisions:
     A*
     A*****************************************************************
     A          R PT701
     A            T7POL#        17          COLHDG('Policy#')
     A            T7CLM#        13          COLHDG('Claim ID')
     A            T7SS#          9          COLHDG('Claimant ID')
     A            T7ACDT         8S 0       COLHDG('Date of Injury')
     A            T7NAME       100          COLHDG('Employer')
     A            T7PFDT         8S 0       COLHDG('Policy From' 'Date')
     A            T7PTDT         8S 0       COLHDG('Policy to' 'Date')
     A            T7CSTA         1          COLHDG('Claim' 'Status')
     A            T7DTRP         8S 0       COLHDG('Date Reported' 'to Emplr')
     A            T7RCVD         8S 0       COLHDG('FROI received date')
     A            T7END#         5S 0       COLHDG('Endorsement#')
     A            T7FORM        15          COLHDG('Endorsement Form')
     A            T7EEDT         8S 0       COLHDG('Endorsement' +
     A                                      'Effective date')
