      * (c) 2010 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*****************************************************************
     A** Convert UDS - E Records                                      *
     A*****************************************************************
     A*  Created: 04/20/10   C:232  Project: 114WWA                   *
     A*                                      Convert UDS - E Records  *
     A*****************************************************************
     A*  Revisions:                                                   *
     A*                                                               *
     A*****************************************************************
     A          R PU101                     TEXT('UDS E Flat File')
     A            U1DATA       651A
     A                                      COLHDG('UDS E Flat File')
