      * (c) 2010 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*****************************************************************
     A** Convert UDS - F Records                                      *
     A*****************************************************************
     A*  Created: 04/20/10   C:232  Project: 114WWA                   *
     A*                                      Convert UDS - F Records  *
     A*****************************************************************
     A*  Revisions:                                                   *
     A*                                                               *
     A*****************************************************************
     A          R PU201                     TEXT('UDS F Flat File')
     A            U2DATA      1081A
     A                                      COLHDG('UDS F Flat File')
