      * (c) 2010 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*****************************************************************
     A** UDS Location File.                                           *
     A*****************************************************************
     A*  Created: 04/20/10   C:232  Project: 114WWA                   *
     A*                                      Convert UDS - A Records  *
     A*****************************************************************
     A*  Revisions:                                                   *
     A*                                                               *
     A*****************************************************************
     A          R PUL01                     PFILE(WXULP)
     A          K ULICC#
