     A          R PUP01                     PFILE(WXUPP)

     A            UPRTYP             I      SST(DATA 1 1)
     A            UPPOL#             I      SST(DATA 2 25)
     A            UPFND              I      SST(DATA 27 3)
     A            UPEMP              I      SST(DATA 30 9)
     A            UPDIV              I      SST(DATA 39 5)
     A            UPFYR              I      SST(DATA 44 3)
     A            UPPDT              I      SST(DATA 47 8)
     A            UPPAMT             I      SST(DATA 55 11)
     A            UPCAMT             I      SST(DATA 66 11)
     A            UPNAMT             I      SST(DATA 75 11)
     A          K UPRTYP
     A          S UPRTYP                    CMP(EQ 'D')
     A          O                           ALL
