     A*  (C) Copyright Progressive Data Solutions, Inc., 2000
     A****************************************************************
     A** WORKERS' COMP  PEO PAYROLL IMPORT FILE
     A**************************************************************************
     A* REVISIONS:                                                             *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(WREFP)
     A          R PUP01                     TEXT('PEO PREM IMPORT FILE')
     A            UPRTYP    R               REFFLD(FLAG)
     A                                      COLHDG('REC' 'TYPE')
     A            UPPOL#        25A         TEXT('POLICY NUMBER')
     A                                      COLHDG('POLICY #')
     A            UPFND          3S 0       TEXT('GROUP')
     A                                      COLHDG('GRP')
     A            UPEMP          9S 0       TEXT('EMPLOYER')
     A                                      COLHDG('EMPLOYER')
     A            UPDIV          5S 0       TEXT('DIVISION')
     A                                      COLHDG('DIV')
     A            UPFYR          3S 0       TEXT('FUND YEAR')
     A                                      COLHDG('YR')
     A            UPPDT     R               REFFLD(DT8)
     A                                      COLHDG('POSTING DT')
     A            UPPAMT        11S 2       TEXT('POSTING AMOUNT')
     A                                      COLHDG('POSTING AMT')
     A            UPCAMT         9S 2       TEXT('COMMISSION AMT')
     A                                      COLHDG('COMMISSION')
     A            UPNAMT        11S 2       TEXT('NET AMT LESS COMM')
     A                                      COLHDG('AMT LESS COMM')
     A            UPFIL1       215A         TEXT('FILLER')
