     A* (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1999
     A*
     A* LOSS CONTROL TASK WORK FILE
     A***************************************************************
      *
     A          R PVS01                     PFILE(WXVSP)
     A          K VSCO#
     A          K VSFND
     A          K VSSTF
     A          K VSEMP#
     A          K VSDIV
     A          K VSVSDT
     A          K VSVSTP
     A          K VSHRS
