     A*  (C) Copyright Progressive Data Systems, Inc., 1988
     A** (C) COPYRIGHT INSURANCE ADMINISTRATIVE SYSTEMS, INC. 1987
     A*
     A** WORKERS' COMPENSATION WASTE CHECK FILE
     A*
     A          R PWC01                     PFILE(WXWCP)
     A          K WCCO#
     A          K WCFND
     A          K WCCHK#
