     A* (C) Copyright Fiserv Insurance Solutions, Inc., 2008
     A*
     A* WZC4L1 - C4CODE - Logical
     A*
     A*****************************************************************
     A* Created on 02/05/2008 by C:47 for Project 129MQN
     A*****************************************************************
     A* Purpose:
     A*
     A*****************************************************************
     A* Revisions:
     A*
     A*****************************************************************
     A          R PC401                     PFILE(WZC4P)
     A          K C4CODE
