     A* (C) Copyright Fiserv Insurance Solutions, Inc., 2008
     A*
     A* Claim Export File
     A*
     A*****************************************************************
     A* Created on 02/05/2008 by C:47 for Project 129MQN
     A*****************************************************************
     A* Revisions:
     A*
     A*****************************************************************
     A                                      REF(WREFP)
     A          R PXC01                     TEXT('Claim Export File')
     A            XCDATA      3000A
