     A*  (C) Copyright Progressive Data Systems, Inc., 1996
     A*****************************************************************
     A** CAUSE CODE CROSS-REFERENCE FILE
     A*****************************************************************
     A*
     A          R PCA01                     PFILE(XLCAP)
     A          K CACO#
     A          K CAFND
     A          K CAPART
