     A*  (C) Copyright Progressive Data Systems, Inc., 1996
     A*****************************************************************
     A** PART CODE CROSS-REFERENCE FILE
     A*****************************************************************
     A*
     A          R PNA01                     PFILE(XLNAP)
     A          K NACO#
     A          K NAFND
     A          K NAPART
