     A          R ZCLIENTR                  TEXT('Client Setup Defaults')
     A            ZCLT#          3S 0       TEXT('Client/Company')
                                            COLHDG('                    ' +
                                                   'Clt                 ' +
                                                   'Co#                 ')
     A            ZCVBA         10A         TEXT('Conversion Team Leader')
                                            COLHDG('Conversion          ' +
                                                   '   Team             ' +
                                                   '  Leader            ')
     A            ZCONT         30A         TEXT('Client Contact')
                                            COLHDG('                    ' +
                                                   '                    ' +
                                                   'Client contact      ')
     A            ZBA           10A         TEXT('Account Representative')
                                            COLHDG('                    ' +
                                                   'Account             ' +
                                                   '  Rep               ')
     A            ZSTATE         2A         TEXT('State')
                                            COLHDG('                    ' +
                                                   '                    ' +
                                                   'State               ')
     A            ZFTYP         10A         TEXT('Form Type')
                                            COLHDG('                    ' +
                                                   '                    ' +
                                                   'Form type           ')
     A            ZOUTQ         10A         TEXT('Check Out Queue')
                                            COLHDG('                    ' +
                                                   'Check               ' +
                                                   'Out queue           ')
     A            ZCPYQ         10A         TEXT('File Copy Out Queue')
                                            COLHDG('                    ' +
                                                   'File copy           ' +
                                                   'Out queue           ')
     A            ZEFDT          7P 0       TEXT('Account Effective Date')
                                            COLHDG(' Account            ' +
                                                   'Effective           ' +
                                                   '  Date              ')
