      *******************************************************************
      * FILE NAME:   HYLSGCU11
      * DESCRIPTION: Shipment Group Customer - reverse-engineered LF
      * Notes:       Original HYLSGCU11.LF is not in the HornadyDemo
      *              package but is F-spec'd in HYR0600.SQLRPGLE.
      *              Keys chosen to mirror HYLSGCU1 (the closest sibling).
      *******************************************************************
     A          R HYRSGCU                   PFILE(HYPSGCU)
      *
     A          K GCGRP#
     A          K GCCPTY
     A          K GCBLTO
     A          K GCSHTO
     A          K GCDSHP
