     D fids01        e ds                  extname(szq2p)
     D psds          esds                  extname(szq1p)
    D*
     D                 ds
     D dsdttm                        14  0
     D  dstime                        6  0 overlay(dsdttm)
     D  dsdate                        8  0 overlay(dsdttm:7)
    D*
      ***** BEG CHG ***** 03/08/06 ************************************************
     D************ pdsnam          c                   const('Progressive Data So-
     D************                                    lutions, Inc.')
      ***** BEG CHG ***** 01/28/10 ************************************************
     D***** pdsnam          c               const('Fiserv Insurance So-
     D*****                                 lutions, Inc.')
     D pdsnam          c                   const('Stoneriver, Inc.')
      ***** END CHG ***** 01/28/10 ************************************************
      ***** END CHG ***** 03/08/06 ************************************************
     D ##conm          s             40
     D ##data          s             80
     D ##leng          s              3  0
     D f3reqd          s              1
