     ftestWidgetcf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
     f                                     ExtFile('TESTWIDGET')

       exfmt scr01;
       *inLR = *On;
